[{"id":"C16-2001","title":"An Interactive System for Exploring Community Question Answering Forums","authors":["Hoque, Enamul","Joty, Shafiq","M{\\`a}rquez, Llu{\\'\\i}s","Barr{\\'o}n-Cede{\\~n}o, Alberto","Da San Martino, Giovanni","Moschitti, Alessandro","Nakov, Preslav","Romeo, Salvatore","Carenini, Giuseppe"],"emails":["enamul@cs.ubc.ca","sjoty@qf.org.qa","lmarquez@qf.org.qa","albarron@qf.org.qa","gmartino@qf.org.qa","amoschitti@qf.org.qa","pnakov@qf.org.qa","sromeo@qf.org.qa","carenini@cs.ubc.ca"],"author_id":["enamul-hoque","shafiq-joty","lluis-marquez","alberto-barron-cedeno","giovanni-da-san-martino","alessandro-moschitti","preslav-nakov","salvatore-romeo","giuseppe-carenini"],"abstract":"We present an interactive system to provide effective and efficient search capabilities in Community Question Answering (cQA) forums. The system integrates state-of-the-art technology for answer search with a Web-based user interface specifically tailored to support the cQA forum readers. The answer search module automatically finds relevant answers for a new question by exploring related questions and the comments within their threads. The graphical user interface presents the search results and supports the exploration of related information. The system is running live at \\url{http:\/\/www.qatarliving.com\/betasearch\/}.","pages":"1--5","url":"https:\/\/www.aclweb.org\/anthology\/C16-2001","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2002","title":"{NL}maps: A Natural Language Interface to Query {O}pen{S}treet{M}ap","authors":["Lawrence, Carolin","Riezler, Stefan"],"emails":["lawrence@cl.uni-heidelberg.de","riezler@cl.uni-heidelberg.de"],"author_id":["carolin-lawrence","stefan-riezler"],"abstract":"We present a Natural Language Interface (nlmaps.cl.uni-heidelberg.de) to query OpenStreetMap. Natural language questions about geographical facts are parsed into database queries that can be executed against the OpenStreetMap (OSM) database. After parsing the question, the system provides a text based answer as well as an interactive map with all points of interest and their relevant information marked. Additionally, we provide several options for users to give feedback after a question has been parsed.","pages":"6--10","url":"https:\/\/www.aclweb.org\/anthology\/C16-2002","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2003","title":"A Reading Environment for Learners of {C}hinese as a Foreign Language","authors":["Lee, John","Lam, Chun Yin","Jiang, Shu"],"emails":["jsylee@cityu.edu.hk","mickey1224@gmail.com","jshmjs45@gmail.com"],"author_id":["john-lee","chun-yin-lam","shu-jiang"],"abstract":"We present a mobile app that provides a reading environment for learners of Chinese as a foreign language. The app includes a text database that offers over 500K articles from Chinese Wikipedia. These articles have been word-segmented; each word is linked to its entry in a Chinese-English dictionary, and to automatically-generated review exercises. The app estimates the reading proficiency of the user based on a {``}to-learn{''} list of vocabulary items. It automatically constructs and maintains this list by tracking the user{'}s dictionary lookup behavior and performance in review exercises. When a user searches for articles to read, search results are filtered such that the proportion of unknown words does not exceed a user-specified threshold.","pages":"11--15","url":"https:\/\/www.aclweb.org\/anthology\/C16-2003","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2004","title":"A Post-editing Interface for Immediate Adaptation in Statistical Machine Translation","authors":["Simianer, Patrick","Karimova, Sariya","Riezler, Stefan"],"emails":["simianer@cl.uni-heidelberg.de","karimova@cl.uni-heidelberg.de","riezler@cl.uni-heidelberg.de"],"author_id":["patrick-simianer","sariya-karimova","stefan-riezler"],"abstract":"Adaptive machine translation (MT) systems are a promising approach for improving the effectiveness of computer-aided translation (CAT) environments. There is, however, virtually only theoretical work that examines how such a system could be implemented. We present an open source post-editing interface for adaptive statistical MT, which has in-depth monitoring capabilities and excellent expandability, and can facilitate practical studies. To this end, we designed text-based and graphical post-editing interfaces. The graphical interface offers means for displaying and editing a rich view of the MT output. Our translation systems may learn from post-edits using several weight, language model and novel translation model adaptation techniques, in part by exploiting the output of the graphical interface. In a user study we show that using the proposed interface and adaptation methods, reductions in technical effort and time can be achieved.","pages":"16--20","url":"https:\/\/www.aclweb.org\/anthology\/C16-2004","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2005","title":"Word {M}idas Powered by {S}tring{N}et: Discovering Lexicogrammatical Constructions in Situ","authors":["Wible, David","Tsao, Nai-Lung"],"emails":["wible@stringnet.org","beaktsao@stringnet.org"],"author_id":["david-wible","nai-lung-tsao"],"abstract":"Adult second language learners face the daunting but underappreciated task of mastering patterns of language use that are neither products of fully productive grammar rules nor frozen items to be memorized. Word Midas, a web browser extention, targets this uncharted territory of lexicogrammar by detecting multiword tokens of lexicogrammatical patterning in real time in situ within the noisy digital texts from the user{'}s unscripted web browsing or other digital venues. The language model powering Word Midas is StringNet, a densely cross-indexed navigable network of one billion lexicogrammatical patterns of English. These resources are described and their functionality is illustrated with a detailed scenario.","pages":"21--24","url":"https:\/\/www.aclweb.org\/anthology\/C16-2005","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2006","title":"{`}{B}on{T}en{'} {--} Corpus Concordance System for {`}{NINJAL} Web {J}apanese Corpus{'}","authors":["Asahara, Masayuki","KAWAHARA, Kazuya","TAKEI, Yuya","MASUOKA, Hideto","OHBA, Yasuko","TORII, Yuki","MORII, Toru","TANAKA, Yuki","Maekawa, Kikuo","KATO, Sachi","KONISHI, Hikari"],"emails":["","","","","","","","","","",""],"author_id":["masayuki-asahara","kazuya-kawahara","yuka-takei","hideto-masuoka","yasuko-ohba","yuki-torii","toru-morii","yuki-tanaka","kikuo-maekawa","sachi-kato","hikari-konishi"],"abstract":"The National Institute for Japanese Language and Linguistics, Japan (NINJAL) has undertaken a corpus compilation project to construct a web corpus for linguistic research comprising ten billion words. The project is divided into four parts: page collection, linguistic analysis, development of the corpus concordance system, and preservation. This article presents the corpus concordance system named {`}BonTen{'} which enables the ten-billion-scaled corpus to be queried by string, a sequence of morphological information or a subtree of the syntactic dependency structure.","pages":"25--29","url":"https:\/\/www.aclweb.org\/anthology\/C16-2006","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2007","title":"A Prototype Automatic Simultaneous Interpretation System","authors":["Wang, Xiaolin","Finch, Andrew","Utiyama, Masao","Sumita, Eiichiro"],"emails":["xiaolin.wang@nict.go.jp","andrew.finch@nict.go.jp","mutiyama@nict.go.jp","eiichiro.sumita@nict.go.jp"],"author_id":["xiaolin-wang","andrew-finch","masao-utiyama","eiichiro-sumita"],"abstract":"Simultaneous interpretation allows people to communicate spontaneously across language boundaries, but such services are prohibitively expensive for the general public. This paper presents a fully automatic simultaneous interpretation system to address this problem. Though the development is still at an early stage, the system is capable of keeping up with the fastest of the TED speakers while at the same time delivering high-quality translations. We believe that the system will become an effective tool for facilitating cross-lingual communication in the future.","pages":"30--34","url":"https:\/\/www.aclweb.org\/anthology\/C16-2007","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2008","title":"{M}u{TUAL}: A Controlled Authoring Support System Enabling Contextual Machine Translation","authors":["Miyata, Rei","Hartley, Anthony","Kageura, Kyo","Paris, C{\\'e}cile","Utiyama, Masao","Sumita, Eiichiro"],"emails":["rei@p.u-tokyo.ac.jp","","","","",""],"author_id":["rei-miyata","anthony-hartley","kyo-kageura","cecile-paris","masao-utiyama","eiichiro-sumita"],"abstract":"The paper introduces a web-based authoring support system, MuTUAL, which aims to help writers create multilingual texts. The highlighted feature of the system is that it enables machine translation (MT) to generate outputs appropriate to their functional context within the target document. Our system is operational online, implementing core mechanisms for document structuring and controlled writing. These include a topic template and a controlled language authoring assistant, linked to our statistical MT system.","pages":"35--39","url":"https:\/\/www.aclweb.org\/anthology\/C16-2008","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2009","title":"Joint search in a bilingual valency lexicon and an annotated corpus","authors":["Fu{\\v{c}}{\\'\\i}kov{\\'a}, Eva","Haji{\\v{c}}, Jan","Ure{\\v{s}}ov{\\'a}, Zde{\\v{n}}ka"],"emails":["fucikova@ufal.mff.cuni.cz","hajic@ufal.mff.cuni.cz","uresova@ufal.mff.cuni.cz"],"author_id":["eva-fucikova","jan-hajic","zdenka-uresova"],"abstract":"In this paper and the associated system demo, we present an advanced search system that allows to perform a joint search over a (bilingual) valency lexicon and a correspondingly annotated linked parallel corpus. This search tool has been developed on the basis of the Prague Czech-English Dependency Treebank, but its ideas are applicable in principle to any bilingual parallel corpus that is annotated for dependencies and valency (i.e., predicate-argument structure), and where verbs are linked to appropriate entries in an associated valency lexicon. Our online search tool consolidates more search interfaces into one, providing expanded structured search capability and a more efficient advanced way to search, allowing users to search for verb pairs, verbal argument pairs, their surface realization as recorded in the lexicon, or for their surface form actually appearing in the linked parallel corpus. The search system is currently under development, and is replacing our current search tool available at \\url{http:\/\/lindat.mff.cuni.cz\/services\/CzEngVallex}, which could search the lexicon but the queries cannot take advantage of the underlying corpus nor use the additional surface form information from the lexicon(s). The system is available as open source.","pages":"40--44","url":"https:\/\/www.aclweb.org\/anthology\/C16-2009","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2010","title":"Experiments in Candidate Phrase Selection for Financial Named Entity Extraction - A Demo","authors":["Kumar, Aman","Alam, Hassan","Werner, Tina","Vyas, Manan"],"emails":["","","","mvyas@bcltechnologies.com"],"author_id":["aman-kumar","hassan-alam","tina-werner","manan-vyas"],"abstract":"In this study we develop a system that tags and extracts financial concepts called financial named entities (FNE) along with corresponding numeric values {--} monetary and temporal. We employ machine learning and natural language processing methods to identify financial concepts and dates, and link them to numerical entities.","pages":"45--48","url":"https:\/\/www.aclweb.org\/anthology\/C16-2010","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2011","title":"Demonstration of {C}ha{K}i.{NET} {--} beyond the corpus search system","authors":["Asahara, Masayuki","Matsumoto, Yuji","MORITA, Toshio"],"emails":["","",""],"author_id":["masayuki-asahara","yuji-matsumoto","toshio-morita"],"abstract":"ChaKi.NET is a corpus management system for dependency structure annotated corpora. After more than 10 years of continuous development, the system is now usable not only for corpus search, but also for visualization, annotation, labelling, and formatting for statistical analysis. This paper describes the various functions included in the current ChaKi.NET system.","pages":"49--53","url":"https:\/\/www.aclweb.org\/anthology\/C16-2011","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2012","title":"{V}ox{S}im: A Visual Platform for Modeling Motion Language","authors":["Krishnaswamy, Nikhil","Pustejovsky, James"],"emails":["nkrishna@brandeis.edu","jamesp@brandeis.edu"],"author_id":["nikhil-krishnaswamy","james-pustejovsky"],"abstract":"Much existing work in text-to-scene generation focuses on generating static scenes. By introducing a focus on motion verbs, we integrate dynamic semantics into a rich formal model of events to generate animations in real time that correlate with human conceptions of the event described. This paper presents a working system that generates these animated scenes over a test set, discussing challenges encountered and describing the solutions implemented.","pages":"54--58","url":"https:\/\/www.aclweb.org\/anthology\/C16-2012","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2013","title":"{T}ext{I}mager: a Distributed {UIMA}-based System for {NLP}","authors":["Hemati, Wahed","Uslu, Tolga","Mehler, Alexander"],"emails":["hemati@em.uni-frankfurt.de","uslu@em.uni-frankfurt.de","mehler@em.uni-frankfurt.de"],"author_id":["wahed-hemati","tolga-uslu","alexander-mehler"],"abstract":"More and more disciplines require NLP tools for performing automatic text analyses on various levels of linguistic resolution. However, the usage of established NLP frameworks is often hampered for several reasons: in most cases, they require basic to sophisticated programming skills, interfere with interoperability due to using non-standard I\/O-formats and often lack tools for visualizing computational results. This makes it difficult especially for humanities scholars to use such frameworks. In order to cope with these challenges, we present TextImager, a UIMA-based framework that offers a range of NLP and visualization tools by means of a user-friendly GUI. Using TextImager requires no programming skills.","pages":"59--63","url":"https:\/\/www.aclweb.org\/anthology\/C16-2013","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2014","title":"{DISCO}: A System Leveraging Semantic Search in Document Review","authors":["Vo, Ngoc Phuoc An","Guillot, Fabien","Privault, Caroline"],"emails":["an.vo@xrce.xerox.com","fabien.guillot@xrce.xerox.com","caroline.privault@xrce.xerox.com"],"author_id":["ngoc-phuoc-an-vo","fabien-guillot","caroline-privault"],"abstract":"This paper presents Disco, a prototype for supporting knowledge workers in exploring, reviewing and sorting collections of textual data. The goal is to facilitate, accelerate and improve the discovery of information. To this end, it combines Semantic Relatedness techniques with a review workflow developed in a tangible environment. Disco uses a semantic model that is leveraged on-line in the course of search sessions, and accessed through natural hand-gesture, in a simple and intuitive way.","pages":"64--68","url":"https:\/\/www.aclweb.org\/anthology\/C16-2014","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2015","title":"pke: an open source python-based keyphrase extraction toolkit","authors":["Boudin, Florian"],"emails":["florian.boudin@univ-nantes.fr"],"author_id":["florian-boudin"],"abstract":"We describe pke, an open source python-based keyphrase extraction toolkit. It provides an end-to-end keyphrase extraction pipeline in which each component can be easily modified or extented to develop new approaches. pke also allows for easy benchmarking of state-of-the-art keyphrase extraction approaches, and ships with supervised models trained on the SemEval-2010 dataset.","pages":"69--73","url":"https:\/\/www.aclweb.org\/anthology\/C16-2015","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2016","title":"{L}angforia: Language Pipelines for Annotating Large Collections of Documents","authors":["Klang, Marcus","Nugues, Pierre"],"emails":["lang@cs.lth.se","ugues@cs.lth.se"],"author_id":["marcus-klang","pierre-nugues"],"abstract":"In this paper, we describe \\textbf{Langforia}, a multilingual processing pipeline to annotate texts with multiple layers: formatting, parts of speech, named entities, dependencies, semantic roles, and entity links. Langforia works as a web service, where the server hosts the language processing components and the client, the input and result visualization. To annotate a text or a Wikipedia page, the user chooses an NLP pipeline and enters the text in the interface or selects the page URL. Once processed, the results are returned to the client, where the user can select the annotation layers s\/he wants to visualize. We designed Langforia with a specific focus for Wikipedia, although it can process any type of text. Wikipedia has become an essential encyclopedic corpus used in many NLP projects. However, processing articles and visualizing the annotations are nontrivial tasks that require dealing with multiple markup variants, encodings issues, and tool incompatibilities across the language versions. This motivated the development of a new architecture. A demonstration of Langforia is available for six languages: English, French, German, Spanish, Russian, and Swedish at \\url{http:\/\/vilde.cs.lth.se:9000\/} as well as a web API: \\url{http:\/\/vilde.cs.lth.se:9000\/api}. Langforia is also provided as a standalone library and is compatible with cluster computing.","pages":"74--78","url":"https:\/\/www.aclweb.org\/anthology\/C16-2016","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2017","title":"{A}nita: An Intelligent Text Adaptation Tool","authors":["Paetzold, Gustavo","Specia, Lucia"],"emails":["g.h.paetzold@sheffield.ac.uk","l.specia@sheffield.ac.uk"],"author_id":["gustavo-paetzold","lucia-specia"],"abstract":"We introduce Anita: a flexible and intelligent Text Adaptation tool for web content that provides Text Simplification and Text Enhancement modules. Anita{'}s simplification module features a state-of-the-art system that adapts texts according to the needs of individual users, and its enhancement module allows the user to search for a word{'}s definitions, synonyms, translations, and visual cues through related images. These utilities are brought together in an easy-to-use interface of a freely available web browser extension.","pages":"79--83","url":"https:\/\/www.aclweb.org\/anthology\/C16-2017","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2018","title":"{H}istory{C}omparator: Interactive Across-Time Comparison in Document Archives","authors":["Jatowt, Adam","Bron, Marc"],"emails":["adam@dl.kuis.kyoto-u.ac.jp","marc.bron@gmail.com"],"author_id":["adam-jatowt","marc-bron"],"abstract":"Recent years have witnessed significant increase in the number of large scale digital collections of archival documents such as news articles, books, etc. Typically, users access these collections through searching or browsing. In this paper we investigate another way of accessing temporal collections - across-time comparison, i.e., comparing query-relevant information at different periods in the past. We propose an interactive framework called HistoryComparator for contrastively analyzing concepts in archival document collections at different time periods.","pages":"84--88","url":"https:\/\/www.aclweb.org\/anthology\/C16-2018","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2019","title":"On-line Multilingual Linguistic Services","authors":["Wehrli, Eric","Scherrer, Yves","Nerima, Luka"],"emails":["","","erima@unige.ch"],"author_id":["eric-wehrli","yves-scherrer","luka-nerima"],"abstract":"In this demo, we present our free on-line multilingual linguistic services which allow to analyze sentences or to extract collocations from a corpus directly on-line, or by uploading a corpus. They are available for 8 European languages (English, French, German, Greek, Italian, Portuguese, Romanian, Spanish) and can also be accessed as web services by programs. While several open systems are available for POS-tagging and dependency parsing or terminology extraction, their integration into an application requires some computational competence. Furthermore, none of the parsers\/taggers handles MWEs very satisfactorily, in particular when the two terms of the collocation are distant from each other or in reverse order. Our tools, on the other hand, are specifically designed for users with no particular computational literacy. They do not require from the user any download, installation or adaptation if used on-line, and their integration in an application, using one the scripts described below is quite easy. Furthermore, by default, the parser handles collocations and other MWEs, as well as anaphora resolution (limited to 3rd person personal pronouns). When used in the tagger mode, it can be set to display grammatical functions and collocations.","pages":"89--92","url":"https:\/\/www.aclweb.org\/anthology\/C16-2019","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2020","title":"A Customizable Editor for Text Simplification","authors":["Lee, John","Zhao, Wenlong","Xie, Wenxiu"],"emails":["jsylee@cityu.edu.hk","wenlzhao@gmail.com","vasiliky@outlook.com"],"author_id":["john-lee","wenlong-zhao","wenxiu-xie"],"abstract":"We present a browser-based editor for simplifying English text. Given an input sentence, the editor performs both syntactic and lexical simplification. It splits a complex sentence into shorter ones, and suggests word substitutions in drop-down lists. The user can choose the best substitution from the list, undo any inappropriate splitting, and further edit the sentence as necessary. A significant novelty is that the system accepts a customized vocabulary list for a target reader population. It identifies all words in the text that do not belong to the list, and attempts to substitute them with words from the list, thus producing a text tailored for the targeted readers.","pages":"93--97","url":"https:\/\/www.aclweb.org\/anthology\/C16-2020","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2021","title":"{CAT}a{L}og Online: A Web-based {CAT} Tool for Distributed Translation with Data Capture for {APE} and Translation Process Research","authors":["Pal, Santanu","Naskar, Sudip Kumar","Zampieri, Marcos","Nayak, Tapas","van Genabith, Josef"],"emails":["santanu.pal@uni-saarland.de","sudip.naskar@jdvu.ac.in","marcos.zampieri@uni-saarland.de","tnk02.05@gmail.com","josef.vangenabith@uni-saarland.de"],"author_id":["santanu-pal","sudip-kumar-naskar","marcos-zampieri","tapas-nayak","josef-van-genabith"],"abstract":"We present a free web-based CAT tool called CATaLog Online which provides a novel and user-friendly online CAT environment for post-editors\/translators. The goal is to support distributed translation, reduce post-editing time and effort, improve the post-editing experience and capture data for incremental MT\/APE (automatic post-editing) and translation process research. The tool supports individual as well as batch mode file translation and provides translations from three engines {--} translation memory (TM), MT and APE. TM suggestions are color coded to accelerate the post-editing task. The users can integrate their personal TM\/MT outputs. The tool remotely monitors and records post-editing activities generating an extensive range of post-editing logs.","pages":"98--102","url":"https:\/\/www.aclweb.org\/anthology\/C16-2021","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2022","title":"Interactive Relation Extraction in Main Memory Database Systems","authors":["Schneider, Rudolf","Guder, Cordula","Kilias, Torsten","L{\\\"o}ser, Alexander","Graupmann, Jens","Kozachuk, Oleksandr"],"emails":["ruschneider@beuth-hochschule.de","s57515@beuth-hochschule.de","tkilias@beuth-hochschule.de","aloeser@beuth-hochschule.de","jens.graupmann@exasol.com","oleksandr.kozachuk@exasol.com"],"author_id":["rudolf-schneider","cordula-guder","torsten-kilias","alexander-loser","jens-graupmann","oleksandr-kozachuk"],"abstract":"We present INDREX-MM, a main memory database system for interactively executing two interwoven tasks, declarative relation extraction from text and their exploitation with SQL. INDREX-MM simplifies these tasks for the user with powerful SQL extensions for gathering statistical semantics, for executing open information extraction and for integrating relation candidates with domain specific data. We demonstrate these functions on 800k documents from Reuters RCV1 with more than a billion linguistic annotations and report execution times in the order of seconds.","pages":"103--106","url":"https:\/\/www.aclweb.org\/anthology\/C16-2022","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2023","title":"An Open Source Library for Semantic-Based Datetime Resolution","authors":["Merlo, Aur{\\'e}lie","Pasin, Denis"],"emails":["",""],"author_id":["aurelie-merlo","denis-pasin"],"abstract":"In this paper, we introduce an original Python implementation of datetime resolution in french, which we make available as open-source library. Our approach is based on Frame Semantics and Corpus Pattern Analysis in order to provide a precise semantic interpretation of datetime expressions. This interpretation facilitates the contextual resolution of datetime expressions in timestamp format.","pages":"107--110","url":"https:\/\/www.aclweb.org\/anthology\/C16-2023","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2024","title":"{TASTY}: Interactive Entity Linking As-You-Type","authors":["Arnold, Sebastian","Dziuba, Robert","L{\\\"o}ser, Alexander"],"emails":["sarnold@beuth-hochschule.de","s58345@beuth-hochschule.de","aloeser@beuth-hochschule.de"],"author_id":["sebastian-arnold","robert-dziuba","alexander-loser"],"abstract":"We introduce TASTY (Tag-as-you-type), a novel text editor for interactive entity linking as part of the writing process. Tasty supports the author of a text with complementary information about the mentioned entities shown in a {`}live{'} exploration view. The system is automatically triggered by keystrokes, recognizes mention boundaries and disambiguates the mentioned entities to Wikipedia articles. The author can use seven operators to interact with the editor and refine the results according to his specific intention while writing. Our implementation captures syntactic and semantic context using a robust end-to-end LSTM sequence learner and word embeddings. We demonstrate the applicability of our system in English and German language for encyclopedic or medical text. Tasty is currently being tested in interactive applications for text production, such as scientific research, news editorial, medical anamnesis, help desks and product reviews.","pages":"111--115","url":"https:\/\/www.aclweb.org\/anthology\/C16-2024","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2025","title":"What topic do you want to hear about? A bilingual talking robot using {E}nglish and {J}apanese {W}ikipedias","authors":["Wilcock, Graham","Jokinen, Kristiina","Yamamoto, Seiichi"],"emails":["gw@cdminteract.com","kristiina.jokinen@helsinki.fi","seyamamo@mail.doshisha.ac.jp"],"author_id":["graham-wilcock","kristiina-jokinen","seiichi-yamamoto"],"abstract":"We demonstrate a bilingual robot application, WikiTalk, that can talk fluently in both English and Japanese about almost any topic using information from English and Japanese Wikipedias. The English version of the system has been demonstrated previously, but we now present a live demo with a Nao robot that speaks English and Japanese and switches language on request. The robot supports the verbal interaction with face-tracking, nodding and communicative gesturing. One of the key features of the WikiTalk system is that the robot can switch from the current topic to related topics during the interaction in order to navigate around Wikipedia following the user{'}s individual interests.","pages":"116--120","url":"https:\/\/www.aclweb.org\/anthology\/C16-2025","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2026","title":"Annotating Discourse Relations with the {PDTB} Annotator","authors":["Lee, Alan","Prasad, Rashmi","Webber, Bonnie","Joshi, Aravind K."],"emails":["aleewk@seas.upenn.edu","prasadr@uwm.edu","ebber@ed.ac.uk","joshi@seas.upenn.edu"],"author_id":["alan-lee","rashmi-prasad","bonnie-webber","aravind-joshi"],"abstract":"The PDTB Annotator is a tool for annotating and adjudicating discourse relations based on the annotation framework of the Penn Discourse TreeBank (PDTB). This demo describes the benefits of using the PDTB Annotator, gives an overview of the PDTB Framework and discusses the tool{'}s features, setup requirements and how it can also be used for adjudication.","pages":"121--125","url":"https:\/\/www.aclweb.org\/anthology\/C16-2026","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2027","title":"Opinion Retrieval Systems using Tweet-external Factors","authors":["Kim, Yoon-Sung","Song, Young-In","Rim, Hae-Chang"],"emails":["kys0205@korea.ac.kr","youngin.song@gmail.com","rim@korea.ac.kr"],"author_id":["yoon-sung-kim","young-in-song","hae-chang-rim"],"abstract":"Opinion mining is a natural language processing technique which extracts subjective information from natural language text. To estimate an opinion about a query in large data collection, an opinion retrieval system that retrieves subjective and relevant information about the query can be useful. We present an opinion retrieval system that retrieves subjective and query-relevant tweets from Twitter, which is a useful source of obtaining real-time opinions. Our system outperforms previous opinion retrieval systems, and it further provides subjective information about Twitter authors and hashtags to describe their subjective tendencies.","pages":"126--130","url":"https:\/\/www.aclweb.org\/anthology\/C16-2027","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2028","title":"{T}ext{P}ro-{AL}: An Active Learning Platform for Flexible and Efficient Production of Training Data for {NLP} Tasks","authors":["Magnini, Bernardo","Minard, Anne-Lyse","Qwaider, Mohammed R. H.","Speranza, Manuela"],"emails":["magnini@fbk.eu","minard@fbk.eu","qwaider@fbk.eu","manspera@fbk.eu"],"author_id":["bernardo-magnini","anne-lyse-minard","mohammed-r-h-qwaider","manuela-speranza"],"abstract":"This paper presents TextPro-AL (Active Learning for Text Processing), a platform where human annotators can efficiently work to produce high quality training data for new domains and new languages exploiting Active Learning methodologies. TextPro-AL is a web-based application integrating four components: a machine learning based NLP pipeline, an annotation editor for task definition and text annotations, an incremental re-training procedure based on active learning selection from a large pool of unannotated data, and a graphical visualization of the learning status of the system.","pages":"131--135","url":"https:\/\/www.aclweb.org\/anthology\/C16-2028","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2029","title":"{S}ide{N}oter: Scholarly Paper Browsing System based on {PDF} Restructuring and Text Annotation","authors":["Abekawa, Takeshi","Aizawa, Akiko"],"emails":["abekawa@nii.ac.jp","aizawa@nii.ac.jp"],"author_id":["takeshi-abekawa","akiko-aizawa"],"abstract":"In this paper, we discuss our ongoing efforts to construct a scientific paper browsing system that helps users to read and understand advanced technical content distributed in PDF. Since PDF is a format specifically designed for printing, layout and logical structures of documents are indistinguishably embedded in the file. It requires much effort to extract natural language text from PDF files, and reversely, display semantic annotations produced by NLP tools on the original page layout. In our browsing system, we tackle these issues caused by the gap between printable document and plain text. Our system provides ways to extract natural language sentences from PDF files together with their logical structures, and also to map arbitrary textual spans to their corresponding regions on page images. We setup a demonstration system using papers published in ACL anthology and demonstrate the enhanced search and refined recommendation functions which we plan to make widely available to NLP researchers.","pages":"136--140","url":"https:\/\/www.aclweb.org\/anthology\/C16-2029","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2030","title":"{S}ensing Emotions in Text Messages: An Application and Deployment Study of {E}motion{P}ush","authors":["Wang, Shih-Ming","Lee, Chun-Hui Scott","Lo, Yu-Chun","Huang, Ting-Hao","Ku, Lun-Wei"],"emails":["ipod825@gmail.com","iamscli.tw@gmail.com","howard.lo@nlplab.cc","tinghaoh@cs.cmu.edu","lwku@iis.sinica.edu.tw"],"author_id":["shih-ming-wang","chun-hui-scott-lee","yu-chun-lo","ting-hao-huang","lun-wei-ku"],"abstract":"Instant messaging and push notifications play important roles in modern digital life. To enable robust sense-making and rich context awareness in computer mediated communications, we introduce EmotionPush, a system that automatically conveys the emotion of received text with a colored push notification on mobile devices. EmotionPush is powered by state-of-the-art emotion classifiers and is deployed for Facebook Messenger clients on Android. The study showed that the system is able to help users prioritize interactions.","pages":"141--145","url":"https:\/\/www.aclweb.org\/anthology\/C16-2030","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2031","title":"{I}llinois Cross-Lingual Wikifier: Grounding Entities in Many Languages to the {E}nglish {W}ikipedia","authors":["Tsai, Chen-Tse","Roth, Dan"],"emails":["ctsai12@illinois.edu","danr@illinois.edu"],"author_id":["chen-tse-tsai","dan-roth"],"abstract":"We release a cross-lingual wikification system for all languages in Wikipedia. Given a piece of text in any supported language, the system identifies names of people, locations, organizations, and grounds these names to the corresponding English Wikipedia entries. The system is based on two components: a cross-lingual named entity recognition (NER) model and a cross-lingual mention grounding model. The cross-lingual NER model is a language-independent model which can extract named entity mentions in the text of any language in Wikipedia. The extracted mentions are then grounded to the English Wikipedia using the cross-lingual mention grounding model. The only resources required to train the proposed system are the multilingual Wikipedia dump and existing training data for English NER. The system is online at \\url{http:\/\/cogcomp.cs.illinois.edu\/page\/demo_view\/xl_wikifier}","pages":"146--150","url":"https:\/\/www.aclweb.org\/anthology\/C16-2031","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2032","title":"A Meaning-based {E}nglish Math Word Problem Solver with Understanding, Reasoning and Explanation","authors":["Liang, Chao-Chun","Tsai, Shih-Hong","Chang, Ting-Yun","Lin, Yi-Chung","Su, Keh-Yih"],"emails":["ccliang@iis.sinica.edu.tw","doublebite@iis.sinica.edu.tw","terachang621@iis.sinica.edu.tw","lyc@iis.sinica.edu.tw","kysu@iis.sinica.edu.tw"],"author_id":["chao-chun-liang","shih-hong-tsai","ting-yun-chang","yi-chung-lin","keh-yih-su"],"abstract":"This paper presents a meaning-based statistical math word problem (MWP) solver with understanding, reasoning and explanation. It comprises a web user interface and pipelined modules for analysing the text, transforming both body and question parts into their logic forms, and then performing inference on them. The associated context of each quantity is represented with proposed role-tags (e.g., nsubj, verb, etc.), which provides the flexibility for annotating the extracted math quantity with its associated syntactic and semantic information (which specifies the physical meaning of that quantity). Those role-tags are then used to identify the desired operands and filter out irrelevant quantities (so that the answer can be obtained precisely). Since the physical meaning of each quantity is explicitly represented with those role-tags and used in the inference process, the proposed approach could explain how the answer is obtained in a human comprehensible way.","pages":"151--155","url":"https:\/\/www.aclweb.org\/anthology\/C16-2032","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2033","title":"{V}alencer: an {API} to Query Valence Patterns in {F}rame{N}et","authors":["Kabbach, Alexandre","Ribeyre, Corentin"],"emails":["alexandre.kabbach@unige.ch","corentin.ribeyre@unige.ch"],"author_id":["alexandre-kabbach","corentin-ribeyre"],"abstract":"This paper introduces Valencer: a RESTful API to search for annotated sentences matching a given combination of syntactic realizations of the arguments of a predicate {--} also called {`}valence pattern{'} {--} in the FrameNet database. The API takes as input an HTTP GET request specifying a valence pattern and outputs a list of exemplifying annotated sentences in JSON format. The API is designed to be modular and language-independent, and can therefore be easily integrated to other (NLP) server-side or client-side applications, as well as non-English FrameNet projects. Valencer is free, open-source, and licensed under the MIT license.","pages":"156--160","url":"https:\/\/www.aclweb.org\/anthology\/C16-2033","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2034","title":"The Open Framework for Developing Knowledge Base And Question Answering System","authors":["Kim, Jiseong","Choi, GyuHyeon","Kim, Jung-Uk","Kim, Eun-Kyung","Choi, Key-Sun"],"emails":["jiseong@kaist.ac.kr","kschoi@kaist.ac.kr","prismriver@kaist.ac.kr","kekeeo@kaist.ac.kr","wiany11@kaist.ac.kr"],"author_id":["jiseong-kim","gyuhyeon-choi","jung-uk-kim","eun-kyung-kim","key-sun-choi"],"abstract":"Developing a question answering (QA) system is a task of implementing and integrating modules of different technologies and evaluating an integrated whole system, which inevitably goes with a collaboration among experts of different domains. For supporting a easy collaboration, this demonstration presents the open framework that aims to support developing a QA system in collaborative and intuitive ways. The demonstration also shows the QA system developed by our novel framework.","pages":"161--165","url":"https:\/\/www.aclweb.org\/anthology\/C16-2034","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2035","title":"Linggle Knows: A Search Engine Tells How People Write","authors":["Chen, Jhih-Jie","Peng, Hao-Chun","Yeh, Mei-Cih","Chen, Peng-Yu","Chang, Jason"],"emails":["jjc@nlplab.cc","pengyu@nlplab.cc","meicih@nlplab.cc","henry.p@nlplab.cc","jason@nlplab.cc"],"author_id":["jhih-jie-chen","hao-chun-peng","mei-cih-yeh","peng-yu-chen","jason-s-chang"],"abstract":"This paper shows the great potential of incorporating different approaches to help writing. Not only did they solve different kinds of writing problems, but also they complement and reinforce each other to be a complete and effective solution. Despite the extensive and multifaceted feedback and suggestion, writing is not all about syntactically or lexically well-written. It involves contents, structure, the certain understanding of the background, and many other factors to compose a rich, organized and sophisticated text. (e.g., conventional structure and idioms in academic writing). There is still a long way to go to accomplish the ultimate goal. We envision the future of writing to be a joyful experience with the help of instantaneous suggestion and constructive feedback.","pages":"166--169","url":"https:\/\/www.aclweb.org\/anthology\/C16-2035","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2036","title":"A Sentence Simplification System for Improving Relation Extraction","authors":["Niklaus, Christina","Bermeitinger, Bernhard","Handschuh, Siegfried","Freitas, Andr{\\'e}"],"emails":["christina.niklaus@uni-passau.de","bernhard.bermeitinger@uni-passau.de","siegfried.handschuh@uni-passau.de","andre.freitas@uni-passau.de"],"author_id":["christina-niklaus","bernhard-bermeitinger","siegfried-handschuh","andre-freitas"],"abstract":"We present a text simplification approach that is directed at improving the performance of state-of-the-art Open Relation Extraction (RE) systems. As syntactically complex sentences often pose a challenge for current Open RE approaches, we have developed a simplification framework that performs a pre-processing step by taking a single sentence as input and using a set of syntactic-based transformation rules to create a textual input that is easier to process for subsequently applied Open RE systems.","pages":"170--174","url":"https:\/\/www.aclweb.org\/anthology\/C16-2036","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2037","title":"{K}orean {F}rame{N}et Expansion Based on Projection of {J}apanese {F}rame{N}et","authors":["Kim, Jeong-uk","Hahm, Younggyun","Choi, Key-Sun"],"emails":["prismriver@kaist.ac.kr","hahmyg@kaist.ac.kr","kschoi@kaist.ac.kr"],"author_id":["jeong-uk-kim","younggyun-hahm","key-sun-choi"],"abstract":"FrameNet project has begun from Berkeley in 1997, and is now supported in several countries reflecting characteristics of each language. The work for generating Korean FrameNet was already done by converting annotated English sentences into Korean with trained translators. However, high cost of frame-preservation and error revision was a huge burden on further expansion of FrameNet. This study makes use of linguistic similarity between Japanese and Korean to increase Korean FrameNet corpus with low cost. We also suggest adapting PubAnnotation and Korean-friendly valence patterns to FrameNet for increased accessibility.","pages":"175--179","url":"https:\/\/www.aclweb.org\/anthology\/C16-2037","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2038","title":"A Framework for Mining Enterprise Risk and Risk Factors from News Documents","authors":["Dasgupta, Tirthankar","Dey, Lipika","Dey, Prasenjit","Saha, Rupsa"],"emails":["gupta.tirthankar@tcs.com","lipika.dey@tcs.com","ab@tcs.com","prsnjt002@gmail.com"],"author_id":["tirthankar-dasgupta","lipika-dey","prasenjit-dey","rupsa-saha"],"abstract":"Any real world events or trends that can affect the company{'}s growth trajectory can be considered as risk. There has been a growing need to automatically identify, extract and analyze risk related statements from news events. In this demonstration, we will present a risk analytics framework that processes enterprise project management reports in the form of textual data and news documents and classify them into valid and invalid risk categories. The framework also extracts information from the text pertaining to the different categories of risks like their possible cause and impacts. Accordingly, we have used machine learning based techniques and studied different linguistic features like n-gram, POS, dependency, future timing, uncertainty factors in texts and their various combinations. A manual annotation study from management experts using risk descriptions collected for a specific organization was conducted to evaluate the framework. The evaluation showed promising results for automated risk analysis and identification.","pages":"180--184","url":"https:\/\/www.aclweb.org\/anthology\/C16-2038","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2039","title":"papago: A Machine Translation Service with Word Sense Disambiguation and Currency Conversion","authors":["Lee, Hyoung-Gyu","Kim, Jun-Seok","Shin, Joong-Hwi","Lee, Jaesong","Quan, Ying-Xiu","Jeong, Young-Seob"],"emails":["hg.lee@navercorp.com","jun.seok@navercorp.com","joonghwi.shin@navercorp.com","jaesong.lee@navercorp.com","pinode.waider@navercorp.com","eungsoo.jun@navercorp.com"],"author_id":["hyoung-gyu-lee","jun-seok-kim","joong-hwi-shin","jaesong-lee","ying-xiu-quan","young-seob-jeong"],"abstract":"In this paper, we introduce papago - a translator for mobile device which is equipped with new features that can provide convenience for users. The first feature is word sense disambiguation based on user feedback. By using the feature, users can select one among multiple meanings of a homograph and obtain the corrected translation with the user-selected sense. The second feature is the instant currency conversion of money expressions contained in a translation result with current exchange rate. Users can be quickly and precisely provided the amount of money converted as local currency when they travel abroad.","pages":"185--188","url":"https:\/\/www.aclweb.org\/anthology\/C16-2039","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2040","title":"{T}opo{T}ext: Interactive Digital Mapping of Literary Text","authors":["El Khatib, Randa","El Zini, Julia","Wrisley, David","Jaber, Mohamad","Elbassuoni, Shady"],"emails":["khatib@uvic.ca","jwe0@4aub.edu.lb","dw04@aub.edu.lb","mj54@aub.edu.lb","se58@aub.edu.lb"],"author_id":["randa-el-khatib","julia-el-zini","david-wrisley","mohamad-jaber","shady-elbassuoni"],"abstract":"We demonstrate TopoText, an interactive tool for digital mapping of literary text. TopoText takes as input a literary piece of text such as a novel or a biography article and automatically extracts all place names in the text. The identified places are then geoparsed and displayed on an interactive map. TopoText calculates the number of times a place was mentioned in the text, which is then reflected on the map allowing the end-user to grasp the importance of the different places within the text. It also displays the most frequent words mentioned within a specified proximity of a place name in context or across the entire text. This can also be faceted according to part of speech tags. Finally, TopoText keeps the human in the loop by allowing the end-user to disambiguate places and to provide specific place annotations. All extracted information such as geolocations, place frequencies, as well as all user-provided annotations can be automatically exported as a CSV file that can be imported later by the same user or other users.","pages":"189--193","url":"https:\/\/www.aclweb.org\/anthology\/C16-2040","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2041","title":"{ACE}: Automatic Colloquialism, Typographical and Orthographic Errors Detection for {C}hinese Language","authors":["Dong, Shichao","Fung, Gabriel Pui Cheong","Li, Binyang","Peng, Baolin","Liao, Ming","Zhu, Jia","Wong, Kam-fai"],"emails":["scdong@se.cuhk.edu.hk","gabriel@labviso.com","mliao@se.cuhk.edu.hk","blpeng@se.cuhk.edu.hk","byli@uir.edu.cn","jzhu@m.scnu.edu.cn","kfwong@se.cuhk.edu.hk"],"author_id":["shichao-dong","gabriel-pui-cheong-fung","binyang-li","baolin-peng","ming-liao","jia-zhu","kam-fai-wong"],"abstract":"We present a system called ACE for Automatic Colloquialism and Errors detection for written Chinese. ACE is based on the combination of N-gram model and rule-base model. Although it focuses on detecting colloquial Cantonese (a dialect of Chinese) at the current stage, it can be extended to detect other dialects. We chose Cantonese becauase it has many interesting properties, such as unique grammar system and huge colloquial terms, that turn the detection task extremely challenging. We conducted experiments using real data and synthetic data. The results indicated that ACE is highly reliable and effective.","pages":"194--197","url":"https:\/\/www.aclweb.org\/anthology\/C16-2041","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2042","title":"A Tool for Efficient Content Compilation","authors":["Galitsky, Boris"],"emails":["bgalitsky@hotmail.com"],"author_id":["boris-galitsky"],"abstract":"We build a tool to assist in content creation by mining the web for information relevant to a given topic. This tool imitates the process of essay writing by humans: searching for topics on the web, selecting content frag-ments from the found document, and then compiling these fragments to obtain a coherent text. The process of writing starts with automated building of a table of content by obtaining the list of key entities for the given topic extracted from web resources such as Wikipedia. Once a table of content is formed, each item forms a seed for web mining. The tool builds a full-featured structured Word document with table of content, section structure, images and captions and web references for all mined text fragments. Two linguistic technologies are employed: for relevance verification, we use similarity computed as a tree similarity between parse trees for a seed and candidate text fragment. For text coherence, we use a measure of agreement between a given and consecutive paragraph by tree kernel learning of their discourse trees. The tool is available at \\url{http:\/\/animatronica.io\/submit.html}.","pages":"198--202","url":"https:\/\/www.aclweb.org\/anthology\/C16-2042","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2043","title":"{MAGES}: A Multilingual Angle-integrated Grouping-based Entity Summarization System","authors":["Kim, Eun-kyung","Choi, Key-Sun"],"emails":["kekeeo@world.kaist.ac.kr","kschoi@world.kaist.ac.kr"],"author_id":["eun-kyung-kim","key-sun-choi"],"abstract":"This demo presents MAGES (multilingual angle-integrated grouping-based entity summarization), an entity summarization system for a large knowledge base such as DBpedia based on a entity-group-bound ranking in a single integrated entity space across multiple language-specific editions. MAGES offers a multilingual angle-integrated space model, which has the advantage of overcoming missing semantic tags (i.e., categories) caused by biases in different language communities, and can contribute to the creation of entity groups that are well-formed and more stable than the monolingual condition within it. MAGES can help people quickly identify the essential points of the entities when they search or browse a large volume of entity-centric data. Evaluation results on the same experimental data demonstrate that our system produces a better summary compared with other representative DBpedia entity summarization methods.","pages":"203--207","url":"https:\/\/www.aclweb.org\/anthology\/C16-2043","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2044","title":"{B}otta: An {A}rabic Dialect Chatbot","authors":["Abu Ali, Dana","Habash, Nizar"],"emails":["daa389@nyu.edu","nizar.habash@nyu.edu"],"author_id":["dana-abu-ali","nizar-habash"],"abstract":"This paper presents BOTTA, the first Arabic dialect chatbot. We explore the challenges of creating a conversational agent that aims to simulate friendly conversations using the Egyptian Arabic dialect. We present a number of solutions and describe the different components of the BOTTA chatbot. The BOTTA database files are publicly available for researchers working on Arabic chatbot technologies. The BOTTA chatbot is also publicly available for any users who want to chat with it online.","pages":"208--212","url":"https:\/\/www.aclweb.org\/anthology\/C16-2044","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2045","title":"What{'}s up on Twitter? Catch up with {TWIST}!","authors":["Litvak, Marina","Vanetik, Natalia","Levi, Efi","Roistacher, Michael"],"emails":["marinal@sce.ac.il","natalyav@sce.ac.il","efilvefi@gmail.com","mikiroistacher@gmail.com"],"author_id":["marina-litvak","natalia-vanetik","efi-levi","michael-roistacher"],"abstract":"Event detection and analysis with respect to public opinions and sentiments in social media is a broad and well-addressed research topic. However, the characteristics and sheer volume of noisy Twitter messages make this a difficult task. This demonstration paper describes a TWItter event Summarizer and Trend detector (TWIST) system for event detection, visualization, textual description, and geo-sentiment analysis of real-life events reported in Twitter.","pages":"213--217","url":"https:\/\/www.aclweb.org\/anthology\/C16-2045","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2046","title":"{P}raat on the Web: An Upgrade of {P}raat for Semi-Automatic Speech Annotation","authors":["Dom{\\'\\i}nguez, M{\\'o}nica","Latorre, Iv{\\'a}n","Farr{\\'u}s, Mireia","Codina-Filb{\\`a}, Joan","Wanner, Leo"],"emails":["monica.dominguez@upf.edu","ivan.latorre@upf.edu","mireia.farrus@upf.edu","joan.codina@upf.edu","leo.wanner@upf.edu"],"author_id":["monica-dominguez","ivan-latorre","mireia-farrus","joan-codina-filba","leo-wanner"],"abstract":"This paper presents an implementation of the widely used speech analysis tool Praat as a web application with an extended functionality for feature annotation. In particular, Praat on the Web addresses some of the central limitations of the original Praat tool and provides (i) enhanced visualization of annotations in a dedicated window for feature annotation at interval and point segments, (ii) a dynamic scripting composition exemplified with a modular prosody tagger, and (iii) portability and an operational web interface. Speech annotation tools with such a functionality are key for exploring large corpora and designing modular pipelines.","pages":"218--222","url":"https:\/\/www.aclweb.org\/anthology\/C16-2046","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2047","title":"{YAMAMA}: Yet Another Multi-Dialect {A}rabic Morphological Analyzer","authors":["Khalifa, Salam","Zalmout, Nasser","Habash, Nizar"],"emails":["salamkhalifa@nyu.edu","nasser.zalmout@nyu.edu","nizar.habash@nyu.edu"],"author_id":["salam-khalifa","nasser-zalmout","nizar-habash"],"abstract":"In this paper, we present YAMAMA, a multi-dialect Arabic morphological analyzer and disambiguator. Our system is almost five times faster than the state-of-art MADAMIRA system with a slightly lower quality. In addition to speed, YAMAMA outputs a rich representation which allows for a wider spectrum of use. In this regard, YAMAMA transcends other systems, such as FARASA, which is faster but provides specific outputs catering to specific applications.","pages":"223--227","url":"https:\/\/www.aclweb.org\/anthology\/C16-2047","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2048","title":"{C}amel{P}arser: A system for {A}rabic Syntactic Analysis and Morphological Disambiguation","authors":["Shahrour, Anas","Khalifa, Salam","Taji, Dima","Habash, Nizar"],"emails":["anas.shahrour@nyu.edu","salamkhalifa@nyu.edu","dima.taji@nyu.edu","nizar.habash@nyu.edu"],"author_id":["anas-shahrour","salam-khalifa","dima-taji","nizar-habash"],"abstract":"In this paper, we present CamelParser, a state-of-the-art system for Arabic syntactic dependency analysis aligned with contextually disambiguated morphological features. CamelParser uses a state-of-the-art morphological disambiguator and improves its results using syntactically driven features. The system offers a number of output formats that include basic dependency with morphological features, two tree visualization modes, and traditional Arabic grammatical analysis.","pages":"228--232","url":"https:\/\/www.aclweb.org\/anthology\/C16-2048","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2049","title":"Demonstrating Ambient Search: Implicit Document Retrieval for Speech Streams","authors":["Milde, Benjamin","Wacker, Jonas","Radomski, Stefan","M{\\\"u}hlh{\\\"a}user, Max","Biemann, Chris"],"emails":["","","","",""],"author_id":["benjamin-milde","jonas-wacker","stefan-radomski","max-muhlhauser","chris-biemann"],"abstract":"In this demonstration paper we describe Ambient Search, a system that displays and retrieves documents in real time based on speech input. The system operates continuously in ambient mode, i.e. it generates speech transcriptions and identifies main keywords and keyphrases, while also querying its index to display relevant documents without explicit query. Without user intervention, the results are dynamically updated; users can choose to interact with the system at any time, employing a conversation protocol that is enriched with the ambient information gathered continuously. Our evaluation shows that Ambient Search outperforms another implicit speech-based information retrieval system. Ambient search is available as open source software.","pages":"233--237","url":"https:\/\/www.aclweb.org\/anthology\/C16-2049","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2050","title":"{C}on{F}arm: Extracting Surface Representations of Verb and Noun Constructions from Dependency Annotated Corpora of {R}ussian","authors":["Mediankin, Nikita"],"emails":["nikita.medyankin@gmail.com"],"author_id":["nikita-mediankin"],"abstract":"ConFarm is a web service dedicated to extraction of surface representations of verb and noun constructions from dependency annotated corpora of Russian texts. Currently, the extraction of constructions with a specific lemma from SynTagRus and Russian National Corpus is available. The system provides flexible interface that allows users to fine-tune the output. Extracted constructions are grouped by their contents to allow for compact representation, and the groups are visualised as a graph in order to help navigating the extraction results. ConFarm differs from similar existing tools for Russian language in that it offers full constructions, as opposed to extracting separate dependents of search word or working with collocations, and allows users to discover unexpected constructions as opposed to searching for examples of a user-defined construction.","pages":"238--242","url":"https:\/\/www.aclweb.org\/anthology\/C16-2050","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2051","title":"{ENIAM}: Categorial Syntactic-Semantic Parser for Polish","authors":["Jaworski, Wojciech","Kozakoszczak, Jakub"],"emails":["wjaworski@mimuw.edu.pl","jkozakoszczak@gmail.com"],"author_id":["wojciech-jaworski","jakub-kozakoszczak"],"abstract":"This paper presents ENIAM, the first syntactic and semantic parser that generates semantic representations for sentences in Polish. The parser processes non-annotated data and performs tokenization, lemmatization, dependency recognition, word sense annotation, thematic role annotation, partial disambiguation and computes the semantic representation.","pages":"243--247","url":"https:\/\/www.aclweb.org\/anthology\/C16-2051","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2052","title":"Towards Non-projective High-Order Dependency Parser","authors":["Fang, Wenjing","Zhu, Kenny","Wang, Yizhong","Tan, Jia"],"emails":["littlebeanfang@sjtu.edu.cn","kzhu@sjtu.edu.cn","eastonwyz@gmail.com","tjtanjia.tan@gmail.com"],"author_id":["wenjing-fang","kenny-zhu","yizhong-wang","jia-tan"],"abstract":"This paper presents a novel high-order dependency parsing framework that targets non-projective treebanks. It imitates how a human parses sentences in an intuitive way. At every step of the parse, it determines which word is the easiest to process among all the remaining words, identifies its head word and then folds it under the head word. Further, this work is flexible enough to be augmented with other parsing techniques.","pages":"248--252","url":"https:\/\/www.aclweb.org\/anthology\/C16-2052","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2053","title":"Using Synthetically Collected Scripts for Story Generation","authors":["Ogata, Takashi","Arai, Tatsuya","Ono, Jumpei"],"emails":["g031l011@s.iwate","","g236m001@s.iwate"],"author_id":["takashi-ogata","tatsuya-arai","jumpei-ono"],"abstract":"A script is a type of knowledge representation in artificial intelligence (AI). This paper presents two methods for synthetically using collected scripts for story generation. The first method recursively generates long sequences of events and the second creates script networks. Although related studies generally use one or more scripts for story generation, this research synthetically uses many scripts to flexibly generate a diverse narrative.","pages":"253--257","url":"https:\/\/www.aclweb.org\/anthology\/C16-2053","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2054","title":"{C}ase{S}ummarizer: A System for Automated Summarization of Legal Texts","authors":["Polsley, Seth","Jhunjhunwala, Pooja","Huang, Ruihong"],"emails":["spolsley@cse.tamu.edu","pj861992@cse.tamu.edu","huangrh@cse.tamu.edu"],"author_id":["seth-polsley","pooja-jhunjhunwala","ruihong-huang"],"abstract":"Attorneys, judges, and others in the justice system are constantly surrounded by large amounts of legal text, which can be difficult to manage across many cases. We present CaseSummarizer, a tool for automated text summarization of legal documents which uses standard summary methods based on word frequency augmented with additional domain-specific knowledge. Summaries are then provided through an informative interface with abbreviations, significance heat maps, and other flexible controls. It is evaluated using ROUGE and human scoring against several other summarization systems, including summary text and feedback provided by domain experts.","pages":"258--262","url":"https:\/\/www.aclweb.org\/anthology\/C16-2054","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2055","title":"{WISDOM} X, {DISAANA} and D-{SUMM}: Large-scale {NLP} Systems for Analyzing Textual Big Data","authors":["Mizuno, Junta","Tanaka, Masahiro","Ohtake, Kiyonori","Oh, Jong-Hoon","Kloetzer, Julien","Hashimoto, Chikara","Torisawa, Kentaro"],"emails":["junta-m@nict.go.jp","mtnk@nict.go.jp","kiyonori.ohtake@nict.go.jp","rovellia@nict.go.jp","julien@nict.go.jp","ch@nict.go.jp","torisawa@nict.go.jp"],"author_id":["junta-mizuno","masahiro-tanaka","kiyonori-ohtake","jong-hoon-oh","julien-kloetzer","chikara-hashimoto","kentaro-torisawa"],"abstract":"We demonstrate our large-scale NLP systems: WISDOM X, DISAANA, and D-SUMM. WISDOM X provides numerous possible answers including unpredictable ones to widely diverse natural language questions to provide deep insights about a broad range of issues. DISAANA and D-SUMM enable us to assess the damage caused by large-scale disasters in real time using Twitter as an information source.","pages":"263--267","url":"https:\/\/www.aclweb.org\/anthology\/C16-2055","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2056","title":"Multilingual Information Extraction with {P}olyglot{IE}","authors":["Akbik, Alan","Chiticariu, Laura","Danilevsky, Marina","Kbrom, Yonas","Li, Yunyao","Zhu, Huaiyu"],"emails":["akbika@us.ibm.com","chiti@us.ibm.com","mdanile@us.ibm.com","yktbrom@us.ibm.com","yunyaoli@us.ibm.com","huaiyu@us.ibm.com"],"author_id":["alan-akbik","laura-chiticariu","marina-danilevsky","yonas-kbrom","yunyao-li","huaiyu-zhu"],"abstract":"We present PolyglotIE, a web-based tool for developing extractors that perform Information Extraction (IE) over multilingual data. Our tool has two core features: First, it allows users to develop extractors against a unified abstraction that is shared across a large set of natural languages. This means that an extractor needs only be created once for one language, but will then run on multilingual data without any additional effort or language-specific knowledge on part of the user. Second, it embeds this abstraction as a set of views within a declarative IE system, allowing users to quickly create extractors using a mature IE query language. We present PolyglotIE as a hands-on demo in which users can experiment with creating extractors, execute them on multilingual text and inspect extraction results. Using the UI, we discuss the challenges and potential of using unified, crosslingual semantic abstractions as basis for downstream applications. We demonstrate multilingual IE for 9 languages from 4 different language groups: English, German, French, Spanish, Japanese, Chinese, Arabic, Russian and Hindi.","pages":"268--272","url":"https:\/\/www.aclweb.org\/anthology\/C16-2056","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2057","title":"{W}ord{F}orce: Visualizing Controversial Words in Debates","authors":["Chen, Wei-Fan","Lin, Fang-Yu","Ku, Lun-Wei"],"emails":["viericwf@iis.sinica.edu.tw","nis50122806@gmail.com","lwku@iis.sinica.edu.tw"],"author_id":["wei-fan-chen","fang-yu-lin","lun-wei-ku"],"abstract":"This paper presents WordForce, a system powered by the state of the art neural network model to visualize the learned user-dependent word embeddings from each post according to the post content and its engaged users. It generates the scatter plots to show the force of a word, i.e., whether the semantics of word embeddings from posts of different stances are clearly separated from the aspect of this controversial word. In addition, WordForce provides the dispersion and the distance of word embeddings from posts of different stance groups, and proposes the most controversial words accordingly to show clues to what people argue about in a debate.","pages":"273--277","url":"https:\/\/www.aclweb.org\/anthology\/C16-2057","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2058","title":"{Z}ara: A Virtual Interactive Dialogue System Incorporating Emotion, Sentiment and Personality Recognition","authors":["Fung, Pascale","Dey, Anik","Siddique, Farhad Bin","Lin, Ruixi","Yang, Yang","Bertero, Dario","Wan, Yan","Chan, Ricky Ho Yin","Wu, Chien-Sheng"],"emails":["pascale@ece.ust.hk","adey@connect.ust.hk","fsiddique@connect.ust.hk","rlinab@connect.ust.hk","yyangag@connect.ust.hk","dbertero@connect.ust.hk","ywanad@connect.ust.hk","eehychan@ust.hk","b01901045@ntu.edu.tw"],"author_id":["pascale-fung","anik-dey","farhad-bin-siddique","ruixi-lin","yang-yang","dario-bertero","yan-wan","ricky-ho-yin-chan","chien-sheng-wu"],"abstract":"Zara, or {`}Zara the Supergirl{'} is a virtual robot, that can exhibit empathy while interacting with an user, with the aid of its built in facial and emotion recognition, sentiment analysis, and speech module. At the end of the 5-10 minute conversation, Zara can give a personality analysis of the user based on all the user utterances. We have also implemented a real-time emotion recognition, using a CNN model that detects emotion from raw audio without feature extraction, and have achieved an average of 65.7{\\%} accuracy on six different emotion classes, which is an impressive 4.5{\\%} improvement from the conventional feature based SVM classification. Also, we have described a CNN based sentiment analysis module trained using out-of-domain data, that recognizes sentiment from the speech recognition transcript, which has a 74.8 F-measure when tested on human-machine dialogues.","pages":"278--281","url":"https:\/\/www.aclweb.org\/anthology\/C16-2058","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2059","title":"{NL}2{KB}: Resolving Vocabulary Gap between Natural Language and Knowledge Base in Knowledge Base Construction and Retrieval","authors":["Wei, Sheng-Lun","Chiu, Yen-Pin","Huang, Hen-Hsen","Chen, Hsin-Hsi"],"emails":["weisl@nlg.csie.ntu.edu.tw","ypchiu@nlg.csie.ntu.edu.tw","hhhuang@nlg.csie.ntu.edu.tw","hhchen@ntu.edu.tw"],"author_id":["sheng-lun-wei","yen-pin-chiu","hen-hsen-huang","hsin-hsi-chen"],"abstract":"Words to express relations in natural language (NL) statements may be different from those to represent properties in knowledge bases (KB). The vocabulary gap becomes barriers for knowledge base construction and retrieval. With the demo system called NL2KB in this paper, users can browse which properties in KB side may be mapped to for a given relational pattern in NL side. Besides, they can retrieve the sets of relational patterns in NL side for a given property in KB side. We describe how the mapping is established in detail. Although the mined patterns are used for Chinese knowledge base applications, the methodology can be extended to other languages.","pages":"282--286","url":"https:\/\/www.aclweb.org\/anthology\/C16-2059","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2060","title":"{PKUSUMSUM} : A {J}ava Platform for Multilingual Document Summarization","authors":["Zhang, Jianmin","Wang, Tianming","Wan, Xiaojun"],"emails":["zhangjianmin2015@pku.edu.cn","wangtm@pku.edu.cn","wanxiaojun@pku.edu.cn"],"author_id":["jianmin-zhang","tianming-wang","xiaojun-wan"],"abstract":"PKUSUMSUM is a Java platform for multilingual document summarization, and it sup-ports multiple languages, integrates 10 automatic summarization methods, and tackles three typical summarization tasks. The summarization platform has been released and users can easily use and update it. In this paper, we make a brief description of the char-acteristics, the summarization methods, and the evaluation results of the platform, and al-so compare PKUSUMSUM with other summarization toolkits.","pages":"287--291","url":"https:\/\/www.aclweb.org\/anthology\/C16-2060","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2061","title":"{K}otonush: Understanding Concepts Based on Values behind Social Media","authors":["Iwanari, Tatsuya","Ohara, Kohei","Yoshinaga, Naoki","Kaji, Nobuhiro","Toyoda, Masashi","Kitsuregawa, Masaru"],"emails":["","","","","",""],"author_id":["tatsuya-iwanari","kohei-ohara","naoki-yoshinaga","nobuhiro-kaji","masashi-toyoda","masaru-kitsuregawa"],"abstract":"Kotonush, a system that clarifies people{'}s values on various concepts on the basis of what they write about on social media, is presented. The values are represented by ordering sets of concepts (e.g., London, Berlin, and Rome) in accordance with a common attribute intensity expressed by an adjective (e.g., entertaining). We exploit social media text written by different demographics and at different times in order to induce specific orderings for comparison. The system combines a text-to-ordering module with an interactive querying interface enabled by massive hyponymy relations and provides mechanisms to compare the induced orderings from various viewpoints. We empirically evaluate Kotonush and present some case studies, featuring real-world concept orderings with different domains on Twitter, to demonstrate the usefulness of our system.","pages":"292--296","url":"https:\/\/www.aclweb.org\/anthology\/C16-2061","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2062","title":"Exploring a Continuous and Flexible Representation of the Lexicon","authors":["Marchal, Pierre","Poibeau, Thierry"],"emails":["pierre.marchal@inalco.fr","thierry.poibeau@ens.fr"],"author_id":["pierre-marchal","thierry-poibeau"],"abstract":"We aim at showing that lexical descriptions based on multifactorial and continuous models can be used by linguists and lexicographers (and not only by machines) so long as they are provided with a way to efficiently navigate data collections. We propose to demonstrate such a system.","pages":"297--301","url":"https:\/\/www.aclweb.org\/anthology\/C16-2062","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2063","title":"Automatically Suggesting Example Sentences of Near-Synonyms for Language Learners","authors":["Huang, Chieh-Yang","Peinelt, Nicole","Ku, Lun-Wei"],"emails":["nis50122806@gmail.com","appleternity@iis.sinica.edu.tw","lwku@iis.sinica.edu.tw"],"author_id":["chieh-yang-huang","nicole-peinelt","lun-wei-ku"],"abstract":"In this paper, we propose GiveMeExample that ranks example sentences according to their capacity of demonstrating the differences among English and Chinese near-synonyms for language learners. The difficulty of the example sentences is automatically detected. Furthermore, the usage models of the near-synonyms are built by the GMM and Bi-LSTM models to suggest the best elaborative sentences. Experiments show the good performance both in the fill-in-the-blank test and on the manually labeled gold data, that is, the built models can select the appropriate words for the given context and vice versa.","pages":"302--306","url":"https:\/\/www.aclweb.org\/anthology\/C16-2063","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"},{"id":"C16-2064","title":"{K}yoto-{NMT}: a Neural Machine Translation implementation in Chainer","authors":["Cromi{\\`e}res, Fabien"],"emails":["fabien@pa.jst.jp"],"author_id":["fabien-cromieres"],"abstract":"We present Kyoto-NMT, an open-source implementation of the Neural Machine Translation paradigm. This implementation is done in Python and Chainer, an easy-to-use Deep Learning Framework.","pages":"307--311","url":"https:\/\/www.aclweb.org\/anthology\/C16-2064","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of {COLING} 2016, the 26th International Conference on Computational Linguistics: System Demonstrations"}]