[{"id":"I17-1001","title":"Evaluating Layers of Representation in Neural Machine Translation on Part-of-Speech and Semantic Tagging Tasks","authors":["Belinkov, Yonatan","M{\\`a}rquez, Llu{\\'\\i}s","Sajjad, Hassan","Durrani, Nadir","Dalvi, Fahim","Glass, James"],"emails":["belinkov@mit.edu","lmarquez@qf.org.qa","hsajjad@qf.org.qa","ndurrani@qf.org.qa","faimaduddin@qf.org.qa","glass@mit.edu"],"author_id":["yonatan-belinkov","lluis-marquez","hassan-sajjad","nadir-durrani","fahim-dalvi","james-glass"],"abstract":"While neural machine translation (NMT) models provide improved translation quality in an elegant framework, it is less clear what they learn about language. Recent work has started evaluating the quality of vector representations learned by NMT models on morphological and syntactic tasks. In this paper, we investigate the representations learned at different layers of NMT encoders. We train NMT systems on parallel data and use the models to extract features for training a classifier on two tasks: part-of-speech and semantic tagging. We then measure the performance of the classifier as a proxy to the quality of the original NMT model for the given task. Our quantitative analysis yields interesting insights regarding representation learning in NMT models. For instance, we find that higher layers are better at learning semantics while lower layers tend to be better for part-of-speech tagging. We also observe little effect of the target language on source-side representations, especially in higher quality models.","pages":"1--10","url":"https:\/\/www.aclweb.org\/anthology\/I17-1001","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1002","title":"Context-Aware Smoothing for Neural Machine Translation","authors":["Chen, Kehai","Wang, Rui","Utiyama, Masao","Sumita, Eiichiro","Zhao, Tiejun"],"emails":["","","","eiichiro.sumita@nict.go.jp","tjzhao@hit.edu.cn"],"author_id":["kehai-chen","rui-wang","masao-utiyama","eiichiro-sumita","tiejun-zhao"],"abstract":"In Neural Machine Translation (NMT), each word is represented as a low-dimension, real-value vector for encoding its syntax and semantic information. This means that even if the word is in a different sentence context, it is represented as the fixed vector to learn source representation. Moreover, a large number of Out-Of-Vocabulary (OOV) words, which have different syntax and semantic information, are represented as the same vector representation of {``}unk{''}. To alleviate this problem, we propose a novel context-aware smoothing method to dynamically learn a sentence-specific vector for each word (including OOV words) depending on its local context words in a sentence. The learned context-aware representation is integrated into the NMT to improve the translation performance. Empirical results on NIST Chinese-to-English translation task show that the proposed approach achieves 1.78 BLEU improvements on average over a strong attentional NMT, and outperforms some existing systems.","pages":"11--20","url":"https:\/\/www.aclweb.org\/anthology\/I17-1002","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1003","title":"Improving Sequence to Sequence Neural Machine Translation by Utilizing Syntactic Dependency Information","authors":["Nguyen Le, An","Martinez, Ander","Yoshimoto, Akifumi","Matsumoto, Yuji"],"emails":["nguyen.an.mr9@is.naist.jp","ander.martinez.zy4@is.naist.jp","akifumi-y@is.naist.jp","matsu@is.naist.jp"],"author_id":["an-nguyen-le","ander-martinez","akifumi-yoshimoto","yuji-matsumoto"],"abstract":"Sequence to Sequence Neural Machine Translation has achieved significant performance in recent years. Yet, there are some existing issues that Neural Machine Translation still does not solve completely. Two of them are translation for long sentences and the {``}over-translation{''}. To address these two problems, we propose an approach that utilize more grammatical information such as syntactic dependencies, so that the output can be generated based on more abundant information. In our approach, syntactic dependencies is employed in decoding. In addition, the output of the model is presented not as a simple sequence of tokens but as a linearized tree construction. In order to assess the performance, we construct model based on an attention mechanism encoder-decoder model in which the source language is input to the encoder as a sequence and the decoder generates the target language as a linearized dependency tree structure. Experiments on the Europarl-v7 dataset of French-to-English translation demonstrate that our proposed method improves BLEU scores by 1.57 and 2.40 on datasets consisting of sentences with up to 50 and 80 tokens, respectively. Furthermore, the proposed method also solved the two existing problems, ineffective translation for long sentences and over-translation in Neural Machine Translation.","pages":"21--29","url":"https:\/\/www.aclweb.org\/anthology\/I17-1003","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1004","title":"What does Attention in Neural Machine Translation Pay Attention to?","authors":["Ghader, Hamidreza","Monz, Christof"],"emails":["h.ghader@uva.nl","c.monz@uva.nl"],"author_id":["hamidreza-ghader","christof-monz"],"abstract":"Attention in neural machine translation provides the possibility to encode relevant parts of the source sentence at each translation step. As a result, attention is considered to be an alignment model as well. However, there is no work that specifically studies attention and provides analysis of what is being learned by attention models. Thus, the question still remains that how attention is similar or different from the traditional alignment. In this paper, we provide detailed analysis of attention and compare it to traditional alignment. We answer the question of whether attention is only capable of modelling translational equivalent or it captures more information. We show that attention is different from alignment in some cases and is capturing useful information other than alignments.","pages":"30--39","url":"https:\/\/www.aclweb.org\/anthology\/I17-1004","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1005","title":"Grammatical Error Detection Using Error- and Grammaticality-Specific Word Embeddings","authors":["Kaneko, Masahiro","Sakaizawa, Yuya","Komachi, Mamoru"],"emails":["","",""],"author_id":["masahiro-kaneko","yuya-sakaizawa","mamoru-komachi"],"abstract":"In this study, we improve grammatical error detection by learning word embeddings that consider grammaticality and error patterns. Most existing algorithms for learning word embeddings usually model only the syntactic context of words so that classifiers treat erroneous and correct words as similar inputs. We address the problem of contextual information by considering learner errors. Specifically, we propose two models: one model that employs grammatical error patterns and another model that considers grammaticality of the target word. We determine grammaticality of n-gram sequence from the annotated error tags and extract grammatical error patterns for word embeddings from large-scale learner corpora. Experimental results show that a bidirectional long-short term memory model initialized by our word embeddings achieved the state-of-the-art accuracy by a large margin in an English grammatical error detection task on the First Certificate in English dataset.","pages":"40--48","url":"https:\/\/www.aclweb.org\/anthology\/I17-1005","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1006","title":"Dependency Parsing with Partial Annotations: An Empirical Comparison","authors":["Zhang, Yue","Li, Zhenghua","Lang, Jun","Xia, Qingrong","Zhang, Min"],"emails":["yzhang1107@stu.suda.edu.cn","zhli13@suda.edu.cn","langjun.lj@alibaba-inc.com","qrxia@stu.suda.edu.cn","minzhang@suda.edu.cn"],"author_id":["yue-zhang","zhenghua-li","jun-lang","qingrong-xia","min-zhang"],"abstract":"This paper describes and compares two straightforward approaches for dependency parsing with partial annotations (PA). The first approach is based on a forest-based training objective for two CRF parsers, i.e., a biaffine neural network graph-based parser (Biaffine) and a traditional log-linear graph-based parser (LLGPar). The second approach is based on the idea of constrained decoding for three parsers, i.e., a traditional linear graph-based parser (LGPar), a globally normalized neural network transition-based parser (GN3Par) and a traditional linear transition-based parser (LTPar). For the test phase, constrained decoding is also used for completing partial trees. We conduct experiments on Penn Treebank under three different settings for simulating PA, i.e., random, most uncertain, and divergent outputs from the five parsers. The results show that LLGPar is most effective in directly learning from PA, and other parsers can achieve best performance when PAs are completed into full trees by LLGPar.","pages":"49--58","url":"https:\/\/www.aclweb.org\/anthology\/I17-1006","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1007","title":"Neural Probabilistic Model for Non-projective {MST} Parsing","authors":["Ma, Xuezhe","Hovy, Eduard"],"emails":["xuezhem@cs.cmu.edu","hovy@cmu.edu"],"author_id":["xuezhe-ma","eduard-hovy"],"abstract":"In this paper, we propose a probabilistic parsing model that defines a proper conditional probability distribution over non-projective dependency trees for a given sentence, using neural representations as inputs. The neural network architecture is based on bi-directional LSTMCNNs, which automatically benefits from both word- and character-level representations, by using a combination of bidirectional LSTMs and CNNs. On top of the neural network, we introduce a probabilistic structured layer, defining a conditional log-linear model over non-projective trees. By exploiting Kirchhoff{'}s Matrix-Tree Theorem (Tutte, 1984), the partition functions and marginals can be computed efficiently, leading to a straightforward end-to-end model training procedure via back-propagation. We evaluate our model on 17 different datasets, across 14 different languages. Our parser achieves state-of-the-art parsing performance on nine datasets.","pages":"59--69","url":"https:\/\/www.aclweb.org\/anthology\/I17-1007","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1008","title":"Word Ordering as Unsupervised Learning Towards Syntactically Plausible Word Representations","authors":["Nishida, Noriki","Nakayama, Hideki"],"emails":["nishida@nlab.ci.i.u-tokyo.ac.jp","nakayama@nlab.ci.i.u-tokyo.ac.jp"],"author_id":["noriki-nishida","hideki-nakayama"],"abstract":"The research question we explore in this study is how to obtain syntactically plausible word representations without using human annotations. Our underlying hypothesis is that word ordering tests, or linearizations, is suitable for learning syntactic knowledge about words. To verify this hypothesis, we develop a differentiable model called Word Ordering Network (WON) that explicitly learns to recover correct word order while implicitly acquiring word embeddings representing syntactic knowledge. We evaluate the word embeddings produced by the proposed method on downstream syntax-related tasks such as part-of-speech tagging and dependency parsing. The experimental results demonstrate that the WON consistently outperforms both order-insensitive and order-sensitive baselines on these tasks.","pages":"70--79","url":"https:\/\/www.aclweb.org\/anthology\/I17-1008","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1009","title":"{MIPA}: Mutual Information Based Paraphrase Acquisition via Bilingual Pivoting","authors":["Kajiwara, Tomoyuki","Komachi, Mamoru","Mochihashi, Daichi"],"emails":["kajiwara-tomoyuki@ed.tmu.ac.jp","komachi@tmu.ac.jp","daichi@ism.ac.jp"],"author_id":["tomoyuki-kajiwara","mamoru-komachi","daichi-mochihashi"],"abstract":"We present a pointwise mutual information (PMI)-based approach to formalize paraphrasability and propose a variant of PMI, called MIPA, for the paraphrase acquisition. Our paraphrase acquisition method first acquires lexical paraphrase pairs by bilingual pivoting and then reranks them by PMI and distributional similarity. The complementary nature of information from bilingual corpora and from monolingual corpora makes the proposed method robust. Experimental results show that the proposed method substantially outperforms bilingual pivoting and distributional similarity themselves in terms of metrics such as MRR, MAP, coverage, and Spearman{'}s correlation.","pages":"80--89","url":"https:\/\/www.aclweb.org\/anthology\/I17-1009","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1010","title":"Improving Implicit Semantic Role Labeling by Predicting Semantic Frame Arguments","authors":["Do, Quynh Ngoc Thi","Bethard, Steven","Moens, Marie-Francine"],"emails":["quynhngocthi.do@cs.kuleuven.be","bethard@email.arizona.edu","sien.moens@cs.kuleuven.be"],"author_id":["quynh-ngoc-thi-do","steven-bethard","marie-francine-moens"],"abstract":"Implicit semantic role labeling (iSRL) is the task of predicting the semantic roles of a predicate that do not appear as explicit arguments, but rather regard common sense knowledge or are mentioned earlier in the discourse. We introduce an approach to iSRL based on a predictive recurrent neural semantic frame model (PRNSFM) that uses a large unannotated corpus to learn the probability of a sequence of semantic arguments given a predicate. We leverage the sequence probabilities predicted by the PRNSFM to estimate selectional preferences for predicates and their arguments. On the NomBank iSRL test set, our approach improves state-of-the-art performance on implicit semantic role labeling with less reliance than prior work on manually constructed language resources.","pages":"90--99","url":"https:\/\/www.aclweb.org\/anthology\/I17-1010","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1011","title":"Natural Language Inference from Multiple Premises","authors":["Lai, Alice","Bisk, Yonatan","Hockenmaier, Julia"],"emails":["aylai2@illinois.edu","ybisk@cs.washington.edu","juliahmr@illinois.edu"],"author_id":["alice-lai","yonatan-bisk","julia-hockenmaier"],"abstract":"We define a novel textual entailment task that requires inference over multiple premise sentences. We present a new dataset for this task that minimizes trivial lexical inferences, emphasizes knowledge of everyday events, and presents a more challenging setting for textual entailment. We evaluate several strong neural baselines and analyze how the multiple premise task differs from standard textual entailment.","pages":"100--109","url":"https:\/\/www.aclweb.org\/anthology\/I17-1011","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1012","title":"Enabling Transitivity for Lexical Inference on {C}hinese Verbs Using Probabilistic Soft Logic","authors":["Wang, Wei-Chung","Ku, Lun-Wei"],"emails":["anthonywang@iis.sinica.edu.tw","lwku@iis.sinica.edu.tw"],"author_id":["wei-chung-wang","lun-wei-ku"],"abstract":"To learn more knowledge, enabling transitivity is a vital step for lexical inference. However, most of the lexical inference models with good performance are for nouns or noun phrases, which cannot be directly applied to the inference on events or states. In this paper, we construct the largest Chinese verb lexical inference dataset containing 18,029 verb pairs, where for each pair one of four inference relations are annotated. We further build a probabilistic soft logic (PSL) model to infer verb lexicons using the logic language. With PSL, we easily enable transitivity in two layers, the observed layer and the feature layer, which are included in the knowledge base. We further discuss the effect of transitives within and between these layers. Results show the performance of the proposed PSL model can be improved at least 3.5{\\%} (relative) when the transitivity is enabled. Furthermore, experiments show that enabling transitivity in the observed layer benefits the most.","pages":"110--119","url":"https:\/\/www.aclweb.org\/anthology\/I17-1012","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1013","title":"An Exploration of Neural Sequence-to-Sequence Architectures for Automatic Post-Editing","authors":["Junczys-Dowmunt, Marcin","Grundkiewicz, Roman"],"emails":["junczys@amu.edu.pl","rgrundki@inf.ed.ac.uk"],"author_id":["marcin-junczys-dowmunt","roman-grundkiewicz"],"abstract":"In this work, we explore multiple neural architectures adapted for the task of automatic post-editing of machine translation output. We focus on neural end-to-end models that combine both inputs $mt$ (raw MT output) and $src$ (source language input) in a single neural architecture, modeling $\\{mt, src\\} \\rightarrow pe$ directly. Apart from that, we investigate the influence of hard-attention models which seem to be well-suited for monolingual tasks, as well as combinations of both ideas. We report results on data sets provided during the WMT-2016 shared task on automatic post-editing and can demonstrate that dual-attention models that incorporate all available data in the APE scenario in a single model improve on the best shared task system and on all other published results after the shared task. Dual-attention models that are combined with hard attention remain competitive despite applying fewer changes to the input.","pages":"120--129","url":"https:\/\/www.aclweb.org\/anthology\/I17-1013","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1014","title":"Imagination Improves Multimodal Translation","authors":["Elliott, Desmond","K{\\'a}d{\\'a}r, {\\'A}kos"],"emails":["d.elliott@ed.ac.uk","a.kadar@uvt.nl"],"author_id":["desmond-elliott","akos-kadar"],"abstract":"We decompose multimodal translation into two sub-tasks: learning to translate and learning visually grounded representations. In a multitask learning framework, translations are learned in an attention-based encoder-decoder, and grounded representations are learned through image representation prediction. Our approach improves translation performance compared to the state of the art on the Multi30K dataset. Furthermore, it is equally effective if we train the image prediction task on the external MS COCO dataset, and we find improvements if we train the translation model on the external News Commentary parallel text.","pages":"130--141","url":"https:\/\/www.aclweb.org\/anthology\/I17-1014","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1015","title":"Understanding and Improving Morphological Learning in the Neural Machine Translation Decoder","authors":["Dalvi, Fahim","Durrani, Nadir","Sajjad, Hassan","Belinkov, Yonatan","Vogel, Stephan"],"emails":["faimaduddin@qf.org.qa","ndurrani@qf.org.qa","hsajjad@qf.org.qa","belinkov@mit.edu","svogel@qf.org.qa"],"author_id":["fahim-dalvi","nadir-durrani","hassan-sajjad","yonatan-belinkov","stephan-vogel"],"abstract":"End-to-end training makes the neural machine translation (NMT) architecture simpler, yet elegant compared to traditional statistical machine translation (SMT). However, little is known about linguistic patterns of morphology, syntax and semantics learned during the training of NMT systems, and more importantly, which parts of the architecture are responsible for learning each of these phenomenon. In this paper we i) analyze how much morphology an NMT decoder learns, and ii) investigate whether injecting target morphology in the decoder helps it to produce better translations. To this end we present three methods: i) simultaneous translation, ii) joint-data learning, and iii) multi-task learning. Our results show that explicit morphological information helps the decoder learn target language morphology and improves the translation quality by 0.2{--}0.6 BLEU points.","pages":"142--151","url":"https:\/\/www.aclweb.org\/anthology\/I17-1015","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1016","title":"Improving Neural Machine Translation through Phrase-based Forced Decoding","authors":["Zhang, Jingyi","Utiyama, Masao","Sumita, Eiichro","Neubig, Graham","Nakamura, Satoshi"],"emails":["","","eiichiro.sumita@nict.go.jp","gneubig@cs.cmu.edu","s-nakamura@is.naist.jp"],"author_id":["jingyi-zhang","masao-utiyama","eiichiro-sumita","graham-neubig","satoshi-nakamura"],"abstract":"Compared to traditional statistical machine translation (SMT), neural machine translation (NMT) often sacrifices adequacy for the sake of fluency. We propose a method to combine the advantages of traditional SMT and NMT by exploiting an existing phrase-based SMT model to compute the phrase-based decoding cost for an NMT output and then using the phrase-based decoding cost to rerank the n-best NMT outputs. The main challenge in implementing this approach is that NMT outputs may not be in the search space of the standard phrase-based decoding algorithm, because the search space of phrase-based SMT is limited by the phrase-based translation rule table. We propose a soft forced decoding algorithm, which can always successfully find a decoding path for any NMT output. We show that using the forced decoding cost to rerank the NMT outputs can successfully improve translation quality on four different language pairs.","pages":"152--162","url":"https:\/\/www.aclweb.org\/anthology\/I17-1016","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1017","title":"Convolutional Neural Network with Word Embeddings for {C}hinese Word Segmentation","authors":["Wang, Chunqi","Xu, Bo"],"emails":["chqiwang@126.com","xubo@ia.ac.cn"],"author_id":["chunqi-wang","bo-xu"],"abstract":"Character-based sequence labeling framework is flexible and efficient for Chinese word segmentation (CWS). Recently, many character-based neural models have been applied to CWS. While they obtain good performance, they have two obvious weaknesses. The first is that they heavily rely on manually designed bigram feature, i.e. they are not good at capturing $n$-gram features automatically. The second is that they make no use of full word information. For the first weakness, we propose a convolutional neural model, which is able to capture rich $n$-gram features without any feature engineering. For the second one, we propose an effective approach to integrate the proposed model with word embeddings. We evaluate the model on two benchmark datasets: PKU and MSR. Without any feature engineering, the model obtains competitive performance {---} 95.7{\\%} on PKU and 97.3{\\%} on MSR. Armed with word embeddings, the model achieves state-of-the-art performance on both datasets {---} 96.5{\\%} on PKU and 98.0{\\%} on MSR, without using any external labeled resource.","pages":"163--172","url":"https:\/\/www.aclweb.org\/anthology\/I17-1017","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1018","title":"Character-based Joint Segmentation and {POS} Tagging for {C}hinese using Bidirectional {RNN}-{CRF}","authors":["Shao, Yan","Hardmeier, Christian","Tiedemann, J{\\\"o}rg","Nivre, Joakim"],"emails":["yan.shao@lingfil.uu.se","christian.hardmeier@lingfil.uu.se","jorg.tiedemann@helsinki.fi","joakim.nivre@lingfil.uu.se"],"author_id":["yan-shao","christian-hardmeier","jorg-tiedemann","joakim-nivre"],"abstract":"We present a character-based model for joint segmentation and POS tagging for Chinese. The bidirectional RNN-CRF architecture for general sequence tagging is adapted and applied with novel vector representations of Chinese characters that capture rich contextual information and lower-than-character level features. The proposed model is extensively evaluated and compared with a state-of-the-art tagger respectively on CTB5, CTB9 and UD Chinese. The experimental results indicate that our model is accurate and robust across datasets in different sizes, genres and annotation schemes. We obtain state-of-the-art performance on CTB5, achieving 94.38 F1-score for joint segmentation and POS tagging.","pages":"173--183","url":"https:\/\/www.aclweb.org\/anthology\/I17-1018","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1019","title":"Addressing Domain Adaptation for {C}hinese Word Segmentation with Global Recurrent Structure","authors":["Huang, Shen","Sun, Xu","Wang, Houfeng"],"emails":["huangshenno1@pku.edu.cn","xusun@pku.edu.cn","wanghf@pku.edu.cn"],"author_id":["shen-huang","xu-sun","houfeng-wang"],"abstract":"Boundary features are widely used in traditional Chinese Word Segmentation (CWS) methods as they can utilize unlabeled data to help improve the Out-of-Vocabulary (OOV) word recognition performance. Although various neural network methods for CWS have achieved performance competitive with state-of-the-art systems, these methods, constrained by the domain and size of the training corpus, do not work well in domain adaptation. In this paper, we propose a novel BLSTM-based neural network model which incorporates a global recurrent structure designed for modeling boundary features dynamically. Experiments show that the proposed structure can effectively boost the performance of Chinese Word Segmentation, especially OOV-Recall, which brings benefits to domain adaptation. We achieved state-of-the-art results on 6 domains of CNKI articles, and competitive results to the best reported on the 4 domains of SIGHAN Bakeoff 2010 data.","pages":"184--193","url":"https:\/\/www.aclweb.org\/anthology\/I17-1019","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1020","title":"Information Bottleneck Inspired Method For Chat Text Segmentation","authors":["Vishal, S","Yadav, Mohit","Vig, Lovekesh","Shroff, Gautam"],"emails":["s.vishal3@tcs.com","ymohit@cs.umass.edu","lovekesh.vig@tcs.com","gautam.shroff@tcs.com"],"author_id":["s-vishal","mohit-yadav","lovekesh-vig","gautam-shroff"],"abstract":"We present a novel technique for segmenting chat conversations using the information bottleneck method (Tishby et al., 2000), augmented with sequential continuity constraints. Furthermore, we utilize critical non-textual clues such as time between two consecutive posts and people mentions within the posts. To ascertain the effectiveness of the proposed method, we have collected data from public Slack conversations and Fresco, a proprietary platform deployed inside our organization. Experiments demonstrate that the proposed method yields an absolute (relative) improvement of as high as 3.23{\\%} (11.25{\\%}). To facilitate future research, we are releasing manual annotations for segmentation on public Slack conversations.","pages":"194--203","url":"https:\/\/www.aclweb.org\/anthology\/I17-1020","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1021","title":"Distributional Modeling on a Diet: One-shot Word Learning from Text Only","authors":["Wang, Su","Roller, Stephen","Erk, Katrin"],"emails":["shrekwang@utexas.edu","roller@cs.utexas.edu","katrin.erk@mail.utexas.edu"],"author_id":["su-wang","stephen-roller","katrin-erk"],"abstract":"We test whether distributional models can do one-shot learning of definitional properties from text only. Using Bayesian models, we find that first learning overarching structure in the known data, regularities in textual contexts and in properties, helps one-shot learning, and that individual context items can be highly informative.","pages":"204--213","url":"https:\/\/www.aclweb.org\/anthology\/I17-1021","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1022","title":"A Computational Study on Word Meanings and Their Distributed Representations via Polymodal Embedding","authors":["Park, Joohee","Myaeng, Sung-hyon"],"emails":["james.joohee.park@navercorp.com","myaeng@kaist.ac.kr"],"author_id":["joohee-park","sung-hyon-myaeng"],"abstract":"A distributed representation has become a popular approach to capturing a word meaning. Besides its success and practical value, however, questions arise about the relationships between a true word meaning and its distributed representation. In this paper, we examine such a relationship via polymodal embedding approach inspired by the theory that humans tend to use diverse sources in developing a word meaning. The result suggests that the existing embeddings lack in capturing certain aspects of word meanings which can be significantly improved by the polymodal approach. Also, we show distinct characteristics of different types of words (e.g. concreteness) via computational studies. Finally, we show our proposed embedding method outperforms the baselines in the word similarity measure tasks and the hypernym prediction tasks.","pages":"214--223","url":"https:\/\/www.aclweb.org\/anthology\/I17-1022","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1023","title":"Geographical Evaluation of Word Embeddings","authors":["Konkol, Michal","Brychc{\\'\\i}n, Tom{\\'a}{\\v{s}}","Nykl, Michal","Hercig, Tom{\\'a}{\\v{s}}"],"emails":["konkol@kiv.zcu.cz","brychcin@kiv.zcu.cz","nyklm@kiv.zcu.cz","hercig@kiv.zcu.cz"],"author_id":["michal-konkol","tomas-brychcin","michal-nykl","tomas-hercig"],"abstract":"Word embeddings are commonly compared either with human-annotated word similarities or through improvements in natural language processing tasks. We propose a novel principle which compares the information from word embeddings with reality. We implement this principle by comparing the information in the word embeddings with geographical positions of cities. Our evaluation linearly transforms the semantic space to optimally fit the real positions of cities and measures the deviation between the position given by word embeddings and the real position. A set of well-known word embeddings with state-of-the-art results were evaluated. We also introduce a visualization that helps with error analysis.","pages":"224--232","url":"https:\/\/www.aclweb.org\/anthology\/I17-1023","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1024","title":"On Modeling Sense Relatedness in Multi-prototype Word Embedding","authors":["Cao, Yixin","Shi, Jiaxin","Li, Juanzi","Liu, Zhiyuan","Li, Chengjiang"],"emails":["cao-yx13@mail.tsinghua.edu.cn","shi-jx@mail.tsinghua.edu.cn","liuzy@mail.tsinghua.edu.cn","ljz@mail.tsinghua.edu.cn","licj17@mail.tsinghua.edu.cn"],"author_id":["yixin-cao","jiaxin-shi","juanzi-li","zhiyuan-liu","chengjiang-li"],"abstract":"To enhance the expression ability of distributional word representation learning model, many researchers tend to induce word senses through clustering, and learn multiple embedding vectors for each word, namely multi-prototype word embedding model. However, most related work ignores the relatedness among word senses which actually plays an important role. In this paper, we propose a novel approach to capture word sense relatedness in multi-prototype word embedding model. Particularly, we differentiate the original sense and extended senses of a word by introducing their global occurrence information and model their relatedness through the local textual context information. Based on the idea of fuzzy clustering, we introduce a random process to integrate these two types of senses and design two non-parametric methods for word sense induction. To make our model more scalable and efficient, we use an online joint learning framework extended from the Skip-gram model. The experimental results demonstrate that our model outperforms both conventional single-prototype embedding models and other multi-prototype embedding models, and achieves more stable performance when trained on smaller data.","pages":"233--242","url":"https:\/\/www.aclweb.org\/anthology\/I17-1024","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1025","title":"Unsupervised Segmentation of Phoneme Sequences based on Pitman-Yor Semi-{M}arkov Model using Phoneme Length Context","authors":["Takeda, Ryu","Komatani, Kazunori"],"emails":["rtakeda@sanken.osaka-u.ac.jp","komatani@sanken.osaka-u.ac.jp"],"author_id":["ryu-takeda","kazunori-komatani"],"abstract":"Unsupervised segmentation of phoneme sequences is an essential process to obtain unknown words during spoken dialogues. In this segmentation, an input phoneme sequence without delimiters is converted into segmented sub-sequences corresponding to words. The Pitman-Yor semi-Markov model (PYSMM) is promising for this problem, but its performance degrades when it is applied to phoneme-level word segmentation. This is because of insufficient cues for the segmentation, e.g., homophones are improperly treated as single entries and their different contexts are also confused. We propose a phoneme-length context model for PYSMM to give a helpful cue at the phoneme-level and to predict succeeding segments more accurately. Our experiments showed that the peak performance with our context model outperformed those without such a context model by 0.045 at most in terms of F-measures of estimated segmentation.","pages":"243--252","url":"https:\/\/www.aclweb.org\/anthology\/I17-1025","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1026","title":"A Sensitivity Analysis of (and Practitioners{'} Guide to) Convolutional Neural Networks for Sentence Classification","authors":["Zhang, Ye","Wallace, Byron"],"emails":["yezhang@utexas.edu","byron@ccs.neu.edu"],"author_id":["ye-zhang","byron-c-wallace"],"abstract":"Convolutional Neural Networks (CNNs) have recently achieved remarkably strong performance on the practically important task of sentence classification (Kim, 2014; Kalchbrenner et al., 2014; Johnson and Zhang, 2014; Zhang et al., 2016). However, these models require practitioners to specify an exact model architecture and set accompanying hyperparameters, including the filter region size, regularization parameters, and so on. It is currently unknown how sensitive model performance is to changes in these configurations for the task of sentence classification. We thus conduct a sensitivity analysis of one-layer CNNs to explore the effect of architecture components on model performance; our aim is to distinguish between important and comparatively inconsequential design decisions for sentence classification. We focus on one-layer CNNs (to the exclusion of more complex models) due to their comparative simplicity and strong empirical performance, which makes it a modern standard baseline method akin to Support Vector Machine (SVMs) and logistic regression. We derive practical advice from our extensive empirical results for those interested in getting the most out of CNNs for sentence classification in real world settings.","pages":"253--263","url":"https:\/\/www.aclweb.org\/anthology\/I17-1026","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1027","title":"Coordination Boundary Identification with Similarity and Replaceability","authors":["Teranishi, Hiroki","Shindo, Hiroyuki","Matsumoto, Yuji"],"emails":["teranishi.hiroki.sw5@is.naist.jp","shindo@is.naist.jp","matsu@is.naist.jp"],"author_id":["hiroki-teranishi","hiroyuki-shindo","yuji-matsumoto"],"abstract":"We propose a neural network model for coordination boundary detection. Our method relies on the two common properties - similarity and replaceability in conjuncts - in order to detect both similar pairs of conjuncts and dissimilar pairs of conjuncts. The model improves identification of clause-level coordination using bidirectional RNNs incorporating two properties as features. We show that our model outperforms the existing state-of-the-art methods on the coordination annotated Penn Treebank and Genia corpus without any syntactic information from parsers.","pages":"264--272","url":"https:\/\/www.aclweb.org\/anthology\/I17-1027","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1028","title":"Turning Distributional Thesauri into Word Vectors for Synonym Extraction and Expansion","authors":["Ferret, Olivier"],"emails":["olivier.ferret@cea.fr"],"author_id":["olivier-ferret"],"abstract":"In this article, we propose to investigate a new problem consisting in turning a distributional thesaurus into dense word vectors. We propose more precisely a method for performing such task by associating graph embedding and distributed representation adaptation. We have applied and evaluated it for English nouns at a large scale about its ability to retrieve synonyms. In this context, we have also illustrated the interest of the developed method for three different tasks: the improvement of already existing word embeddings, the fusion of heterogeneous representations and the expansion of synsets.","pages":"273--283","url":"https:\/\/www.aclweb.org\/anthology\/I17-1028","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1029","title":"Training Word Sense Embeddings With Lexicon-based Regularization","authors":["Nieto-Pi{\\~n}a, Luis","Johansson, Richard"],"emails":["luis.nieto.pina@gu.se","richard.johansson@gu.se"],"author_id":["luis-nieto-pina","richard-johansson"],"abstract":"We propose to improve word sense embeddings by enriching an automatic corpus-based method with lexicographic data. Information from a lexicon is introduced into the learning algorithm{'}s objective function through a regularizer. The incorporation of lexicographic data yields embeddings that are able to reflect expert-defined word senses, while retaining the robustness, high quality, and coverage of automatic corpus-based methods. These properties are observed in a manual inspection of the semantic clusters that different degrees of regularizer strength create in the vector space. Moreover, we evaluate the sense embeddings in two downstream applications: word sense disambiguation and semantic frame prediction, where they outperform simpler approaches. Our results show that a corpus-based model balanced with lexicographic data learns better representations and improve their performance in downstream tasks.","pages":"284--294","url":"https:\/\/www.aclweb.org\/anthology\/I17-1029","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1030","title":"Learning How to Simplify From Explicit Labeling of Complex-Simplified Text Pairs","authors":["Alva-Manchego, Fernando","Bingel, Joachim","Paetzold, Gustavo","Scarton, Carolina","Specia, Lucia"],"emails":["f.alva@sheffield.ac.uk","bingel@di.ku.dk","g.h.paetzold@sheffield.ac.uk","c.scarton@sheffield.ac.uk","l.specia@sheffield.ac.uk"],"author_id":["fernando-alva-manchego","joachim-bingel","gustavo-paetzold","carolina-scarton","lucia-specia"],"abstract":"Current research in text simplification has been hampered by two central problems: (i) the small amount of high-quality parallel simplification data available, and (ii) the lack of explicit annotations of simplification operations, such as deletions or substitutions, on existing data. While the recently introduced Newsela corpus has alleviated the first problem, simplifications still need to be learned directly from parallel text using black-box, end-to-end approaches rather than from explicit annotations. These complex-simple parallel sentence pairs often differ to such a high degree that generalization becomes difficult. End-to-end models also make it hard to interpret what is actually learned from data. We propose a method that decomposes the task of TS into its sub-problems. We devise a way to automatically identify operations in a parallel corpus and introduce a sequence-labeling approach based on these annotations. Finally, we provide insights on the types of transformations that different approaches can model.","pages":"295--305","url":"https:\/\/www.aclweb.org\/anthology\/I17-1030","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1031","title":"Domain-Adaptable Hybrid Generation of {RDF} Entity Descriptions","authors":["Biran, Or","McKeown, Kathleen"],"emails":["or@n-join.com","kathy@cs.columbia.edu"],"author_id":["or-biran","kathleen-mckeown"],"abstract":"RDF ontologies provide structured data on entities in many domains and continue to grow in size and diversity. While they can be useful as a starting point for generating descriptions of entities, they often miss important information about an entity that cannot be captured as simple relations. In addition, generic approaches to generation from RDF cannot capture the unique style and content of specific domains. We describe a framework for hybrid generation of entity descriptions, which combines generation from RDF data with text extracted from a corpus, and extracts unique aspects of the domain from the corpus to create domain-specific generation systems. We show that each component of our approach significantly increases the satisfaction of readers with the text across multiple applications and domains.","pages":"306--315","url":"https:\/\/www.aclweb.org\/anthology\/I17-1031","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1032","title":"{ES}-{LDA}: Entity Summarization using Knowledge-based Topic Modeling","authors":["Pouriyeh, Seyedamin","Allahyari, Mehdi","Kochut, Krzysztof","Cheng, Gong","Arabnia, Hamid Reza"],"emails":["pouriyeh@uga.edu","mallahyari@georgiasouthern.edu","kkochut@uga.edu","gcheng@nju.edu.cn","hra@uga.edu"],"author_id":["seyedamin-pouriyeh","mehdi-allahyari","krzysztof-kochut","gong-cheng","hamid-reza-arabnia"],"abstract":"With the advent of the Internet, the amount of Semantic Web documents that describe real-world entities and their inter-links as a set of statements have grown considerably. These descriptions are usually lengthy, which makes the utilization of the underlying entities a difficult task. Entity summarization, which aims to create summaries for real-world entities, has gained increasing attention in recent years. In this paper, we propose a probabilistic topic model, ES-LDA, that combines prior knowledge with statistical learning techniques within a single framework to create more reliable and representative summaries for entities. We demonstrate the effectiveness of our approach by conducting extensive experiments and show that our model outperforms the state-of-the-art techniques and enhances the quality of the entity summaries.","pages":"316--325","url":"https:\/\/www.aclweb.org\/anthology\/I17-1032","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1033","title":"Procedural Text Generation from an Execution Video","authors":["Ushiku, Atsushi","Hashimoto, Hayato","Hashimoto, Atsushi","Mori, Shinsuke"],"emails":["d460655046504@gmail.com","hashimoto.hayato.73e@st.kyoto-u.ac.jp","ahasimoto@mm.media.kyoto-u.ac.jp","forest@i.kyoto-u.ac.jp"],"author_id":["atsushi-ushiku","hayato-hashimoto","atsushi-hashimoto","shinsuke-mori"],"abstract":"In recent years, there has been a surge of interest in automatically describing images or videos in a natural language. These descriptions are useful for image\/video search, etc. In this paper, we focus on procedure execution videos, in which a human makes or repairs something and propose a method for generating procedural texts from them. Since video\/text pairs available are limited in size, the direct application of end-to-end deep learning is not feasible. Thus we propose to train Faster R-CNN network for object recognition and LSTM for text generation and combine them at run time. We took pairs of recipe and cooking video, generated a recipe from a video, and compared it with the original recipe. The experimental results showed that our method can produce a recipe as accurate as the state-of-the-art scene descriptions.","pages":"326--335","url":"https:\/\/www.aclweb.org\/anthology\/I17-1033","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1034","title":"Text Sentiment Analysis based on Fusion of Structural Information and Serialization Information","authors":["Gan, Ling","Gong, Houyu"],"emails":["ganling@cqupt.edu.cn","b103@163.com"],"author_id":["ling-gan","houyu-gong"],"abstract":"Tree-structured Long Short-Term Memory (Tree-LSTM) has been proved to be an effective method in the sentiment analysis task. It extracts structural information on text, and uses Long Short-Term Memory (LSTM) cell to prevent gradient vanish. However, though combining the LSTM cell, it is still a kind of model that extracts the structural information and almost not extracts serialization information. In this paper, we propose three new models in order to combine those two kinds of information: the structural information generated by the Constituency Tree-LSTM and the serialization information generated by Long-Short Term Memory neural network. Our experiments show that combining those two kinds of information can give contributes to the performance of the sentiment analysis task compared with the single Constituency Tree-LSTM model and the LSTM model.","pages":"336--341","url":"https:\/\/www.aclweb.org\/anthology\/I17-1034","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1035","title":"Length, Interchangeability, and External Knowledge: Observations from Predicting Argument Convincingness","authors":["Potash, Peter","Bhattacharya, Robin","Rumshisky, Anna"],"emails":["ppotash@cs.uml.edu","rbhattac@cs.uml.edu","arum@cs.uml.edu"],"author_id":["peter-potash","robin-bhattacharya","anna-rumshisky"],"abstract":"In this work, we provide insight into three key aspects related to predicting argument convincingness. First, we explicitly display the power that text length possesses for predicting convincingness in an unsupervised setting. Second, we show that a bag-of-words embedding model posts state-of-the-art on a dataset of arguments annotated for convincingness, outperforming an SVM with numerous hand-crafted features as well as recurrent neural network models that attempt to capture semantic composition. Finally, we assess the feasibility of integrating external knowledge when predicting convincingness, as arguments are often more convincing when they contain abundant information and facts. We finish by analyzing the correlations between the various models we propose.","pages":"342--351","url":"https:\/\/www.aclweb.org\/anthology\/I17-1035","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1036","title":"Exploiting Document Level Information to Improve Event Detection via Recurrent Neural Networks","authors":["Duan, Shaoyang","He, Ruifang","Zhao, Wenli"],"emails":["syduan@tju.edu.cn","rfhe@tju.edu.cn","wlzhao@gmail.com"],"author_id":["shaoyang-duan","ruifang-he","wenli-zhao"],"abstract":"This paper tackles the task of event detection, which involves identifying and categorizing events. The previous work mainly exist two problems: (1) the traditional feature-based methods apply cross-sentence information, yet need taking a large amount of human effort to design complicated feature sets and inference rules; (2) the representation-based methods though overcome the problem of manually extracting features, while just depend on local sentence representation. Considering local sentence context is insufficient to resolve ambiguities in identifying particular event types, therefore, we propose a novel document level Recurrent Neural Networks (DLRNN) model, which can automatically extract cross-sentence clues to improve sentence level event detection without designing complex reasoning rules. Experiment results show that our approach outperforms other state-of-the-art methods on ACE 2005 dataset without external knowledge base.","pages":"352--361","url":"https:\/\/www.aclweb.org\/anthology\/I17-1036","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1037","title":"Embracing Non-Traditional Linguistic Resources for Low-resource Language Name Tagging","authors":["Zhang, Boliang","Lu, Di","Pan, Xiaoman","Lin, Ying","Abudukelimu, Halidanmu","Ji, Heng","Knight, Kevin"],"emails":["zhangb8@rpi.edu","lud2@rpi.edu","panx2@rpi.edu","liny9@rpi.edu","abdklmhldm@gmail.com","jih@rpi.edu","knight@isi.edu"],"author_id":["boliang-zhang","di-lu","xiaoman-pan","ying-lin","halidanmu-abudukelimu","heng-ji","kevin-knight"],"abstract":"Current supervised name tagging approaches are inadequate for most low-resource languages due to the lack of annotated data and actionable linguistic knowledge. All supervised learning methods (including deep neural networks (DNN)) are sensitive to noise and thus they are not quite portable without massive clean annotations. We found that the F-scores of DNN-based name taggers drop rapidly (20{\\%}-30{\\%}) when we replace clean manual annotations with noisy annotations in the training data. We propose a new solution to incorporate many non-traditional language universal resources that are readily available but rarely explored in the Natural Language Processing (NLP) community, such as the World Atlas of Linguistic Structure, CIA names, PanLex and survival guides. We acquire and encode various types of non-traditional linguistic resources into a DNN name tagger. Experiments on three low-resource languages show that feeding linguistic knowledge can make DNN significantly more robust to noise, achieving 8{\\%}-22{\\%} absolute F-score gains on name tagging without using any human annotation","pages":"362--372","url":"https:\/\/www.aclweb.org\/anthology\/I17-1037","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1038","title":"{NMT} or {SMT}: Case Study of a Narrow-domain {E}nglish-{L}atvian Post-editing Project","authors":["Skadi{\\c{n}}a, Inguna","Pinnis, M{\\=a}rcis"],"emails":["inguna.skadina@tilde.lv","marcis.pinnis@tilde.lv"],"author_id":["inguna-skadina","marcis-pinnis"],"abstract":"The recent technological shift in machine translation from statistical machine translation (SMT) to neural machine translation (NMT) raises the question of the strengths and weaknesses of NMT. In this paper, we present an analysis of NMT and SMT systems{'} outputs from narrow domain English-Latvian MT systems that were trained on a rather small amount of data. We analyze post-edits produced by professional translators and manually annotated errors in these outputs. Analysis of post-edits allowed us to conclude that both approaches are comparably successful, allowing for an increase in translators{'} productivity, with the NMT system showing slightly worse results. Through the analysis of annotated errors, we found that NMT translations are more fluent than SMT translations. However, errors related to accuracy, especially, mistranslation and omission errors, occur more often in NMT outputs. The word form errors, that characterize the morphological richness of Latvian, are frequent for both systems, but slightly fewer in NMT outputs.","pages":"373--383","url":"https:\/\/www.aclweb.org\/anthology\/I17-1038","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1039","title":"Towards Neural Machine Translation with Partially Aligned Corpora","authors":["Wang, Yining","Zhao, Yang","Zhang, Jiajun","Zong, Chengqing","Xue, Zhengshan"],"emails":["yining.wang@nlpr.ia.ac.cn","yang.zhao@nlpr.ia.ac.cn","jjzhang@nlpr.ia.ac.cn","cqzong@nlpr.ia.ac.cn","xuezhengshan2@toshiba.com.cn"],"author_id":["yining-wang","yang-zhao","jiajun-zhang","chengqing-zong","zhengshan-xue"],"abstract":"While neural machine translation (NMT) has become the new paradigm, the parameter optimization requires large-scale parallel data which is scarce in many domains and language pairs. In this paper, we address a new translation scenario in which there only exists monolingual corpora and phrase pairs. We propose a new method towards translation with partially aligned sentence pairs which are derived from the phrase pairs and monolingual corpora. To make full use of the partially aligned corpora, we adapt the conventional NMT training method in two aspects. On one hand, different generation strategies are designed for aligned and unaligned target words. On the other hand, a different objective function is designed to model the partially aligned parts. The experiments demonstrate that our method can achieve a relatively good result in such a translation scenario, and tiny bitexts can boost translation quality to a large extent.","pages":"384--393","url":"https:\/\/www.aclweb.org\/anthology\/I17-1039","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1040","title":"Identifying Usage Expression Sentences in Consumer Product Reviews","authors":["Lahiri, Shibamouli","Vydiswaran, V.G.Vinod","Mihalcea, Rada"],"emails":["lahiri@umich.edu","vgvinodv@umich.edu","mihalcea@umich.edu"],"author_id":["shibamouli-lahiri","v-g-vinod-vydiswaran","rada-mihalcea"],"abstract":"In this paper we introduce the problem of identifying usage expression sentences in a consumer product review. We create a human-annotated gold standard dataset of 565 reviews spanning five distinct product categories. Our dataset consists of more than 3,000 annotated sentences. We further introduce a classification system to label sentences according to whether or not they describe some {``}usage{''}. The system combines lexical, syntactic, and semantic features in a product-agnostic fashion to yield good classification performance. We show the effectiveness of our approach using importance ranking of features, error analysis, and cross-product classification experiments.","pages":"394--403","url":"https:\/\/www.aclweb.org\/anthology\/I17-1040","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1041","title":"Between Reading Time and Syntactic\/Semantic Categories","authors":["Asahara, Masayuki","Kato, Sachi"],"emails":["masayu-a@ninjal.ac.jp",""],"author_id":["masayuki-asahara","sachi-kato"],"abstract":"This article presents a contrastive analysis between reading time and syntactic\/semantic categories in Japanese. We overlaid the reading time annotation of BCCWJ-EyeTrack and a syntactic\/semantic category information annotation on the {`}Balanced Corpus of Contemporary Written Japanese{'}. Statistical analysis based on a mixed linear model showed that verbal phrases tend to have shorter reading times than adjectives, adverbial phrases, or nominal phrases. The results suggest that the preceding phrases associated with the presenting phrases promote the reading process to shorten the gazing time.","pages":"404--412","url":"https:\/\/www.aclweb.org\/anthology\/I17-1041","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1042","title":"{W}i{NER}: A {W}ikipedia Annotated Corpus for Named Entity Recognition","authors":["Ghaddar, Abbas","Langlais, Phillippe"],"emails":["abbas.ghaddar@umontreal.ca","felipe@iro.umontreal.ca"],"author_id":["abbas-ghaddar","philippe-langlais"],"abstract":"We revisit the idea of mining Wikipedia in order to generate named-entity annotations. We propose a new methodology that we applied to English Wikipedia to build WiNER, a large, high quality, annotated corpus. We evaluate its usefulness on 6 NER tasks, comparing 4 popular state-of-the art approaches. We show that LSTM-CRF is the approach that benefits the most from our corpus. We report impressive gains with this model when using a small portion of WiNER on top of the CONLL training material. Last, we propose a simple but efficient method for exploiting the full range of WiNER, leading to further improvements.","pages":"413--422","url":"https:\/\/www.aclweb.org\/anthology\/I17-1042","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1043","title":"Reusing Neural Speech Representations for Auditory Emotion Recognition","authors":["Lakomkin, Egor","Weber, Cornelius","Magg, Sven","Wermter, Stefan"],"emails":["lakomkin@informatik.uni-hamburg.de","weber@informatik.uni-hamburg.de","magg@informatik.uni-hamburg.de","wermter@informatik.uni-hamburg.de"],"author_id":["egor-lakomkin","cornelius-weber","sven-magg","stefan-wermter"],"abstract":"Acoustic emotion recognition aims to categorize the affective state of the speaker and is still a difficult task for machine learning models. The difficulties come from the scarcity of training data, general subjectivity in emotion perception resulting in low annotator agreement, and the uncertainty about which features are the most relevant and robust ones for classification. In this paper, we will tackle the latter problem. Inspired by the recent success of transfer learning methods we propose a set of architectures which utilize neural representations inferred by training on large speech databases for the acoustic emotion recognition task. Our experiments on the IEMOCAP dataset show {\\textasciitilde}10{\\%} relative improvements in the accuracy and F1-score over the baseline recurrent neural network which is trained end-to-end for emotion recognition.","pages":"423--430","url":"https:\/\/www.aclweb.org\/anthology\/I17-1043","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1044","title":"Local Monotonic Attention Mechanism for End-to-End Speech And Language Processing","authors":["Tjandra, Andros","Sakti, Sakriani","Nakamura, Satoshi"],"emails":["andros.tjandra.ai6@is.naist.jp","ssakti@is.naist.jp","s-nakamura@is.naist.jp"],"author_id":["andros-tjandra","sakriani-sakti","satoshi-nakamura"],"abstract":"Recently, encoder-decoder neural networks have shown impressive performance on many sequence-related tasks. The architecture commonly uses an attentional mechanism which allows the model to learn alignments between the source and the target sequence. Most attentional mechanisms used today is based on a global attention property which requires a computation of a weighted summarization of the whole input sequence generated by encoder states. However, it is computationally expensive and often produces misalignment on the longer input sequence. Furthermore, it does not fit with monotonous or left-to-right nature in several tasks, such as automatic speech recognition (ASR), grapheme-to-phoneme (G2P), etc. In this paper, we propose a novel attention mechanism that has local and monotonic properties. Various ways to control those properties are also explored. Experimental results on ASR, G2P and machine translation between two languages with similar sentence structures, demonstrate that the proposed encoder-decoder model with local monotonic attention could achieve significant performance improvements and reduce the computational complexity in comparison with the one that used the standard global attention architecture.","pages":"431--440","url":"https:\/\/www.aclweb.org\/anthology\/I17-1044","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1045","title":"Attentive Language Models","authors":["Salton, Giancarlo","Ross, Robert","Kelleher, John"],"emails":["giancarlo.salton@mydit.ie","robert.ross@dit.ie","john.d.kelleher@dit.ie"],"author_id":["giancarlo-salton","robert-ross","john-kelleher"],"abstract":"In this paper, we extend Recurrent Neural Network Language Models (RNN-LMs) with an attention mechanism. We show that an {``}attentive{''} RNN-LM (with 11M parameters) achieves a better perplexity than larger RNN-LMs (with 66M parameters) and achieves performance comparable to an ensemble of 10 similar sized RNN-LMs. We also show that an {``}attentive{''} RNN-LM needs less contextual information to achieve similar results to the state-of-the-art on the wikitext2 dataset.","pages":"441--450","url":"https:\/\/www.aclweb.org\/anthology\/I17-1045","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1046","title":"Diachrony-aware Induction of Binary Latent Representations from Typological Features","authors":["Murawaki, Yugo"],"emails":["murawaki@i.kyoto-u.ac.jp"],"author_id":["yugo-murawaki"],"abstract":"Although features of linguistic typology are a promising alternative to lexical evidence for tracing evolutionary history of languages, a large number of missing values in the dataset pose serious difficulties for statistical modeling. In this paper, we combine two existing approaches to the problem: (1) the synchronic approach that focuses on interdependencies between features and (2) the diachronic approach that exploits phylogenetically- and\/or spatially-related languages. Specifically, we propose a Bayesian model that (1) represents each language as a sequence of binary latent parameters encoding inter-feature dependencies and (2) relates a language{'}s parameters to those of its phylogenetic and spatial neighbors. Experiments show that the proposed model recovers missing values more accurately than others and that induced representations retain phylogenetic and spatial signals observed for surface features.","pages":"451--461","url":"https:\/\/www.aclweb.org\/anthology\/I17-1046","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1047","title":"Image-Grounded Conversations: Multimodal Context for Natural Question and Response Generation","authors":["Mostafazadeh, Nasrin","Brockett, Chris","Dolan, Bill","Galley, Michel","Gao, Jianfeng","Spithourakis, Georgios","Vanderwende, Lucy"],"emails":["nasrin.m@benevolent.ai","chrisbkt@microsoft.com","","","","",""],"author_id":["nasrin-mostafazadeh","chris-brockett","bill-dolan","michel-galley","jianfeng-gao","georgios-spithourakis","lucy-vanderwende"],"abstract":"The popularity of image sharing on social media and the engagement it creates between users reflect the important role that visual context plays in everyday conversations. We present a novel task, Image Grounded Conversations (IGC), in which natural-sounding conversations are generated about a shared image. To benchmark progress, we introduce a new multiple reference dataset of crowd-sourced, event-centric conversations on images. IGC falls on the continuum between chit-chat and goal-directed conversation models, where visual grounding constrains the topic of conversation to event-driven utterances. Experiments with models trained on social media data show that the combination of visual and textual context enhances the quality of generated conversational turns. In human evaluation, the gap between human performance and that of both neural and retrieval architectures suggests that multi-modal IGC presents an interesting challenge for dialog research.","pages":"462--472","url":"https:\/\/www.aclweb.org\/anthology\/I17-1047","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1048","title":"A Neural Language Model for Dynamically Representing the Meanings of Unknown Words and Entities in a Discourse","authors":["Kobayashi, Sosuke","Okazaki, Naoaki","Inui, Kentaro"],"emails":["sosk@preferred.jp","okazaki@c.titech.ac.jp","inui@ecei.tohoku.ac.jp"],"author_id":["sosuke-kobayashi","naoaki-okazaki","kentaro-inui"],"abstract":"This study addresses the problem of identifying the meaning of unknown words or entities in a discourse with respect to the word embedding approaches used in neural language models. We proposed a method for on-the-fly construction and exploitation of word embeddings in both the input and output layers of a neural model by tracking contexts. This extends the dynamic entity representation used in Kobayashi et al. (2016) and incorporates a copy mechanism proposed independently by Gu et al. (2016) and Gulcehre et al. (2016). In addition, we construct a new task and dataset called Anonymized Language Modeling for evaluating the ability to capture word meanings while reading. Experiments conducted using our novel dataset show that the proposed variant of RNN language model outperformed the baseline model. Furthermore, the experiments also demonstrate that dynamic updates of an output layer help a model predict reappearing entities, whereas those of an input layer are effective to predict words following reappearing entities.","pages":"473--483","url":"https:\/\/www.aclweb.org\/anthology\/I17-1048","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1049","title":"Using Explicit Discourse Connectives in Translation for Implicit Discourse Relation Classification","authors":["Shi, Wei","Yung, Frances","Rubino, Raphael","Demberg, Vera"],"emails":["w.shi@coli.uni-saarland.de","frances@coli.uni-saarland.de","raphael.rubino@dfki.de","vera@coli.uni-saarland.de"],"author_id":["wei-shi","frances-yung","raphael-rubino","vera-demberg"],"abstract":"Implicit discourse relation recognition is an extremely challenging task due to the lack of indicative connectives. Various neural network architectures have been proposed for this task recently, but most of them suffer from the shortage of labeled data. In this paper, we address this problem by procuring additional training data from parallel corpora: When humans translate a text, they sometimes add connectives (a process known as \\textit{explicitation}). Weautomatically back-translate it into an English connective and use it to infera label with high confidence. We show that a training set several times largerthan the original training set can be generated this way. With the extralabeled instances, we show that even a simple bidirectional Long Short-TermMemory Network can outperform the current state-of-the-art.","pages":"484--495","url":"https:\/\/www.aclweb.org\/anthology\/I17-1049","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1050","title":"Tag-Enhanced Tree-Structured Neural Networks for Implicit Discourse Relation Classification","authors":["Wang, Yizhong","Li, Sujian","Yang, Jingfeng","Sun, Xu","Wang, Houfeng"],"emails":["yizhong@pku.edu.cn","lisujian@pku.edu.cn","yjfllpyym@pku.edu.cn","xusun@pku.edu.cn","wanghf@pku.edu.cn"],"author_id":["yizhong-wang","sujian-li","jingfeng-yang","xu-sun","houfeng-wang"],"abstract":"Identifying implicit discourse relations between text spans is a challenging task because it requires understanding the meaning of the text. To tackle this task, recent studies have tried several deep learning methods but few of them exploited the syntactic information. In this work, we explore the idea of incorporating syntactic parse tree into neural networks. Specifically, we employ the Tree-LSTM model and Tree-GRU model, which is based on the tree structure, to encode the arguments in a relation. And we further leverage the constituent tags to control the semantic composition process in these tree-structured neural networks. Experimental results show that our method achieves state-of-the-art performance on PDTB corpus.","pages":"496--505","url":"https:\/\/www.aclweb.org\/anthology\/I17-1050","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1051","title":"Cross-Lingual Sentiment Analysis Without (Good) Translation","authors":["Abdalla, Mohamed","Hirst, Graeme"],"emails":["","gh@cs.toronto.edu"],"author_id":["mohamed-abdalla","graeme-hirst"],"abstract":"Current approaches to cross-lingual sentiment analysis try to leverage the wealth of labeled English data using bilingual lexicons, bilingual vector space embeddings, or machine translation systems. Here we show that it is possible to use a single linear transformation, with as few as 2000 word pairs, to capture fine-grained sentiment relationships between words in a cross-lingual setting. We apply these cross-lingual sentiment models to a diverse set of tasks to demonstrate their functionality in a non-English context. By effectively leveraging English sentiment knowledge without the need for accurate translation, we can analyze and extract features from other languages with scarce data at a very low cost, thus making sentiment and related analyses for many languages inexpensive.","pages":"506--515","url":"https:\/\/www.aclweb.org\/anthology\/I17-1051","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1052","title":"Implicit Syntactic Features for Target-dependent Sentiment Analysis","authors":["Gao, Yuze","Zhang, Yue","Xiao, Tong"],"emails":["","zhang@sutd.edu.sg","xiaotong@mail.neu.edu.cn"],"author_id":["yuze-gao","yue-zhang","tong-xiao"],"abstract":"Targeted sentiment analysis investigates the sentiment polarities on given target mentions from input texts. Different from sentence level sentiment, it offers more fine-grained knowledge on each entity mention. While early work leveraged syntactic information, recent research has used neural representation learning to induce features automatically, thereby avoiding error propagation of syntactic parsers, which are particularly severe on social media texts. We study a method to leverage syntactic information without explicitly building the parser outputs, by training an encoder-decoder structure parser model on standard syntactic treebanks, and then leveraging its hidden encoder layers when analysing tweets. Such hidden vectors do not contain explicit syntactic outputs, yet encode rich syntactic features. We use them to augment the inputs to a baseline state-of-the-art targeted sentiment classifier, observing significant improvements on various benchmark datasets. We obtain the best accuracies on all test sets.","pages":"516--524","url":"https:\/\/www.aclweb.org\/anthology\/I17-1052","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1053","title":"Graph Based Sentiment Aggregation using {C}oncept{N}et Ontology","authors":["Tamilselvam, Srikanth","Nagar, Seema","Mishra, Abhijit","Dey, Kuntal"],"emails":["srikanth.tamilselvam@in.ibm.com","senagar3@in.ibm.com","abhijimi@in.ibm.com","kuntadey@in.ibm.com"],"author_id":["srikanth-tamilselvam","seema-nagar","abhijit-mishra","kuntal-dey"],"abstract":"The sentiment aggregation problem accounts for analyzing the sentiment of a user towards various aspects\/features of a product, and meaningfully assimilating the pragmatic significance of these features\/aspects from an opinionated text. The current paper addresses the sentiment aggregation problem, by assigning weights to each aspect appearing in the user-generated content, that are proportionate to the strategic importance of the aspect in the pragmatic domain. The novelty of this paper is in computing the pragmatic significance (weight) of each aspect, using graph centrality measures (applied on domain specific ontology-graphs extracted from ConceptNet), and deeply ingraining these weights while aggregating the sentiments from opinionated text. We experiment over multiple real-life product review data. Our system consistently outperforms the state of the art - by as much as a F-score of 20.39{\\%} in one case.","pages":"525--535","url":"https:\/\/www.aclweb.org\/anthology\/I17-1053","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1054","title":"Sentence Modeling with Deep Neural Architecture using Lexicon and Character Attention Mechanism for Sentiment Classification","authors":["Nguyen, Huy Thanh","Nguyen, Minh Le"],"emails":["huy.nguyen@jaist.ac.jp","nguyenml@jaist.ac.jp"],"author_id":["huy-thanh-nguyen","minh-le-nguyen"],"abstract":"Tweet-level sentiment classification in Twitter social networking has many challenges: exploiting syntax, semantic, sentiment, and context in tweets. To address these problems, we propose a novel approach to sentiment analysis that uses lexicon features for building lexicon embeddings (LexW2Vs) and generates character attention vectors (CharAVs) by using a Deep Convolutional Neural Network (DeepCNN). Our approach integrates LexW2Vs and CharAVs with continuous word embeddings (ContinuousW2Vs) and dependency-based word embeddings (DependencyW2Vs) simultaneously in order to increase information for each word into a Bidirectional Contextual Gated Recurrent Neural Network (Bi-CGRNN). We evaluate our model on two Twitter sentiment classification datasets. Experimental results show that our model can improve the classification accuracy of sentence-level sentiment analysis in Twitter social networking.","pages":"536--544","url":"https:\/\/www.aclweb.org\/anthology\/I17-1054","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1055","title":"Combining Lightly-Supervised Text Classification Models for Accurate Contextual Advertising","authors":["Jin, Yiping","Wanvarie, Dittaya","Le, Phu"],"emails":["","","phu@knorex.com"],"author_id":["yiping-jin","dittaya-wanvarie","phu-le"],"abstract":"In this paper we propose a lightly-supervised framework to rapidly build text classifiers for contextual advertising. Traditionally text classification techniques require labeled training documents for each predefined class. In the scenario of contextual advertising, advertisers often want to target to a specific class of webpages most relevant to their product or service, which may not be covered by a pre-trained classifier. Moreover, the advertisers are interested in whether a webpage is {``}relevant{''} or {``}irrelevant{''}. It is time-consuming to solicit the advertisers for reliable training signals for the negative class. Therefore, it is more suitable to model the problem as a one-class classification problem, in contrast to traditional classification problems where disjoint classes are defined a priori. We first apply two state-of-the-art lightly-supervised classification models, generalized expectation (GE) criteria (Druck et al., 2008) and multinomial naive Bayes (MNB) with priors (Settles, 2011) to one-class classification where the user only needs to provide a small list of labeled words for the target class. To combine the strengths of the two models, we fuse them together by using MNB to automatically enrich the constraints for GE training. We also explore ensemble method to combine classifiers. On a corpus of webpages from real-time bidding requests, the proposed model achieves the highest average F1 of 0.69 and closes more than half of the gap between previous state-of-the-art lightly-supervised models to a fully-supervised MaxEnt model.","pages":"545--554","url":"https:\/\/www.aclweb.org\/anthology\/I17-1055","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1056","title":"Capturing Long-range Contextual Dependencies with Memory-enhanced Conditional Random Fields","authors":["Liu, Fei","Baldwin, Timothy","Cohn, Trevor"],"emails":["fliu3@student.unimelb.edu.au","tb@ldwin.net","t.cohn@unimelb.edu.au"],"author_id":["fei-liu","timothy-baldwin","trevor-cohn"],"abstract":"Despite successful applications across a broad range of NLP tasks, conditional random fields ({``}CRFs{''}), in particular the linear-chain variant, are only able to model local features. While this has important benefits in terms of inference tractability, it limits the ability of the model to capture long-range dependencies between items. Attempts to extend CRFs to capture long-range dependencies have largely come at the cost of computational complexity and approximate inference. In this work, we propose an extension to CRFs by integrating external memory, taking inspiration from memory networks, thereby allowing CRFs to incorporate information far beyond neighbouring steps. Experiments across two tasks show substantial improvements over strong CRF and LSTM baselines.","pages":"555--565","url":"https:\/\/www.aclweb.org\/anthology\/I17-1056","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1057","title":"Named Entity Recognition with Stack Residual {LSTM} and Trainable Bias Decoding","authors":["Tran, Quan","MacKinlay, Andrew","Jimeno Yepes, Antonio"],"emails":["hung.tran@monash.edu","admackin@au1.ibm.com","ayepes@au1.ibm.com"],"author_id":["quan-hung-tran","andrew-mackinlay","antonio-jimeno-yepes"],"abstract":"Recurrent Neural Network models are the state-of-the-art for Named Entity Recognition (NER). We present two innovations to improve the performance of these models. The first innovation is the introduction of residual connections between the Stacked Recurrent Neural Network model to address the degradation problem of deep neural networks. The second innovation is a bias decoding mechanism that allows the trained system to adapt to non-differentiable and externally computed objectives, such as the entity-based F-measure. Our work improves the state-of-the-art results for both Spanish and English languages on the standard train\/development\/test split of the CoNLL 2003 Shared Task NER dataset.","pages":"566--575","url":"https:\/\/www.aclweb.org\/anthology\/I17-1057","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1058","title":"{N}euramanteau: A Neural Network Ensemble Model for Lexical Blends","authors":["Das, Kollol","Ghosh, Shaona"],"emails":["kolloldas@gmail.com","sg811@cam.ac.uk"],"author_id":["kollol-das","shaona-ghosh"],"abstract":"The problem of blend formation in generative linguistics is interesting in the context of neologism, their quick adoption in modern life and the creative generative process guiding their formation. Blend quality depends on multitude of factors with high degrees of uncertainty. In this work, we investigate if the modern neural network models can sufficiently capture and recognize the creative blend composition process. We propose recurrent neural network sequence-to-sequence models, that are evaluated on multiple blend datasets available in the literature. We propose an ensemble neural and hybrid model that outperforms most of the baselines and heuristic models upon evaluation on test data.","pages":"576--583","url":"https:\/\/www.aclweb.org\/anthology\/I17-1058","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1059","title":"Leveraging Discourse Information Effectively for Authorship Attribution","authors":["Ferracane, Elisa","Wang, Su","Mooney, Raymond"],"emails":["elisa@ferracane.com","shrekwang@utexas.edu","mooney@cs.utexas.edu"],"author_id":["elisa-ferracane","su-wang","raymond-mooney"],"abstract":"We explore techniques to maximize the effectiveness of discourse information in the task of authorship attribution. We present a novel method to embed discourse features in a Convolutional Neural Network text classifier, which achieves a state-of-the-art result by a significant margin. We empirically investigate several featurization methods to understand the conditions under which discourse features contribute non-trivial performance gains, and analyze discourse embeddings.","pages":"584--593","url":"https:\/\/www.aclweb.org\/anthology\/I17-1059","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1060","title":"Lightly-Supervised Modeling of Argument Persuasiveness","authors":["Persing, Isaac","Ng, Vincent"],"emails":["persingq@hlt.utdallas.edu","vince@hlt.utdallas.edu"],"author_id":["isaac-persing","vincent-ng"],"abstract":"We propose the first lightly-supervised approach to scoring an argument{'}s persuasiveness. Key to our approach is the novel hypothesis that lightly-supervised persuasiveness scoring is possible by explicitly modeling the major errors that negatively impact persuasiveness. In an evaluation on a new annotated corpus of online debate arguments, our approach rivals its fully-supervised counterparts in performance by four scoring metrics when using only 10{\\%} of the available training instances.","pages":"594--604","url":"https:\/\/www.aclweb.org\/anthology\/I17-1060","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1061","title":"Multi-Task Learning for Speaker-Role Adaptation in Neural Conversation Models","authors":["Luan, Yi","Brockett, Chris","Dolan, Bill","Gao, Jianfeng","Galley, Michel"],"emails":["luanyi@uw.edu","chrisbkt@microsoft.com","billdol@microsoft.com","jfgao@microsoft.com","mgalley@microsoft.com"],"author_id":["yi-luan","chris-brockett","bill-dolan","jianfeng-gao","michel-galley"],"abstract":"Building a persona-based conversation agent is challenging owing to the lack of large amounts of speaker-specific conversation data for model training. This paper addresses the problem by proposing a multi-task learning approach to training neural conversation models that leverages both conversation data across speakers and other types of data pertaining to the speaker and speaker roles to be modeled. Experiments show that our approach leads to significant improvements over baseline model quality, generating responses that capture more precisely speakers{'} traits and speaking styles. The model offers the benefits of being algorithmically simple and easy to implement, and not relying on large quantities of data representing specific individual speakers.","pages":"605--614","url":"https:\/\/www.aclweb.org\/anthology\/I17-1061","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1062","title":"Chat Disentanglement: Identifying Semantic Reply Relationships with Random Forests and Recurrent Neural Networks","authors":["Mehri, Shikib","Carenini, Giuseppe"],"emails":["mehrishikib@gmail.com","carenini@cs.ubc.ca"],"author_id":["shikib-mehri","giuseppe-carenini"],"abstract":"Thread disentanglement is a precursor to any high-level analysis of multiparticipant chats. Existing research approaches the problem by calculating the likelihood of two messages belonging in the same thread. Our approach leverages a newly annotated dataset to identify reply relationships. Furthermore, we explore the usage of an RNN, along with large quantities of unlabeled data, to learn semantic relationships between messages. Our proposed pipeline, which utilizes a reply classifier and an RNN to generate a set of disentangled threads, is novel and performs well against previous work.","pages":"615--623","url":"https:\/\/www.aclweb.org\/anthology\/I17-1062","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1063","title":"Towards Bootstrapping a Polarity Shifter Lexicon using Linguistic Features","authors":["Schulder, Marc","Wiegand, Michael","Ruppenhofer, Josef","Roth, Benjamin"],"emails":["marc.schulder@lsv.uni-saarland.de","michael.wiegand@lsv.uni-saarland.de","ruppenhofer@ids-mannheim.de","beroth@cis.uni-muenchen.de"],"author_id":["marc-schulder","michael-wiegand","josef-ruppenhofer","benjamin-roth"],"abstract":"We present a major step towards the creation of the first high-coverage lexicon of polarity shifters. In this work, we bootstrap a lexicon of verbs by exploiting various linguistic features. Polarity shifters, such as {``}abandon{''}, are similar to negations (e.g. {``}not{''}) in that they move the polarity of a phrase towards its inverse, as in {``}abandon all hope{''}. While there exist lists of negation words, creating comprehensive lists of polarity shifters is far more challenging due to their sheer number. On a sample of manually annotated verbs we examine a variety of linguistic features for this task. Then we build a supervised classifier to increase coverage. We show that this approach drastically reduces the annotation effort while ensuring a high-precision lexicon. We also show that our acquired knowledge of verbal polarity shifters improves phrase-level sentiment analysis.","pages":"624--633","url":"https:\/\/www.aclweb.org\/anthology\/I17-1063","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1064","title":"Cascading Multiway Attentions for Document-level Sentiment Classification","authors":["Ma, Dehong","Li, Sujian","Zhang, Xiaodong","Wang, Houfeng","Sun, Xu"],"emails":["madehong@pku.edu.cn","lisujian@pku.edu.cn","zxdcs@pku.edu.cn","wanghf@pku.edu.cn","xusun@pku.edu.cn"],"author_id":["dehong-ma","sujian-li","xiaodong-zhang","houfeng-wang","xu-sun"],"abstract":"Document-level sentiment classification aims to assign the user reviews a sentiment polarity. Previous methods either just utilized the document content without consideration of user and product information, or did not comprehensively consider what roles the three kinds of information play in text modeling. In this paper, to reasonably use all the information, we present the idea that user, product and their combination can all influence the generation of attentions to words and sentences, when judging the sentiment of a document. With this idea, we propose a cascading multiway attention (CMA) model, where multiple ways of using user and product information are cascaded to influence the generation of attentions on the word and sentence layers. Then, sentences and documents are well modeled by multiple representation vectors, which provide rich information for sentiment classification. Experiments on IMDB and Yelp datasets demonstrate the effectiveness of our model.","pages":"634--643","url":"https:\/\/www.aclweb.org\/anthology\/I17-1064","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1065","title":"An Ensemble Method with Sentiment Features and Clustering Support","authors":["Nguyen, Huy Tien","Nguyen, Minh Le"],"emails":["nguyenml@jaist.ac.jp","ntienhuy@jaist.ac.jp"],"author_id":["huy-tien-nguyen","minh-le-nguyen"],"abstract":"Deep learning models have recently been applied successfully in natural language processing, especially sentiment analysis. Each deep learning model has a particular advantage, but it is difficult to combine these advantages into one model, especially in the area of sentiment analysis. In our approach, Convolutional Neural Network (CNN) and Long Short Term Memory (LSTM) were utilized to learn sentiment-specific features in a freezing scheme. This scenario provides a novel and efficient way for integrating advantages of deep learning models. In addition, we also grouped documents into clusters by their similarity and applied the prediction score of Naive Bayes SVM (NBSVM) method to boost the classification accuracy of each group. The experiments show that our method achieves the state-of-the-art performance on two well-known datasets: IMDB large movie reviews for document level and Pang {\\&} Lee movie reviews for sentence level.","pages":"644--653","url":"https:\/\/www.aclweb.org\/anthology\/I17-1065","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1066","title":"Leveraging Auxiliary Tasks for Document-Level Cross-Domain Sentiment Classification","authors":["Yu, Jianfei","Jiang, Jing"],"emails":["jfyu.2014@phdis.smu.edu.sg","jingjiang@smu.edu.sg"],"author_id":["jianfei-yu","jing-jiang"],"abstract":"In this paper, we study domain adaptation with a state-of-the-art hierarchical neural network for document-level sentiment classification. We first design a new auxiliary task based on sentiment scores of domain-independent words. We then propose two neural network architectures to respectively induce document embeddings and sentence embeddings that work well for different domains. When these document and sentence embeddings are used for sentiment classification, we find that with both pseudo and external sentiment lexicons, our proposed methods can perform similarly to or better than several highly competitive domain adaptation methods on a benchmark dataset of product reviews.","pages":"654--663","url":"https:\/\/www.aclweb.org\/anthology\/I17-1066","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1067","title":"Measuring Semantic Relations between Human Activities","authors":["Wilson, Steven","Mihalcea, Rada"],"emails":["steverw@umich.edu","mihalcea@umich.edu"],"author_id":["steven-wilson","rada-mihalcea"],"abstract":"The things people do in their daily lives can provide valuable insights into their personality, values, and interests. Unstructured text data on social media platforms are rich in behavioral content, and automated systems can be deployed to learn about human activity on a broad scale if these systems are able to reason about the content of interest. In order to aid in the evaluation of such systems, we introduce a new phrase-level semantic textual similarity dataset comprised of human activity phrases, providing a testbed for automated systems that analyze relationships between phrasal descriptions of people{'}s actions. Our set of 1,000 pairs of activities is annotated by human judges across four relational dimensions including similarity, relatedness, motivational alignment, and perceived actor congruence. We evaluate a set of strong baselines for the task of generating scores that correlate highly with human ratings, and we introduce several new approaches to the phrase-level similarity task in the domain of human activities.","pages":"664--673","url":"https:\/\/www.aclweb.org\/anthology\/I17-1067","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1068","title":"Learning Transferable Representation for Bilingual Relation Extraction via Convolutional Neural Networks","authors":["Min, Bonan","Jiang, Zhuolin","Freedman, Marjorie","Weischedel, Ralph"],"emails":["bonan.min@raytheon.com","zhuolin.jiang@raytheon.com","mrf@isi.edu","weisched@isi.edu"],"author_id":["bonan-min","zhuolin-jiang","marjorie-freedman","ralph-weischedel"],"abstract":"Typically, relation extraction models are trained to extract instances of a relation ontology using only training data from a single language. However, the concepts represented by the relation ontology (e.g. ResidesIn, EmployeeOf) are language independent. The numbers of annotated examples available for a given ontology vary between languages. For example, there are far fewer annotated examples in Spanish and Japanese than English and Chinese. Furthermore, using only language-specific training data results in the need to manually annotate equivalently large amounts of training for each new language a system encounters. We propose a deep neural network to learn transferable, discriminative bilingual representation. Experiments on the ACE 2005 multilingual training corpus demonstrate that the joint training process results in significant improvement in relation classification performance over the monolingual counterparts. The learnt representation is discriminative and transferable between languages. When using 10{\\%} (25K English words, or 30K Chinese characters) of the training data, our approach results in doubling F1 compared to a monolingual baseline. We achieve comparable performance to the monolingual system trained with 250K English words (or 300K Chinese characters) With 50{\\%} of training data.","pages":"674--684","url":"https:\/\/www.aclweb.org\/anthology\/I17-1068","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1069","title":"Bilingual Word Embeddings for Bilingual Terminology Extraction from Specialized Comparable Corpora","authors":["Hazem, Amir","Morin, Emmanuel"],"emails":["amir.hazem@univ-nantes.fr","emmanuel.morin@univ-nantes.fr"],"author_id":["amir-hazem","emmanuel-morin"],"abstract":"Bilingual lexicon extraction from comparable corpora is constrained by the small amount of available data when dealing with specialized domains. This aspect penalizes the performance of distributional-based approaches, which is closely related to the reliability of word{'}s cooccurrence counts extracted from comparable corpora. A solution to avoid this limitation is to associate external resources with the comparable corpus. Since bilingual word embeddings have recently shown efficient models for learning bilingual distributed representation of words, we explore different word embedding models and show how a general-domain comparable corpus can enrich a specialized comparable corpus via neural networks","pages":"685--693","url":"https:\/\/www.aclweb.org\/anthology\/I17-1069","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1070","title":"A {B}ambara Tonalization System for Word Sense Disambiguation Using Differential Coding, Segmentation and Edit Operation Filtering","authors":["Liu, Luigi Yu-Cheng","Nouvel, Damien"],"emails":["luigi.liu@laposte.net","damien.nouvel@inalco.fr"],"author_id":["luigi-yu-cheng-liu","damien-nouvel"],"abstract":"In many languages such as Bambara or Arabic, tone markers (diacritics) may be written but are actually often omitted. NLP applications are confronted to ambiguities and subsequent difficulties when processing texts. To circumvent this problem, tonalization may be used, as a word sense disambiguation task, relying on context to add diacritics that partially disambiguate words as well as senses. In this paper, we describe our implementation of a Bambara tonalizer that adds tone markers using machine learning (CRFs). To make our tool efficient, we used differential coding, word segmentation and edit operation filtering. We describe our approach that allows tractable machine learning and improves accuracy: our model may be learned within minutes on a 358K-word corpus and reaches 92.3{\\%} accuracy.","pages":"694--703","url":"https:\/\/www.aclweb.org\/anthology\/I17-1070","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1071","title":"Joint Learning of Dialog Act Segmentation and Recognition in Spoken Dialog Using Neural Networks","authors":["Zhao, Tianyu","Kawahara, Tatsuya"],"emails":["zhao@sap.ist.i.kyoto-u.ac.jp","kawahara@sap.ist.i.kyoto-u.ac.jp"],"author_id":["tianyu-zhao","tatsuya-kawahara"],"abstract":"Dialog act segmentation and recognition are basic natural language understanding tasks in spoken dialog systems. This paper investigates a unified architecture for these two tasks, which aims to improve the model{'}s performance on both of the tasks. Compared with past joint models, the proposed architecture can (1) incorporate contextual information in dialog act recognition, and (2) integrate models for tasks of different levels as a whole, i.e. dialog act segmentation on the word level and dialog act recognition on the segment level. Experimental results show that the joint training system outperforms the simple cascading system and the joint coding system on both dialog act segmentation and recognition tasks.","pages":"704--712","url":"https:\/\/www.aclweb.org\/anthology\/I17-1071","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1072","title":"Predicting Users{'} Negative Feedbacks in Multi-Turn Human-Computer Dialogues","authors":["Wang, Xin","Wang, Jianan","Liu, Yuanchao","Wang, Xiaolong","Wang, Zhuoran","Wang, Baoxun"],"emails":["xwang@insun.hit.edu.cn","wangxl@insun.hit.edu.cn","lyc@insun.hit.edu.cn","wangjianan@sjtu.edu.cn","wangzhuoran@trio.ai","wangbaoxun@trio.ai"],"author_id":["xin-wang","jianan-wang","yuanchao-liu","xiaolong-wang","zhuoran-wang","baoxun-wang"],"abstract":"User experience is essential for human-computer dialogue systems. However, it is impractical to ask users to provide explicit feedbacks when the agents{'} responses displease them. Therefore, in this paper, we explore to predict users{'} imminent dissatisfactions caused by intelligent agents by analysing the existing utterances in the dialogue sessions. To our knowledge, this is the first work focusing on this task. Several possible factors that trigger negative emotions are modelled. A relation sequence model (RSM) is proposed to encode the sequence of appropriateness of current response with respect to the earlier utterances. The experimental results show that the proposed structure is effective in modelling emotional risk (possibility of negative feedback) than existing conversation modelling approaches. Besides, strategies of obtaining distance supervision data for pre-training are also discussed in this work. Balanced sampling with respect to the last response in the distance supervision data are shown to be reliable for data augmentation.","pages":"713--722","url":"https:\/\/www.aclweb.org\/anthology\/I17-1072","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1073","title":"Finding Dominant User Utterances And System Responses in Conversations","authors":["Madan, Dhiraj","Joshi, Sachindra"],"emails":["dhimadan@in.ibm.com","jsachind@in.ibm.com"],"author_id":["dhiraj-madan","sachindra-joshi"],"abstract":"There are several dialog frameworks which allow manual specification of intents and rule based dialog flow. The rule based framework provides good control to dialog designers at the expense of being more time consuming and laborious. The job of a dialog designer can be reduced if we could identify pairs of user intents and corresponding responses automatically from prior conversations between users and agents. In this paper we propose an approach to find these frequent user utterances (which serve as examples for intents) and corresponding agent responses. We propose a novel SimCluster algorithm that extends standard K-means algorithm to simultaneously cluster user utterances and agent utterances by taking their adjacency information into account. The method also aligns these clusters to provide pairs of intents and response groups. We compare our results with those produced by using simple Kmeans clustering on a real dataset and observe upto 10{\\%} absolute improvement in F1-scores. Through our experiments on synthetic dataset, we show that our algorithm gains more advantage over K-means algorithm when the data has large variance.","pages":"723--732","url":"https:\/\/www.aclweb.org\/anthology\/I17-1073","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1074","title":"End-to-End Task-Completion Neural Dialogue Systems","authors":["Li, Xiujun","Chen, Yun-Nung","Li, Lihong","Gao, Jianfeng","Celikyilmaz, Asli"],"emails":["lihongli@microsoft.com","y.v.chen@ieee.org","aslicel@microsoft.com","jfgao@microsoft.com","xiul@microsoft.com"],"author_id":["xiujun-li","yun-nung-chen","lihong-li","jianfeng-gao","asli-celikyilmaz"],"abstract":"One of the major drawbacks of modularized task-completion dialogue systems is that each module is trained individually, which presents several challenges. For example, downstream modules are affected by earlier modules, and the performance of the entire system is not robust to the accumulated errors. This paper presents a novel end-to-end learning framework for task-completion dialogue systems to tackle such issues.Our neural dialogue system can directly interact with a structured database to assist users in accessing information and accomplishing certain tasks. The reinforcement learning based dialogue manager offers robust capabilities to handle noises caused by other components of the dialogue system. Our experiments in a movie-ticket booking domain show that our end-to-end system not only outperforms modularized dialogue system baselines for both objective and subjective evaluation, but also is robust to noises as demonstrated by several systematic experiments with different error granularity and rates specific to the language understanding module.","pages":"733--743","url":"https:\/\/www.aclweb.org\/anthology\/I17-1074","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1075","title":"End-to-end Network for Twitter Geolocation Prediction and Hashing","authors":["Lau, Jey Han","Chi, Lianhua","Tran, Khoi-Nguyen","Cohn, Trevor"],"emails":["jeyhan.lau@gmail.com","lianhuac@au1.ibm.com","khndtran@au1.ibm.com","t.cohn@unimelb.edu.au"],"author_id":["jey-han-lau","lianhua-chi","khoi-nguyen-tran","trevor-cohn"],"abstract":"We propose an end-to-end neural network to predict the geolocation of a tweet. The network takes as input a number of raw Twitter metadata such as the tweet message and associated user account information. Our model is language independent, and despite minimal feature engineering, it is interpretable and capable of learning location indicative words and timing patterns. Compared to state-of-the-art systems, our model outperforms them by 2{\\%}-6{\\%}. Additionally, we propose extensions to the model to compress representation learnt by the network into binary codes. Experiments show that it produces compact codes compared to benchmark hashing algorithms. An implementation of the model is released publicly.","pages":"744--753","url":"https:\/\/www.aclweb.org\/anthology\/I17-1075","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1076","title":"Assessing the Verifiability of Attributions in News Text","authors":["Newell, Edward","Schang, Ariane","Margolin, Drew","Ruths, Derek"],"emails":["edward.newell@mail.mcgill.ca","ariane.schang@mail.mcgill.ca","dm658@cornell.edu","derek.ruths@mcgill.ca"],"author_id":["edward-newell","ariane-schang","drew-margolin","derek-ruths"],"abstract":"When reporting the news, journalists rely on the statements of stakeholders, experts, and officials. The attribution of such a statement is verifiable if its fidelity to the source can be confirmed or denied. In this paper, we develop a new NLP task: determining the verifiability of an attribution based on linguistic cues. We operationalize the notion of verifiability as a score between 0 and 1 using human judgments in a comparison-based approach. Using crowdsourcing, we create a dataset of verifiability-scored attributions, and demonstrate a model that achieves an RMSE of 0.057 and Spearman{'}s rank correlation of 0.95 to human-generated scores. We discuss the application of this technique to the analysis of mass media.","pages":"754--763","url":"https:\/\/www.aclweb.org\/anthology\/I17-1076","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1077","title":"Domain Adaptation from User-level {F}acebook Models to County-level Twitter Predictions","authors":["Rieman, Daniel","Jaidka, Kokil","Schwartz, H. Andrew","Ungar, Lyle"],"emails":["rieman@seas.upenn.edu","jaidka@sas.upenn.edu","has@cs.stonybrook.edu","ungar@cis.upenn.edu"],"author_id":["daniel-rieman","kokil-jaidka","h-andrew-schwartz","lyle-ungar"],"abstract":"Several studies have demonstrated how language models of user attributes, such as personality, can be built by using the Facebook language of social media users in conjunction with their responses to psychology questionnaires. It is challenging to apply these models to make general predictions about attributes of communities, such as personality distributions across US counties, because it requires 1. the potentially inavailability of the original training data because of privacy and ethical regulations, 2. adapting Facebook language models to Twitter language without retraining the model, and 3. adapting from users to county-level collections of tweets. We propose a two-step algorithm, Target Side Domain Adaptation (TSDA) for such domain adaptation when no labeled Twitter\/county data is available. TSDA corrects for the different word distributions between Facebook and Twitter and for the varying word distributions across counties by adjusting target side word frequencies; no changes to the trained model are made. In the case of predicting the Big Five county-level personality traits, TSDA outperforms a state-of-the-art domain adaptation method, gives county-level predictions that have fewer extreme outliers, higher year-to-year stability, and higher correlation with county-level outcomes.","pages":"764--773","url":"https:\/\/www.aclweb.org\/anthology\/I17-1077","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1078","title":"Recognizing Explicit and Implicit Hate Speech Using a Weakly Supervised Two-path Bootstrapping Approach","authors":["Gao, Lei","Kuppersmith, Alexis","Huang, Ruihong"],"emails":["sjtuprog@tamu.edu","ex54@stanford.edu","huangrh@cse.tamu.edu"],"author_id":["lei-gao","alexis-kuppersmith","ruihong-huang"],"abstract":"In the wake of a polarizing election, social media is laden with hateful content. To address various limitations of supervised hate speech classification methods including corpus bias and huge cost of annotation, we propose a weakly supervised two-path bootstrapping approach for an online hate speech detection model leveraging large-scale unlabeled data. This system significantly outperforms hate speech detection systems that are trained in a supervised manner using manually annotated data. Applying this model on a large quantity of tweets collected before, after, and on election day reveals motivations and patterns of inflammatory language.","pages":"774--782","url":"https:\/\/www.aclweb.org\/anthology\/I17-1078","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1079","title":"Estimating Reactions and Recommending Products with Generative Models of Reviews","authors":["Ni, Jianmo","Lipton, Zachary C.","Vikram, Sharad","McAuley, Julian"],"emails":["jin018@ucsd.edu","zlipton@ucsd.edu","svikram@ucsd.edu","jmcauley@ucsd.edu"],"author_id":["jianmo-ni","zachary-c-lipton","sharad-vikram","julian-mcauley"],"abstract":"Traditional approaches to recommendation focus on learning from large volumes of historical feedback to estimate simple numerical quantities (Will a user click on a product? Make a purchase? etc.). Natural language approaches that model information like product reviews have proved to be incredibly useful in improving the performance of such methods, as reviews provide valuable auxiliary information that can be used to better estimate latent user preferences and item properties. In this paper, rather than using reviews as an inputs to a recommender system, we focus on generating reviews as the model{'}s output. This requires us to efficiently model text (at the character level) to capture the preferences of the user, the properties of the item being consumed, and the interaction between them (i.e., the user{'}s preference). We show that this can model can be used to (a) generate plausible reviews and estimate nuanced reactions; (b) provide personalized rankings of existing reviews; and (c) recommend existing products more effectively.","pages":"783--791","url":"https:\/\/www.aclweb.org\/anthology\/I17-1079","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1080","title":"Summarizing Lengthy Questions","authors":["Ishigaki, Tatsuya","Takamura, Hiroya","Okumura, Manabu"],"emails":["ishigaki@lr.pi.titech.ac.jp","takamura@pi.titech.ac.jp","oku@pi.titech.ac.jp"],"author_id":["tatsuya-ishigaki","hiroya-takamura","manabu-okumura"],"abstract":"In this research, we propose the task of question summarization. We first analyzed question-summary pairs extracted from a Community Question Answering (CQA) site, and found that a proportion of questions cannot be summarized by extractive approaches but requires abstractive approaches. We created a dataset by regarding the question-title pairs posted on the CQA site as question-summary pairs. By using the data, we trained extractive and abstractive summarization models, and compared them based on ROUGE scores and manual evaluations. Our experimental results show an abstractive method using an encoder-decoder model with a copying mechanism achieves better scores for both ROUGE-2 F-measure and the evaluations by human judges.","pages":"792--800","url":"https:\/\/www.aclweb.org\/anthology\/I17-1080","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1081","title":"Concept-Map-Based Multi-Document Summarization using Concept Coreference Resolution and Global Importance Optimization","authors":["Falke, Tobias","Meyer, Christian M.","Gurevych, Iryna"],"emails":["","",""],"author_id":["tobias-falke","christian-m-meyer","iryna-gurevych"],"abstract":"Concept-map-based multi-document summarization is a variant of traditional summarization that produces structured summaries in the form of concept maps. In this work, we propose a new model for the task that addresses several issues in previous methods. It learns to identify and merge coreferent concepts to reduce redundancy, determines their importance with a strong supervised model and finds an optimal summary concept map via integer linear programming. It is also computationally more efficient than previous methods, allowing us to summarize larger document sets. We evaluate the model on two datasets, finding that it outperforms several approaches from previous work.","pages":"801--811","url":"https:\/\/www.aclweb.org\/anthology\/I17-1081","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1082","title":"Abstractive Multi-document Summarization by Partial Tree Extraction, Recombination and Linearization","authors":["J Kurisinkel, Litton","Zhang, Yue","Varma, Vasudeva"],"emails":["urisinkel@research.iiit.ac.in","zhang@sutd.edu.sg","vv@iiit.ac.in"],"author_id":["litton-j-kurisinkel","yue-zhang","vasudeva-varma"],"abstract":"Existing work for abstractive multidocument summarization utilise existing phrase structures directly extracted from input documents to generate summary sentences. These methods can suffer from lack of consistence and coherence in merging phrases. We introduce a novel approach for abstractive multidocument summarization through partial dependency tree extraction, recombination and linearization. The method entrusts the summarizer to generate its own topically coherent sequential structures from scratch for effective communication. Results on TAC 2011, DUC-2004 and 2005 show that our system gives competitive results compared with state of the art abstractive summarization approaches in the literature. We also achieve competitive results in linguistic quality assessed by human evaluators.","pages":"812--821","url":"https:\/\/www.aclweb.org\/anthology\/I17-1082","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1083","title":"Event Argument Identification on Dependency Graphs with Bidirectional {LSTM}s","authors":["Judea, Alex","Strube, Michael"],"emails":["alex.judea@h-its.org","michael.strube@h-its.org"],"author_id":["alex-judea","michael-strube"],"abstract":"In this paper we investigate the performance of event argument identification. We show that the performance is tied to syntactic complexity. Based on this finding, we propose a novel and effective system for event argument identification. Recurrent Neural Networks learn to produce meaningful representations of long and short dependency paths. Convolutional Neural Networks learn to decompose the lexical context of argument candidates. They are combined into a simple system which outperforms a feature-based, state-of-the-art event argument identifier without any manual feature engineering.","pages":"822--831","url":"https:\/\/www.aclweb.org\/anthology\/I17-1083","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1084","title":"Selective Decoding for Cross-lingual Open Information Extraction","authors":["Zhang, Sheng","Duh, Kevin","Van Durme, Benjamin"],"emails":["zsheng2@jhu.edu","kevinduh@cs.jhu.edu","vandurme@cs.jhu.edu"],"author_id":["sheng-zhang","kevin-duh","benjamin-van-durme"],"abstract":"Cross-lingual open information extraction is the task of distilling facts from the source language into representations in the target language. We propose a novel encoder-decoder model for this problem. It employs a novel selective decoding mechanism, which explicitly models the sequence labeling process as well as the sequence generation process on the decoder side. Compared to a standard encoder-decoder model, selective decoding significantly increases the performance on a Chinese-English cross-lingual open IE dataset by 3.87-4.49 BLEU and 1.91-5.92 F1. We also extend our approach to low-resource scenarios, and gain promising improvement.","pages":"832--842","url":"https:\/\/www.aclweb.org\/anthology\/I17-1084","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1085","title":"Event Ordering with a Generalized Model for Sieve Prediction Ranking","authors":["McDowell, Bill","Chambers, Nathanael","Ororbia II, Alexander","Reitter, David"],"emails":["forkunited@gmail.com","nchamber@usna.edu","ago109@psu.edu","reitter@psu.edu"],"author_id":["bill-mcdowell","nathanael-chambers","alexander-ororbia-ii","david-reitter"],"abstract":"This paper improves on several aspects of a sieve-based event ordering architecture, CAEVO (Chambers et al., 2014), which creates globally consistent temporal relations between events and time expressions. First, we examine the usage of word embeddings and semantic role features. With the incorporation of these new features, we demonstrate a 5{\\%} relative F1 gain over our replicated version of CAEVO. Second, we reformulate the architecture{'}s sieve-based inference algorithm as a prediction reranking method that approximately optimizes a scoring function computed using classifier precisions. Within this prediction reranking framework, we propose an alternative scoring function, showing an 8.8{\\%} relative gain over the original CAEVO. We further include an in-depth analysis of one of the main datasets that is used to evaluate temporal classifiers, and we show how despite using the densest corpus, there is still a danger of overfitting. While this paper focuses on temporal ordering, its results are applicable to other areas that use sieve-based architectures.","pages":"843--853","url":"https:\/\/www.aclweb.org\/anthology\/I17-1085","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1086","title":"Open Relation Extraction and Grounding","authors":["Yu, Dian","Huang, Lifu","Ji, Heng"],"emails":["yud2@rpi.edu","huangl7@rpi.edu","jih@rpi.edu"],"author_id":["dian-yu","lifu-huang","heng-ji"],"abstract":"Previous open Relation Extraction (open RE) approaches mainly rely on linguistic patterns and constraints to extract important relational triples from large-scale corpora. However, they lack of abilities to cover diverse relation expressions or measure the relative importance of candidate triples within a sentence. It is also challenging to name the relation type of a relational triple merely based on context words, which could limit the usefulness of open RE in downstream applications. We propose a novel importance-based open RE approach by exploiting the global structure of a dependency tree to extract salient triples. We design an unsupervised relation type naming method by grounding relational triples to a large-scale Knowledge Base (KB) schema, leveraging KB triples and weighted context words associated with relational triples. Experiments on the English Slot Filling 2013 dataset demonstrate that our approach achieves 8.1{\\%} higher F-score over state-of-the-art open RE methods.","pages":"854--864","url":"https:\/\/www.aclweb.org\/anthology\/I17-1086","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1087","title":"Extraction of Gene-Environment Interaction from the Biomedical Literature","authors":["You, Jinseon","Chung, Jin-Woo","Yang, Wonsuk","Park, Jong C."],"emails":["jsyou@nlp.kaist.ac.kr","jwchung@nlp.kaist.ac.kr","derrick0511@nlp.kaist.ac.kr","park@nlp.kaist.ac.kr"],"author_id":["jinseon-you","jin-woo-chung","wonsuk-yang","jong-c-park"],"abstract":"Genetic information in the literature has been extensively looked into for the purpose of discovering the etiology of a disease. As the gene-disease relation is sensitive to external factors, their identification is important to study a disease. Environmental influences, which are usually called Gene-Environment interaction (GxE), have been considered as important factors and have extensively been researched in biology. Nevertheless, there is still a lack of systems for automatic GxE extraction from the biomedical literature due to new challenges: (1) there are no preprocessing tools and corpora for GxE, (2) expressions of GxE are often quite implicit, and (3) document-level comprehension is usually required. We propose to overcome these challenges with neural network models and show that a modified sequence-to-sequence model with a static RNN decoder produces a good performance in GxE recognition.","pages":"865--874","url":"https:\/\/www.aclweb.org\/anthology\/I17-1087","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1088","title":"Course Concept Extraction in {MOOC}s via Embedding-Based Graph Propagation","authors":["Pan, Liangming","Wang, Xiaochen","Li, Chengjiang","Li, Juanzi","Tang, Jie"],"emails":["panlm14@mails.tsinghua.edu.cn","wangxc15@mails.tsinghua.edu.cn","licj17@mails.tsinghua.edu.cn","lijuanzi@tsinghua.edu.cn","tangjie@tsinghua.edu.cn"],"author_id":["liangming-pan","xiaochen-wang","chengjiang-li","juanzi-li","jie-tang"],"abstract":"Massive Open Online Courses (MOOCs), offering a new way to study online, are revolutionizing education. One challenging issue in MOOCs is how to design effective and fine-grained course concepts such that students with different backgrounds can grasp the essence of the course. In this paper, we conduct a systematic investigation of the problem of course concept extraction for MOOCs. We propose to learn latent representations for candidate concepts via an embedding-based method. Moreover, we develop a graph-based propagation algorithm to rank the candidate concepts based on the learned representations. We evaluate the proposed method using different courses from XuetangX and Coursera. Experimental results show that our method significantly outperforms all the alternative methods (+0.013-0.318 in terms of R-precision; p{\\textless}{\\textless}0.01, t-test).","pages":"875--884","url":"https:\/\/www.aclweb.org\/anthology\/I17-1088","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1089","title":"Identity Deception Detection","authors":["P{\\'e}rez-Rosas, Ver{\\'o}nica","Davenport, Quincy","Dai, Anna Mengdan","Abouelenien, Mohamed","Mihalcea, Rada"],"emails":["vrncapr@umich.edu","quincyd@umich.edu","annadai@umich.edu","zmohamed@umich.edu","mihalcea@umich.edu"],"author_id":["veronica-perez-rosas","quincy-davenport","anna-mengdan-dai","mohamed-abouelenien","rada-mihalcea"],"abstract":"This paper addresses the task of detecting identity deception in language. Using a novel identity deception dataset, consisting of real and portrayed identities from 600 individuals, we show that we can build accurate identity detectors targeting both age and gender, with accuracies of up to 88. We also perform an analysis of the linguistic patterns used in identity deception, which lead to interesting insights into identity portrayers.","pages":"885--894","url":"https:\/\/www.aclweb.org\/anthology\/I17-1089","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1090","title":"Learning to Diagnose: Assimilating Clinical Narratives using Deep Reinforcement Learning","authors":["Ling, Yuan","Hasan, Sadid A.","Datla, Vivek","Qadir, Ashequl","Lee, Kathy","Liu, Joey","Farri, Oladimeji"],"emails":["yuan.ling@philips.com","sadid.hasan@philips.com","vivek.datla@philips.com","ashequl.qadir@philips.com","1@philips.com","joey.liu@philips.com","dimeji.farri@philips.com"],"author_id":["yuan-ling","sadid-a-hasan","vivek-datla","ashequl-qadir","kathy-lee","joey-liu","oladimeji-farri"],"abstract":"Clinical diagnosis is a critical and non-trivial aspect of patient care which often requires significant medical research and investigation based on an underlying clinical scenario. This paper proposes a novel approach by formulating clinical diagnosis as a reinforcement learning problem. During training, the reinforcement learning agent mimics the clinician{'}s cognitive process and learns the optimal policy to obtain the most appropriate diagnoses for a clinical narrative. This is achieved through an iterative search for candidate diagnoses from external knowledge sources via a sentence-by-sentence analysis of the inherent clinical context. A deep Q-network architecture is trained to optimize a reward function that measures the accuracy of the candidate diagnoses. Experiments on the TREC CDS datasets demonstrate the effectiveness of our system over various non-reinforcement learning-based systems.","pages":"895--905","url":"https:\/\/www.aclweb.org\/anthology\/I17-1090","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1091","title":"Dataset for a Neural Natural Language Interface for Databases ({NNLIDB})","authors":["Brad, Florin","Iacob, Radu Cristian Alexandru","Hosu, Ionel Alexandru","Rebedea, Traian"],"emails":["fbrad@bitdefender.com","radu.iacob23@gmail.com","ionel.hosu@gmail.com","traian.rebedea@gmail.com"],"author_id":["florin-brad","radu-cristian-alexandru-iacob","ionel-alexandru-hosu","traian-rebedea"],"abstract":"Progress in natural language interfaces to databases (NLIDB) has been slow mainly due to linguistic issues (such as language ambiguity) and domain portability. Moreover, the lack of a large corpus to be used as a standard benchmark has made data-driven approaches difficult to develop and compare. In this paper, we revisit the problem of NLIDBs and recast it as a sequence translation problem. To this end, we introduce a large dataset extracted from the Stack Exchange Data Explorer website, which can be used for training neural natural language interfaces for databases. We also report encouraging baseline results on a smaller manually annotated test corpus, obtained using an attention-based sequence-to-sequence neural network.","pages":"906--914","url":"https:\/\/www.aclweb.org\/anthology\/I17-1091","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1092","title":"Acquisition and Assessment of Semantic Content for the Generation of Elaborateness and Indirectness in Spoken Dialogue Systems","authors":["Pragst, Louisa","Yoshino, Koichiro","Minker, Wolfgang","Nakamura, Satoshi","Ultes, Stefan"],"emails":["louisa.pragst@uni-ulm.de","koichiro@is.naist.jp","wolfgang.minker@uni-ulm.de","s-nakamura@is.naist.jp","su259@cam.ac.uk"],"author_id":["louisa-pragst","koichiro-yoshino","wolfgang-minker","satoshi-nakamura","stefan-ultes"],"abstract":"In a dialogue system, the dialogue manager selects one of several system actions and thereby determines the system{'}s behaviour. Defining all possible system actions in a dialogue system by hand is a tedious work. While efforts have been made to automatically generate such system actions, those approaches are mostly focused on providing functional system behaviour. Adapting the system behaviour to the user becomes a difficult task due to the limited amount of system actions available. We aim to increase the adaptability of a dialogue system by automatically generating variants of system actions. In this work, we introduce an approach to automatically generate action variants for elaborateness and indirectness. Our proposed algorithm extracts RDF triplets from a knowledge base and rates their relevance to the original system action to find suitable content. We show that the results of our algorithm are mostly perceived similarly to human generated elaborateness and indirectness and can be used to adapt a conversation to the current user and situation. We also discuss where the results of our algorithm are still lacking and how this could be improved: Taking into account the conversation topic as well as the culture of the user is likely to have beneficial effect on the user{'}s perception.","pages":"915--925","url":"https:\/\/www.aclweb.org\/anthology\/I17-1092","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1093","title":"Demographic Word Embeddings for Racism Detection on Twitter","authors":["Hasanuzzaman, Mohammed","Dias, Ga{\\\"e}l","Way, Andy"],"emails":["","",""],"author_id":["mohammed-hasanuzzaman","gael-dias","andy-way"],"abstract":"Most social media platforms grant users freedom of speech by allowing them to freely express their thoughts, beliefs, and opinions. Although this represents incredible and unique communication opportunities, it also presents important challenges. Online racism is such an example. In this study, we present a supervised learning strategy to detect racist language on Twitter based on word embedding that incorporate demographic (Age, Gender, and Location) information. Our methodology achieves reasonable classification accuracy over a gold standard dataset (F1=76.3{\\%}) and significantly improves over the classification performance of demographic-agnostic models.","pages":"926--936","url":"https:\/\/www.aclweb.org\/anthology\/I17-1093","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1094","title":"Automatically Extracting Variant-Normalization Pairs for {J}apanese Text Normalization","authors":["Saito, Itsumi","Nishida, Kyosuke","Sadamitsu, Kugatsu","Saito, Kuniko","Tomita, Junji"],"emails":["saito.itsumi@lab.ntt.co.jp","nishida.kyosuke@lab.ntt.co.jp","k.sadamitsu.ic@future.co.jp","saito.kuniko@lab.ntt.co.jp","tomita.junji@lab.ntt.co.jp"],"author_id":["itsumi-saito","kyosuke-nishida","kugatsu-sadamitsu","kuniko-saito","junji-tomita"],"abstract":"Social media texts, such as tweets from Twitter, contain many types of non-standard tokens, and the number of normalization approaches for handling such noisy text has been increasing. We present a method for automatically extracting pairs of a variant word and its normal form from unsegmented text on the basis of a pair-wise similarity approach. We incorporated the acquired variant-normalization pairs into Japanese morphological analysis. The experimental results show that our method can extract widely covered variants from large Twitter data and improve the recall of normalization without degrading the overall accuracy of Japanese morphological analysis.","pages":"937--946","url":"https:\/\/www.aclweb.org\/anthology\/I17-1094","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1095","title":"Semantic Document Distance Measures and Unsupervised Document Revision Detection","authors":["Zhu, Xiaofeng","Klabjan, Diego","Bless, Patrick"],"emails":["xiaofengzhu2013@u.northwestern.edu","d-klabjan@northwestern.edu","patrick.n.bless@intel.com"],"author_id":["xiaofeng-zhu","diego-klabjan","patrick-bless"],"abstract":"In this paper, we model the document revision detection problem as a minimum cost branching problem that relies on computing document distances. Furthermore, we propose two new document distance measures, word vector-based Dynamic Time Warping (wDTW) and word vector-based Tree Edit Distance (wTED). Our revision detection system is designed for a large scale corpus and implemented in Apache Spark. We demonstrate that our system can more precisely detect revisions than state-of-the-art methods by utilizing the Wikipedia revision dumps and simulated data sets.","pages":"947--956","url":"https:\/\/www.aclweb.org\/anthology\/I17-1095","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1096","title":"An Empirical Analysis of Multiple-Turn Reasoning Strategies in Reading Comprehension Tasks","authors":["Shen, Yelong","Liu, Xiaodong","Duh, Kevin","Gao, Jianfeng"],"emails":["yeshen@microsoft.com","xiaodl@microsoft.com","kevinduh@cs.jhu.edu","jfgao@microsoft.com"],"author_id":["yelong-shen","xiaodong-liu","kevin-duh","jianfeng-gao"],"abstract":"Reading comprehension (RC) is a challenging task that requires synthesis of information across sentences and multiple turns of reasoning. Using a state-of-the-art RC model, we empirically investigate the performance of single-turn and multiple-turn reasoning on the SQuAD and MS MARCO datasets. The RC model is an end-to-end neural network with iterative attention, and uses reinforcement learning to dynamically control the number of turns. We find that multiple-turn reasoning outperforms single-turn reasoning for all question and answer types; further, we observe that enabling a flexible number of turns generally improves upon a fixed multiple-turn strategy. {\\%}across all question types, and is particularly beneficial to questions with lengthy, descriptive answers. We achieve results competitive to the state-of-the-art on these two datasets.","pages":"957--966","url":"https:\/\/www.aclweb.org\/anthology\/I17-1096","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1097","title":"Automated Historical Fact-Checking by Passage Retrieval, Word Statistics, and Virtual Question-Answering","authors":["Kobayashi, Mio","Ishii, Ai","Hoshino, Chikara","Miyashita, Hiroshi","Matsuzaki, Takuya"],"emails":["mio.kobayashi@unisys.co.jp","ai.ishii@unisys.co.jp","chikara.hoshino@unisys.co.jp","hiroshi.miyashita@unisys.co.jp","matuzaki@nuee.nagoya-u.ac.jp"],"author_id":["mio-kobayashi","ai-ishii","chikara-hoshino","hiroshi-miyashita","takuya-matsuzaki"],"abstract":"This paper presents a hybrid approach to the verification of statements about historical facts. The test data was collected from the world history examinations in a standardized achievement test for high school students. The data includes various kinds of false statements that were carefully written so as to deceive the students while they can be disproven on the basis of the teaching materials. Our system predicts the truth or falsehood of a statement based on text search, word cooccurrence statistics, factoid-style question answering, and temporal relation recognition. These features contribute to the judgement complementarily and achieved the state-of-the-art accuracy.","pages":"967--975","url":"https:\/\/www.aclweb.org\/anthology\/I17-1097","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1098","title":"Integrating Subject, Type, and Property Identification for Simple Question Answering over Knowledge Base","authors":["Hsiao, Wei-Chuan","Huang, Hen-Hsen","Chen, Hsin-Hsi"],"emails":["weichuanhsiao@gmail.com","hhhuang@nlg.csie.ntu.edu.tw","hhchen@ntu.edu.tw"],"author_id":["wei-chuan-hsiao","hen-hsen-huang","hsin-hsi-chen"],"abstract":"This paper presents an approach to identify subject, type and property from knowledge base (KB) for answering simple questions. We propose new features to rank entity candidates in KB. Besides, we split a relation in KB into type and property. Each of them is modeled by a bi-directional LSTM. Experimental results show that our model achieves the state-of-the-art performance on the SimpleQuestions dataset. The hard questions in the experiments are also analyzed in detail.","pages":"976--985","url":"https:\/\/www.aclweb.org\/anthology\/I17-1098","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1099","title":"{D}aily{D}ialog: A Manually Labelled Multi-turn Dialogue Dataset","authors":["Li, Yanran","Su, Hui","Shen, Xiaoyu","Li, Wenjie","Cao, Ziqiang","Niu, Shuzi"],"emails":["","","","","",""],"author_id":["yanran-li","hui-su","xiaoyu-shen","wenjie-li","ziqiang-cao","shuzi-niu"],"abstract":"We develop a high-quality multi-turn dialog dataset, \\textbf{DailyDialog},which is intriguing in several aspects. The language is human-written and lessnoisy. The dialogues in the dataset reflect our daily communication way andcover various topics about our daily life. We also manually label the developeddataset with communication intention and emotion information. Then, we evaluateexisting approaches on DailyDialog dataset and hope it benefit the researchfield of dialog systems. The dataset is available on\\url{http:\/\/yanran.li\/dailydialog}","pages":"986--995","url":"https:\/\/www.aclweb.org\/anthology\/I17-1099","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1100","title":"Inference is Everything: Recasting Semantic Resources into a Unified Evaluation Framework","authors":["White, Aaron Steven","Rastogi, Pushpendre","Duh, Kevin","Van Durme, Benjamin"],"emails":["","","",""],"author_id":["aaron-steven-white","pushpendre-rastogi","kevin-duh","benjamin-van-durme"],"abstract":"We propose to unify a variety of existing semantic classification tasks, such as semantic role labeling, anaphora resolution, and paraphrase detection, under the heading of Recognizing Textual Entailment (RTE). We present a general strategy to automatically generate one or more sentential hypotheses based on an input sentence and pre-existing manual semantic annotations. The resulting suite of datasets enables us to probe a statistical RTE model{'}s performance on different aspects of semantics. We demonstrate the value of this approach by investigating the behavior of a popular neural network RTE model.","pages":"996--1005","url":"https:\/\/www.aclweb.org\/anthology\/I17-1100","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1101","title":"Generating a Training Corpus for {OCR} Post-Correction Using Encoder-Decoder Model","authors":["D{'}hondt, Eva","Grouin, Cyril","Grau, Brigitte"],"emails":["eva.dhondt@gmail.com","cyril.grouin@limsi.fr","bg@limsi.fr"],"author_id":["eva-dhondt","cyril-grouin","brigitte-grau"],"abstract":"In this paper we present a novel approach to the automatic correction of OCR-induced orthographic errors in a given text. While current systems depend heavily on large training corpora or external information, such as domain-specific lexicons or confidence scores from the OCR process, our system only requires a small amount of (relatively) clean training data from a representative corpus to learn a character-based statistical language model using Bidirectional Long Short-Term Memory Networks (biLSTMs). We demonstrate the versatility and adaptability of our system on different text corpora with varying degrees of textual noise, including a real-life OCR corpus in the medical domain.","pages":"1006--1014","url":"https:\/\/www.aclweb.org\/anthology\/I17-1101","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1102","title":"Multilingual Hierarchical Attention Networks for Document Classification","authors":["Pappas, Nikolaos","Popescu-Belis, Andrei"],"emails":["nikolaos.pappas@idiap.ch","andrei.popescu-belis@heig-vd.ch"],"author_id":["nikolaos-pappas","andrei-popescu-belis"],"abstract":"Hierarchical attention networks have recently achieved remarkable performance for document classification in a given language. However, when multilingual document collections are considered, training such models separately for each language entails linear parameter growth and lack of cross-language transfer. Learning a single multilingual model with fewer parameters is therefore a challenging but potentially beneficial objective. To this end, we propose multilingual hierarchical attention networks for learning document structures, with shared encoders and\/or shared attention mechanisms across languages, using multi-task learning and an aligned semantic space as input. We evaluate the proposed models on multilingual document classification with disjoint label sets, on a large dataset which we provide, with 600k news documents in 8 languages, and 5k labels. The multilingual models outperform monolingual ones in low-resource as well as full-resource settings, and use fewer parameters, thus confirming their computational efficiency and the utility of cross-language transfer.","pages":"1015--1025","url":"https:\/\/www.aclweb.org\/anthology\/I17-1102","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"},{"id":"I17-1103","title":"Roles and Success in {W}ikipedia Talk Pages: Identifying Latent Patterns of Behavior","authors":["Maki, Keith","Yoder, Michael","Jo, Yohan","Ros{\\'e}, Carolyn"],"emails":["kmaki@cs.cmu.edu","yoder@cs.cmu.edu","yohanj@cs.cmu.edu","cprose@cs.cmu.edu"],"author_id":["keith-maki","michael-yoder","yohan-jo","carolyn-rose"],"abstract":"In this work we investigate how role-based behavior profiles of a Wikipedia editor, considered against the backdrop of roles taken up by other editors in discussions, predict the success of the editor at achieving an impact on the associated article. We first contribute a new public dataset including a task predicting the success of Wikipedia editors involved in discussion, measured by an operationalization of the lasting impact of their edits in the article. We then propose a probabilistic graphical model that advances earlier work inducing latent discussion roles using the light supervision of success in the negotiation task. We evaluate the performance of the model and interpret findings of roles and group configurations that lead to certain outcomes on Wikipedia.","pages":"1026--1035","url":"https:\/\/www.aclweb.org\/anthology\/I17-1103","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 1: Long Papers)"}]