[{"id":"K18-1001","title":"Embedded-State Latent Conditional Random Fields for Sequence Labeling","authors":["Thai, Dung","Ramesh, Sree Harsha","Murty, Shikhar","Vilnis, Luke","McCallum, Andrew"],"emails":["dthai@cs.umass.edu","shramesh@cs.umass.edu","smurty@cs.umass.edu","luke@cs.umass.edu","mccallum@cs.umass.edu"],"author_id":["dung-thai","sree-harsha-ramesh","shikhar-murty","luke-vilnis","andrew-mccallum"],"abstract":"Complex textual information extraction tasks are often posed as sequence labeling or \\textit{shallow parsing}, where fields are extracted using local labels made consistent through probabilistic inference in a graphical model with constrained transitions. Recently, it has become common to locally parametrize these models using rich features extracted by recurrent neural networks (such as LSTM), while enforcing consistent outputs through a simple linear-chain model, representing Markovian dependencies between successive labels. However, the simple graphical model structure belies the often complex non-local constraints between output labels. For example, many fields, such as a first name, can only occur a fixed number of times, or in the presence of other fields. While RNNs have provided increasingly powerful context-aware local features for sequence tagging, they have yet to be integrated with a global graphical model of similar expressivity in the output distribution. Our model goes beyond the linear chain CRF to incorporate multiple hidden states per output label, but parametrizes them parsimoniously with low-rank log-potential scoring matrices, effectively learning an embedding space for hidden states. This augmented latent space of inference variables complements the rich feature representation of the RNN, and allows exact global inference obeying complex, learned non-local output constraints. We experiment with several datasets and show that the model outperforms baseline CRF+RNN models when global output constraints are necessary at inference-time, and explore the interpretable latent structure.","pages":"1--10","doi":"10.18653\/v1\/K18-1001","url":"https:\/\/www.aclweb.org\/anthology\/K18-1001","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1002","title":"Continuous Word Embedding Fusion via Spectral Decomposition","authors":["Fu, Tianfan","Zhang, Cheng","Mandt, Stephan"],"emails":["tfu42@gatech.edu","cheng.zhang@microsoft.com","stephan.mandt@gmail.com"],"author_id":["tianfan-fu","cheng-zhang","stephan-mandt"],"abstract":"Word embeddings have become a mainstream tool in statistical natural language processing. Practitioners often use pre-trained word vectors, which were trained on large generic text corpora, and which are readily available on the web. However, pre-trained word vectors oftentimes lack important words from specific domains. It is therefore often desirable to extend the vocabulary and embed new words into a set of pre-trained word vectors. In this paper, we present an efficient method for including new words from a specialized corpus, containing new words, into pre-trained generic word embeddings. We build on the established view of word embeddings as matrix factorizations to present a spectral algorithm for this task. Experiments on several domain-specific corpora with specialized vocabularies demonstrate that our method is able to embed the new words efficiently into the original embedding space. Compared to competing methods, our method is faster, parameter-free, and deterministic.","pages":"11--20","doi":"10.18653\/v1\/K18-1002","url":"https:\/\/www.aclweb.org\/anthology\/K18-1002","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1003","title":"Dual Latent Variable Model for Low-Resource Natural Language Generation in Dialogue Systems","authors":["Tran, Van-Khanh","Nguyen, Le-Minh"],"emails":["tvkhanh@jaist.ac.jp","nguyenml@jaist.ac.jp"],"author_id":["van-khanh-tran","minh-le-nguyen"],"abstract":"Recent deep learning models have shown improving results to natural language generation (NLG) irrespective of providing sufficient annotated data. However, a modest training data may harm such models{'} performance. Thus, how to build a generator that can utilize as much of knowledge from a low-resource setting data is a crucial issue in NLG. This paper presents a variational neural-based generation model to tackle the NLG problem of having limited labeled dataset, in which we integrate a variational inference into an encoder-decoder generator and introduce a novel auxiliary auto-encoding with an effective training procedure. Experiments showed that the proposed methods not only outperform the previous models when having sufficient training dataset but also demonstrate strong ability to work acceptably well when the training data is scarce.","pages":"21--30","doi":"10.18653\/v1\/K18-1003","url":"https:\/\/www.aclweb.org\/anthology\/K18-1003","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1004","title":"A Trio Neural Model for Dynamic Entity Relatedness Ranking","authors":["Nguyen, Tu","Tran, Tuan","Nejdl, Wolfgang"],"emails":["","anhtuan.tran2@de.bosch.com",""],"author_id":["tu-nguyen","tuan-tran","wolfgang-nejdl"],"abstract":"Measuring entity relatedness is a fundamental task for many natural language processing and information retrieval applications. Prior work often studies entity relatedness in a static setting and unsupervised manner. However, entities in real-world are often involved in many different relationships, consequently entity relations are very dynamic over time. In this work, we propose a neural network-based approach that leverages public attention as supervision. Our model is capable of learning rich and different entity representations in a joint framework. Through extensive experiments on large-scale datasets, we demonstrate that our method achieves better results than competitive baselines.","pages":"31--41","doi":"10.18653\/v1\/K18-1004","url":"https:\/\/www.aclweb.org\/anthology\/K18-1004","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1005","title":"A Unified Neural Network Model for Geolocating {T}witter Users","authors":["Ebrahimi, Mohammad","ShafieiBavani, Elaheh","Wong, Raymond","Chen, Fang"],"emails":["mohammade@cse.unsw.edu.au","elahehs@cse.unsw.edu.au","wong@cse.unsw.edu.au","fang@cse.unsw.edu.au"],"author_id":["mohammad-ebrahimi","elaheh-shafieibavani","raymond-wong","fang-chen"],"abstract":"Locations of social media users are important to many applications such as rapid disaster response, targeted advertisement, and news recommendation. However, many users do not share their exact geographical coordinates due to reasons such as privacy concerns. The lack of explicit location information has motivated a growing body of research in recent years looking at different automatic ways of determining the user{'}s primary location. In this paper, we propose a unified user geolocation method which relies on a fusion of neural networks. Our joint model incorporates different types of available information including tweet text, user network, and metadata to predict users{'} locations. Moreover, we utilize a bidirectional LSTM network augmented with an attention mechanism to identify the most location indicative words in textual content of tweets. The experiments demonstrate that our approach achieves state-of-the-art performance over two Twitter benchmark geolocation datasets. We also conduct an ablation study to evaluate the contribution of each type of information in user geolocation performance.","pages":"42--53","doi":"10.18653\/v1\/K18-1005","url":"https:\/\/www.aclweb.org\/anthology\/K18-1005","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1006","title":"Corpus-Driven Thematic Hierarchy Induction","authors":["Kuznetsov, Ilia","Gurevych, Iryna"],"emails":["",""],"author_id":["ilia-kuznetsov","iryna-gurevych"],"abstract":"Thematic role hierarchy is a widely used linguistic tool to describe interactions between semantic roles and their syntactic realizations. Despite decades of dedicated research and numerous thematic hierarchy suggestions in the literature, this concept has not been used in NLP so far due to incompatibility and limited scope of existing hierarchies. We introduce an empirical framework for thematic hierarchy induction and evaluate several role ranking strategies on English and German full-text corpus data. We hypothesize that global thematic hierarchy induction is feasible, that a hierarchy can be induced from just fractions of training data and that resulting hierarchies apply cross-lingually. We evaluate these assumptions empirically.","pages":"54--64","doi":"10.18653\/v1\/K18-1006","url":"https:\/\/www.aclweb.org\/anthology\/K18-1006","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1007","title":"Adversarially Regularising Neural {NLI} Models to Integrate Logical Background Knowledge","authors":["Minervini, Pasquale","Riedel, Sebastian"],"emails":["p.minervini@cs.ucl.ac.uk","s.riedel@cs.ucl.ac.uk"],"author_id":["pasquale-minervini","sebastian-riedel"],"abstract":"Adversarial examples are inputs to machine learning models designed to cause the model to make a mistake. They are useful for understanding the shortcomings of machine learning models, interpreting their results, and for regularisation. In NLP, however, most example generation strategies produce input text by using known, pre-specified semantic transformations, requiring significant manual effort and in-depth understanding of the problem and domain. In this paper, we investigate the problem of automatically generating adversarial examples that violate a set of given First-Order Logic constraints in Natural Language Inference (NLI). We reduce the problem of identifying such adversarial examples to a combinatorial optimisation problem, by maximising a quantity measuring the degree of violation of such constraints and by using a language model for generating linguistically-plausible examples. Furthermore, we propose a method for adversarially regularising neural NLI models for incorporating background knowledge. Our results show that, while the proposed method does not always improve results on the SNLI and MultiNLI datasets, it significantly and consistently increases the predictive accuracy on adversarially-crafted datasets {--} up to a 79.6{\\%} relative improvement {--} while drastically reducing the number of background knowledge violations. Furthermore, we show that adversarial examples transfer among model architectures, and that the proposed adversarial training procedure improves the robustness of NLI models to adversarial examples.","pages":"65--74","doi":"10.18653\/v1\/K18-1007","url":"https:\/\/www.aclweb.org\/anthology\/K18-1007","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1008","title":"From Strings to Other Things: Linking the Neighborhood and Transposition Effects in Word Reading","authors":["Tulkens, St{\\'e}phan","Sandra, Dominiek","Daelemans, Walter"],"emails":["stephan.tulkens@uantwerpen.be","dominiek.sandra@uantwerpen.be","walter.daelemans@uantwerpen.be"],"author_id":["stephan-tulkens","dominiek-sandra","walter-daelemans"],"abstract":"We investigate the relation between the transposition and deletion effects in word reading, i.e., the finding that readers can successfully read {``}SLAT{''} as {``}SALT{''}, or {``}WRK{''} as {``}WORK{''}, and the neighborhood effect. In particular, we investigate whether lexical orthographic neighborhoods take into account transposition and deletion in determining neighbors. If this is the case, it is more likely that the neighborhood effect takes place early during processing, and does not solely rely on similarity of internal representations. We introduce a new neighborhood measure, rd20, which can be used to quantify neighborhood effects over arbitrary feature spaces. We calculate the rd20 over large sets of words in three languages using various feature sets and show that feature sets that do not allow for transposition or deletion explain more variance in Reaction Time (RT) measurements. We also show that the rd20 can be calculated using the hidden state representations of an Multi-Layer Perceptron, and show that these explain less variance than the raw features. We conclude that the neighborhood effect is unlikely to have a perceptual basis, but is more likely to be the result of items co-activating after recognition. All code is available at: \\url{www.github.com\/clips\/conll2018}","pages":"75--85","doi":"10.18653\/v1\/K18-1008","url":"https:\/\/www.aclweb.org\/anthology\/K18-1008","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1009","title":"Global Attention for Name Tagging","authors":["Zhang, Boliang","Whitehead, Spencer","Huang, Lifu","Ji, Heng"],"emails":["zhangb8@rpi.edu","whites5@rpi.edu","huangl7@rpi.edu","jih@rpi.edu"],"author_id":["boliang-zhang","spencer-whitehead","lifu-huang","heng-ji"],"abstract":"Many name tagging approaches use local contextual information with much success, but can fail when the local context is ambiguous or limited. We present a new framework to improve name tagging by utilizing local, document-level, and corpus-level contextual information. For each word, we retrieve document-level context from other sentences within the same document and corpus-level context from sentences in other documents. We propose a model that learns to incorporate document-level and corpus-level contextual information alongside local contextual information via document-level and corpus-level attentions, which dynamically weight their respective contextual information and determines the influence of this information through gating mechanisms. Experiments on benchmark datasets show the effectiveness of our approach, which achieves state-of-the-art results for Dutch, German, and Spanish on the CoNLL-2002 and CoNLL-2003 datasets. We will make our code and pre-trained models publicly available for research purposes.","pages":"86--96","doi":"10.18653\/v1\/K18-1009","url":"https:\/\/www.aclweb.org\/anthology\/K18-1009","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1010","title":"Pervasive Attention: 2{D} Convolutional Neural Networks for Sequence-to-Sequence Prediction","authors":["Elbayad, Maha","Besacier, Laurent","Verbeek, Jakob"],"emails":["firstname.lastname@inria.fr","maha.elbayad@univ-grenoble-alpes.fr","jakob.verbeek@univ-grenoble-alpes.fr"],"author_id":["maha-elbayad","laurent-besacier","jakob-verbeek"],"abstract":"Current state-of-the-art machine translation systems are based on encoder-decoder architectures, that first encode the input sequence, and then generate an output sequence based on the input encoding. Both are interfaced with an attention mechanism that recombines a fixed encoding of the source tokens based on the decoder state. We propose an alternative approach which instead relies on a single 2D convolutional neural network across both sequences. Each layer of our network re-codes source tokens on the basis of the output sequence produced so far. Attention-like properties are therefore pervasive throughout the network. Our model yields excellent results, outperforming state-of-the-art encoder-decoder systems, while being conceptually simpler and having fewer parameters.","pages":"97--107","doi":"10.18653\/v1\/K18-1010","url":"https:\/\/www.aclweb.org\/anthology\/K18-1010","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1011","title":"Comparing Attention-Based Convolutional and Recurrent Neural Networks: Success and Limitations in Machine Reading Comprehension","authors":["Blohm, Matthias","Jagfeld, Glorianna","Sood, Ekta","Yu, Xiang","Vu, Ngoc Thang"],"emails":["blohmms@ims.uni-stuttgart.de","jagfelga@ims.uni-stuttgart.de","soodea@ims.uni-stuttgart.de","xiangyu@ims.uni-stuttgart.de","thangvu@ims.uni-stuttgart.de"],"author_id":["matthias-blohm","glorianna-jagfeld","ekta-sood","xiang-yu","ngoc-thang-vu"],"abstract":"We propose a machine reading comprehension model based on the compare-aggregate framework with two-staged attention that achieves state-of-the-art results on the MovieQA question answering dataset. To investigate the limitations of our model as well as the behavioral difference between convolutional and recurrent neural networks, we generate adversarial examples to confuse the model and compare to human performance. Furthermore, we assess the generalizability of our model by analyzing its differences to human inference, drawing upon insights from cognitive science.","pages":"108--118","doi":"10.18653\/v1\/K18-1011","url":"https:\/\/www.aclweb.org\/anthology\/K18-1011","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1012","title":"Uncovering Code-Mixed Challenges: A Framework for Linguistically Driven Question Generation and Neural Based Question Answering","authors":["Gupta, Deepak","Lenka, Pabitra","Ekbal, Asif","Bhattacharyya, Pushpak"],"emails":["deepak.pcs16@iitp.ac.in","pabitra.lenka18@gmail.com","asif@iitp.ac.in","pb@iitp.ac.in"],"author_id":["deepak-gupta","pabitra-lenka","asif-ekbal","pushpak-bhattacharyya"],"abstract":"Existing research on question answering (QA) and comprehension reading (RC) are mainly focused on the resource-rich language like English. In recent times, the rapid growth of multi-lingual web content has posed several challenges to the existing QA systems. Code-mixing is one such challenge that makes the task more complex. In this paper, we propose a linguistically motivated technique for code-mixed question generation (CMQG) and a neural network based architecture for code-mixed question answering (CMQA). For evaluation, we manually create the code-mixed questions for Hindi-English language pair. In order to show the effectiveness of our neural network based CMQA technique, we utilize two benchmark datasets, SQuAD and MMQA. Experiments show that our proposed model achieves encouraging performance on CMQG and CMQA.","pages":"119--130","doi":"10.18653\/v1\/K18-1012","url":"https:\/\/www.aclweb.org\/anthology\/K18-1012","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1013","title":"Learning to Embed Semantic Correspondence for Natural Language Understanding","authors":["Jung, Sangkeun","Lee, Jinsik","Kim, Jiwon"],"emails":["1hugmanskj@gmail.com","jinsik16.lee@sktbrain.com","jk@sktbrain.com"],"author_id":["sangkeun-jung","jinsik-lee","jiwon-kim"],"abstract":"While learning embedding models has yielded fruitful results in several NLP subfields, most notably Word2Vec, embedding correspondence has relatively not been well explored especially in the context of natural language understanding (NLU), a task that typically extracts structured semantic knowledge from a text. A NLU embedding model can facilitate analyzing and understanding relationships between unstructured texts and their corresponding structured semantic knowledge, essential for both researchers and practitioners of NLU. Toward this end, we propose a framework that learns to embed semantic correspondence between text and its extracted semantic knowledge, called semantic frame. One key contributed technique is semantic frame reconstruction used to derive a one-to-one mapping between embedded vectors and their corresponding semantic frames. Embedding into semantically meaningful vectors and computing their distances in vector space provides a simple, but effective way to measure semantic similarities. With the proposed framework, we demonstrate three key areas where the embedding model can be effective: visualization, semantic search and re-ranking.","pages":"131--140","doi":"10.18653\/v1\/K18-1013","url":"https:\/\/www.aclweb.org\/anthology\/K18-1013","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1014","title":"Commonsense Knowledge Base Completion and Generation","authors":["Saito, Itsumi","Nishida, Kyosuke","Asano, Hisako","Tomita, Junji"],"emails":["saito.itsumi@lab.ntt.co.jp","nishida.kyosuke@lab.ntt.co.jp","asano.hisako@lab.ntt.co.jp","tomita.junji@lab.ntt.co.jp"],"author_id":["itsumi-saito","kyosuke-nishida","hisako-asano","junji-tomita"],"abstract":"This study focuses on acquisition of commonsense knowledge. A previous study proposed a commonsense knowledge base completion (CKB completion) method that predicts a confidence score of for triplet-style knowledge for improving the coverage of CKBs. To improve the accuracy of CKB completion and expand the size of CKBs, we formulate a new commonsense knowledge base generation task (CKB generation) and propose a joint learning method that incorporates both CKB completion and CKB generation. Experimental results show that the joint learning method improved completion accuracy and the generation model created reasonable knowledge. Our generation model could also be used to augment data and improve the accuracy of completion.","pages":"141--150","doi":"10.18653\/v1\/K18-1014","url":"https:\/\/www.aclweb.org\/anthology\/K18-1014","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1015","title":"Active Learning for Interactive Neural Machine Translation of Data Streams","authors":["Peris, {\\'A}lvaro","Casacuberta, Francisco"],"emails":["lvapeab@prhlt.upv.es","fcn@prhlt.upv.es"],"author_id":["alvaro-peris","francisco-casacuberta"],"abstract":"We study the application of active learning techniques to the translation of unbounded data streams via interactive neural machine translation. The main idea is to select, from an unbounded stream of source sentences, those worth to be supervised by a human agent. The user will interactively translate those samples. Once validated, these data is useful for adapting the neural machine translation model. We propose two novel methods for selecting the samples to be validated. We exploit the information from the attention mechanism of a neural machine translation system. Our experiments show that the inclusion of active learning techniques into this pipeline allows to reduce the effort required during the process, while increasing the quality of the translation system. Moreover, it enables to balance the human effort required for achieving a certain translation quality. Moreover, our neural system outperforms classical approaches by a large margin.","pages":"151--160","doi":"10.18653\/v1\/K18-1015","url":"https:\/\/www.aclweb.org\/anthology\/K18-1015","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1016","title":"Churn Intent Detection in Multilingual Chatbot Conversations and Social Media","authors":["Abbet, Christian","M{'}hamdi, Meryem","Giannakopoulos, Athanasios","West, Robert","Hossmann, Andreea","Baeriswyl, Michael","Musat, Claudiu"],"emails":["","ame@swisscom.com","","","","ame@epfl.ch",""],"author_id":["christian-abbet","meryem-mhamdi","athanasios-giannakopoulos","robert-west","andreea-hossmann","michael-baeriswyl","claudiu-musat"],"abstract":"We propose a new method to detect when users express the intent to leave a service, also known as churn. While previous work focuses solely on social media, we show that this intent can be detected in chatbot conversations. As companies increasingly rely on chatbots they need an overview of potentially churny users. To this end, we crowdsource and publish a dataset of churn intent expressions in chatbot interactions in German and English. We show that classifiers trained on social media data can detect the same intent in the context of chatbots. We introduce a classification architecture that outperforms existing work on churn intent detection in social media. Moreover, we show that, using bilingual word embeddings, a system trained on combined English and German data outperforms monolingual approaches. As the only existing dataset is in English, we crowdsource and publish a novel dataset of German tweets. We thus underline the universal aspect of the problem, as examples of churn intent in English help us identify churn in German tweets and chatbot conversations.","pages":"161--170","doi":"10.18653\/v1\/K18-1016","url":"https:\/\/www.aclweb.org\/anthology\/K18-1016","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1017","title":"Learning Text Representations for 500{K} Classification Tasks on Named Entity Disambiguation","authors":["Barrena, Ander","Soroa, Aitor","Agirre, Eneko"],"emails":["ander.barrena@ehu.eus","a.soroa@ehu.eus","e.agirre@ehu.eus"],"author_id":["ander-barrena","aitor-soroa","eneko-agirre"],"abstract":"Named Entity Disambiguation algorithms typically learn a single model for all target entities. In this paper we present a word expert model and train separate deep learning models for each target entity string, yielding 500K classification tasks. This gives us the opportunity to benchmark popular text representation alternatives on this massive dataset. In order to face scarce training data we propose a simple data-augmentation technique and transfer-learning. We show that bag-of-word-embeddings are better than LSTMs for tasks with scarce training data, while the situation is reversed when having larger amounts. Transferring a LSTM which is learned on all datasets is the most effective context representation option for the word experts in all frequency bands. The experiments show that our system trained on out-of-domain Wikipedia data surpass comparable NED systems which have been trained on in-domain training data.","pages":"171--180","doi":"10.18653\/v1\/K18-1017","url":"https:\/\/www.aclweb.org\/anthology\/K18-1017","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1018","title":"Hierarchical Attention Based Position-Aware Network for Aspect-Level Sentiment Analysis","authors":["Li, Lishuang","Liu, Yang","Zhou, AnQiao"],"emails":["","",""],"author_id":["lishuang-li","yang-liu","anqiao-zhou"],"abstract":"Aspect-level sentiment analysis aims to identify the sentiment of a specific target in its context. Previous works have proved that the interactions between aspects and the contexts are important. On this basis, we also propose a succinct hierarchical attention based mechanism to fuse the information of targets and the contextual words. In addition, most existing methods ignore the position information of the aspect when encoding the sentence. In this paper, we argue that the position-aware representations are beneficial to this task. Therefore, we propose a hierarchical attention based position-aware network (HAPN), which introduces position embeddings to learn the position-aware representations of sentences and further generate the target-specific representations of contextual words. The experimental results on SemEval 2014 dataset show that our approach outperforms the state-of-the-art methods.","pages":"181--189","doi":"10.18653\/v1\/K18-1018","url":"https:\/\/www.aclweb.org\/anthology\/K18-1018","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1019","title":"Bidirectional Generative Adversarial Networks for Neural Machine Translation","authors":["Zhang, Zhirui","Liu, Shujie","Li, Mu","Zhou, Ming","Chen, Enhong"],"emails":["zrustc11@gmail.com","shujliu@microsoft.com","limugx@outlook.com","mingzhou@microsoft.com","cheneh@ustc.edu.cn"],"author_id":["zhirui-zhang","shujie-liu","mu-li","ming-zhou","enhong-chen"],"abstract":"Generative Adversarial Network (GAN) has been proposed to tackle the exposure bias problem of Neural Machine Translation (NMT). However, the discriminator typically results in the instability of the GAN training due to the inadequate training problem: the search space is so huge that sampled translations are not sufficient for discriminator training. To address this issue and stabilize the GAN training, in this paper, we propose a novel Bidirectional Generative Adversarial Network for Neural Machine Translation (BGAN-NMT), which aims to introduce a generator model to act as the discriminator, whereby the discriminator naturally considers the entire translation space so that the inadequate training problem can be alleviated. To satisfy this property, generator and discriminator are both designed to model the joint probability of sentence pairs, with the difference that, the generator decomposes the joint probability with a source language model and a source-to-target translation model, while the discriminator is formulated as a target language model and a target-to-source translation model. To further leverage the symmetry of them, an auxiliary GAN is introduced and adopts generator and discriminator models of original one as its own discriminator and generator respectively. Two GANs are alternately trained to update the parameters. Experiment results on German-English and Chinese-English translation tasks demonstrate that our method not only stabilizes GAN training but also achieves significant improvements over baseline systems.","pages":"190--199","doi":"10.18653\/v1\/K18-1019","url":"https:\/\/www.aclweb.org\/anthology\/K18-1019","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1020","title":"Latent Entities Extraction: How to Extract Entities that Do Not Appear in the Text?","authors":["Shoshan, Eylon","Radinsky, Kira"],"emails":["eylonsho999@cs.technion.ac.il","kirar@cs.technion.ac.il"],"author_id":["eylon-shoshan","kira-radinsky"],"abstract":"Named-entity Recognition (NER) is an important task in the NLP field , and is widely used to solve many challenges. However, in many scenarios, not all of the entities are explicitly mentioned in the text. Sometimes they could be inferred from the context or from other indicative words. Consider the following sentence: {``}CMA can easily hydrolyze into free acetic acid.{''} Although water is not mentioned explicitly, one can infer that H2O is an entity involved in the process. In this work, we present the problem of Latent Entities Extraction (LEE). We present several methods for determining whether entities are discussed in a text, even though, potentially, they are not explicitly written. Specifically, we design a neural model that handles extraction of multiple entities jointly. We show that our model, along with multi-task learning approach and a novel task grouping algorithm, reaches high performance in identifying latent entities. Our experiments are conducted on a large biological dataset from the biochemical field. The dataset contains text descriptions of biological processes, and for each process, all of the involved entities in the process are labeled, including implicitly mentioned ones. We believe LEE is a task that will significantly improve many NER and subsequent applications and improve text understanding and inference.","pages":"200--210","doi":"10.18653\/v1\/K18-1020","url":"https:\/\/www.aclweb.org\/anthology\/K18-1020","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1021","title":"Generalizing {P}rocrustes Analysis for Better Bilingual Dictionary Induction","authors":["Kementchedjhieva, Yova","Ruder, Sebastian","Cotterell, Ryan","S{\\o}gaard, Anders"],"emails":["yova@di.ku.dk","sebastian@ruder.io","ryan.cotterell@gmail.com","soegaard@di.ku.dk"],"author_id":["yova-kementchedjhieva","sebastian-ruder","ryan-cotterell","anders-sogaard"],"abstract":"Most recent approaches to bilingual dictionary induction find a linear alignment between the word vector spaces of two languages. We show that projecting the two languages onto a third, latent space, rather than directly onto each other, while equivalent in terms of expressivity, makes it easier to learn approximate alignments. Our modified approach also allows for supporting languages to be included in the alignment process, to obtain an even better performance in low resource settings.","pages":"211--220","doi":"10.18653\/v1\/K18-1021","url":"https:\/\/www.aclweb.org\/anthology\/K18-1021","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1022","title":"Simple Unsupervised Keyphrase Extraction using Sentence Embeddings","authors":["Bennani-Smires, Kamil","Musat, Claudiu","Hossmann, Andreea","Baeriswyl, Michael","Jaggi, Martin"],"emails":["kamil.bennani-smires@swisscom.com","claudiu.musat@swisscom.com","andreea.hossmann@swisscom.com","michael.baeriswyl@swisscom.com","martin.jaggi@epfl.ch"],"author_id":["kamil-bennani-smires","claudiu-musat","andreea-hossmann","michael-baeriswyl","martin-jaggi"],"abstract":"Keyphrase extraction is the task of automatically selecting a small set of phrases that best describe a given free text document. Supervised keyphrase extraction requires large amounts of labeled training data and generalizes very poorly outside the domain of the training data. At the same time, unsupervised systems have poor accuracy, and often do not generalize well, as they require the input document to belong to a larger corpus also given as input. Addressing these drawbacks, in this paper, we tackle keyphrase extraction from single documents with EmbedRank: a novel unsupervised method, that leverages sentence embeddings. EmbedRank achieves higher F-scores than graph-based state of the art systems on standard datasets and is suitable for real-time processing of large amounts of Web data. With EmbedRank, we also explicitly increase coverage and diversity among the selected keyphrases by introducing an embedding-based maximal marginal relevance (MMR) for new phrases. A user study including over 200 votes showed that, although reducing the phrases{'} semantic overlap leads to no gains in F-score, our high diversity selection is preferred by humans.","pages":"221--229","doi":"10.18653\/v1\/K18-1022","url":"https:\/\/www.aclweb.org\/anthology\/K18-1022","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1023","title":"A Temporally Sensitive Submodularity Framework for Timeline Summarization","authors":["Martschat, Sebastian","Markert, Katja"],"emails":["sebastian.martschat@basf.com","markert@cl.uni-heidelberg.de"],"author_id":["sebastian-martschat","katja-markert"],"abstract":"Timeline summarization (TLS) creates an overview of long-running events via dated daily summaries for the most important dates. TLS differs from standard multi-document summarization (MDS) in the importance of date selection, interdependencies between summaries of different dates and by having very short summaries compared to the number of corpus documents. However, we show that MDS optimization models using submodular functions can be adapted to yield well-performing TLS models by designing objective functions and constraints that model the temporal dimension inherent in TLS. Importantly, these adaptations retain the elegance and advantages of the original MDS models (clear separation of features and inference, performance guarantees and scalability, little need for supervision) that current TLS-specific models lack.","pages":"230--240","doi":"10.18653\/v1\/K18-1023","url":"https:\/\/www.aclweb.org\/anthology\/K18-1023","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1024","title":"{C}hinese Poetry Generation with a Salient-Clue Mechanism","authors":["Yi, Xiaoyuan","Li, Ruoyu","Sun, Maosong"],"emails":["yi-xy16@mails.tsinghua.edu.cn","liruoyu@6estates.com","sms@mail.tsinghua.edu.cn"],"author_id":["xiaoyuan-yi","ruoyu-li","maosong-sun"],"abstract":"As a precious part of the human cultural heritage, Chinese poetry has influenced people for generations. Automatic poetry composition is a challenge for AI. In recent years, significant progress has been made in this area benefiting from the development of neural networks. However, the coherence in meaning, theme or even artistic conception for a generated poem as a whole still remains a big problem. In this paper, we propose a novel Salient-Clue mechanism for Chinese poetry generation. Different from previous work which tried to exploit all the context information, our model selects the most salient characters automatically from each so-far generated line to gradually form a salient clue, which is utilized to guide successive poem generation process so as to eliminate interruptions and improve coherence. Besides, our model can be flexibly extended to control the generated poem in different aspects, for example, poetry style, which further enhances the coherence. Experimental results show that our model is very effective, outperforming three strong baselines.","pages":"241--250","doi":"10.18653\/v1\/K18-1024","url":"https:\/\/www.aclweb.org\/anthology\/K18-1024","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1025","title":"Multi-Modal Sequence Fusion via Recursive Attention for Emotion Recognition","authors":["Beard, Rory","Das, Ritwik","Ng, Raymond W. M.","Gopalakrishnan, P. G. Keerthana","Eerens, Luka","Swietojanski, Pawel","Miksik, Ondrej"],"emails":["","","","","","",""],"author_id":["rory-beard","ritwik-das","raymond-w-m-ng","p-g-keerthana-gopalakrishnan","luka-eerens","pawel-swietojanski","ondrej-miksik"],"abstract":"Natural human communication is nuanced and inherently multi-modal. Humans possess specialised sensoria for processing vocal, visual, and linguistic, and para-linguistic information, but form an intricately fused percept of the multi-modal data stream to provide a holistic representation. Analysis of emotional content in face-to-face communication is a cognitive task to which humans are particularly attuned, given its sociological importance, and poses a difficult challenge for machine emulation due to the subtlety and expressive variability of cross-modal cues. Inspired by the empirical success of recent so-called End-To-End Memory Networks and related works, we propose an approach based on recursive multi-attention with a shared external memory updated over multiple gated iterations of analysis. We evaluate our model across several large multi-modal datasets and show that global contextualised memory with gated memory update can effectively achieve emotion recognition.","pages":"251--259","doi":"10.18653\/v1\/K18-1025","url":"https:\/\/www.aclweb.org\/anthology\/K18-1025","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1026","title":"Using Sparse Semantic Embeddings Learned from Multimodal Text and Image Data to Model Human Conceptual Knowledge","authors":["Derby, Steven","Miller, Paul","Murphy, Brian","Devereux, Barry"],"emails":["sderby02@qub.ac.uk","p.miller@qub.ac.uk","brian.murphy@qub.ac.uk","b.devereux@qub.ac.uk"],"author_id":["steven-derby","paul-miller","brian-murphy","barry-devereux"],"abstract":"Distributional models provide a convenient way to model semantics using dense embedding spaces derived from unsupervised learning algorithms. However, the dimensions of dense embedding spaces are not designed to resemble human semantic knowledge. Moreover, embeddings are often built from a single source of information (typically text data), even though neurocognitive research suggests that semantics is deeply linked to both language and perception. In this paper, we combine multimodal information from both text and image-based representations derived from state-of-the-art distributional models to produce sparse, interpretable vectors using Joint Non-Negative Sparse Embedding. Through in-depth analyses comparing these sparse models to human-derived behavioural and neuroimaging data, we demonstrate their ability to predict interpretable linguistic descriptions of human ground-truth semantic knowledge.","pages":"260--270","doi":"10.18653\/v1\/K18-1026","url":"https:\/\/www.aclweb.org\/anthology\/K18-1026","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1027","title":"Similarity Dependent {C}hinese Restaurant Process for Cognate Identification in Multilingual Wordlists","authors":["Rama, Taraka"],"emails":["tarakark@ifi.uio.no"],"author_id":["taraka-rama"],"abstract":"We present and evaluate two similarity dependent Chinese Restaurant Process (sd-CRP) algorithms at the task of automated cognate detection. The sd-CRP clustering algorithms do not require any predefined threshold for detecting cognate sets in a multilingual word list. We evaluate the performance of the algorithms on six language families (more than 750 languages) and find that both the sd-CRP variants performs as well as InfoMap and better than UPGMA at the task of inferring cognate clusters. The algorithms presented in this paper are family agnostic and can be applied to any linguistically under-studied language family.","pages":"271--281","doi":"10.18653\/v1\/K18-1027","url":"https:\/\/www.aclweb.org\/anthology\/K18-1027","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1028","title":"Uncovering Divergent Linguistic Information in Word Embeddings with Lessons for Intrinsic and Extrinsic Evaluation","authors":["Artetxe, Mikel","Labaka, Gorka","Lopez-Gazpio, I{\\~n}igo","Agirre, Eneko"],"emails":["mikel.artetxe@ehu.eus","gorka.labaka@ehu.eus","inigo.lopez@ehu.eus","e.agirre@ehu.eus"],"author_id":["mikel-artetxe","gorka-labaka","inigo-lopez-gazpio","eneko-agirre"],"abstract":"Following the recent success of word embeddings, it has been argued that there is no such thing as an ideal representation for words, as different models tend to capture divergent and often mutually incompatible aspects like semantics\/syntax and similarity\/relatedness. In this paper, we show that each embedding model captures more information than directly apparent. A linear transformation that adjusts the similarity order of the model without any external resource can tailor it to achieve better results in those aspects, providing a new perspective on how embeddings encode divergent linguistic information. In addition, we explore the relation between intrinsic and extrinsic evaluation, as the effect of our transformations in downstream tasks is higher for unsupervised systems than for supervised ones.","pages":"282--291","doi":"10.18653\/v1\/K18-1028","url":"https:\/\/www.aclweb.org\/anthology\/K18-1028","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1029","title":"Comparing Models of Associative Meaning: An Empirical Investigation of Reference in Simple Language Games","authors":["Shen, Judy Hanwen","Hofer, Matthias","Felbo, Bjarke","Levy, Roger"],"emails":["judyshen@mit.edu","mhofer@mit.edu","felbo@mit.edu","rplevy@mit.edu"],"author_id":["judy-hanwen-shen","matthias-hofer","bjarke-felbo","roger-levy"],"abstract":"Simple reference games are of central theoretical and empirical importance in the study of situated language use. Although language provides rich, compositional truth-conditional semantics to facilitate reference, speakers and listeners may sometimes lack the overall lexical and cognitive resources to guarantee successful reference through these means alone. However, language also has rich associational structures that can serve as a further resource for achieving successful reference. Here we investigate this use of associational information in a setting where only associational information is available: a simplified version of the popular game Codenames. Using optimal experiment design techniques, we compare a range of models varying in the type of associative information deployed and in level of pragmatic sophistication against human behavior. In this setting we find that listeners{'} behavior reflects direct bigram collocational associations more strongly than word-embedding or semantic knowledge graph-based associations and that there is little evidence for pragmatically sophisticated behavior on the part of either speakers or listeners. More generally, we demonstrate the effective use of simple tasks to derive insights into the nature of complex linguistic phenomena.","pages":"292--301","doi":"10.18653\/v1\/K18-1029","url":"https:\/\/www.aclweb.org\/anthology\/K18-1029","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1030","title":"Sequence Classification with Human Attention","authors":["Barrett, Maria","Bingel, Joachim","Hollenstein, Nora","Rei, Marek","S{\\o}gaard, Anders"],"emails":["barrett@hum.ku.dk","bingel@di.ku.dk","noraho@ethz.ch","marek.rei@cl.cam.ac.uk","soegaard@di.ku.dk"],"author_id":["maria-barrett","joachim-bingel","nora-hollenstein","marek-rei","anders-sogaard"],"abstract":"Learning attention functions requires large volumes of data, but many NLP tasks simulate human behavior, and in this paper, we show that human attention really does provide a good inductive bias on many attention functions in NLP. Specifically, we use estimated human attention derived from eye-tracking corpora to regularize attention functions in recurrent neural networks. We show substantial improvements across a range of tasks, including sentiment analysis, grammatical error detection, and detection of abusive language.","pages":"302--312","doi":"10.18653\/v1\/K18-1030","url":"https:\/\/www.aclweb.org\/anthology\/K18-1030","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1031","title":"Sentence-Level Fluency Evaluation: References Help, But Can Be Spared!","authors":["Kann, Katharina","Rothe, Sascha","Filippova, Katja"],"emails":["kann@nyu.edu","rothe@google.com","katjaf@google.com"],"author_id":["katharina-kann","sascha-rothe","katja-filippova"],"abstract":"Motivated by recent findings on the probabilistic modeling of acceptability judgments, we propose syntactic log-odds ratio (SLOR), a normalized language model score, as a metric for referenceless fluency evaluation of natural language generation output at the sentence level. We further introduce WPSLOR, a novel WordPiece-based version, which harnesses a more compact language model. Even though word-overlap metrics like ROUGE are computed with the help of hand-written references, our referenceless methods obtain a significantly higher correlation with human fluency scores on a benchmark dataset of compressed sentences. Finally, we present ROUGE-LM, a reference-based metric which is a natural extension of WPSLOR to the case of available references. We show that ROUGE-LM yields a significantly higher correlation with human judgments than all baseline metrics, including WPSLOR on its own.","pages":"313--323","doi":"10.18653\/v1\/K18-1031","url":"https:\/\/www.aclweb.org\/anthology\/K18-1031","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1032","title":"Predefined Sparseness in Recurrent Sequence Models","authors":["Demeester, Thomas","Deleu, Johannes","Godin, Fr{\\'e}deric","Develder, Chris"],"emails":["thomas.demeester@ugent.be","johannes.deleu@ugent.be","fr{\\'e}deric.godin@ugent.be","chris.develder@ugent.be"],"author_id":["thomas-demeester","johannes-deleu","frederic-godin","chris-develder"],"abstract":"Inducing sparseness while training neural networks has been shown to yield models with a lower memory footprint but similar effectiveness to dense models. However, sparseness is typically induced starting from a dense model, and thus this advantage does not hold during training. We propose techniques to enforce sparseness upfront in recurrent sequence models for NLP applications, to also benefit training. First, in language modeling, we show how to increase hidden state sizes in recurrent layers without increasing the number of parameters, leading to more expressive models. Second, for sequence labeling, we show that word embeddings with predefined sparseness lead to similar performance as dense embeddings, at a fraction of the number of trainable parameters.","pages":"324--333","doi":"10.18653\/v1\/K18-1032","url":"https:\/\/www.aclweb.org\/anthology\/K18-1032","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1033","title":"Learning to Actively Learn Neural Machine Translation","authors":["Liu, Ming","Buntine, Wray","Haffari, Gholamreza"],"emails":["ming.m.liu@monash.edu","wray.buntine@monash.edu","gholamreza.haffari@monash.edu"],"author_id":["ming-liu","wray-buntine","gholamreza-haffari"],"abstract":"Traditional active learning (AL) methods for machine translation (MT) rely on heuristics. However, these heuristics are limited when the characteristics of the MT problem change due to e.g. the language pair or the amount of the initial bitext. In this paper, we present a framework to learn sentence selection strategies for neural MT. We train the AL query strategy using a high-resource language-pair based on AL simulations, and then transfer it to the low-resource language-pair of interest. The learned query strategy capitalizes on the shared characteristics between the language pairs to make an effective use of the AL budget. Our experiments on three language-pairs confirms that our method is more effective than strong heuristic-based methods in various conditions, including cold-start and warm-start as well as small and extremely small data conditions.","pages":"334--344","doi":"10.18653\/v1\/K18-1033","url":"https:\/\/www.aclweb.org\/anthology\/K18-1033","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1034","title":"Upcycle Your {OCR}: Reusing {OCR}s for Post-{OCR} Text Correction in {R}omanised {S}anskrit","authors":["Krishna, Amrith","Majumder, Bodhisattwa P.","Bhat, Rajesh","Goyal, Pawan"],"emails":["amrith@iitkgp.ac.in","bmajumde@eng.ucsd.edu","rajeshbhatpesit@gmail.com","pawang@cse.iitkgp.ernet.in"],"author_id":["amrith-krishna","bodhisattwa-p-majumder","rajesh-bhat","pawan-goyal"],"abstract":"We propose a post-OCR text correction approach for digitising texts in Romanised Sanskrit. Owing to the lack of resources our approach uses OCR models trained for other languages written in Roman. Currently, there exists no dataset available for Romanised Sanskrit OCR. So, we bootstrap a dataset of 430 images, scanned in two different settings and their corresponding ground truth. For training, we synthetically generate training images for both the settings. We find that the use of copying mechanism (Gu et al., 2016) yields a percentage increase of 7.69 in Character Recognition Rate (CRR) than the current state of the art model in solving monotone sequence-to-sequence tasks (Schnober et al., 2016). We find that our system is robust in combating OCR-prone errors, as it obtains a CRR of 87.01{\\%} from an OCR output with CRR of 35.76{\\%} for one of the dataset settings. A human judgement survey performed on the models shows that our proposed model results in predictions which are faster to comprehend and faster to improve for a human than the other systems.","pages":"345--355","doi":"10.18653\/v1\/K18-1034","url":"https:\/\/www.aclweb.org\/anthology\/K18-1034","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1035","title":"Weakly-Supervised Neural Semantic Parsing with a Generative Ranker","authors":["Cheng, Jianpeng","Lapata, Mirella"],"emails":["jianpeng.cheng@ed.ac.uk","mlap@inf.ed.ac.uk"],"author_id":["jianpeng-cheng","mirella-lapata"],"abstract":"Weakly-supervised semantic parsers are trained on utterance-denotation pairs, treating logical forms as latent. The task is challenging due to the large search space and spuriousness of logical forms. In this paper we introduce a neural parser-ranker system for weakly-supervised semantic parsing. The parser generates candidate tree-structured logical forms from utterances using clues of denotations. These candidates are then ranked based on two criterion: their likelihood of executing to the correct denotation, and their agreement with the utterance semantics. We present a scheduled training procedure to balance the contribution of the two objectives. Furthermore, we propose to use a neurally encoded lexicon to inject prior domain knowledge to the model. Experiments on three Freebase datasets demonstrate the effectiveness of our semantic parser, achieving results within the state-of-the-art range.","pages":"356--367","doi":"10.18653\/v1\/K18-1035","url":"https:\/\/www.aclweb.org\/anthology\/K18-1035","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1036","title":"Modeling Composite Labels for Neural Morphological Tagging","authors":["Tkachenko, Alexander","Sirts, Kairit"],"emails":["kairit.sirts@ut.ee","aleksandr.tkatsenko@ut.ee"],"author_id":["alexander-tkachenko","kairit-sirts"],"abstract":"Neural morphological tagging has been regarded as an extension to POS tagging task, treating each morphological tag as a monolithic label and ignoring its internal structure. We propose to view morphological tags as composite labels and explicitly model their internal structure in a neural sequence tagger. For this, we explore three different neural architectures and compare their performance with both CRF and simple neural multiclass baselines. We evaluate our models on 49 languages and show that the neural architecture that models the morphological labels as sequences of morphological category values performs significantly better than both baselines establishing state-of-the-art results in morphological tagging for most languages.","pages":"368--379","doi":"10.18653\/v1\/K18-1036","url":"https:\/\/www.aclweb.org\/anthology\/K18-1036","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1037","title":"Evolutionary Data Measures: Understanding the Difficulty of Text Classification Tasks","authors":["Collins, Edward","Rozanov, Nikolai","Zhang, Bingbing"],"emails":["ed@wluper.com","nikolai@wluper.com","bingbing@wluper.com"],"author_id":["edward-collins","nikolai-rozanov","bingbing-zhang"],"abstract":"Classification tasks are usually analysed and improved through new model architectures or hyperparameter optimisation but the underlying properties of datasets are discovered on an ad-hoc basis as errors occur. However, understanding the properties of the data is crucial in perfecting models. In this paper we analyse exactly which characteristics of a dataset best determine how difficult that dataset is for the task of text classification. We then propose an intuitive measure of difficulty for text classification datasets which is simple and fast to calculate. We empirically prove that this measure generalises to unseen data by comparing it to state-of-the-art datasets and results. This measure can be used to analyse the precise source of errors in a dataset and allows fast estimation of how difficult a dataset is to learn. We searched for this measure by training 12 classical and neural network based models on 78 real-world datasets, then use a genetic algorithm to discover the best measure of difficulty. Our difficulty-calculating code and datasets are publicly available.","pages":"380--391","doi":"10.18653\/v1\/K18-1037","url":"https:\/\/www.aclweb.org\/anthology\/K18-1037","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1038","title":"Vectorial Semantic Spaces Do Not Encode Human Judgments of Intervention Similarity","authors":["Merlo, Paola","Ackermann, Francesco"],"emails":["paola.merlo@unige.ch","francesco.ackermann@unige.ch"],"author_id":["paola-merlo","francesco-ackermann"],"abstract":"Despite their practical success and impressive performances, neural-network-based and distributed semantics techniques have often been criticized as they remain fundamentally opaque and difficult to interpret. In a vein similar to recent pieces of work investigating the linguistic abilities of these representations, we study another core, defining property of language: the property of long-distance dependencies. Human languages exhibit the ability to interpret discontinuous elements distant from each other in the string as if they were adjacent. This ability is blocked if a similar, but extraneous, element intervenes between the discontinuous components. We present results that show, under exhaustive and precise conditions, that one kind of word embeddings and the similarity spaces they define do not encode the properties of intervention similarity in long-distance dependencies, and that therefore they fail to represent this core linguistic notion.","pages":"392--401","doi":"10.18653\/v1\/K18-1038","url":"https:\/\/www.aclweb.org\/anthology\/K18-1038","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1039","title":"Lessons Learned in Multilingual Grounded Language Learning","authors":["K{\\'a}d{\\'a}r, {\\'A}kos","Elliott, Desmond","C{\\^o}t{\\'e}, Marc-Alexandre","Chrupa{\\l}a, Grzegorz","Alishahi, Afra"],"emails":["a.kadar@uvt.nl","de@di.ku.dk","macote@microsoft.com","g.chrupala@uvt.nl","a.alishahi@uvt.nl"],"author_id":["akos-kadar","desmond-elliott","marc-alexandre-cote","grzegorz-chrupala","afra-alishahi"],"abstract":"Recent work has shown how to learn better visual-semantic embeddings by leveraging image descriptions in more than one language. Here, we investigate in detail which conditions affect the performance of this type of grounded language learning model. We show that multilingual training improves over bilingual training, and that low-resource languages benefit from training with higher-resource languages. We demonstrate that a multilingual model can be trained equally well on either translations or comparable sentence pairs, and that annotating the same set of images in multiple language enables further improvements via an additional caption-caption ranking objective.","pages":"402--412","doi":"10.18653\/v1\/K18-1039","url":"https:\/\/www.aclweb.org\/anthology\/K18-1039","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1040","title":"Unsupervised Sentence Compression using Denoising Auto-Encoders","authors":["Fevry, Thibault","Phang, Jason"],"emails":["evry@nyu.edu","jasonphang@nyu.edu"],"author_id":["thibault-fevry","jason-phang"],"abstract":"In sentence compression, the task of shortening sentences while retaining the original meaning, models tend to be trained on large corpora containing pairs of verbose and compressed sentences. To remove the need for paired corpora, we emulate a summarization task and add noise to extend sentences and train a denoising auto-encoder to recover the original, constructing an end-to-end training regime without the need for any examples of compressed sentences. We conduct a human evaluation of our model on a standard text summarization dataset and show that it performs comparably to a supervised baseline based on grammatical correctness and retention of meaning. Despite being exposed to no target data, our unsupervised models learn to generate imperfect but reasonably readable sentence summaries. Although we underperform supervised models based on ROUGE scores, our models are competitive with a supervised baseline based on human evaluation for grammatical correctness and retention of meaning.","pages":"413--422","doi":"10.18653\/v1\/K18-1040","url":"https:\/\/www.aclweb.org\/anthology\/K18-1040","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1041","title":"Resources to Examine the Quality of Word Embedding Models Trained on n-Gram Data","authors":["Elekes, {\\'A}bel","Englhardt, Adrian","Sch{\\\"a}ler, Martin","B{\\\"o}hm, Klemens"],"emails":["abel.elekes@kit.edu","adrian.englhardt@kit.edu","martin.schaeler@kit.edu","klemens.boehm@kit.edu"],"author_id":["abel-elekes","adrian-englhardt","martin-schaler","klemens-bohm"],"abstract":"Word embeddings are powerful tools that facilitate better analysis of natural language. However, their quality highly depends on the resource used for training. There are various approaches relying on n-gram corpora, such as the Google n-gram corpus. However, n-gram corpora only offer a small window into the full text {--} 5 words for the Google corpus at best. This gives way to the concern whether the extracted word semantics are of high quality. In this paper, we address this concern with two contributions. First, we provide a resource containing 120 word-embedding models {--} one of the largest collection of embedding models. Furthermore, the resource contains the n-gramed versions of all used corpora, as well as our scripts used for corpus generation, model generation and evaluation. Second, we define a set of meaningful experiments allowing to evaluate the aforementioned quality differences. We conduct these experiments using our resource to show its usage and significance. The evaluation results confirm that one generally can expect high quality for n-grams with n {\\textgreater} 3.","pages":"423--432","doi":"10.18653\/v1\/K18-1041","url":"https:\/\/www.aclweb.org\/anthology\/K18-1041","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1042","title":"Linguistically-Based Deep Unstructured Question Answering","authors":["Aghaebrahimian, Ahmad"],"emails":["ebrahimian@ufal.mff.cuni.cz"],"author_id":["ahmad-aghaebrahimian"],"abstract":"In this paper, we propose a new linguistically-based approach to answering non-factoid open-domain questions from unstructured data. First, we elaborate on an architecture for textual encoding based on which we introduce a deep end-to-end neural model. This architecture benefits from a bilateral attention mechanism which helps the model to focus on a question and the answer sentence at the same time for phrasal answer extraction. Second, we feed the output of a constituency parser into the model directly and integrate linguistic constituents into the network to help it concentrate on chunks of an answer rather than on its single words for generating more natural output. By optimizing this architecture, we managed to obtain near-to-human-performance results and competitive to a state-of-the-art system on SQuAD and MS-MARCO datasets respectively.","pages":"433--443","doi":"10.18653\/v1\/K18-1042","url":"https:\/\/www.aclweb.org\/anthology\/K18-1042","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1043","title":"{DIMSIM}: An Accurate {C}hinese Phonetic Similarity Algorithm Based on Learned High Dimensional Encoding","authors":["Li, Min","Danilevsky, Marina","Noeman, Sara","Li, Yunyao"],"emails":["minli@us.ibm.com","mdanile@us.ibm.com","noemans@eg.ibm.com","yunyaoli@us.ibm.com"],"author_id":["min-li","marina-danilevsky","sara-noeman","yunyao-li"],"abstract":"Phonetic similarity algorithms identify words and phrases with similar pronunciation which are used in many natural language processing tasks. However, existing approaches are designed mainly for Indo-European languages and fail to capture the unique properties of Chinese pronunciation. In this paper, we propose a high dimensional encoded phonetic similarity algorithm for Chinese, DIMSIM. The encodings are learned from annotated data to separately map initial and final phonemes into n-dimensional coordinates. Pinyin phonetic similarities are then calculated by aggregating the similarities of initial, final and tone. DIMSIM demonstrates a 7.5X improvement on mean reciprocal rank over the state-of-the-art phonetic similarity approaches.","pages":"444--453","doi":"10.18653\/v1\/K18-1043","url":"https:\/\/www.aclweb.org\/anthology\/K18-1043","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1044","title":"Challenge or Empower: Revisiting Argumentation Quality in a News Editorial Corpus","authors":["El Baff, Roxanne","Wachsmuth, Henning","Al-Khatib, Khalid","Stein, Benno"],"emails":["ermany@upb.de","henningw@upb.de","",""],"author_id":["roxanne-el-baff","henning-wachsmuth","khalid-al-khatib","benno-stein"],"abstract":"News editorials are said to shape public opinion, which makes them a powerful tool and an important source of political argumentation. However, rarely do editorials change anyone{'}s stance on an issue completely, nor do they tend to argue explicitly (but rather follow a subtle rhetorical strategy). So, what does argumentation quality mean for editorials then? We develop the notion that an effective editorial challenges readers with opposing stance, and at the same time empowers the arguing skills of readers that share the editorial{'}s stance {---} or even challenges both sides. To study argumentation quality based on this notion, we introduce a new corpus with 1000 editorials from the New York Times, annotated for their perceived effect along with the annotators{'} political orientations. Analyzing the corpus, we find that annotators with different orientation disagree on the effect significantly. While only 1{\\%} of all editorials changed anyone{'}s stance, more than 5{\\%} meet our notion. We conclude that our corpus serves as a suitable resource for studying the argumentation quality of news editorials.","pages":"454--464","doi":"10.18653\/v1\/K18-1044","url":"https:\/\/www.aclweb.org\/anthology\/K18-1044","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1045","title":"Bringing Order to Neural Word Embeddings with Embeddings Augmented by Random Permutations ({EARP})","authors":["Cohen, Trevor","Widdows, Dominic"],"emails":["cohenta@uw.edu","dominic.widdows@grab.com"],"author_id":["trevor-cohn","dominic-widdows"],"abstract":"Word order is clearly a vital part of human language, but it has been used comparatively lightly in distributional vector models. This paper presents a new method for incorporating word order information into word vector embedding models by combining the benefits of permutation-based order encoding with the more recent method of skip-gram with negative sampling. The new method introduced here is called Embeddings Augmented by Random Permutations (EARP). It operates by applying permutations to the coordinates of context vector representations during the process of training. Results show an 8{\\%} improvement in accuracy on the challenging Bigger Analogy Test Set, and smaller but consistent improvements on other analogy reference sets. These findings demonstrate the importance of order-based information in analogical retrieval tasks, and the utility of random permutations as a means to augment neural embeddings.","pages":"465--475","doi":"10.18653\/v1\/K18-1045","url":"https:\/\/www.aclweb.org\/anthology\/K18-1045","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1046","title":"Aggregated Semantic Matching for Short Text Entity Linking","authors":["Nie, Feng","Zhou, Shuyan","Liu, Jing","Wang, Jinpeng","Lin, Chin-Yew","Pan, Rong"],"emails":["fengniesysu@gmail.com","alexisxy0418@gmail.com","liujing46@baidu.com","jinpwa@microsoft.com","cyl@microsoft.com","panr@sysu.edu.cn"],"author_id":["feng-nie","shuyan-zhou","jing-liu","jinpeng-wang","chin-yew-lin","rong-pan"],"abstract":"The task of entity linking aims to identify concepts mentioned in a text fragments and link them to a reference knowledge base. Entity linking in long text has been well studied in previous work. However, short text entity linking is more challenging since the text are noisy and less coherent. To better utilize the local information provided in short texts, we propose a novel neural network framework, Aggregated Semantic Matching (ASM), in which two different aspects of semantic information between the local context and the candidate entity are captured via representation-based and interaction-based neural semantic matching models, and then two matching signals work jointly for disambiguation with a rank aggregation mechanism. Our evaluation shows that the proposed model outperforms the state-of-the-arts on public tweet datasets.","pages":"476--485","doi":"10.18653\/v1\/K18-1046","url":"https:\/\/www.aclweb.org\/anthology\/K18-1046","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1047","title":"Adversarial Over-Sensitivity and Over-Stability Strategies for Dialogue Models","authors":["Niu, Tong","Bansal, Mohit"],"emails":["tongn@cs.unc.edu","mbansal@cs.unc.edu"],"author_id":["tong-niu","mohit-bansal"],"abstract":"We present two categories of model-agnostic adversarial strategies that reveal the weaknesses of several generative, task-oriented dialogue models: Should-Not-Change strategies that evaluate over-sensitivity to small and semantics-preserving edits, as well as Should-Change strategies that test if a model is over-stable against subtle yet semantics-changing modifications. We next perform adversarial training with each strategy, employing a max-margin approach for negative generative examples. This not only makes the target dialogue model more robust to the adversarial inputs, but also helps it perform significantly better on the original inputs. Moreover, training on all strategies combined achieves further improvements, achieving a new state-of-the-art performance on the original task (also verified via human evaluation). In addition to adversarial training, we also address the robustness task at the model-level, by feeding it subword units as both inputs and outputs, and show that the resulting model is equally competitive, requires only 1\/4 of the original vocabulary size, and is robust to one of the adversarial strategies (to which the original model is vulnerable) even without adversarial training.","pages":"486--496","doi":"10.18653\/v1\/K18-1047","url":"https:\/\/www.aclweb.org\/anthology\/K18-1047","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1048","title":"Improving Response Selection in Multi-Turn Dialogue Systems by Incorporating Domain Knowledge","authors":["Chaudhuri, Debanjan","Kristiadi, Agustinus","Lehmann, Jens","Fischer, Asja"],"emails":["chaudhur@cs.uni-bonn.de","kristiadi@uni-bonn.de","jens.lehmann@cs.uni-bonn.de","asja.fischer@rub.de"],"author_id":["debanjan-chaudhuri","agustinus-kristiadi","jens-lehmann","asja-fischer"],"abstract":"Building systems that can communicate with humans is a core problem in Artificial Intelligence. This work proposes a novel neural network architecture for response selection in an end-to-end multi-turn conversational dialogue setting. The architecture applies context level attention and incorporates additional external knowledge provided by descriptions of domain-specific words. It uses a bi-directional Gated Recurrent Unit (GRU) for encoding context and responses and learns to attend over the context words given the latent response representation and vice versa. In addition, it incorporates external domain specific information using another GRU for encoding the domain keyword descriptions. This allows better representation of domain-specific keywords in responses and hence improves the overall performance. Experimental results show that our model outperforms all other state-of-the-art methods for response selection in multi-turn conversations.","pages":"497--507","doi":"10.18653\/v1\/K18-1048","url":"https:\/\/www.aclweb.org\/anthology\/K18-1048","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1049","title":"The Lifted Matrix-Space Model for Semantic Composition","authors":["Chung, WooJin","Wang, Sheng-Fu","Bowman, Samuel"],"emails":["woojin@nyu.edu","shengfu.wang@nyu.edu","bowman@nyu.edu"],"author_id":["woojin-chung","sheng-fu-wang","samuel-bowman"],"abstract":"Tree-structured neural network architectures for sentence encoding draw inspiration from the approach to semantic composition generally seen in formal linguistics, and have shown empirical improvements over comparable sequence models by doing so. Moreover, adding multiplicative interaction terms to the composition functions in these models can yield significant further improvements. However, existing compositional approaches that adopt such a powerful composition function scale poorly, with parameter counts exploding as model dimension or vocabulary size grows. We introduce the Lifted Matrix-Space model, which uses a global transformation to map vector word embeddings to matrices, which can then be composed via an operation based on matrix-matrix multiplication. Its composition function effectively transmits a larger number of activations across layers with relatively few model parameters. We evaluate our model on the Stanford NLI corpus, the Multi-Genre NLI corpus, and the Stanford Sentiment Treebank and find that it consistently outperforms TreeLSTM (Tai et al., 2015), the previous best known composition function for tree-structured models.","pages":"508--518","doi":"10.18653\/v1\/K18-1049","url":"https:\/\/www.aclweb.org\/anthology\/K18-1049","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1050","title":"End-to-End Neural Entity Linking","authors":["Kolitsas, Nikolaos","Ganea, Octavian-Eugen","Hofmann, Thomas"],"emails":["nikos_kolitsas@hotmail.com","octavian.ganea@inf.ethz.ch","thomas.hofmann@inf.ethz.ch"],"author_id":["nikolaos-kolitsas","octavian-eugen-ganea","thomas-hofmann"],"abstract":"Entity Linking (EL) is an essential task for semantic text understanding and information extraction. Popular methods separately address the Mention Detection (MD) and Entity Disambiguation (ED) stages of EL, without leveraging their mutual dependency. We here propose the first neural end-to-end EL system that jointly discovers and links entities in a text document. The main idea is to consider all possible spans as potential mentions and learn contextual similarity scores over their entity candidates that are useful for both MD and ED decisions. Key components are context-aware mention embeddings, entity embeddings and a probabilistic mention - entity map, without demanding other engineered features. Empirically, we show that our end-to-end method significantly outperforms popular systems on the Gerbil platform when enough training data is available. Conversely, if testing datasets follow different annotation conventions compared to the training set (e.g. queries\/ tweets vs news documents), our ED model coupled with a traditional NER system offers the best or second best EL accuracy.","pages":"519--529","doi":"10.18653\/v1\/K18-1050","url":"https:\/\/www.aclweb.org\/anthology\/K18-1050","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1051","title":"Modelling Salient Features as Directions in Fine-Tuned Semantic Spaces","authors":["Ager, Thomas","Ku{\\v{z}}elka, Ond{\\v{r}}ej","Schockaert, Steven"],"emails":["agert@cardiff.ac.uk","ondrej.kuzelka@kuleuven.be","schockaerts1@cardiff.ac.uk"],"author_id":["thomas-ager","ondrej-kuzelka","steven-schockaert"],"abstract":"In this paper we consider semantic spaces consisting of objects from some particular domain (e.g. IMDB movie reviews). Various authors have observed that such semantic spaces often model salient features (e.g. how scary a movie is) as directions. These feature directions allow us to rank objects according to how much they have the corresponding feature, and can thus play an important role in interpretable classifiers, recommendation systems, or entity-oriented search engines, among others. Methods for learning semantic spaces, however, are mostly aimed at modelling similarity. In this paper, we argue that there is an inherent trade-off between capturing similarity and faithfully modelling features as directions. Following this observation, we propose a simple method to fine-tune existing semantic spaces, with the aim of improving the quality of their feature directions. Crucially, our method is fully unsupervised, requiring only a bag-of-words representation of the objects as input.","pages":"530--540","doi":"10.18653\/v1\/K18-1051","url":"https:\/\/www.aclweb.org\/anthology\/K18-1051","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1052","title":"Model Transfer with Explicit Knowledge of the Relation between Class Definitions","authors":["Yoshikawa, Hiyori","Iwakura, Tomoya"],"emails":["y.hiyori@jp.fujitsu.com","iwakura.tomoya@jp.fujitsu.com"],"author_id":["hiyori-yoshikawa","tomoya-iwakura"],"abstract":"This paper investigates learning methods for multi-class classification using labeled data for the target classification scheme and another labeled data for a similar but different classification scheme (support scheme). We show that if we have prior knowledge about the relation between support and target classification schemes in the form of a class correspondence table, we can use it to improve the model performance further than the simple multi-task learning approach. Instead of learning the individual classification layers for the support and target schemes, the proposed method converts the class label of each example on the support scheme into a set of candidate class labels on the target scheme via the class correspondence table, and then uses the candidate labels to learn the classification layer for the target scheme. We evaluate the proposed method on two tasks in NLP. The experimental results show that our method effectively learns the target schemes especially for the classes that have a tight connection to certain support classes.","pages":"541--550","doi":"10.18653\/v1\/K18-1052","url":"https:\/\/www.aclweb.org\/anthology\/K18-1052","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1053","title":"Aiming to Know You Better Perhaps Makes Me a More Engaging Dialogue Partner","authors":["Zemlyanskiy, Yury","Sha, Fei"],"emails":["yury.zemlyanskiy@usc.edu","fsha@netflix.com"],"author_id":["yury-zemlyanskiy","fei-sha"],"abstract":"There have been several attempts to define a plausible motivation for a chit-chat dialogue agent that can lead to engaging conversations. In this work, we explore a new direction where the agent specifically focuses on discovering information about its interlocutor. We formalize this approach by defining a quantitative metric. We propose an algorithm for the agent to maximize it. We validate the idea with human evaluation where our system outperforms various baselines. We demonstrate that the metric indeed correlates with the human judgments of engagingness.","pages":"551--561","doi":"10.18653\/v1\/K18-1053","url":"https:\/\/www.aclweb.org\/anthology\/K18-1053","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1054","title":"Neural Maximum Subgraph Parsing for Cross-Domain Semantic Dependency Analysis","authors":["Chen, Yufei","Huang, Sheng","Wang, Fang","Cao, Junjie","Sun, Weiwei","Wan, Xiaojun"],"emails":["yufei.chen@pku.edu.cn","huangsheng@pku.edu.cn","foundwang@pku.edu.cn","","ws@pku.edu.cn","wanxiaojun@pku.edu.cn"],"author_id":["yufei-chen","sheng-huang","fang-wang","junjie-cao","weiwei-sun","xiaojun-wan"],"abstract":"We present experiments for cross-domain semantic dependency analysis with a neural Maximum Subgraph parser. Our parser targets 1-endpoint-crossing, pagenumber-2 graphs which are a good fit to semantic dependency graphs, and utilizes an efficient dynamic programming algorithm for decoding. For disambiguation, the parser associates words with BiLSTM vectors and utilizes these vectors to assign scores to candidate dependencies. We conduct experiments on the data sets from SemEval 2015 as well as Chinese CCGBank. Our parser achieves very competitive results for both English and Chinese. To improve the parsing performance on cross-domain texts, we propose a data-oriented method to explore the linguistic generality encoded in English Resource Grammar, which is a precisionoriented, hand-crafted HPSG grammar, in an implicit way. Experiments demonstrate the effectiveness of our data-oriented method across a wide range of conditions.","pages":"562--572","doi":"10.18653\/v1\/K18-1054","url":"https:\/\/www.aclweb.org\/anthology\/K18-1054","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1055","title":"From Random to Supervised: A Novel Dropout Mechanism Integrated with Global Information","authors":["Xu, Hengru","Li, Shen","Hu, Renfen","Li, Si","Gao, Sheng"],"emails":["xuhengru@bupt.edu.cn","lisi@bupt.edu.cn","2shen@deeplycurious.ai","3irishere@mail.bnu.edu.cn","gaosheng@bupt.edu.cn"],"author_id":["hengru-xu","shen-li","renfen-hu","si-li","sheng-gao"],"abstract":"Dropout is used to avoid overfitting by randomly dropping units from the neural networks during training. Inspired by dropout, this paper presents GI-Dropout, a novel dropout method integrating with global information to improve neural networks for text classification. Unlike the traditional dropout method in which the units are dropped randomly according to the same probability, we aim to use explicit instructions based on global information of the dataset to guide the training process. With GI-Dropout, the model is supposed to pay more attention to inapparent features or patterns. Experiments demonstrate the effectiveness of the dropout with global information on seven text classification tasks, including sentiment analysis and topic classification.","pages":"573--582","doi":"10.18653\/v1\/K18-1055","url":"https:\/\/www.aclweb.org\/anthology\/K18-1055","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"},{"id":"K18-1056","title":"Sequence to Sequence Mixture Model for Diverse Machine Translation","authors":["He, Xuanli","Haffari, Gholamreza","Norouzi, Mohammad"],"emails":["xuanli.he1@monash.edu","gholamreza.haffari@monash.edu","mnorouzi@google.com"],"author_id":["xuanli-he","gholamreza-haffari","mohammad-norouzi"],"abstract":"Sequence to sequence (SEQ2SEQ) models lack diversity in their generated translations. This can be attributed to their limitations in capturing lexical and syntactic variations in parallel corpora, due to different styles, genres, topics, or ambiguity of human translation process. In this paper, we develop a novel sequence to sequence mixture (S2SMIX) model that improves both translation diversity and quality by adopting a committee of specialized translation models rather than a single translation model. Each mixture component selects its own training dataset via optimization of the marginal log-likelihood, which leads to a soft clustering of the parallel corpus. Experiments on four language pairs demonstrate the superiority of our mixture model compared to SEQ2SEQ model with the standard and diversity encouraged beam search. Our mixture model incurs negligible additional parameters and no extra computation in the decoding time.","pages":"583--592","doi":"10.18653\/v1\/K18-1056","url":"https:\/\/www.aclweb.org\/anthology\/K18-1056","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the 22nd Conference on Computational Natural Language Learning"}]