[{"id":"S19-1001","title":"{SUR}el: A Gold Standard for Incorporating Meaning Shifts into Term Extraction","authors":["H{\\\"a}tty, Anna","Schlechtweg, Dominik","Schulte im Walde, Sabine"],"emails":["anna.haetty@de.bosch.com","schlecdk@ims.uni-stuttgart.de","schulte@ims.uni-stuttgart.de"],"author_id":["anna-hatty","dominik-schlechtweg","sabine-schulte-im-walde"],"abstract":"We introduce SURel, a novel dataset with human-annotated meaning shifts between general-language and domain-specific contexts. We show that meaning shifts of term candidates cause errors in term extraction, and demonstrate that the SURel annotation reflects these errors. Furthermore, we illustrate that SURel enables us to assess optimisations of term extraction techniques when incorporating meaning shifts.","pages":"1--8","doi":"10.18653\/v1\/S19-1001","url":"https:\/\/www.aclweb.org\/anthology\/S19-1001","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1002","title":"Word Usage Similarity Estimation with Sentence Representations and Automatic Substitutes","authors":["Gar{\\'\\i} Soler, Aina","Apidianaki, Marianna","Allauzen, Alexandre"],"emails":["aina.gari@limsi.fr","marianna@limsi.fr","allauzen@limsi.fr"],"author_id":["aina-gari-soler","marianna-apidianaki","alexandre-allauzen"],"abstract":"Usage similarity estimation addresses the semantic proximity of word instances in different contexts. We apply contextualized (ELMo and BERT) word and sentence embeddings to this task, and propose supervised models that leverage these representations for prediction. Our models are further assisted by lexical substitute annotations automatically assigned to word instances by context2vec, a neural model that relies on a bidirectional LSTM. We perform an extensive comparison of existing word and sentence representations on benchmark datasets addressing both graded and binary similarity.The best performing models outperform previous methods in both settings.","pages":"9--21","doi":"10.18653\/v1\/S19-1002","url":"https:\/\/www.aclweb.org\/anthology\/S19-1002","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1003","title":"Beyond Context: A New Perspective for Word Embeddings","authors":["Zhou, Yichu","Srikumar, Vivek"],"emails":["flyaway@cs.utah.edu","svivek@cs.utah.edu"],"author_id":["yichu-zhou","vivek-srikumar"],"abstract":"Most word embeddings today are trained by optimizing a language modeling goal of scoring words in their context, modeled as a multi-class classification problem. In this paper, we argue that, despite the successes of this assumption, it is incomplete: in addition to its context, orthographical or morphological aspects of words can offer clues about their meaning. We define a new modeling framework for training word embeddings that captures this intuition. Our framework is based on the well-studied problem of multi-label classification and, consequently, exposes several design choices for featurizing words and contexts, loss functions for training and score normalization. Indeed, standard models such as CBOW and fasttext are specific choices along each of these axes. We show via experiments that by combining feature engineering with embedding learning, our method can outperform CBOW using only 10{\\%} of the training data in both the standard word embedding evaluations and also text classification experiments.","pages":"22--32","doi":"10.18653\/v1\/S19-1003","url":"https:\/\/www.aclweb.org\/anthology\/S19-1003","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1004","title":"Composition of Sentence Embeddings: Lessons from Statistical Relational Learning","authors":["Sileo, Damien","Van De Cruys, Tim","Pradel, Camille","Muller, Philippe"],"emails":["damien.sileo@synapse-fr.com","","",""],"author_id":["damien-sileo","tim-van-de-cruys","camille-pradel","philippe-muller"],"abstract":"Various NLP problems {--} such as the prediction of sentence similarity, entailment, and discourse relations {--} are all instances of the same general task: the modeling of semantic relations between a pair of textual elements. A popular model for such problems is to embed sentences into fixed size vectors, and use composition functions (e.g. concatenation or sum) of those vectors as features for the prediction. At the same time, composition of embeddings has been a main focus within the field of Statistical Relational Learning (SRL) whose goal is to predict relations between entities (typically from knowledge base triples). In this article, we show that previous work on relation prediction between texts implicitly uses compositions from baseline SRL models. We show that such compositions are not expressive enough for several tasks (e.g. natural language inference). We build on recent SRL models to address textual relational problems, showing that they are more expressive, and can alleviate issues from simpler compositions. The resulting models significantly improve the state of the art in both transferable sentence representation learning and relation prediction.","pages":"33--43","doi":"10.18653\/v1\/S19-1004","url":"https:\/\/www.aclweb.org\/anthology\/S19-1004","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1005","title":"Multi-Label Transfer Learning for Multi-Relational Semantic Similarity","authors":["Zhang, Li","Wilson, Steven","Mihalcea, Rada"],"emails":["zharry@umich.edu","steverw@umich.edu","mihalcea@umich.edu"],"author_id":["li-zhang","steven-wilson","rada-mihalcea"],"abstract":"Multi-relational semantic similarity datasets define the semantic relations between two short texts in multiple ways, e.g., similarity, relatedness, and so on. Yet, all the systems to date designed to capture such relations target one relation at a time. We propose a multi-label transfer learning approach based on LSTM to make predictions for several relations simultaneously and aggregate the losses to update the parameters. This multi-label regression approach jointly learns the information provided by the multiple relations, rather than treating them as separate tasks. Not only does this approach outperform the single-task approach and the traditional multi-task learning approach, but it also achieves state-of-the-art performance on all but one relation of the Human Activity Phrase dataset.","pages":"44--50","doi":"10.18653\/v1\/S19-1005","url":"https:\/\/www.aclweb.org\/anthology\/S19-1005","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1006","title":"Scalable Cross-Lingual Transfer of Neural Sentence Embeddings","authors":["Aldarmaki, Hanan","Diab, Mona"],"emails":["aldarmaki@gwu.edu","diabmona@amazon.com"],"author_id":["hanan-aldarmaki","mona-diab"],"abstract":"We develop and investigate several cross-lingual alignment approaches for neural sentence embedding models, such as the supervised inference classifier, InferSent, and sequential encoder-decoder models. We evaluate three alignment frameworks applied to these models: joint modeling, representation transfer learning, and sentence mapping, using parallel text to guide the alignment. Our results support representation transfer as a scalable approach for modular cross-lingual alignment of neural sentence embeddings, where we observe better performance compared to joint models in intrinsic and extrinsic evaluations, particularly with smaller sets of parallel data.","pages":"51--60","doi":"10.18653\/v1\/S19-1006","url":"https:\/\/www.aclweb.org\/anthology\/S19-1006","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1007","title":"Second-order contexts from lexical substitutes for few-shot learning of word representations","authors":["Liu, Qianchu","McCarthy, Diana","Korhonen, Anna"],"emails":["ql261@cam.ac.uk","diana@dianamccarthy.co.uk","alk23@cam.ac.uk"],"author_id":["qianchu-liu","diana-mccarthy","anna-korhonen"],"abstract":"There is a growing awareness of the need to handle rare and unseen words in word representation modelling. In this paper, we focus on few-shot learning of emerging concepts that fully exploits only a few available contexts. We introduce a substitute-based context representation technique that can be applied on an existing word embedding space. Previous context-based approaches to modelling unseen words only consider bag-of-word first-order contexts, whereas our method aggregates contexts as second-order substitutes that are produced by a sequence-aware sentence completion model. We experimented with three tasks that aim to test the modelling of emerging concepts. We found that these tasks show different emphasis on first and second order contexts, and our substitute-based method achieves superior performance on naturally-occurring contexts from corpora.","pages":"61--67","doi":"10.18653\/v1\/S19-1007","url":"https:\/\/www.aclweb.org\/anthology\/S19-1007","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1008","title":"Pre-trained Contextualized Character Embeddings Lead to Major Improvements in Time Normalization: a Detailed Analysis","authors":["Xu, Dongfang","Laparra, Egoitz","Bethard, Steven"],"emails":["dongfangxu9@email.arizona.edu","laparra@email.arizona.edu","bethard@email.arizona.edu"],"author_id":["dongfang-xu","egoitz-laparra","steven-bethard"],"abstract":"Recent studies have shown that pre-trained contextual word embeddings, which assign the same word different vectors in different contexts, improve performance in many tasks. But while contextual embeddings can also be trained at the character level, the effectiveness of such embeddings has not been studied. We derive character-level contextual embeddings from Flair (Akbik et al., 2018), and apply them to a time normalization task, yielding major performance improvements over the previous state-of-the-art: 51{\\%} error reduction in news and 33{\\%} in clinical notes. We analyze the sources of these improvements, and find that pre-trained contextual character embeddings are more robust to term variations, infrequent terms, and cross-domain changes. We also quantify the size of context that pre-trained contextual character embeddings take advantage of, and show that such embeddings capture features like part-of-speech and capitalization.","pages":"68--74","doi":"10.18653\/v1\/S19-1008","url":"https:\/\/www.aclweb.org\/anthology\/S19-1008","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1009","title":"{B}ot2{V}ec: Learning Representations of Chatbots","authors":["Herzig, Jonathan","Sandbank, Tommy","Shmueli-Scheuer, Michal","Konopnicki, David"],"emails":["ajtr@us.ibm.com","tommy@similari.com",".il.ibm.com@similari.com",""],"author_id":["jonathan-herzig","tommy-sandbank","michal-shmueli-scheuer","david-konopnicki"],"abstract":"Chatbots (i.e., bots) are becoming widely used in multiple domains, along with supporting bot programming platforms. These platforms are equipped with novel testing tools aimed at improving the quality of individual chatbots. Doing so requires an understanding of what sort of bots are being built (captured by their underlying conversation graphs) and how well they perform (derived through analysis of conversation logs). In this paper, we propose a new model, Bot2Vec, that embeds bots to a compact representation based on their structure and usage logs. Then, we utilize Bot2Vec representations to improve the quality of two bot analysis tasks. Using conversation data and graphs of over than 90 bots, we show that Bot2Vec representations improve detection performance by more than 16{\\%} for both tasks.","pages":"75--84","doi":"10.18653\/v1\/S19-1009","url":"https:\/\/www.aclweb.org\/anthology\/S19-1009","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1010","title":"Are We Consistently Biased? Multidimensional Analysis of Biases in Distributional Word Vectors","authors":["Lauscher, Anne","Glava{\\v{s}}, Goran"],"emails":["anne@informatik.uni-mannheim.de","goran@informatik.uni-mannheim.de"],"author_id":["anne-lauscher","goran-glavas"],"abstract":"Word embeddings have recently been shown to reflect many of the pronounced societal biases (e.g., gender bias or racial bias). Existing studies are, however, limited in scope and do not investigate the consistency of biases across relevant dimensions like embedding models, types of texts, and different languages. In this work, we present a systematic study of biases encoded in distributional word vector spaces: we analyze how consistent the bias effects are across languages, corpora, and embedding models. Furthermore, we analyze the cross-lingual biases encoded in bilingual embedding spaces, indicative of the effects of bias transfer encompassed in cross-lingual transfer of NLP models. Our study yields some unexpected findings, e.g., that biases can be emphasized or downplayed by different embedding models or that user-generated content may be less biased than encyclopedic text. We hope our work catalyzes bias research in NLP and informs the development of bias reduction techniques.","pages":"85--91","doi":"10.18653\/v1\/S19-1010","url":"https:\/\/www.aclweb.org\/anthology\/S19-1010","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1011","title":"A Semantic Cover Approach for Topic Modeling","authors":["Venkatesaramani, Rajagopal","Downey, Doug","Malin, Bradley","Vorobeychik, Yevgeniy"],"emails":["rajagopal@wustl.edu","ddowney@eecs.northwestern.edu","b.malin@vanderbilt.edu","yvorobeychik@wustl.edu"],"author_id":["rajagopal-venkatesaramani","doug-downey","bradley-malin","yevgeniy-vorobeychik"],"abstract":"We introduce a novel topic modeling approach based on constructing a semantic set cover for clusters of similar documents. Specifically, our approach first clusters documents using their Tf-Idf representation, and then covers each cluster with a set of topic words based on semantic similarity, defined in terms of a word embedding. Computing a topic cover amounts to solving a minimum set cover problem. Our evaluation compares our topic modeling approach to Latent Dirichlet Allocation (LDA) on three metrics: 1) qualitative topic match, measured using evaluations by Amazon Mechanical Turk (MTurk) workers, 2) performance on classification tasks using each topic model as a sparse feature representation, and 3) topic coherence. We find that qualitative judgments significantly favor our approach, the method outperforms LDA on topic coherence, and is comparable to LDA on document classification tasks.","pages":"92--102","doi":"10.18653\/v1\/S19-1011","url":"https:\/\/www.aclweb.org\/anthology\/S19-1011","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1012","title":"{MCS}cript2.0: A Machine Comprehension Corpus Focused on Script Events and Participants","authors":["Ostermann, Simon","Roth, Michael","Pinkal, Manfred"],"emails":["simono@coli.uni-saarland.de","rothml@ims.uni-stuttgart.de","pinkal@coli.uni-saarland.de"],"author_id":["simon-ostermann","michael-roth","manfred-pinkal"],"abstract":"We introduce MCScript2.0, a machine comprehension corpus for the end-to-end evaluation of script knowledge. MCScript2.0 contains approx. 20,000 questions on approx. 3,500 texts, crowdsourced based on a new collection process that results in challenging questions. Half of the questions cannot be answered from the reading texts, but require the use of commonsense and, in particular, script knowledge. We give a thorough analysis of our corpus and show that while the task is not challenging to humans, existing machine comprehension models fail to perform well on the data, even if they make use of a commonsense knowledge base. The dataset is available at http:\/\/www.sfb1102. uni-saarland.de\/?page{\\_}id=2582","pages":"103--117","doi":"10.18653\/v1\/S19-1012","url":"https:\/\/www.aclweb.org\/anthology\/S19-1012","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1013","title":"Deconstructing multimodality: visual properties and visual context in human semantic processing","authors":["Davis, Christopher","Bulat, Luana","Vero, Anita Lilla","Shutova, Ekaterina"],"emails":["ccd38@cam.ac.uk","luana.bulat@cam.ac.uk","alv34@cam.ac.uk","e.shutova@uva.nl"],"author_id":["christopher-davis","luana-bulat","anita-lilla-vero","ekaterina-shutova"],"abstract":"Multimodal semantic models that extend linguistic representations with additional perceptual input have proved successful in a range of natural language processing (NLP) tasks. Recent research has successfully used neural methods to automatically create visual representations for words. However, these works have extracted visual features from complete images, and have not examined how different kinds of visual information impact performance. In contrast, we construct multimodal models that differentiate between internal visual properties of the objects and their external visual context. We evaluate the models on the task of decoding brain activity associated with the meanings of nouns, demonstrating their advantage over those based on complete images.","pages":"118--124","doi":"10.18653\/v1\/S19-1013","url":"https:\/\/www.aclweb.org\/anthology\/S19-1013","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1014","title":"Learning Graph Embeddings from {W}ord{N}et-based Similarity Measures","authors":["Kutuzov, Andrey","Dorgham, Mohammad","Oliynyk, Oleksiy","Biemann, Chris","Panchenko, Alexander"],"emails":["andreku@ifi.uio.no","5dorgham@informatik.uni-hamburg.de","6oliinyk@informatik.uni-hamburg.de","biemann@informatik.uni-hamburg.de","panchenko@informatik.uni-hamburg.de"],"author_id":["andrey-kutuzov","mohammad-dorgham","oleksiy-oliynyk","chris-biemann","alexander-panchenko"],"abstract":"We present path2vec, a new approach for learning graph embeddings that relies on structural measures of pairwise node similarities. The model learns representations for nodes in a dense space that approximate a given user-defined graph distance measure, such as e.g. the shortest path distance or distance measures that take information beyond the graph structure into account. Evaluation of the proposed model on semantic similarity and word sense disambiguation tasks, using various WordNet-based similarity measures, show that our approach yields competitive results, outperforming strong graph embedding baselines. The model is computationally efficient, being orders of magnitude faster than the direct computation of graph-based distances.","pages":"125--135","doi":"10.18653\/v1\/S19-1014","url":"https:\/\/www.aclweb.org\/anthology\/S19-1014","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1015","title":"Neural User Factor Adaptation for Text Classification: Learning to Generalize Across Author Demographics","authors":["Huang, Xiaolei","Paul, Michael J."],"emails":["xiaolei.huang@colorado.edu","mpaul@colorado.edu"],"author_id":["xiaolei-huang","michael-paul"],"abstract":"Language use varies across different demographic factors, such as gender, age, and geographic location. However, most existing document classification methods ignore demographic variability. In this study, we examine empirically how text data can vary across four demographic factors: gender, age, country, and region. We propose a multitask neural model to account for demographic variations via adversarial training. In experiments on four English-language social media datasets, we find that classification performance improves when adapting for user factors.","pages":"136--146","doi":"10.18653\/v1\/S19-1015","url":"https:\/\/www.aclweb.org\/anthology\/S19-1015","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1016","title":"Abstract Graphs and Abstract Paths for Knowledge Graph Completion","authors":["Nastase, Vivi","Kotnis, Bhushan"],"emails":["nastase@cl.uni-heidelberg.de","bhushan.kotnis@gmail.com"],"author_id":["vivi-nastase","bhushan-kotnis"],"abstract":"Knowledge graphs, which provide numerous facts in a machine-friendly format, are incomplete. Information that we induce from such graphs {--} e.g. entity embeddings, relation representations or patterns {--} will be affected by the imbalance in the information captured in the graph {--} by biasing representations, or causing us to miss potential patterns. To partially compensate for this situation we describe a method for representing knowledge graphs that capture an intensional representation of the original extensional information. This representation is very compact, and it abstracts away from individual links, allowing us to find better path candidates, as shown by the results of link prediction using this information.","pages":"147--157","doi":"10.18653\/v1\/S19-1016","url":"https:\/\/www.aclweb.org\/anthology\/S19-1016","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1017","title":"A Corpus of Negations and their Underlying Positive Interpretations","authors":["Sarabi, Zahra","Killian, Erin","Blanco, Eduardo","Palmer, Alexis"],"emails":["zahrasarabi@my.unt.edu","erinkillian@my.unt.edu","eduardo.blanco@unt.edu","alexis.palmer@unt.edu"],"author_id":["zahra-sarabi","erin-killian","eduardo-blanco","alexis-palmer"],"abstract":"Negation often conveys implicit positive meaning. In this paper, we present a corpus of negations and their underlying positive interpretations. We work with negations from Simple Wikipedia, automatically generate potential positive interpretations, and then collect manual annotations that effectively rewrite the negation in positive terms. This procedure yields positive interpretations for approximately 77{\\%} of negations, and the final corpus includes over 5,700 negations and over 5,900 positive interpretations. We also present baseline results using seq2seq neural models.","pages":"158--167","doi":"10.18653\/v1\/S19-1017","url":"https:\/\/www.aclweb.org\/anthology\/S19-1017","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1018","title":"Enthymemetic Conditionals","authors":["Maguire, Eimear"],"emails":["eimear.maguire@etu.univ-paris-diderot.fr"],"author_id":["eimear-maguire"],"abstract":"To model conditionals in a way that reflects their acceptability, we must include some means of making judgements about whether antecedent and consequent are meaningfully related or not. Enthymemes are non-logical arguments which do not hold up by themselves, but are acceptable through their relation to a topos, an already-known general principle or pattern for reasoning. This paper uses enthymemes and topoi as a way to model the world-knowledge behind these judgements. In doing so, it provides a reformalisation (in TTR) of enthymemes and topoi as networks rather than functions, and information state update rules for conditionals.","pages":"168--177","doi":"10.18653\/v1\/S19-1018","url":"https:\/\/www.aclweb.org\/anthology\/S19-1018","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1019","title":"Acquiring Structured Temporal Representation via Crowdsourcing: A Feasibility Study","authors":["Zhang, Yuchen","Xue, Nianwen"],"emails":["yuchenz@brandeis.edu","xuen@brandeis.edu"],"author_id":["yuchen-zhang","nianwen-xue"],"abstract":"Temporal Dependency Trees are a structured temporal representation that represents temporal relations among time expressions and events in a text as a dependency tree structure. Compared to traditional pair-wise temporal relation representations, temporal dependency trees facilitate efficient annotations, higher inter-annotator agreement, and efficient computations. However, annotations on temporal dependency trees so far have only been done by expert annotators, which is costly and time-consuming. In this paper, we introduce a method to crowdsource temporal dependency tree annotations, and show that this representation is intuitive and can be collected with high accuracy and agreement through crowdsourcing. We produce a corpus of temporal dependency trees, and present a baseline temporal dependency parser, trained and evaluated on this new corpus.","pages":"178--185","doi":"10.18653\/v1\/S19-1019","url":"https:\/\/www.aclweb.org\/anthology\/S19-1019","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1020","title":"Exploration of Noise Strategies in Semi-supervised Named Entity Classification","authors":["Lakshmi Narayan, Pooja","Nagesh, Ajay","Surdeanu, Mihai"],"emails":["poojal@email.arizona.edu","ajaynagesh@didiglobal.com","msurdeanu@email.arizona.edu"],"author_id":["pooja-lakshmi-narayan","ajay-nagesh","mihai-surdeanu"],"abstract":"Noise is inherent in real world datasets and modeling noise is critical during training as it is effective in regularization. Recently, novel semi-supervised deep learning techniques have demonstrated tremendous potential when learning with very limited labeled training data in image processing tasks. A critical aspect of these semi-supervised learning techniques is augmenting the input or the network with noise to be able to learn robust models. While modeling noise is relatively straightforward in continuous domains such as image classification, it is not immediately apparent how noise can be modeled in discrete domains such as language. Our work aims to address this gap by exploring different noise strategies for the semi-supervised named entity classification task, including statistical methods such as adding Gaussian noise to input embeddings, and linguistically-inspired ones such as dropping words and replacing words with their synonyms. We compare their performance on two benchmark datasets (OntoNotes and CoNLL) for named entity classification. Our results indicate that noise strategies that are linguistically informed perform at least as well as statistical approaches, while being simpler and requiring minimal tuning.","pages":"186--191","doi":"10.18653\/v1\/S19-1020","url":"https:\/\/www.aclweb.org\/anthology\/S19-1020","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1021","title":"Improving Generalization in Coreference Resolution via Adversarial Training","authors":["Subramanian, Sanjay","Roth, Dan"],"emails":["sanjayssub34@gmail.com","danroth@seas.upenn.edu"],"author_id":["sanjay-subramanian","dan-roth"],"abstract":"In order for coreference resolution systems to be useful in practice, they must be able to generalize to new text. In this work, we demonstrate that the performance of the state-of-the-art system decreases when the names of PER and GPE named entities in the CoNLL dataset are changed to names that do not occur in the training set. We use the technique of adversarial gradient-based training to retrain the state-of-the-art system and demonstrate that the retrained system achieves higher performance on the CoNLL dataset (both with and without the change of named entities) and the GAP dataset.","pages":"192--197","doi":"10.18653\/v1\/S19-1021","url":"https:\/\/www.aclweb.org\/anthology\/S19-1021","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1022","title":"Improving Human Needs Categorization of Events with Semantic Classification","authors":["Ding, Haibo","Riloff, Ellen","Feng, Zhe"],"emails":["haibo.ding@us.bosch.com","riloff@cs.utah.edu","zhe.feng2@us.bosch.com"],"author_id":["haibo-ding","ellen-riloff","zhe-feng"],"abstract":"Human Needs categories have been used to characterize the reason why an affective event is positive or negative. For example, {``}I got the flu{''} and {``}I got fired{''} are both negative (undesirable) events, but getting the flu is a Health problem while getting fired is a Financial problem. Previous work created learning models to assign events to Human Needs categories based on their words and contexts. In this paper, we introduce an intermediate step that assigns words to relevant semantic concepts. We create lightly supervised models that learn to label words with respect to 10 semantic concepts associated with Human Needs categories, and incorporate these labels as features for event categorization. Our results show that recognizing relevant semantic concepts improves both the recall and precision of Human Needs categorization for events.","pages":"198--204","doi":"10.18653\/v1\/S19-1022","url":"https:\/\/www.aclweb.org\/anthology\/S19-1022","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1023","title":"Word Embeddings (Also) Encode Human Personality Stereotypes","authors":["Agarwal, Oshin","Durup{\\i}nar, Funda","Badler, Norman I.","Nenkova, Ani"],"emails":["oagarwal@seas.upenn.edu","fundad@cs.bilkent.edu.tr","badler@seas.upenn.edu","nenkova@seas.upenn.edu"],"author_id":["oshin-agarwal","funda-durupinar","norman-i-badler","ani-nenkova"],"abstract":"Word representations trained on text reproduce human implicit bias related to gender, race and age. Methods have been developed to remove such bias. Here, we present results that show that human stereotypes exist even for much more nuanced judgments such as personality, for a variety of person identities beyond the typically legally protected attributes and that these are similarly captured in word representations. Specifically, we collected human judgments about a person{'}s Big Five personality traits formed solely from information about the occupation, nationality or a common noun description of a hypothetical person. Analysis of the data reveals a large number of statistically significant stereotypes in people. We then demonstrate the bias captured in lexical representations is statistically significantly correlated with the documented human bias. Our results, showing bias for a large set of person descriptors for such nuanced traits put in doubt the feasibility of broadly and fairly applying debiasing methods and call for the development of new methods for auditing language technology systems and resources.","pages":"205--211","doi":"10.18653\/v1\/S19-1023","url":"https:\/\/www.aclweb.org\/anthology\/S19-1023","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1024","title":"Automatic Accuracy Prediction for {AMR} Parsing","authors":["Opitz, Juri","Frank, Anette"],"emails":["opitz@cl.uni-heidelberg.de","frank@cl.uni-heidelberg.de"],"author_id":["juri-opitz","anette-frank"],"abstract":"Abstract Meaning Representation (AMR) represents sentences as directed, acyclic and rooted graphs, aiming at capturing their meaning in a machine readable format. AMR parsing converts natural language sentences into such graphs. However, evaluating a parser on new data by means of comparison to manually created AMR graphs is very costly. Also, we would like to be able to detect parses of questionable quality, or preferring results of alternative systems by selecting the ones for which we can assess good quality. We propose AMR accuracy prediction as the task of predicting several metrics of correctness for an automatically generated AMR parse {--} in absence of the corresponding gold parse. We develop a neural end-to-end multi-output regression model and perform three case studies: firstly, we evaluate the model{'}s capacity of predicting AMR parse accuracies and test whether it can reliably assign high scores to gold parses. Secondly, we perform parse selection based on predicted parse accuracies of candidate parses from alternative systems, with the aim of improving overall results. Finally, we predict system ranks for submissions from two AMR shared tasks on the basis of their predicted parse accuracy averages. All experiments are carried out across two different domains and show that our method is effective.","pages":"212--223","doi":"10.18653\/v1\/S19-1024","url":"https:\/\/www.aclweb.org\/anthology\/S19-1024","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1025","title":"An Argument-Marker Model for Syntax-Agnostic Proto-Role Labeling","authors":["Opitz, Juri","Frank, Anette"],"emails":["opitz@cl.uni-heidelberg.de","frank@cl.uni-heidelberg.de"],"author_id":["juri-opitz","anette-frank"],"abstract":"Semantic proto-role labeling (SPRL) is an alternative to semantic role labeling (SRL) that moves beyond a categorical definition of roles, following Dowty{'}s feature-based view of proto-roles. This theory determines agenthood vs. patienthood based on a participant{'}s instantiation of more or less typical agent vs. patient properties, such as, for example, volition in an event. To perform SPRL, we develop an ensemble of hierarchical models with self-attention and concurrently learned predicate-argument markers. Our method is competitive with the state-of-the art, overall outperforming previous work in two formulations of the task (multi-label and multi-variate Likert scale pre- diction). In contrast to previous work, our results do not depend on gold argument heads derived from supplementary gold tree banks.","pages":"224--234","doi":"10.18653\/v1\/S19-1025","url":"https:\/\/www.aclweb.org\/anthology\/S19-1025","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1026","title":"Probing What Different {NLP} Tasks Teach Machines about Function Word Comprehension","authors":["Kim, Najoung","Patel, Roma","Poliak, Adam","Xia, Patrick","Wang, Alex","McCoy, Tom","Tenney, Ian","Ross, Alexis","Linzen, Tal","Van Durme, Benjamin","Bowman, Samuel R.","Pavlick, Ellie"],"emails":["","","","","","","","","","","",""],"author_id":["najoung-kim","roma-patel","adam-poliak","patrick-xia","alex-wang","tom-mccoy","ian-tenney","alexis-ross","tal-linzen","benjamin-van-durme","samuel-bowman","ellie-pavlick"],"abstract":"We introduce a set of nine challenge tasks that test for the understanding of function words. These tasks are created by structurally mutating sentences from existing datasets to target the comprehension of specific types of function words (e.g., prepositions, wh-words). Using these probing tasks, we explore the effects of various pretraining objectives for sentence encoders (e.g., language modeling, CCG supertagging and natural language inference (NLI)) on the learned representations. Our results show that pretraining on CCG{---}our most syntactic objective{---}performs the best on average across our probing tasks, suggesting that syntactic knowledge helps function word comprehension. Language modeling also shows strong performance, supporting its widespread use for pretraining state-of-the-art NLP models. Overall, no pretraining objective dominates across the board, and our function word probing tasks highlight several intuitive differences between pretraining objectives, e.g., that NLI helps the comprehension of negation.","pages":"235--249","doi":"10.18653\/v1\/S19-1026","url":"https:\/\/www.aclweb.org\/anthology\/S19-1026","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1027","title":"{HELP}: A Dataset for Identifying Shortcomings of Neural Models in Monotonicity Reasoning","authors":["Yanaka, Hitomi","Mineshima, Koji","Bekki, Daisuke","Inui, Kentaro","Sekine, Satoshi","Abzianidze, Lasha","Bos, Johan"],"emails":["hitomi.yanaka@riken.jp","mineshima.koji@ocha.ac.jp","bekki@is.ocha.ac.jp","inui@ecei.tohoku.ac.jp","satoshi.sekine@riken.jp","l.abzianidze@rug.nl","johan.bos@rug.nl"],"author_id":["hitomi-yanaka","koji-mineshima","daisuke-bekki","kentaro-inui","satoshi-sekine","lasha-abzianidze","johan-bos"],"abstract":"Large crowdsourced datasets are widely used for training and evaluating neural models on natural language inference (NLI). Despite these efforts, neural models have a hard time capturing logical inferences, including those licensed by phrase replacements, so-called monotonicity reasoning. Since no large dataset has been developed for monotonicity reasoning, it is still unclear whether the main obstacle is the size of datasets or the model architectures themselves. To investigate this issue, we introduce a new dataset, called HELP, for handling entailments with lexical and logical phenomena. We add it to training data for the state-of-the-art neural models and evaluate them on test sets for monotonicity phenomena. The results showed that our data augmentation improved the overall accuracy. We also find that the improvement is better on monotonicity inferences with lexical replacements than on downward inferences with disjunction and modification. This suggests that some types of inferences can be improved by our data augmentation while others are immune to it.","pages":"250--255","doi":"10.18653\/v1\/S19-1027","url":"https:\/\/www.aclweb.org\/anthology\/S19-1027","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1028","title":"On Adversarial Removal of Hypothesis-only Bias in Natural Language Inference","authors":["Belinkov, Yonatan","Poliak, Adam","Shieber, Stuart","Van Durme, Benjamin","Rush, Alexander"],"emails":["belinkov@seas.harvard.edu","azpoliak@cs.jhu.edu","shieber@seas.harvard.edu","vandurme@cs.jhu.edu","srush@seas.harvard.edu"],"author_id":["yonatan-belinkov","adam-poliak","stuart-m-shieber","benjamin-van-durme","alexander-m-rush"],"abstract":"Popular Natural Language Inference (NLI) datasets have been shown to be tainted by hypothesis-only biases. Adversarial learning may help models ignore sensitive biases and spurious correlations in data. We evaluate whether adversarial learning can be used in NLI to encourage models to learn representations free of hypothesis-only biases. Our analyses indicate that the representations learned via adversarial learning may be less biased, with only small drops in NLI accuracy.","pages":"256--262","doi":"10.18653\/v1\/S19-1028","url":"https:\/\/www.aclweb.org\/anthology\/S19-1028","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1029","title":"{B}ayesian Inference Semantics: A Modelling System and A Test Suite","authors":["Bernardy, Jean-Philippe","Blanck, Rasmus","Chatzikyriakidis, Stergios","Lappin, Shalom","Maskharashvili, Aleksandre"],"emails":["jean-philippe.bernardy@gu.se","rasmus.blanck@gu.se","stergios.chatzikyriakidis@gu.se","shalom.lappin@gu.se","aleksandre.maskharashvili@gu.se"],"author_id":["jean-philippe-bernardy","rasmus-blanck","stergios-chatzikyriakidis","shalom-lappin","aleksandre-maskharashvili"],"abstract":"We present BIS, a Bayesian Inference Semantics, for probabilistic reasoning in natural language. The current system is based on the framework of Bernardy et al. (2018), but departs from it in important respects. BIS makes use of Bayesian learning for inferring a hypothesis from premises. This involves estimating the probability of the hypothesis, given the data supplied by the premises of an argument. It uses a syntactic parser to generate typed syntactic structures that serve as input to a model generation system. Sentences are interpreted compositionally to probabilistic programs, and the corresponding truth values are estimated using sampling methods. BIS successfully deals with various probabilistic semantic phenomena, including frequency adverbs, generalised quantifiers, generics, and vague predicates. It performs well on a number of interesting probabilistic reasoning tasks. It also sustains most classically valid inferences (instantiation, de Morgan{'}s laws, etc.). To test BIS we have built an experimental test suite with examples of a range of probabilistic and classical inference patterns.","pages":"263--272","doi":"10.18653\/v1\/S19-1029","url":"https:\/\/www.aclweb.org\/anthology\/S19-1029","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1030","title":"Target Based Speech Act Classification in Political Campaign Text","authors":["Subramanian, Shivashankar","Cohn, Trevor","Baldwin, Timothy"],"emails":["shivashankar@student.unimelb.edu.au","t.cohn@unimelb.edu.au","tbaldwin@unimelb.edu.au"],"author_id":["shivashankar-subramanian","trevor-cohn","timothy-baldwin"],"abstract":"We study pragmatics in political campaign text, through analysis of speech acts and the target of each utterance. We propose a new annotation schema incorporating domain-specific speech acts, such as commissive-action, and present a novel annotated corpus of media releases and speech transcripts from the 2016 Australian election cycle. We show how speech acts and target referents can be modeled as sequential classification, and evaluate several techniques, exploiting contextualized word representations, semi-supervised learning, task dependencies and speaker meta-data.","pages":"273--282","doi":"10.18653\/v1\/S19-1030","url":"https:\/\/www.aclweb.org\/anthology\/S19-1030","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1031","title":"Incivility Detection in Online Comments","authors":["Sadeque, Farig","Rains, Stephen","Shmargad, Yotam","Kenski, Kate","Coe, Kevin","Bethard, Steven"],"emails":["farig@email.arizona.edu","srains@email.arizona.edu","yotam@email.arizona.edu","kkenski@email.arizona.edu","kevin.coe@utah.edu","bethard@email.arizona.edu"],"author_id":["farig-sadeque","stephen-rains","yotam-shmargad","kate-kenski","kevin-coe","steven-bethard"],"abstract":"Incivility in public discourse has been a major concern in recent times as it can affect the quality and tenacity of the discourse negatively. In this paper, we present neural models that can learn to detect name-calling and vulgarity from a newspaper comment section. We show that in contrast to prior work on detecting toxic language, fine-grained incivilities like namecalling cannot be accurately detected by simple models like logistic regression. We apply the models trained on the newspaper comments data to detect uncivil comments in a Russian troll dataset, and find that despite the change of domain, the model makes accurate predictions.","pages":"283--291","doi":"10.18653\/v1\/S19-1031","url":"https:\/\/www.aclweb.org\/anthology\/S19-1031","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"},{"id":"S19-1032","title":"Generating Animations from Screenplays","authors":["Zhang, Yeyao","Tsipidi, Eleftheria","Schriber, Sasha","Kapadia, Mubbasir","Gross, Markus","Modi, Ashutosh"],"emails":["yezhang@inf.ethz.ch","etsipidi@disneyresearch.com","sasha.schriber@disneyresearch.com","mubbasir.kapadia@rutgers.edu","gross@disneyresearch.com","ashutosh.modi@disneyresearch.com"],"author_id":["yeyao-zhang","eleftheria-tsipidi","sasha-schriber","mubbasir-kapadia","markus-gross","ashutosh-modi"],"abstract":"Automatically generating animation from natural language text finds application in a number of areas e.g. movie script writing, instructional videos, and public safety. However, translating natural language text into animation is a challenging task. Existing text-to-animation systems can handle only very simple sentences, which limits their applications. In this paper, we develop a text-to-animation system which is capable of handling complex sentences. We achieve this by introducing a text simplification step into the process. Building on an existing animation generation system for screenwriting, we create a robust NLP pipeline to extract information from screenplays and map them to the system{'}s knowledge base. We develop a set of linguistic transformation rules that simplify complex sentences. Information extracted from the simplified sentences is used to generate a rough storyboard and video depicting the text. Our sentence simplification module outperforms existing systems in terms of BLEU and SARI metrics.We further evaluated our system via a user study: 68{\\%} participants believe that our system generates reasonable animation from input screenplays.","pages":"292--307","doi":"10.18653\/v1\/S19-1032","url":"https:\/\/www.aclweb.org\/anthology\/S19-1032","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Eighth Joint Conference on Lexical and Computational Semantics (*{SEM} 2019)"}]