[{"id":"W16-3901","title":"Processing non-canonical or noisy text: fortuitous data to the rescue","authors":["Plank, Barbara"],"emails":["b.plank@rug.nl"],"author_id":["barbara-plank"],"abstract":"Real world data differs radically from the benchmark corpora we use in NLP, resulting in large performance drops. The reason for this problem is obvious: NLP models are trained on limited samples from canonical varieties considered standard. However, there are many dimensions, e.g., sociodemographic, language, genre, sentence type, etc. on which texts can differ from the standard. The solution is not obvious: we cannot control for all factors, and it is not clear how to best go beyond the current practice of training on homogeneous data from a single domain and language. In this talk, I review the notion of canonicity, and how it shapes our community{'}s approach to language. I argue for the use of fortuitous data. Fortuitous data is data out there that just waits to be harvested. It includes data which is in plain sight, but is often neglected, and more distant sources like behavioral data, which first need to be refined. They provide additional contexts and a myriad of opportunities to build more adaptive language technology, some of which I will explore in this talk.","pages":"1","url":"https:\/\/www.aclweb.org\/anthology\/W16-3901","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3902","title":"From Entity Linking to Question Answering {--} Recent Progress on Semantic Grounding Tasks","authors":["Chang, Ming-Wei"],"emails":["minchang@microsoft.com"],"author_id":["ming-wei-chang"],"abstract":"Entity linking and semantic parsing have been shown to be crucial to important applications such as question answering and document understanding. These tasks often require structured learning models, which make predictions on multiple interdependent variables. In this talk, I argue that carefully designed structured learning algorithms play a central role in entity linking and semantic parsing tasks. In particular, I will present several new structured learning models for entity linking, which jointly detect mentions and disambiguate entities as well as capture non-textual information. I will then show how to use a staged search procedure to building a state-of-the-art knowledge base question answering system. Finally, if time permits, I will discuss different supervision protocols for training semantic parsers and the value of labeling semantic parses.","pages":"2","url":"https:\/\/www.aclweb.org\/anthology\/W16-3902","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3903","title":"{DISAANA} and D-{SUMM}: Large-scale Real Time {NLP} Systems for Analyzing Disaster Related Reports in Tweets","authors":["Torisawa, Kentaro"],"emails":["torisawa@nict.go.jp"],"author_id":["kentaro-torisawa"],"abstract":"This talk presents two NLP systems that were developed for helping disaster victims and rescue workers in the aftermath of large-scale disasters. DISAANA provides answers to questions such as {``}What is in short supply in Tokyo?{''} and displays locations related to each answer on a map. D-SUMM automatically summarizes a large number of disaster related reports concerning a specified area and helps rescue workers to understand disaster situations from a macro perspective. Both systems are publicly available as Web services. In the aftermath of the 2016 Kumamoto Earthquake (M7.0), the Japanese government actually used DISAANA to analyze the situation.","pages":"3","url":"https:\/\/www.aclweb.org\/anthology\/W16-3903","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3904","title":"Private or Corporate? Predicting User Types on Twitter","authors":["Ljube{\\v{s}}i{\\'c}, Nikola","Fi{\\v{s}}er, Darja"],"emails":["nikola.ljubesic@ijs.si","darja.fiser@ff.uni-lj.si"],"author_id":["nikola-ljubesic","darja-fiser"],"abstract":"In this paper we present a series of experiments on discriminating between private and corporate accounts on Twitter. We define features based on Twitter metadata, morphosyntactic tags and surface forms, showing that the simple bag-of-words model achieves single best results that can, however, be improved by building a weighted soft ensemble of classifiers based on each feature type. Investigating the time and language dependence of each feature type delivers quite unexpecting results showing that features based on metadata are neither time- nor language-insensitive as the way the two user groups use the social network varies heavily through time and space.","pages":"4--12","url":"https:\/\/www.aclweb.org\/anthology\/W16-3904","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3905","title":"From Noisy Questions to {M}inecraft Texts: Annotation Challenges in Extreme Syntax Scenario","authors":["Mart{\\'\\i}nez Alonso, H{\\'e}ctor","Seddah, Djam{\\'e}","Sagot, Beno{\\^\\i}t"],"emails":["h{\\'e}ctor.mart{\\'\\i}nez alonso@inria.fr","djam{\\'e}.seddah@inria.fr","beno{\\^\\i}t.sagot@inria.fr"],"author_id":["hector-martinez-alonso","djame-seddah","benoit-sagot"],"abstract":"User-generated content presents many challenges for its automatic processing. While many of them do come from out-of-vocabulary effects, others spawn from different linguistic phenomena such as unusual syntax. In this work we present a French three-domain data set made up of question headlines from a cooking forum, game chat logs and associated forums from two popular online games (MINECRAFT {\\&} LEAGUE OF LEGENDS). We chose these domains because they encompass different degrees of lexical and syntactic compliance with canonical language. We conduct an automatic and manual evaluation of the difficulties of processing these domains for part-of-speech prediction, and introduce a pilot study to determine whether dependency analysis lends itself well to annotate these data. We also discuss the development cost of our data set.","pages":"13--23","url":"https:\/\/www.aclweb.org\/anthology\/W16-3905","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3906","title":"Disaster Analysis using User-Generated Weather Report","authors":["Asakura, Yasunobu","Hangyo, Masatsugu","Komachi, Mamoru"],"emails":["asakura-yasunobu@ed.tmu.ac.jp","hangyo@wni.com","komachi@tmu.ac.jp"],"author_id":["yasunobu-asakura","masatsugu-hangyo","mamoru-komachi"],"abstract":"Information extraction from user-generated text has gained much attention with the growth of the Web.Disaster analysis using information from social media provides valuable, real-time, geolocation information for helping people caught up these in disasters. However, it is not convenient to analyze texts posted on social media because disaster keywords match any texts that contain words. For collecting posts about a disaster from social media, we need to develop a classifier to filter posts irrelevant to disasters. Moreover, because of the nature of social media, we can take advantage of posts that come with GPS information. However, a post does not always refer to an event occurring at the place where it has been posted. Therefore, we propose a new task of classifying whether a flood disaster occurred, in addition to predicting the geolocation of events from user-generated text. We report the annotation of the flood disaster corpus and develop a classifier to demonstrate the use of this corpus for disaster analysis.","pages":"24--32","url":"https:\/\/www.aclweb.org\/anthology\/W16-3906","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3907","title":"Veracity Computing from Lexical Cues and Perceived Certainty Trends","authors":["Reichel, Uwe","Lendvai, Piroska"],"emails":["uwe.reichel@nytud.mta.hu","piroska.r@gmail.com"],"author_id":["uwe-reichel","piroska-lendvai"],"abstract":"We present a data-driven method for determining the veracity of a set of rumorous claims on social media data. Tweets from different sources pertaining to a rumor are processed on three levels: first, factuality values are assigned to each tweet based on four textual cue categories relevant for our journalism use case; these amalgamate speaker support in terms of polarity and commitment in terms of certainty and speculation. Next, the proportions of these lexical cues are utilized as predictors for tweet certainty in a generalized linear regression model. Subsequently, lexical cue proportions, predicted certainty, as well as their time course characteristics are used to compute veracity for each rumor in terms of the identity of the rumor-resolving tweet and its binary resolution value judgment. The system operates without access to extralinguistic resources. Evaluated on the data portion for which hand-labeled examples were available, it achieves .74 F1-score on identifying rumor resolving tweets and .76 F1-score on predicting if a rumor is resolved as true or false.","pages":"33--42","url":"https:\/\/www.aclweb.org\/anthology\/W16-3907","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3908","title":"A Simple but Effective Approach to Improve {A}rabizi-to-{E}nglish Statistical Machine Translation","authors":["van der Wees, Marlies","Bisazza, Arianna","Monz, Christof"],"emails":["m.e.vanderwees@uva.nl","a.bisazza@uva.nl","c.monz@uva.nl"],"author_id":["marlies-van-der-wees","arianna-bisazza","christof-monz"],"abstract":"A major challenge for statistical machine translation (SMT) of Arabic-to-English user-generated text is the prevalence of text written in Arabizi, or Romanized Arabic. When facing such texts, a translation system trained on conventional Arabic-English data will suffer from extremely low model coverage. In addition, Arabizi is not regulated by any official standardization and therefore highly ambiguous, which prevents rule-based approaches from achieving good translation results. In this paper, we improve Arabizi-to-English machine translation by presenting a simple but effective Arabizi-to-Arabic transliteration pipeline that does not require knowledge by experts or native Arabic speakers. We incorporate this pipeline into a phrase-based SMT system, and show that translation quality after automatically transliterating Arabizi to Arabic yields results that are comparable to those achieved after human transliteration.","pages":"43--50","url":"https:\/\/www.aclweb.org\/anthology\/W16-3908","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3909","title":"Name Variation in Community Question Answering Systems","authors":["Andy, Anietie","Sekine, Satoshi","Rwebangira, Mugizi","Dredze, Mark"],"emails":["anietie.andy@bison.howard.edu","sekine@cs.nyu.edu","rweba@scs.howard.edu","mdredze@cs.jhu.edu"],"author_id":["anietie-andy","satoshi-sekine","mugizi-rwebangira","mark-dredze"],"abstract":"Name Variation in Community Question Answering Systems Abstract Community question answering systems are forums where users can ask and answer questions in various categories. Examples are Yahoo! Answers, Quora, and Stack Overflow. A common challenge with such systems is that a significant percentage of asked questions are left unanswered. In this paper, we propose an algorithm to reduce the number of unanswered questions in Yahoo! Answers by reusing the answer to the most similar past resolved question to the unanswered question, from the site. Semantically similar questions could be worded differently, thereby making it difficult to find questions that have shared needs. For example, {``}Who is the best player for the Reds?{''} and {``}Who is currently the biggest star at Manchester United?{''} have a shared need but are worded differently; also, {``}Reds{''} and {``}Manchester United{''} are used to refer to the soccer team Manchester United football club. In this research, we focus on question categories that contain a large number of named entities and entity name variations. We show that in these categories, entity linking can be used to identify relevant past resolved questions with shared needs as a given question by disambiguating named entities and matching these questions based on the disambiguated entities, identified entities, and knowledge base information related to these entities. We evaluated our algorithm on a new dataset constructed from Yahoo! Answers. The dataset contains annotated question pairs, (Qgiven, [Qpast, Answer]). We carried out experiments on several question categories and show that an entity-based approach gives good performance when searching for similar questions in entity rich categories.","pages":"51--60","url":"https:\/\/www.aclweb.org\/anthology\/W16-3909","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3910","title":"Whose Nickname is This? Recognizing Politicians from Their Aliases","authors":["Wang, Wei-Chung","Chen, Hung-Chen","Ji, Zhi-Kai","Hsiao, Hui-I","Chiu, Yu-Shian","Ku, Lun-Wei"],"emails":["anthonywang@iis.sinica.edu.tw","hankchen@iis.sinica.edu.tw","kevinchi@iii.org.tw","hhsiao@iii.org.tw","samuelchiu@iii.org.tw","lwku@iis.sinica.edu.tw"],"author_id":["wei-chung-wang","hung-chen-chen","zhi-kai-ji","hui-i-hsiao","yu-shian-chiu","lun-wei-ku"],"abstract":"Using aliases to refer to public figures is one way to make fun of people, to express sarcasm, or even to sidestep legal issues when expressing opinions on social media. However, linking an alias back to the real name is difficult, as it entails phonemic, graphemic, and semantic challenges. In this paper, we propose a phonemic-based approach and inject semantic information to align aliases with politicians{'} Chinese formal names. The proposed approach creates an HMM model for each name to model its phonemes and takes into account document-level pairwise mutual information to capture the semantic relations to the alias. In this work we also introduce two new datasets consisting of 167 phonemic pairs and 279 mixed pairs of aliases and formal names. Experimental results show that the proposed approach models both phonemic and semantic information and outperforms previous work on both the phonemic and mixed datasets with the best top-1 accuracies of 0.78 and 0.59 respectively.","pages":"61--69","url":"https:\/\/www.aclweb.org\/anthology\/W16-3910","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3911","title":"Towards Accurate Event Detection in Social Media: A Weakly Supervised Approach for Learning Implicit Event Indicators","authors":["Jain, Ajit","Kasiviswanathan, Girish","Huang, Ruihong"],"emails":["ajitjain@cse.tamu.edu","girishk14@cse.tamu.edu","huangrh@cse.tamu.edu"],"author_id":["ajit-jain","girish-kasiviswanathan","ruihong-huang"],"abstract":"Accurate event detection in social media is very challenging because user generated contents are extremely noisy and sparse in content. Event indicators are generally words or phrases that act as a trigger that help us understand the semantics of the context they occur in. We present a weakly supervised approach that relies on using a single strong event indicator phrase as a seed to acquire a variety of additional event cues. We propose to leverage various types of implicit event indicators, such as props, actors and precursor events, to achieve precise event detection. We experimented with civil unrest events and show that the automatically learnt event indicators are effective in identifying specific types of events.","pages":"70--77","url":"https:\/\/www.aclweb.org\/anthology\/W16-3911","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3912","title":"Unsupervised Stemmer for {A}rabic Tweets","authors":["Albogamy, Fahad","Ramsay, Allan"],"emails":["albogamf@cs.man.ac.uk","allan.ramsay@cs.man.ac.uk"],"author_id":["fahad-albogamy","allan-ramsay"],"abstract":"Stemming is an essential processing step in a wide range of high level text processing applications such as information extraction, machine translation and sentiment analysis. It is used to reduce words to their stems. Many stemming algorithms have been developed for Modern Standard Arabic (MSA). Although Arabic tweets and MSA are closely related and share many characteristics, there are substantial differences between them in lexicon and syntax. In this paper, we introduce a light Arabic stemmer for Arabic tweets. Our results show improvements over the performance of a number of well-known stemmers for Arabic.","pages":"78--84","url":"https:\/\/www.aclweb.org\/anthology\/W16-3912","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3913","title":"Topic Stability over Noisy Sources","authors":["Su, Jing","Greene, Derek","Boydell, Ois{\\'\\i}n"],"emails":["jing.su@ucd.ie","derek.greene@ucd.ie","oisin.boydell@ucd.ie"],"author_id":["jing-su","derek-greene","oisin-boydell"],"abstract":"Topic modelling techniques such as LDA have recently been applied to speech transcripts and OCR output. These corpora may contain noisy or erroneous texts which may undermine topic stability. Therefore, it is important to know how well a topic modelling algorithm will perform when applied to noisy data. In this paper we show that different types of textual noise can have diverse effects on the stability of topic models. On the other hand, topic model stability is not consistent with the same type but different levels of noise. We introduce a dictionary filtering approach to address this challenge, with the result that a topic model with the correct number of topics is always identified across different levels of noise.","pages":"85--93","url":"https:\/\/www.aclweb.org\/anthology\/W16-3913","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3914","title":"Analysis of Twitter Data for Postmarketing Surveillance in Pharmacovigilance","authors":["Pain, Julie","Levacher, Jessie","Quinquenel, Adam","Belz, Anja"],"emails":["julie.pain@insa-rouen.fr","jessie.levacher@insa-rouen.fr","adam.quinquenel@insa-rouen.fr","a.s.belz@brighton.ac.uk"],"author_id":["julie-pain","jessie-levacher","adam-quinquenel","anja-belz"],"abstract":"Postmarketing surveillance (PMS) has the vital aim to monitor effects of drugs after release for use by the general population, but suffers from under-reporting and limited coverage. Automatic methods for detecting drug effect reports, especially for social media, could vastly increase the scope of PMS. Very few automatic PMS methods are currently available, in particular for the messy text types encountered on Twitter. In this paper we describe first results for developing PMS methods specifically for tweets. We describe the corpus of 125,669 tweets we have created and annotated to train and test the tools. We find that generic tools perform well for tweet-level language identification and tweet-level sentiment analysis (both 0.94 F1-Score). For detection of effect mentions we are able to achieve 0.87 F1-Score, while effect-level adverse-vs.-beneficial analysis proves harder with an F1-Score of 0.64. Among other things, our results indicate that MetaMap semantic types provide a very promising basis for identifying drug effect mentions in tweets.","pages":"94--101","url":"https:\/\/www.aclweb.org\/anthology\/W16-3914","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3915","title":"Named Entity Recognition and Hashtag Decomposition to Improve the Classification of Tweets","authors":["Belainine, Billal","Fonseca, Alexsandro","Sadat, Fatiha"],"emails":["belainine.billal@courrier.uqam.ca","affonseca@gmail.com","sadat.fatiha@uqam.ca"],"author_id":["billal-belainine","alexsandro-fonseca","fatiha-sadat"],"abstract":"In social networks services like Twitter, users are overwhelmed with huge amount of social data, most of which are short, unstructured and highly noisy. Identifying accurate information from this huge amount of data is indeed a hard task. Classification of tweets into organized form will help the user to easily access these required information. Our first contribution relates to filtering parts of speech and preprocessing this kind of highly noisy and short data. Our second contribution concerns the named entity recognition (NER) in tweets. Thus, the adaptation of existing language tools for natural languages, noisy and not accurate language tweets, is necessary. Our third contribution involves segmentation of hashtags and a semantic enrichment using a combination of relations from WordNet, which helps the performance of our classification system, including disambiguation of named entities, abbreviations and acronyms. Graph theory is used to cluster the words extracted from WordNet and tweets, based on the idea of connected components. We test our automatic classification system with four categories: politics, economy, sports and the medical field. We evaluate and compare several automatic classification systems using part or all of the items described in our contributions and found that filtering by part of speech and named entity recognition dramatically increase the classification precision to 77.3 {\\%}. Moreover, a classification system incorporating segmentation of hashtags and semantic enrichment by two relations from WordNet, synonymy and hyperonymy, increase classification precision up to 83.4 {\\%}.","pages":"102--111","url":"https:\/\/www.aclweb.org\/anthology\/W16-3915","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3916","title":"Exploring Word Embeddings for Unsupervised Textual User-Generated Content Normalization","authors":["Costa Bertaglia, Thales Felipe","Volpe Nunes, Maria das Gra{\\c{c}}as"],"emails":["thales.bertaglia@usp.br","gracan@icmc.usp.br"],"author_id":["thales-felipe-costa-bertaglia","maria-das-gracas-volpe-nunes"],"abstract":"Text normalization techniques based on rules, lexicons or supervised training requiring large corpora are not scalable nor domain interchangeable, and this makes them unsuitable for normalizing user-generated content (UGC). Current tools available for Brazilian Portuguese make use of such techniques. In this work we propose a technique based on distributed representation of words (or word embeddings). It generates continuous numeric vectors of high-dimensionality to represent words. The vectors explicitly encode many linguistic regularities and patterns, as well as syntactic and semantic word relationships. Words that share semantic similarity are represented by similar vectors. Based on these features, we present a totally unsupervised, expandable and language and domain independent method for learning normalization lexicons from word embeddings. Our approach obtains high correction rate of orthographic errors and internet slang in product reviews, outperforming the current available tools for Brazilian Portuguese.","pages":"112--120","url":"https:\/\/www.aclweb.org\/anthology\/W16-3916","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3917","title":"How Document Pre-processing affects Keyphrase Extraction Performance","authors":["Boudin, Florian","Mougard, Hugo","Cram, Damien"],"emails":["florian.boudin@univ-nantes.fr","hugo.mougard@univ-nantes.fr","damien.cram@univ-nantes.fr"],"author_id":["florian-boudin","hugo-mougard","damien-cram"],"abstract":"The SemEval-2010 benchmark dataset has brought renewed attention to the task of automatic keyphrase extraction. This dataset is made up of scientific articles that were automatically converted from PDF format to plain text and thus require careful preprocessing so that irrevelant spans of text do not negatively affect keyphrase extraction performance. In previous work, a wide range of document preprocessing techniques were described but their impact on the overall performance of keyphrase extraction models is still unexplored. Here, we re-assess the performance of several keyphrase extraction models and measure their robustness against increasingly sophisticated levels of document preprocessing.","pages":"121--128","url":"https:\/\/www.aclweb.org\/anthology\/W16-3917","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3918","title":"{J}apanese Text Normalization with Encoder-Decoder Model","authors":["Ikeda, Taishi","Shindo, Hiroyuki","Matsumoto, Yuji"],"emails":["ikeda.taishi.io7@is.naist.jp","shindo@is.naist.jp","matsu@is.naist.jp"],"author_id":["taishi-ikeda","hiroyuki-shindo","yuji-matsumoto"],"abstract":"Text normalization is the task of transforming lexical variants to their canonical forms. We model the problem of text normalization as a character-level sequence to sequence learning problem and present a neural encoder-decoder model for solving it. To train the encoder-decoder model, many sentences pairs are generally required. However, Japanese non-standard canonical pairs are scarce in the form of parallel corpora. To address this issue, we propose a method of data augmentation to increase data size by converting existing resources into synthesized non-standard forms using handcrafted rules. We conducted an experiment to demonstrate that the synthesized corpus contributes to stably train an encoder-decoder model and improve the performance of Japanese text normalization.","pages":"129--137","url":"https:\/\/www.aclweb.org\/anthology\/W16-3918","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3919","title":"Results of the {WNUT}16 Named Entity Recognition Shared Task","authors":["Strauss, Benjamin","Toma, Bethany","Ritter, Alan","de Marneffe, Marie-Catherine","Xu, Wei"],"emails":["strauss.105@osu.edu","toma.18@osu.edu","ritter.1492@osu.edu","demarneffe.1@osu.edu","xu.1265@osu.edu"],"author_id":["benjamin-strauss","bethany-toma","alan-ritter","marie-catherine-de-marneffe","wei-xu"],"abstract":"This paper presents the results of the Twitter Named Entity Recognition shared task associated with W-NUT 2016: a named entity tagging task with 10 teams participating. We outline the shared task, annotation process and dataset statistics, and provide a high-level overview of the participating systems for each shared task.","pages":"138--144","url":"https:\/\/www.aclweb.org\/anthology\/W16-3919","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3920","title":"Bidirectional {LSTM} for Named Entity Recognition in Twitter Messages","authors":["Limsopatham, Nut","Collier, Nigel"],"emails":["nl347@cam.ac.uk","nhc30@cam.ac.uk"],"author_id":["nut-limsopatham","nigel-collier"],"abstract":"In this paper, we present our approach for named entity recognition in Twitter messages that we used in our participation in the Named Entity Recognition in Twitter shared task at the COLING 2016 Workshop on Noisy User-generated text (WNUT). The main challenge that we aim to tackle in our participation is the short, noisy and colloquial nature of tweets, which makes named entity recognition in Twitter message a challenging task. In particular, we investigate an approach for dealing with this problem by enabling bidirectional long short-term memory (LSTM) to automatically learn orthographic features without requiring feature engineering. In comparison with other systems participating in the shared task, our system achieved the most effective performance on both the {`}segmentation and categorisation{'} and the {`}segmentation only{'} sub-tasks.","pages":"145--152","url":"https:\/\/www.aclweb.org\/anthology\/W16-3920","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3921","title":"Learning to recognise named entities in tweets by exploiting weakly labelled data","authors":["Espinosa, Kurt Junshean","Batista-Navarro, Riza Theresa","Ananiadou, Sophia"],"emails":["kurtjunshean.espinosa@postgrad.manchester.ac.uk","riza.batista@manchester.ac.uk","sophia.ananiadou@manchester.ac.uk"],"author_id":["kurt-junshean-espinosa","riza-theresa-batista-navarro","sophia-ananiadou"],"abstract":"Named entity recognition (NER) in social media (e.g., Twitter) is a challenging task due to the noisy nature of text. As part of our participation in the W-NUT 2016 Named Entity Recognition Shared Task, we proposed an unsupervised learning approach using deep neural networks and leverage a knowledge base (i.e., DBpedia) to bootstrap sparse entity types with weakly labelled data. To further boost the performance, we employed a more sophisticated tagging scheme and applied dropout as a regularisation technique in order to reduce overfitting. Even without hand-crafting linguistic features nor leveraging any of the W-NUT-provided gazetteers, we obtained robust performance with our approach, which ranked third amongst all shared task participants according to the official evaluation on a gold standard named entity-annotated corpus of 3,856 tweets.","pages":"153--163","url":"https:\/\/www.aclweb.org\/anthology\/W16-3921","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3922","title":"Feature-Rich Twitter Named Entity Recognition and Classification","authors":["Sikdar, Utpal Kumar","Gamb{\\\"a}ck, Bj{\\\"o}rn"],"emails":["sikdar.utpal@idi.ntnu.no","gamback@idi.ntnu.no"],"author_id":["utpal-kumar-sikdar","bjorn-gamback"],"abstract":"Twitter named entity recognition is the process of identifying proper names and classifying them into some predefined labels\/categories. The paper introduces a Twitter named entity system using a supervised machine learning approach, namely Conditional Random Fields. A large set of different features was developed and the system was trained using these. The Twitter named entity task can be divided into two parts: i) Named entity extraction from tweets and ii) Twitter name classification into ten different types. For Twitter named entity recognition on unseen test data, our system obtained the second highest F1 score in the shared task: 63.22{\\%}. The system performance on the classification task was worse, with an F1 measure of 40.06{\\%} on unseen test data, which was the fourth best of the ten systems participating in the shared task.","pages":"164--170","url":"https:\/\/www.aclweb.org\/anthology\/W16-3922","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3923","title":"Learning to Search for Recognizing Named Entities in Twitter","authors":["Partalas, Ioannis","Lopez, C{\\'e}dric","Derbas, Nadia","Kalitvianski, Ruslan"],"emails":["ioannis.partalas@viseo.com","c{\\'e}dric.lopez@viseo.com","nadia.derbas@viseo.com","ruslan.kalitvianski@viseo.com"],"author_id":["ioannis-partalas","cedric-lopez","nadia-derbas","ruslan-kalitvianski"],"abstract":"We presented in this work our participation in the 2nd Named Entity Recognition for Twitter shared task. The task has been cast as a sequence labeling one and we employed a learning to search approach in order to tackle it. We also leveraged LOD for extracting rich contextual features for the named-entities. Our submission achieved F-scores of 46.16 and 60.24 for the classification and the segmentation tasks and ranked 2nd and 3rd respectively. The post-analysis showed that LOD features improved substantially the performance of our system as they counter-balance the lack of context in tweets. The shared task gave us the opportunity to test the performance of NER systems in short and noisy textual data. The results of the participated systems shows that the task is far to be considered as a solved one and methods with stellar performance in normal texts need to be revised.","pages":"171--177","url":"https:\/\/www.aclweb.org\/anthology\/W16-3923","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3924","title":"{D}eep{NNNER}: Applying {BLSTM}-{CNN}s and Extended Lexicons to Named Entity Recognition in Tweets","authors":["Dugas, Fabrice","Nichols, Eric"],"emails":["faberice.dugas@gmail.com","e.nichols@jp.honda-ri.com"],"author_id":["fabrice-dugas","eric-nichols"],"abstract":"In this paper, we describe the DeepNNNER entry to The 2nd Workshop on Noisy User-generated Text (WNUT) Shared Task {\\#}2: Named Entity Recognition in Twitter. Our shared task submission adopts the bidirectional LSTM-CNN model of Chiu and Nichols (2016), as it has been shown to perform well on both newswire and Web texts. It uses word embeddings trained on large-scale Web text collections together with text normalization to cope with the diversity in Web texts, and lexicons for target named entity classes constructed from publicly-available sources. Extended evaluation comparing the effectiveness of various word embeddings, text normalization, and lexicon settings shows that our system achieves a maximum F1-score of 47.24, performance surpassing that of the shared task{'}s second-ranked system.","pages":"178--187","url":"https:\/\/www.aclweb.org\/anthology\/W16-3924","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3925","title":"{ASU}: An Experimental Study on Applying Deep Learning in Twitter Named Entity Recognition.","authors":["Gerguis, Michel Naim","Salama, Cherif","El-Kharashi, M. Watheq"],"emails":["michel.naim.naguib.gerguis@gmail.com","cherif.salama@eng.asu.edu.eg","watheq.elkharashi@eng.asu.edu.eg"],"author_id":["michel-naim-gerguis","cherif-salama","m-watheq-el-kharashi"],"abstract":"This paper describes the ASU system submitted in the COLING W-NUT 2016 Twitter Named Entity Recognition (NER) task. We present an experimental study on applying deep learning to extracting named entities (NEs) from tweets. We built two Long Short-Term Memory (LSTM) models for the task. The first model was built to extract named entities without types while the second model was built to extract and then classify them into 10 fine-grained entity classes. In this effort, we show detailed experimentation results on the effectiveness of word embeddings, brown clusters, part-of-speech (POS) tags, shape features, gazetteers, and local context for the tweet input vector representation to the LSTM model. Also, we present a set of experiments, to better design the network parameters for the Twitter NER task. Our system was ranked the fifth out of ten participants with a final f1-score for the typed classes of 39{\\%} and 55{\\%} for the non typed ones.","pages":"188--196","url":"https:\/\/www.aclweb.org\/anthology\/W16-3925","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3926","title":"{UQAM}-{NTL}: Named entity recognition in Twitter messages","authors":["Le, Ngoc Tan","Mallek, Fatma","Sadat, Fatiha"],"emails":["le.ngoc_tan@courrier.uqam.ca","mallek.fatma@courrier.uqam.ca","sadat.fatiha@uqam.ca"],"author_id":["ngoc-tan-le","fatma-mallek","fatiha-sadat"],"abstract":"This paper describes our system used in the 2nd Workshop on Noisy User-generated Text (WNUT) shared task for Named Entity Recognition (NER) in Twitter, in conjunction with Coling 2016. Our system is based on supervised machine learning by applying Conditional Random Fields (CRF) to train two classifiers for two evaluations. The first evaluation aims at predicting the 10 fine-grained types of named entities; while the second evaluation aims at predicting no type of named entities. The experimental results show that our method has significantly improved Twitter NER performance.","pages":"197--202","url":"https:\/\/www.aclweb.org\/anthology\/W16-3926","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3927","title":"Semi-supervised Named Entity Recognition in noisy-text","authors":["Mishra, Shubhanshu","Diesner, Jana"],"emails":["smishra8@illinois.edu","jdiesner@illinois.edu"],"author_id":["shubhanshu-mishra","jana-diesner"],"abstract":"Many of the existing Named Entity Recognition (NER) solutions are built based on news corpus data with proper syntax. These solutions might not lead to highly accurate results when being applied to noisy, user generated data, e.g., tweets, which can feature sloppy spelling, concept drift, and limited contextualization of terms and concepts due to length constraints. The models described in this paper are based on linear chain conditional random fields (CRFs), use the BIEOU encoding scheme, and leverage random feature dropout for up-sampling the training data. The considered features include word clusters and pre-trained distributed word representations, updated gazetteer features, and global context predictions. The latter feature allows for ingesting the meaning of new or rare tokens into the system via unsupervised learning and for alleviating the need to learn lexicon based features, which usually tend to be high dimensional. In this paper, we report on the solution [ST] we submitted to the WNUT 2016 NER shared task. We also present an improvement over our original submission [SI], which we built by using semi-supervised learning on labelled training data and pre-trained resourced constructed from unlabelled tweet data. Our ST solution achieved an F1 score of 1.2{\\%} higher than the baseline (35.1{\\%} F1) for the task of extracting 10 entity types. The SI resulted in an increase of 8.2{\\%} in F1 score over the base-line (7.08{\\%} over ST). Finally, the SI model{'}s evaluation on the test data achieved a F1 score of 47.3{\\%} ({\\textasciitilde}1.15{\\%} increase over the 2nd best submitted solution). Our experimental setup and results are available as a standalone twitter NER tool at \\url{https:\/\/github.com\/napsternxg\/TwitterNER}.","pages":"203--212","url":"https:\/\/www.aclweb.org\/anthology\/W16-3927","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3928","title":"Twitter Geolocation Prediction Shared Task of the 2016 Workshop on Noisy User-generated Text","authors":["Han, Bo","Rahimi, Afshin","Derczynski, Leon","Baldwin, Timothy"],"emails":["bhan@hugo.ai","arahimi@student.unimelb.edu.au","leon.d@shef.ac.uk","tb@ldwin.net"],"author_id":["bo-han","afshin-rahimi","leon-derczynski","timothy-baldwin"],"abstract":"This paper presents the shared task for English Twitter geolocation prediction in WNUT 2016. We discuss details of task settings, data preparations and participant systems. The derived dataset and performance figures from each system provide baselines for future research in this realm.","pages":"213--217","url":"https:\/\/www.aclweb.org\/anthology\/W16-3928","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3929","title":"{CSIRO} {D}ata61 at the {WNUT} Geo Shared Task","authors":["Jayasinghe, Gaya","Jin, Brian","Mchugh, James","Robinson, Bella","Wan, Stephen"],"emails":["gaya.jayasinghe@data61.csiro.au","brian.jin@data61.csiro.au","james.mchugh@data61.csiro.au","bella.robinson@data61.csiro.au","stephen.wan@data61.csiro.au"],"author_id":["gaya-jayasinghe","brian-jin","james-mchugh","bella-robinson","stephen-wan"],"abstract":"In this paper, we describe CSIRO Data61{'}s participation in the Geolocation shared task at the Workshop for Noisy User-generated Text. Our approach was to use ensemble methods to capitalise on four component methods: heuristics based on metadata, a label propagation method, timezone text classifiers, and an information retrieval approach. The ensembles we explored focused on examining the role of language technologies in geolocation prediction and also in examining the use of hard voting and cascading ensemble methods. Based on the accuracy of city-level predictions, our systems were the best performing submissions at this year{'}s shared task. Furthermore, when estimating the latitude and longitude of a user, our median error distance was accurate to within 30 kilometers.","pages":"218--226","url":"https:\/\/www.aclweb.org\/anthology\/W16-3929","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3930","title":"Geolocation Prediction in Twitter Using Location Indicative Words and Textual Features","authors":["Chi, Lianhua","Lim, Kwan Hui","Alam, Nebula","Butler, Christopher J."],"emails":["lianhuac@au1.ibm.com","limk2@student.unimelb.edu.au","anebula@au1.ibm.com","chris.butler@au1.ibm.com"],"author_id":["lianhua-chi","kwan-hui-lim","nebula-alam","christopher-j-butler"],"abstract":"Knowing the location of a social media user and their posts is important for various purposes, such as the recommendation of location-based items\/services, and locality detection of crisis\/disasters. This paper describes our submission to the shared task {``}Geolocation Prediction in Twitter{''} of the 2nd Workshop on Noisy User-generated Text. In this shared task, we propose an algorithm to predict the location of Twitter users and tweets using a multinomial Naive Bayes classifier trained on Location Indicative Words and various textual features (such as city\/country names, {\\#}hashtags and @mentions). We compared our approach against various baselines based on Location Indicative Words, city\/country names, {\\#}hashtags and @mentions as individual feature sets, and experimental results show that our approach outperforms these baselines in terms of classification accuracy, mean and median error distance.","pages":"227--234","url":"https:\/\/www.aclweb.org\/anthology\/W16-3930","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"},{"id":"W16-3931","title":"A Simple Scalable Neural Networks based Model for Geolocation Prediction in Twitter","authors":["Miura, Yasuhide","Taniguchi, Motoki","Taniguchi, Tomoki","Ohkuma, Tomoko"],"emails":["yasuhide.miura@fujixerox.co.jp","motoki.taniguchi@fujixerox.co.jp","taniguchi.tomoki@fujixerox.co.jp","ohkuma.tomoko@fujixerox.co.jp"],"author_id":["yasuhide-miura","motoki-taniguchi","tomoki-taniguchi","tomoko-ohkuma"],"abstract":"This paper describes a model that we submitted to W-NUT 2016 Shared task {\\#}1: Geolocation Prediction in Twitter. Our model classifies a tweet or a user to a city using a simple neural networks structure with fully-connected layers and average pooling processes. From the findings of previous geolocation prediction approaches, we integrated various user metadata along with message texts and trained the model with them. In the test run of the task, the model achieved the accuracy of 40.91{\\%} and the median distance error of 69.50 km in message-level prediction and the accuracy of 47.55{\\%} and the median distance error of 16.13 km in user-level prediction. These results are moderate performances in terms of accuracy and best performances in terms of distance. The results show a promising extension of neural networks based models for geolocation prediction where recent advances in neural networks can be added to enhance our current simple model.","pages":"235--239","url":"https:\/\/www.aclweb.org\/anthology\/W16-3931","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 2nd Workshop on Noisy User-generated Text ({WNUT})"}]