[{"id":"W16-5101","title":"Cancer Hallmark Text Classification Using Convolutional Neural Networks","authors":["Baker, Simon","Korhonen, Anna","Pyysalo, Sampo"],"emails":["simon.baker@cl.cam.ac.uk","alk23@cam.ac.uk","sampo@pyysalo.net"],"author_id":["simon-baker","anna-korhonen","sampo-pyysalo"],"abstract":"Methods based on deep learning approaches have recently achieved state-of-the-art performance in a range of machine learning tasks and are increasingly applied to natural language processing (NLP). Despite strong results in various established NLP tasks involving general domain texts, there is only limited work applying these models to biomedical NLP. In this paper, we consider a Convolutional Neural Network (CNN) approach to biomedical text classification. Evaluation using a recently introduced cancer domain dataset involving the categorization of documents according to the well-established hallmarks of cancer shows that a basic CNN model can achieve a level of performance competitive with a Support Vector Machine (SVM) trained using complex manually engineered features optimized to the task. We further show that simple modifications to the CNN hyperparameters, initialization, and training process allow the model to notably outperform the SVM, establishing a new state of the art result at this task. We make all of the resources and tools introduced in this study available under open licenses from \\url{https:\/\/cambridgeltl.github.io\/cancer-hallmark-cnn\/}.","pages":"1--9","url":"https:\/\/www.aclweb.org\/anthology\/W16-5101","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5102","title":"Learning Orthographic Features in Bi-directional {LSTM} for Biomedical Named Entity Recognition","authors":["Limsopatham, Nut","Collier, Nigel"],"emails":["nl347@cam.ac.uk","nhc30@cam.ac.uk"],"author_id":["nut-limsopatham","nigel-collier"],"abstract":"End-to-end neural network models for named entity recognition (NER) have shown to achieve effective performances on general domain datasets (e.g. newswire), without requiring additional hand-crafted features. However, in biomedical domain, recent studies have shown that hand-engineered features (e.g. orthographic features) should be used to attain effective performance, due to the complexity of biomedical terminology (e.g. the use of acronyms and complex gene names). In this work, we propose a novel approach that allows a neural network model based on a long short-term memory (LSTM) to automatically learn orthographic features and incorporate them into a model for biomedical NER. Importantly, our bi-directional LSTM model learns and leverages orthographic features on an end-to-end basis. We evaluate our approach by comparing against existing neural network models for NER using three well-established biomedical datasets. Our experimental results show that the proposed approach consistently outperforms these strong baselines across all of the three datasets.","pages":"10--19","url":"https:\/\/www.aclweb.org\/anthology\/W16-5102","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5103","title":"Building Content-driven Entity Networks for Scarce Scientific Literature using Content Information","authors":["Amplayo, Reinald Kim","Song, Min"],"emails":["rktamplayo@yonsei.ac.kr","min.song@yonsei.ac.kr"],"author_id":["reinald-kim-amplayo","min-song"],"abstract":"This paper proposes several network construction methods for collections of scarce scientific literature data. We define scarcity as lacking in value and in volume. Instead of using the paper{'}s metadata to construct several kinds of scientific networks, we use the full texts of the articles and automatically extract the entities needed to construct the networks. Specifically, we present seven kinds of networks using the proposed construction methods: co-occurrence networks for author, keyword, and biological entities, and citation networks for author, keyword, biological, and topic entities. We show two case studies that applies our proposed methods: CADASIL, a rare yet the most common form of hereditary stroke disorder, and Metformin, the first-line medication to the type 2 diabetes treatment. We apply our proposed method to four different applications for evaluation: finding prolific authors, finding important bio-entities, finding meaningful keywords, and discovering influential topics. The results show that the co-occurrence and citation networks constructed using the proposed method outperforms the traditional-based networks. We also compare our proposed networks to traditional citation networks constructed using enough data and infer that even with the same amount of enough data, our methods perform comparably or better than the traditional methods.","pages":"20--29","url":"https:\/\/www.aclweb.org\/anthology\/W16-5103","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5104","title":"Named Entity Recognition in {S}wedish Health Records with Character-Based Deep Bidirectional {LSTM}s","authors":["Almgren, Simon","Pavlov, Sean","Mogren, Olof"],"emails":["","","olof@mogren.one"],"author_id":["simon-almgren","sean-pavlov","olof-mogren"],"abstract":"We propose an approach for named entity recognition in medical data, using a character-based deep bidirectional recurrent neural network. Such models can learn features and patterns based on the character sequence, and are not limited to a fixed vocabulary. This makes them very well suited for the NER task in the medical domain. Our experimental evaluation shows promising results, with a 60{\\%} improvement in F 1 score over the baseline, and our system generalizes well between different datasets.","pages":"30--39","url":"https:\/\/www.aclweb.org\/anthology\/W16-5104","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5105","title":"Entity-Supported Summarization of Biomedical Abstracts","authors":["Schulze, Frederik","Neves, Mariana"],"emails":["","mariana.neves@hpi.de"],"author_id":["frederik-schulze","mariana-neves"],"abstract":"The increasing amount of biomedical information that is available for researchers and clinicians makes it harder to quickly find the right information. Automatic summarization of multiple texts can provide summaries specific to the user{'}s information needs. In this paper we look into the use named-entity recognition for graph-based summarization. We extend the LexRank algorithm with information about named entities and present EntityRank, a multi-document graph-based summarization algorithm that is solely based on named entities. We evaluate our system on a datasets of 1009 human written summaries provided by BioASQ and on 1974 gene summaries, fetched from the Entrez Gene database. The results show that the addition of named-entity information increases the performance of graph-based summarizers and that the EntityRank significantly outperforms the other methods with regard to the ROUGE measures.","pages":"40--49","url":"https:\/\/www.aclweb.org\/anthology\/W16-5105","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5106","title":"Fully unsupervised low-dimensional representation of adverse drug reaction events through distributional semantics","authors":["P{\\'e}rez, Alicia","Casillas, Arantza","Gojenola, Koldo"],"emails":["alicia.perez@ehu.eus","arantza.casillas@ehu.eus","koldo.gojenola@ehu.eus"],"author_id":["alicia-perez","arantza-casillas","koldo-gojenola"],"abstract":"Electronic health records show great variability since the same concept is often expressed with different terms, either scientific latin forms, common or lay variants and even vernacular naming. Deep learning enables distributional representation of terms in a vector-space, and therefore, related terms tend to be close in the vector space. Accordingly, embedding words through these vectors opens the way towards accounting for semantic relatedness through classical algebraic operations. In this work we propose a simple though efficient unsupervised characterization of Adverse Drug Reactions (ADRs). This approach exploits the embedding representation of the terms involved in candidate ADR events, that is, drug-disease entity pairs. In brief, the ADRs are represented as vectors that link the drug with the disease in their context through a recursive additive model. We discovered that a low-dimensional representation that makes use of the modulus and argument of the embedded representation of the ADR event shows correlation with the manually annotated class. Thus, it can be derived that this characterization results in to be beneficial for further classification tasks as predictive features.","pages":"50--59","url":"https:\/\/www.aclweb.org\/anthology\/W16-5106","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5107","title":"A Dataset for {ICD}-10 Coding of Death Certificates: Creation and Usage","authors":["Lavergne, Thomas","N{\\'e}v{\\'e}ol, Aur{\\'e}lie","Robert, Aude","Grouin, Cyril","Rey, Gr{\\'e}goire","Zweigenbaum, Pierre"],"emails":["lavergne@limsi.fr","neveol@limsi.fr","aude.robert@inserm.fr","grouin@limsi.fr","gregoire.rey@inserm.fr","pz@limsi.fr"],"author_id":["thomas-lavergne","aurelie-neveol","aude-robert","cyril-grouin","gregoire-rey","pierre-zweigenbaum"],"abstract":"Very few datasets have been released for the evaluation of diagnosis coding with the International Classification of Diseases, and only one so far in a language other than English. This paper describes a large-scale dataset prepared from French death certificates, and the problems which needed to be solved to turn it into a dataset suitable for the application of machine learning and natural language processing methods of ICD-10 coding. The dataset includes the free-text statements written by medical doctors, the associated meta-data, the human coder-assigned codes for each statement, as well as the statement segments which supported the coder{'}s decision for each code. The dataset comprises 93,694 death certificates totalling 276,103 statements and 377,677 ICD-10 code assignments (3,457 unique codes). It was made available for an international automated coding shared task, which attracted five participating teams. An extended version of the dataset will be used in a new edition of the shared task.","pages":"60--69","url":"https:\/\/www.aclweb.org\/anthology\/W16-5107","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5108","title":"A Corpus of Tables in Full-Text Biomedical Research Publications","authors":["Shmanina, Tatyana","Zukerman, Ingrid","Cheam, Ai Lee","Bochynek, Thomas","Cavedon, Lawrence"],"emails":["tatyana.shmanina@monash.edu","ingrid.zukerman@monash.edu","ai.cheam@monash.edu","thomas.bochynek@monash.edu","lawrence.cavedon@monash.edu"],"author_id":["tatyana-shmanina","ingrid-zukerman","ai-lee-cheam","thomas-bochynek","lawrence-cavedon"],"abstract":"The development of text mining techniques for biomedical research literature has received increased attention in recent times. However, most of these techniques focus on prose, while much important biomedical data reside in tables. In this paper, we present a corpus created to serve as a gold standard for the development and evaluation of techniques for the automatic extraction of information from biomedical tables. We describe the guidelines used for corpus annotation and the manner in which they were developed. The high inter-annotator agreement achieved on the corpus, and the generic nature of our annotation approach, suggest that the developed guidelines can serve as a general framework for table annotation in biomedical and other scientific domains. The annotated corpus and the guidelines are available at \\url{http:\/\/www.csse.monash.edu.au\/research\/umnl\/data\/index.shtml}.","pages":"70--79","url":"https:\/\/www.aclweb.org\/anthology\/W16-5108","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5109","title":"Supervised classification of end-of-lines in clinical text with no manual annotation","authors":["Zweigenbaum, Pierre","Grouin, Cyril","Lavergne, Thomas"],"emails":["pz@limsi.fr","grouin@limsi.fr","lavergne@limsi.fr"],"author_id":["pierre-zweigenbaum","cyril-grouin","thomas-lavergne"],"abstract":"In some plain text documents, end-of-line marks may or may not mark the boundary of a text unit (e.g., of a paragraph). This vexing problem is likely to impact subsequent natural language processing components, but is seldom addressed in the literature. We propose a method which uses no manual annotation to classify whether end-of-lines must actually be seen as simple spaces (soft line breaks) or as true text unit boundaries. This method, which includes self-training and co-training steps based on token and line length features, achieves 0.943 F-measure on a corpus of short e-books with controlled format, F=0.904 on a random sample of 24 clinical texts with soft line breaks, and F=0.898 on a larger set of mixed clinical texts which may or may not contain soft line breaks, a fairly high value for a method with no manual annotation.","pages":"80--88","url":"https:\/\/www.aclweb.org\/anthology\/W16-5109","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5110","title":"{B}io{DCA} Identifier: A System for Automatic Identification of Discourse Connective and Arguments from Biomedical Text","authors":["Gopalan, Sindhuja","Lalitha Devi, Sobha"],"emails":["sindhujagopalan@au-kbc.org","sobha@au-kbc.org"],"author_id":["sindhuja-gopalan","sobha-lalitha-devi"],"abstract":"This paper describes a Natural language processing system developed for automatic identification of explicit connectives, its sense and arguments. Prior work has shown that the difference in usage of connectives across corpora affects the cross domain connective identification task negatively. Hence the development of domain specific discourse parser has become indispensable. Here, we present a corpus annotated with discourse relations on Medline abstracts. Kappa score is calculated to check the annotation quality of our corpus. The previous works on discourse analysis in bio-medical data have concentrated only on the identification of connectives and hence we have developed an end-end parser for connective and argument identification using Conditional Random Fields algorithm. The type and sub-type of the connective sense is also identified. The results obtained are encouraging.","pages":"89--98","url":"https:\/\/www.aclweb.org\/anthology\/W16-5110","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5111","title":"Data, tools and resources for mining social media drug chatter","authors":["Sarker, Abeed","Gonzalez, Graciela"],"emails":["abeed@upenn.edu","gragon@upenn.edu"],"author_id":["abeed-sarker","graciela-gonzalez"],"abstract":"Social media has emerged into a crucial resource for obtaining population-based signals for various public health monitoring and surveillance tasks, such as pharmacovigilance. There is an abundance of knowledge hidden within social media data, and the volume is growing. Drug-related chatter on social media can include user-generated information that can provide insights into public health problems such as abuse, adverse reactions, long-term effects, and multi-drug interactions. Our objective in this paper is to present to the biomedical natural language processing, data science, and public health communities data sets (annotated and unannotated), tools and resources that we have collected and created from social media. The data we present was collected from Twitter using the generic and brand names of drugs as keywords, along with their common misspellings. Following the collection of the data, annotation guidelines were created over several iterations, which detail important aspects of social media data annotation and can be used by future researchers for developing similar data sets. The annotation guidelines were followed to prepare data sets for text classification, information extraction and normalization. In this paper, we discuss the preparation of these guidelines, outline the data sets prepared, and present an overview of our state-of-the-art systems for data collection, supervised classification, and information extraction. In addition to the development of supervised systems for classification and extraction, we developed and released unlabeled data and language models. We discuss the potential uses of these language models in data mining and the large volumes of unlabeled data from which they were generated. We believe that the summaries and repositories we present here of our data, annotation guidelines, models, and tools will be beneficial to the research community as a single-point entry for all these resources, and will promote further research in this area.","pages":"99--107","url":"https:\/\/www.aclweb.org\/anthology\/W16-5111","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5112","title":"Detection of Text Reuse in {F}rench Medical Corpora","authors":["D{'}hondt, Eva","Grouin, Cyril","N{\\'e}v{\\'e}ol, Aur{\\'e}lie","Stamatatos, Efstathios","Zweigenbaum, Pierre"],"emails":["dhondt@limsi.fr","grouin@limsi.fr","neveol@limsi.fr","stamatatos@aegean.gr","pz@limsi.fr"],"author_id":["eva-dhondt","cyril-grouin","aurelie-neveol","efstathios-stamatatos","pierre-zweigenbaum"],"abstract":"Electronic Health Records (EHRs) are increasingly available in modern health care institutions either through the direct creation of electronic documents in hospitals{'} health information systems, or through the digitization of historical paper records. Each EHR creation method yields the need for sophisticated text reuse detection tools in order to prepare the EHR collections for efficient secondary use relying on Natural Language Processing methods. Herein, we address the detection of two types of text reuse in French EHRs: 1) the detection of updated versions of the same document and 2) the detection of document duplicates that still bear surface differences due to OCR or de-identification processing. We present a robust text reuse detection method to automatically identify redundant document pairs in two French EHR corpora that achieves an overall macro F-measure of 0.68 and 0.60, respectively and correctly identifies all redundant document pairs of interest.","pages":"108--114","url":"https:\/\/www.aclweb.org\/anthology\/W16-5112","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5113","title":"Negation Detection in Clinical Reports Written in {G}erman","authors":["Cotik, Viviana","Roller, Roland","Xu, Feiyu","Uszkoreit, Hans","Budde, Klemens","Schmidt, Danilo"],"emails":["vcotik@dc.uba.ar","roland.roller@dfki.de","feiyu.xu@dfki.de","hans.uszkoreit@dfki.de","klemens.budde@dfki.de","danilo.schmidt@dfki.de"],"author_id":["viviana-cotik","roland-roller","feiyu-xu","hans-uszkoreit","klemens-budde","danilo-schmidt"],"abstract":"An important subtask in clinical text mining tries to identify whether a clinical finding is expressed as present, absent or unsure in a text. This work presents a system for detecting mentions of clinical findings that are negated or just speculated. The system has been applied to two different types of German clinical texts: clinical notes and discharge summaries. Our approach is built on top of NegEx, a well known algorithm for identifying non-factive mentions of medical findings. In this work, we adjust a previous adaptation of NegEx to German and evaluate the system on our data to detect negation and speculation. The results are compared to a baseline algorithm and are analyzed for both types of clinical documents. Our system achieves an F1-Score above 0.9 on both types of reports.","pages":"115--124","url":"https:\/\/www.aclweb.org\/anthology\/W16-5113","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5114","title":"Scoring Disease-Medication Associations using Advanced {NLP}, Machine Learning, and Multiple Content Sources","authors":["Dandala, Bharath","Devarakonda, Murthy","Bornea, Mihaela","Nielson, Christopher"],"emails":["","","",""],"author_id":["bharath-dandala","murthy-devarakonda","mihaela-bornea","christopher-nielson"],"abstract":"Effective knowledge resources are critical for developing successful clinical decision support systems that alleviate the cognitive load on physicians in patient care. In this paper, we describe two new methods for building a knowledge resource of disease to medication associations. These methods use fundamentally different content and are based on advanced natural language processing and machine learning techniques. One method uses distributional semantics on large medical text, and the other uses data mining on a large number of patient records. The methods are evaluated using 25,379 unique disease-medication pairs extracted from 100 de-identified longitudinal patient records of a large multi-provider hospital system. We measured recall (R), precision (P), and F scores for positive and negative association prediction, along with coverage and accuracy. While individual methods performed well, a combined stacked classifier achieved the best performance, indicating the limitations and unique value of each resource and method. In predicting positive associations, the stacked combination significantly outperformed the baseline (a distant semi-supervised method on large medical text), achieving F scores of 0.75 versus 0.55 on the pairs seen in the patient records, and F scores of 0.69 and 0.35 on unique pairs.","pages":"125--133","url":"https:\/\/www.aclweb.org\/anthology\/W16-5114","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"},{"id":"W16-5115","title":"Author Name Disambiguation in {MEDLINE} Based on Journal Descriptors and Semantic Types","authors":["Vishnyakova, Dina","Rodriguez-Esteban, Raul","Ozol, Khan","Rinaldi, Fabio"],"emails":["ishnyakova@roche.com","esteban@roche.com","","i@uzh.ch"],"author_id":["dina-vishnyakova","raul-rodriguez-esteban","khan-ozol","fabio-rinaldi"],"abstract":"Author name disambiguation (AND) in publication and citation resources is a well-known problem. Often, information about email address and other details in the affiliation is missing. In cases where such information is not available, identifying the authorship of publications becomes very challenging. Consequently, there have been attempts to resolve such cases by utilizing external resources as references. However, such external resources are heterogeneous and are not always reliable regarding the correctness of information. To solve the AND task, especially when information about an author is not complete we suggest the use of new features such as journal descriptors (JD) and semantic types (ST). The evaluation of different feature models shows that their inclusion has an impact equivalent to that of other important features such as email address. Using such features we show that our system outperforms the state of the art.","pages":"134--142","url":"https:\/\/www.aclweb.org\/anthology\/W16-5115","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Fifth Workshop on Building and Evaluating Resources for Biomedical Text Mining ({B}io{T}xt{M}2016)"}]