[{"id":"W16-4301","title":"Zooming in on Gender Differences in Social Media","authors":["Garimella, Aparna","Mihalcea, Rada"],"emails":["gaparna@umich.edu","mihalcea@umich.edu"],"author_id":["aparna-garimella","rada-mihalcea"],"abstract":"Men are from Mars and women are from Venus - or so the genre of relationship literature would have us believe. But there is some truth in this idea, and researchers in fields as diverse as psychology, sociology, and linguistics have explored ways to better understand the differences between genders. In this paper, we take another look at the problem of gender discrimination and attempt to move beyond the typical surface-level text classification approach, by (1) identifying semantic and psycholinguistic word classes that reflect systematic differences between men and women and (2) finding differences between genders in the ways they use the same words. We describe several experiments and report results on a large collection of blogs authored by men and women.","pages":"1--10","url":"https:\/\/www.aclweb.org\/anthology\/W16-4301","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4302","title":"The Effect of Gender and Age Differences on the Recognition of Emotions from Facial Expressions","authors":["Schneevogt, Daniela","Paggio, Patrizia"],"emails":["d.schneevogt@googlemail.com","paggio@hum.ku.dk"],"author_id":["daniela-schneevogt","patrizia-paggio"],"abstract":"Recent studies have demonstrated gender and cultural differences in the recognition of emotions in facial expressions. However, most studies were conducted on American subjects. In this paper, we explore the generalizability of several findings to a non-American culture in the form of Danish subjects. We conduct an emotion recognition task followed by two stereotype questionnaires with different genders and age groups. While recent findings (Krems et al., 2015) suggest that women are biased to see anger in neutral facial expressions posed by females, in our sample both genders assign higher ratings of anger to all emotions expressed by females. Furthermore, we demonstrate an effect of gender on the fear-surprise-confusion observed by Tomkins and McCarter (1964); females overpredict fear, while males overpredict surprise.","pages":"11--19","url":"https:\/\/www.aclweb.org\/anthology\/W16-4302","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4303","title":"A Recurrent and Compositional Model for Personality Trait Recognition from Short Texts","authors":["Liu, Fei","Perez, Julien","Nowson, Scott"],"emails":["fliu3@student.unimelb.edu.au","julien.perez@xrce.xerox.com","scott.nowson@accenture.com"],"author_id":["fei-liu","julien-perez","scott-nowson"],"abstract":"Many methods have been used to recognise author personality traits from text, typically combining linguistic feature engineering with shallow learning models, e.g. linear regression or Support Vector Machines. This work uses deep-learning-based models and atomic features of text, the characters, to build hierarchical, vectorial word and sentence representations for trait inference. This method, applied to a corpus of tweets, shows state-of-the-art performance across five traits compared with prior work. The results, supported by preliminary visualisation work, are encouraging for the ability to detect complex human traits.","pages":"20--29","url":"https:\/\/www.aclweb.org\/anthology\/W16-4303","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4304","title":"Distant supervision for emotion detection using {F}acebook reactions","authors":["Pool, Chris","Nissim, Malvina"],"emails":["c.pool@anchormen.nl","m.nissim@rug.nl"],"author_id":["chris-pool","malvina-nissim"],"abstract":"We exploit the Facebook reaction feature in a distant supervised fashion to train a support vector machine classifier for emotion detection, using several feature combinations and combining different Facebook pages. We test our models on existing benchmarks for emotion detection and show that employing only information that is derived completely automatically, thus without relying on any handcrafted lexicon as it{'}s usually done, we can achieve competitive results. The results also show that there is large room for improvement, especially by gearing the collection of Facebook pages, with a view to the target domain.","pages":"30--39","url":"https:\/\/www.aclweb.org\/anthology\/W16-4304","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4305","title":"A graphical framework to detect and categorize diverse opinions from online news","authors":["Mullick, Ankan","Goyal, Pawan","Ganguly, Niloy"],"emails":["ankan@cse.iitkgp.ernet.in","pawang@cse.iitkgp.ernet.in","niloy@cse.iitkgp.ernet.in"],"author_id":["ankan-mullick","pawan-goyal","niloy-ganguly"],"abstract":"This paper proposes a graphical framework to extract opinionated sentences which highlight different contexts within a given news article by introducing the concept of diversity in a graphical model for opinion detection.We conduct extensive evaluations and find that the proposed modification leads to impressive improvement in performance and makes the final results of the model much more usable. The proposed method (OP-D) not only performs much better than the other techniques used for opinion detection as well as introducing diversity, but is also able to select opinions from different categories (Asher et al. 2009). By developing a classification model which categorizes the identified sentences into various opinion categories, we find that OP-D is able to push opinions from different categories uniformly among the top opinions.","pages":"40--49","url":"https:\/\/www.aclweb.org\/anthology\/W16-4305","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4306","title":"Active learning for detection of stance components","authors":["Skeppstedt, Maria","Sahlgren, Magnus","Paradis, Carita","Kerren, Andreas"],"emails":["maria.skeppstedt@lnu.se","mange@sics.se","carita.paradis@englund.lu.se","andreas.kerren@lnu.se"],"author_id":["maria-skeppstedt","magnus-sahlgren","carita-paradis","andreas-kerren"],"abstract":"Automatic detection of five language components, which are all relevant for expressing opinions and for stance taking, was studied: positive sentiment, negative sentiment, speculation, contrast and condition. A resource-aware approach was taken, which included manual annotation of 500 training samples and the use of limited lexical resources. Active learning was compared to random selection of training data, as well as to a lexicon-based method. Active learning was successful for the categories speculation, contrast and condition, but not for the two sentiment categories, for which results achieved when using active learning were similar to those achieved when applying a random selection of training data. This difference is likely due to a larger variation in how sentiment is expressed than in how speakers express the other three categories. This larger variation was also shown by the lower recall results achieved by the lexicon-based approach for sentiment than for the categories speculation, contrast and condition.","pages":"50--59","url":"https:\/\/www.aclweb.org\/anthology\/W16-4306","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4307","title":"Detecting Opinion Polarities using Kernel Methods","authors":["Kaljahi, Rasoul","Foster, Jennifer"],"emails":["rasoul.kaljahi@adaptcentre.ie","jfoster@computing.dcu.ie"],"author_id":["rasoul-kaljahi","jennifer-foster"],"abstract":"We investigate the application of kernel methods to representing both structural and lexical knowledge for predicting polarity of opinions in consumer product review. We introduce any-gram kernels which model lexical information in a significantly faster way than the traditional n-gram features, while capturing all possible orders of n-grams n in a sequence without the need to explicitly present a pre-specified set of such orders. We also present an effective format to represent constituency and dependency structure together with aspect terms and sentiment polarity scores. Furthermore, we modify the traditional tree kernel function to compute the similarity based on word embedding vectors instead of exact string match and present experiments using the new models.","pages":"60--69","url":"https:\/\/www.aclweb.org\/anthology\/W16-4307","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4308","title":"Effects of Semantic Relatedness between Setups and Punchlines in Twitter Hashtag Games","authors":["Cattle, Andrew","Ma, Xiaojuan"],"emails":["acattle@cse.ust.hk","mxj@cse.ust.hk"],"author_id":["andrew-cattle","xiaojuan-ma"],"abstract":"This paper explores humour recognition for Twitter-based hashtag games. Given their popularity, frequency, and relatively formulaic nature, these games make a good target for computational humour research and can leverage Twitter likes and retweets as humour judgments. In this work, we use pair-wise relative humour judgments to examine several measures of semantic relatedness between setups and punchlines on a hashtag game corpus we collected and annotated. Results show that perplexity, Normalized Google Distance, and free-word association-based features are all useful in identifying {``}funnier{''} hashtag game responses. In fact, we provide empirical evidence that funnier punchlines tend to be more obscure, although more obscure punchlines are not necessarily rated funnier. Furthermore, the asymmetric nature of free-word association features allows us to see that while punchlines should be harder to predict given a setup, they should also be relatively easy to understand in context.","pages":"70--79","url":"https:\/\/www.aclweb.org\/anthology\/W16-4308","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4309","title":"Generating Sentiment Lexicons for {G}erman Twitter","authors":["Sidarenka, Uladzimir","Stede, Manfred"],"emails":["sidarenk@uni-potsdam.de","stede@uni-potsdam.de"],"author_id":["uladzimir-sidarenka","manfred-stede"],"abstract":"Despite a substantial progress made in developing new sentiment lexicon generation (SLG) methods for English, the task of transferring these approaches to other languages and domains in a sound way still remains open. In this paper, we contribute to the solution of this problem by systematically comparing semi-automatic translations of common English polarity lists with the results of the original automatic SLG algorithms, which were applied directly to German data. We evaluate these lexicons on a corpus of 7,992 manually annotated tweets. In addition to that, we also collate the results of dictionary- and corpus-based SLG methods in order to find out which of these paradigms is better suited for the inherently noisy domain of social media. Our experiments show that semi-automatic translations notably outperform automatic systems (reaching a macro-averaged F1-score of 0.589), and that dictionary-based techniques produce much better polarity lists as compared to corpus-based approaches (whose best F1-scores run up to 0.479 and 0.419 respectively) even for the non-standard Twitter genre.","pages":"80--90","url":"https:\/\/www.aclweb.org\/anthology\/W16-4309","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4310","title":"Innovative Semi-Automatic Methodology to Annotate Emotional Corpora","authors":["Canales, Lea","Strapparava, Carlo","Boldrini, Ester","Mart{\\'\\i}nez-Barco, Patricio"],"emails":["lcanales@dlsi.ua.es","strappa@fbk.eu","eboldrini@dlsi.ua.es","patricio@dlsi.ua.es"],"author_id":["lea-canales","carlo-strapparava","ester-boldrini","patricio-martinez-barco"],"abstract":"Detecting depression or personality traits, tutoring and student behaviour systems, or identifying cases of cyber-bulling are a few of the wide range of the applications, in which the automatic detection of emotion is a crucial element. Emotion detection has the potential of high impact by contributing the benefit of business, society, politics or education. Given this context, the main objective of our research is to contribute to the resolution of one of the most important challenges in textual emotion detection task: the problems of emotional corpora annotation. This will be tackled by proposing of a new semi-automatic methodology. Our innovative methodology consists in two main phases: (1) an automatic process to pre-annotate the unlabelled sentences with a reduced number of emotional categories; and (2) a refinement manual process where human annotators will determine which is the predominant emotion between the emotional categories selected in the phase 1. Our proposal in this paper is to show and evaluate the pre-annotation process to analyse the feasibility and the benefits by the methodology proposed. The results obtained are promising and allow obtaining a substantial improvement of annotation time and cost and confirm the usefulness of our pre-annotation process to improve the annotation task.","pages":"91--100","url":"https:\/\/www.aclweb.org\/anthology\/W16-4310","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4311","title":"Personality Estimation from {J}apanese Text","authors":["Kamijo, Koichi","Nasukawa, Tetsuya","Kitamura, Hideya"],"emails":["kamijoh@jp.ibm.com","nasukawa@jp.ibm.com","kitamura.hideya@gmail.com"],"author_id":["koichi-kamijo","tetsuya-nasukawa","hideya-kitamura"],"abstract":"We created a model to estimate personality trait from authors{'} text written in Japanese and measured its performance by conducting surveys and analyzing the Twitter data of 1,630 users. We used the Big Five personality traits for personality trait estimation. Our approach is a combination of category- and Word2Vec-based approaches. For the category-based element, we added several unique Japanese categories along with the ones regularly used in the English model, and for the Word2Vec-based element, we used a model called GloVe. We found that some of the newly added categories have a stronger correlation with personality traits than other categories do and that the combination of the category- and Word2Vec-based approaches improves the accuracy of the personality trait estimation compared with the case of using just one of them.","pages":"101--109","url":"https:\/\/www.aclweb.org\/anthology\/W16-4311","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4312","title":"Predicting {B}rexit: Classifying Agreement is Better than Sentiment and Pollsters","authors":["Celli, Fabio","Stepanov, Evgeny","Poesio, Massimo","Riccardi, Giuseppe"],"emails":["fabio.celli@unitn.it","evgeny.stepanov@unitn.it","","giuseppe.riccardi@unitn.it"],"author_id":["fabio-celli","evgeny-stepanov","massimo-poesio","giuseppe-riccardi"],"abstract":"On June 23rd 2016, UK held the referendum which ratified the exit from the EU. While most of the traditional pollsters failed to forecast the final vote, there were online systems that hit the result with high accuracy using opinion mining techniques and big data. Starting one month before, we collected and monitored millions of posts about the referendum from social media conversations, and exploited Natural Language Processing techniques to predict the referendum outcome. In this paper we discuss the methods used by traditional pollsters and compare it to the predictions based on different opinion mining techniques. We find that opinion mining based on agreement\/disagreement classification works better than opinion mining based on polarity classification in the forecast of the referendum outcome.","pages":"110--118","url":"https:\/\/www.aclweb.org\/anthology\/W16-4312","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4313","title":"Sarcasm Detection : Building a Contextual Hierarchy","authors":["Bali, Taradheesh","Singh, Navjyoti"],"emails":["taradheesh.bali@research.iiit.ac.in","navjyoti@iiit.ac.in"],"author_id":["taradheesh-bali","navjyoti-singh"],"abstract":"The conundrum of understanding and classifying sarcasm has been dealt with by the traditional theorists as an analysis of a sarcastic utterance and the ironic situation that surrounds it. The problem with such an approach is that it is too narrow, as it is unable to sufficiently utilize the two indispensable agents in making such an utterance, viz. the speaker and the listener. It undermines the necessary context required to comprehend a sarcastic utterance. In this paper, we propose a novel approach towards understanding sarcasm in terms of the existing knowledge hierarchy between the two participants, which forms the basis of the context that both agents share. The difference in relationship of the speaker of the sarcastic utterance and the disparate audience found on social media, such as Twitter, is also captured. We then apply our model on a corpus of tweets to achieve significant results and consequently, shed light on subjective nature of context, which is contingent on the relation between the speaker and the listener.","pages":"119--127","url":"https:\/\/www.aclweb.org\/anthology\/W16-4313","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4314","title":"Social and linguistic behavior and its correlation to trait empathy","authors":["Litvak, Marina","Otterbacher, Jahna","Ang, Chee Siang","Atkins, David"],"emails":["marinal@sce.ac.il","jahna.otterbacher@ouc.ac.cy","ng@kent.ac.uk","tkins@kent.ac.uk"],"author_id":["marina-litvak","jahna-otterbacher","chee-siang-ang","david-atkins"],"abstract":"A growing body of research exploits social media behaviors to gauge psychological character-istics, though trait empathy has received little attention. Because of its intimate link to the abil-ity to relate to others, our research aims to predict participants{'} levels of empathy, given their textual and friending behaviors on Facebook. Using Poisson regression, we compared the vari-ance explained in Davis{'} Interpersonal Reactivity Index (IRI) scores on four constructs (em-pathic concern, personal distress, fantasy, perspective taking), by two classes of variables: 1) post content and 2) linguistic style. Our study lays the groundwork for a greater understanding of empathy{'}s role in facilitating interactions on social media.","pages":"128--137","url":"https:\/\/www.aclweb.org\/anthology\/W16-4314","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4315","title":"The Challenges of Multi-dimensional Sentiment Analysis Across Languages","authors":["{\\\"O}hman, Emily","Honkela, Timo","Tiedemann, J{\\\"o}rg"],"emails":["emily.{\\\"o}hman@helsinki.fi","timo.honkela@helsinki.fi","j{\\\"o}rg.tiedemann@helsinki.fi"],"author_id":["emily-ohman","timo-honkela","jorg-tiedemann"],"abstract":"This paper outlines a pilot study on multi-dimensional and multilingual sentiment analysis of social media content. We use parallel corpora of movie subtitles as a proxy for colloquial language in social media channels and a multilingual emotion lexicon for fine-grained sentiment analyses. Parallel data sets make it possible to study the preservation of sentiments and emotions in translation and our assessment reveals that the lexical approach shows great inter-language agreement. However, our manual evaluation also suggests that the use of purely lexical methods is limited and further studies are necessary to pinpoint the cross-lingual differences and to develop better sentiment classifiers.","pages":"138--142","url":"https:\/\/www.aclweb.org\/anthology\/W16-4315","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4316","title":"The Social Mood of News: Self-reported Annotations to Design Automatic Mood Detection Systems","authors":["Alam, Firoj","Celli, Fabio","Stepanov, Evgeny A.","Ghosh, Arindam","Riccardi, Giuseppe"],"emails":["firoj.alam@unitn.it","fabio.celli@unitn.it","evgeny.stepanov@unitn.it","arindam.ghosh@unitn.it","giuseppe.riccardi@unitn.it"],"author_id":["firoj-alam","fabio-celli","evgeny-stepanov","arindam-ghosh","giuseppe-riccardi"],"abstract":"In this paper, we address the issue of automatic prediction of readers{'} mood from newspaper articles and comments. As online newspapers are becoming more and more similar to social media platforms, users can provide affective feedback, such as mood and emotion. We have exploited the self-reported annotation of mood categories obtained from the metadata of the Italian online newspaper corriere.it to design and evaluate a system for predicting five different mood categories from news articles and comments: indignation, disappointment, worry, satisfaction, and amusement. The outcome of our experiments shows that overall, bag-of-word-ngrams perform better compared to all other feature sets; however, stylometric features perform better for the mood score prediction of articles. Our study shows that self-reported annotations can be used to design automatic mood prediction systems.","pages":"143--152","url":"https:\/\/www.aclweb.org\/anthology\/W16-4316","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4317","title":"Microblog Emotion Classification by Computing Similarity in Text, Time, and Space","authors":["Summa, Anja","Resch, Bernd","Strube, Michael"],"emails":["sum.anja@arcor.de","bernd.resch@sbg.ac.at","michael.strube@h-its.org"],"author_id":["anja-summa","bernd-resch","michael-strube"],"abstract":"Most work in NLP analysing microblogs focuses on textual content thus neglecting temporal and spatial information. We present a new interdisciplinary method for emotion classification that combines linguistic, temporal, and spatial information into a single metric. We create a graph of labeled and unlabeled tweets that encodes the relations between neighboring tweets with respect to their emotion labels. Graph-based semi-supervised learning labels all tweets with an emotion.","pages":"153--162","url":"https:\/\/www.aclweb.org\/anthology\/W16-4317","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4318","title":"A domain-agnostic approach for opinion prediction on speech","authors":["Santos, Pedro Bispo","Beinborn, Lisa","Gurevych, Iryna"],"emails":["","",""],"author_id":["pedro-bispo-santos","lisa-beinborn","iryna-gurevych"],"abstract":"We explore a domain-agnostic approach for analyzing speech with the goal of opinion prediction. We represent the speech signal by mel-frequency cepstral coefficients and apply long short-term memory neural networks to automatically learn temporal regularities in speech. In contrast to previous work, our approach does not require complex feature engineering and works without textual transcripts. As a consequence, it can easily be applied on various speech analysis tasks for different languages and the results show that it can nevertheless be competitive to the state-of-the-art in opinion prediction. In a detailed error analysis for opinion mining we find that our approach performs well in identifying speaker-specific characteristics, but should be combined with additional information if subtle differences in the linguistic content need to be identified.","pages":"163--172","url":"https:\/\/www.aclweb.org\/anthology\/W16-4318","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4319","title":"Can We Make Computers Laugh at Talks?","authors":["Lee, Chong Min","Yoon, Su-Youn","Chen, Lei"],"emails":["clee001@ets.org","syoon@ets.org","lchen@ets.org"],"author_id":["chungmin-lee","su-youn-yoon","lei-chen"],"abstract":"Considering the importance of public speech skills, a system which makes a prediction on where audiences laugh in a talk can be helpful to a person who prepares for a talk. We investigated a possibility that a state-of-the-art humor recognition system can be used in detecting sentences inducing laughters in talks. In this study, we used TED talks and laughters in the talks as data. Our results showed that the state-of-the-art system needs to be improved in order to be used in a practical application. In addition, our analysis showed that classifying humorous sentences in talks is very challenging due to close distance between humorous and non-humorous sentences.","pages":"173--181","url":"https:\/\/www.aclweb.org\/anthology\/W16-4319","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"},{"id":"W16-4320","title":"Towards Automatically Classifying Depressive Symptoms from Twitter Data for Population Health","authors":["Mowery, Danielle L.","Park, Albert","Bryan, Craig","Conway, Mike"],"emails":["danielle.mowery@utah.edu","albert.park@utah.edu","craig.bryan@utah.edu","mike.conway@utah.edu"],"author_id":["danielle-l-mowery","y-albert-park","craig-bryan","mike-conway"],"abstract":"Major depressive disorder, a debilitating and burdensome disease experienced by individuals worldwide, can be defined by several depressive symptoms (e.g., anhedonia (inability to feel pleasure), depressed mood, difficulty concentrating, etc.). Individuals often discuss their experiences with depression symptoms on public social media platforms like Twitter, providing a potentially useful data source for monitoring population-level mental health risk factors. In a step towards developing an automated method to estimate the prevalence of symptoms associated with major depressive disorder over time in the United States using Twitter, we developed classifiers for discerning whether a Twitter tweet represents no evidence of depression or evidence of depression. If there was evidence of depression, we then classified whether the tweet contained a depressive symptom and if so, which of three subtypes: depressed mood, disturbed sleep, or fatigue or loss of energy. We observed that the most accurate classifiers could predict classes with high-to-moderate F1-score performances for no evidence of depression (85), evidence of depression (52), and depressive symptoms (49). We report moderate F1-scores for depressive symptoms ranging from 75 (fatigue or loss of energy) to 43 (disturbed sleep) to 35 (depressed mood). Our work demonstrates baseline approaches for automatically encoding Twitter data with granular depressive symptoms associated with major depressive disorder.","pages":"182--191","url":"https:\/\/www.aclweb.org\/anthology\/W16-4320","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Workshop on Computational Modeling of People{'}s Opinions, Personality, and Emotions in Social Media ({PEOPLES})"}]