[{"id":"W17-2601","title":"Sense Contextualization in a Dependency-Based Compositional Distributional Model","authors":["Gamallo, Pablo"],"emails":["pablo.gamallo@usc.es"],"author_id":["pablo-gamallo"],"abstract":"Little attention has been paid to distributional compositional methods which employ syntactically structured vector models. As word vectors belonging to different syntactic categories have incompatible syntactic distributions, no trivial compositional operation can be applied to combine them into a new compositional vector. In this article, we generalize the method described by Erk and Pad{\\'o} (2009) by proposing a dependency-base framework that contextualize not only lemmas but also selectional preferences. The main contribution of the article is to expand their model to a fully compositional framework in which syntactic dependencies are put at the core of semantic composition. We claim that semantic composition is mainly driven by syntactic dependencies. Each syntactic dependency generates two new compositional vectors representing the contextualized sense of the two related lemmas. The sequential application of the compositional operations associated to the dependencies results in as many contextualized vectors as lemmas the composite expression contains. At the end of the semantic process, we do not obtain a single compositional vector representing the semantic denotation of the whole composite expression, but one contextualized vector for each lemma of the whole expression. Our method avoids the troublesome high-order tensor representations by defining lemmas and selectional restrictions as first-order tensors (i.e. standard vectors). A corpus-based experiment is performed to both evaluate the quality of the compositional vectors built with our strategy, and to compare them to other approaches on distributional compositional semantics. The experiments show that our dependency-based compositional method performs as (or even better than) the state-of-the-art.","pages":"1--9","doi":"10.18653\/v1\/W17-2601","url":"https:\/\/www.aclweb.org\/anthology\/W17-2601","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2602","title":"Context encoders as a simple but powerful extension of word2vec","authors":["Horn, Franziska"],"emails":["franziska.horn@campus.tu-berlin.de"],"author_id":["franziska-horn"],"abstract":"With a strikingly simple architecture and the ability to learn meaningful word embeddings efficiently from texts containing billions of words, word2vec remains one of the most popular neural language models used today. However, as only a single embedding is learned for every word in the vocabulary, the model fails to optimally represent words with multiple meanings and, additionally, it is not possible to create embeddings for new (out-of-vocabulary) words on the spot. Based on an intuitive interpretation of the continuous bag-of-words (CBOW) word2vec model{'}s negative sampling training objective in terms of predicting context based similarities, we motivate an extension of the model we call context encoders (ConEc). By multiplying the matrix of trained word2vec embeddings with a word{'}s average context vector, out-of-vocabulary (OOV) embeddings and representations for words with multiple meanings can be created based on the words{'} local contexts. The benefits of this approach are illustrated by using these word embeddings as features in the CoNLL 2003 named entity recognition (NER) task.","pages":"10--14","doi":"10.18653\/v1\/W17-2602","url":"https:\/\/www.aclweb.org\/anthology\/W17-2602","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2603","title":"Machine Comprehension by Text-to-Text Neural Question Generation","authors":["Yuan, Xingdi","Wang, Tong","Gulcehre, Caglar","Sordoni, Alessandro","Bachman, Philip","Zhang, Saizheng","Subramanian, Sandeep","Trischler, Adam"],"emails":["eric.yuan@microsoft.com","tong.wang@microsoft.com","gulcehrc@iro.umontreal.ca","alsordon@microsoft.com","phbachma@microsoft.com","saizheng.zhang@umontreal.ca","sandeep.subramanian@gmail.com","adam.trischler@microsoft.com"],"author_id":["xingdi-yuan","tong-wang","caglar-gulcehre","alessandro-sordoni","philip-bachman","saizheng-zhang","sandeep-subramanian","adam-trischler"],"abstract":"We propose a recurrent neural model that generates natural-language questions from documents, conditioned on answers. We show how to train the model using a combination of supervised and reinforcement learning. After teacher forcing for standard maximum likelihood training, we fine-tune the model using policy gradient techniques to maximize several rewards that measure question quality. Most notably, one of these rewards is the performance of a question-answering system. We motivate question generation as a means to improve the performance of question answering systems. Our model is trained and evaluated on the recent question-answering dataset SQuAD.","pages":"15--25","doi":"10.18653\/v1\/W17-2603","url":"https:\/\/www.aclweb.org\/anthology\/W17-2603","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2604","title":"Emergent Predication Structure in Hidden State Vectors of Neural Readers","authors":["Wang, Hai","Onishi, Takeshi","Gimpel, Kevin","McAllester, David"],"emails":["haiwang@ttic.edu","tonishi@ttic.edu","kgimpel@ttic.edu","mcallester@ttic.edu"],"author_id":["hai-wang","takashi-onishi","kevin-gimpel","david-mcallester"],"abstract":"A significant number of neural architectures for reading comprehension have recently been developed and evaluated on large cloze-style datasets. We present experiments supporting the emergence of {``}predication structure{''} in the hidden state vectors of these readers. More specifically, we provide evidence that the hidden state vectors represent atomic formulas $\\Phi[c]$ where $\\Phi$ is a semantic property (predicate) and $c$ is a constant symbol entity identifier.","pages":"26--36","doi":"10.18653\/v1\/W17-2604","url":"https:\/\/www.aclweb.org\/anthology\/W17-2604","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2605","title":"Towards Harnessing Memory Networks for Coreference Resolution","authors":["Cheri, Joe","Bhattacharyya, Pushpak"],"emails":["joe@cse.iitb.ac.in","pb@cse.iitb.ac.in"],"author_id":["joe-cheri","pushpak-bhattacharyya"],"abstract":"Coreference resolution task demands comprehending a discourse, especially for anaphoric mentions which require semantic information for resolving antecedents. We investigate into how memory networks can be helpful for coreference resolution when posed as question answering problem. The comprehension capability of memory networks assists coreference resolution, particularly for the mentions that require semantic and context information. We experiment memory networks for coreference resolution, with 4 synthetic datasets generated for coreference resolution with varying difficulty levels. Our system{'}s performance is compared with a traditional coreference resolution system to show why memory network can be promising for coreference resolution.","pages":"37--42","doi":"10.18653\/v1\/W17-2605","url":"https:\/\/www.aclweb.org\/anthology\/W17-2605","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2606","title":"Combining Word-Level and Character-Level Representations for Relation Classification of Informal Text","authors":["Liang, Dongyun","Xu, Weiran","Zhao, Yinge"],"emails":["dongyunliang@bupt.edu.cn","xuweiran@bupt.edu.cn","yingezhao@outlook.com"],"author_id":["dongyun-liang","weiran-xu","yinge-zhao"],"abstract":"Word representation models have achieved great success in natural language processing tasks, such as relation classification. However, it does not always work on informal text, and the morphemes of some misspelling words may carry important short-distance semantic information. We propose a hybrid model, combining the merits of word-level and character-level representations to learn better representations on informal text. Experiments on two dataset of relation classification, SemEval-2010 Task8 and a large-scale one we compile from informal text, show that our model achieves a competitive result in the former and state-of-the-art with the other.","pages":"43--47","doi":"10.18653\/v1\/W17-2606","url":"https:\/\/www.aclweb.org\/anthology\/W17-2606","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2607","title":"Transfer Learning for Neural Semantic Parsing","authors":["Fan, Xing","Monti, Emilio","Mathias, Lambert","Dreyer, Markus"],"emails":["fanxing@amazon.com","monti@amazon.co.uk","mathias@amazon.com","mddreyer@amazon.com"],"author_id":["xing-fan","emilio-monti","lambert-mathias","markus-dreyer"],"abstract":"The goal of semantic parsing is to map natural language to a machine interpretable meaning representation language (MRL). One of the constraints that limits full exploration of deep learning technologies for semantic parsing is the lack of sufficient annotation training data. In this paper, we propose using sequence-to-sequence in a multi-task setup for semantic parsing with focus on transfer learning. We explore three multi-task architectures for sequence-to-sequence model and compare their performance with the independently trained model. Our experiments show that the multi-task setup aids transfer learning from an auxiliary task with large labeled data to the target task with smaller labeled data. We see an absolute accuracy gain ranging from 1.0{\\%} to 4.4{\\%} in in our in-house data set and we also see good gains ranging from 2.5{\\%} to 7.0{\\%} on the ATIS semantic parsing tasks with syntactic and semantic auxiliary tasks.","pages":"48--56","doi":"10.18653\/v1\/W17-2607","url":"https:\/\/www.aclweb.org\/anthology\/W17-2607","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2608","title":"Modeling Large-Scale Structured Relationships with Shared Memory for Knowledge Base Completion","authors":["Shen, Yelong","Huang, Po-Sen","Chang, Ming-Wei","Gao, Jianfeng"],"emails":["yeshen@microsoft.com","pshuang@microsoft.com","minchang@microsoft.com","jfgao@microsoft.com"],"author_id":["yelong-shen","po-sen-huang","ming-wei-chang","jianfeng-gao"],"abstract":"Recent studies on knowledge base completion, the task of recovering missing relationships based on recorded relations, demonstrate the importance of learning embeddings from multi-step relations. However, due to the size of knowledge bases, learning multi-step relations directly on top of observed triplets could be costly. Hence, a manually designed procedure is often used when training the models. In this paper, we propose Implicit ReasoNets (IRNs), which is designed to perform multi-step inference implicitly through a controller and shared memory. Without a human-designed inference procedure, IRNs use training data to learn to perform multi-step inference in an embedding neural space through the shared memory and controller. While the inference procedure does not explicitly operate on top of observed triplets, our proposed model outperforms all previous approaches on the popular FB15k benchmark by more than 5.7{\\%}.","pages":"57--68","doi":"10.18653\/v1\/W17-2608","url":"https:\/\/www.aclweb.org\/anthology\/W17-2608","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2609","title":"Knowledge Base Completion: Baselines Strike Back","authors":["Kadlec, Rudolf","Bajgar, Ondrej","Kleindienst, Jan"],"emails":["kadlec@cz.ibm.com","obajgar@cz.ibm.com","jankle@cz.ibm.com"],"author_id":["rudolf-kadlec","ondrej-bajgar","jan-kleindienst"],"abstract":"Many papers have been published on the knowledge base completion task in the past few years. Most of these introduce novel architectures for relation learning that are evaluated on standard datasets like FB15k and WN18. This paper shows that the accuracy of almost all models published on the FB15k can be outperformed by an appropriately tuned baseline {---} our reimplementation of the DistMult model. Our findings cast doubt on the claim that the performance improvements of recent models are due to architectural changes as opposed to hyper-parameter tuning or different training objectives. This should prompt future research to re-consider how the performance of models is evaluated and reported.","pages":"69--74","doi":"10.18653\/v1\/W17-2609","url":"https:\/\/www.aclweb.org\/anthology\/W17-2609","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2610","title":"Sequential Attention: A Context-Aware Alignment Function for Machine Reading","authors":["Brarda, Sebastian","Yeres, Philip","Bowman, Samuel"],"emails":["sb5518@nyu.edu","yeres@nyu.edu","bowman@nyu.edu"],"author_id":["sebastian-brarda","philip-yeres","samuel-bowman"],"abstract":"In this paper we propose a neural network model with a novel Sequential Attention layer that extends soft attention by assigning weights to words in an input sequence in a way that takes into account not just how well that word matches a query, but how well surrounding words match. We evaluate this approach on the task of reading comprehension (on the Who did What and CNN datasets) and show that it dramatically improves a strong baseline{---}the Stanford Reader{---}and is competitive with the state of the art.","pages":"75--80","doi":"10.18653\/v1\/W17-2610","url":"https:\/\/www.aclweb.org\/anthology\/W17-2610","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2611","title":"Semantic Vector Encoding and Similarity Search Using Fulltext Search Engines","authors":["Rygl, Jan","Pomik{\\'a}lek, Jan","{\\v{R}}eh{\\r{u}}{\\v{r}}ek, Radim","R{\\r{u}}{\\v{z}}i{\\v{c}}ka, Michal","Novotn{\\'y}, V{\\'\\i}t","Sojka, Petr"],"emails":["jimmy@rare-technologies.com","witiko@mail.muni.cz","radim@rare-technologies.com","mruzicka@mail.muni.cz","honza@rare-technologies.com","sojka@fi.muni.cz"],"author_id":["jan-rygl","jan-pomikalek","radim-rehurek","michal-ruzicka","vit-novotny","petr-sojka"],"abstract":"Vector representations and vector space modeling (VSM) play a central role in modern machine learning. We propose a novel approach to {`}vector similarity searching{'} over dense semantic representations of words and documents that can be deployed on top of traditional inverted-index-based fulltext engines, taking advantage of their robustness, stability, scalability and ubiquity. We show that this approach allows the indexing and querying of dense vectors in text domains. This opens up exciting avenues for major efficiency gains, along with simpler deployment, scaling and monitoring. The end result is a fast and scalable vector database with a tunable trade-off between vector search performance and quality, backed by a standard fulltext engine such as Elasticsearch. We empirically demonstrate its querying performance and quality by applying this solution to the task of semantic searching over a dense vector representation of the entire English Wikipedia.","pages":"81--90","doi":"10.18653\/v1\/W17-2611","url":"https:\/\/www.aclweb.org\/anthology\/W17-2611","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2612","title":"Multi-task Domain Adaptation for Sequence Tagging","authors":["Peng, Nanyun","Dredze, Mark"],"emails":["npeng1@jhu.edu","mdredze@cs.jhu.edu"],"author_id":["nanyun-peng","mark-dredze"],"abstract":"Many domain adaptation approaches rely on learning cross domain shared representations to transfer the knowledge learned in one domain to other domains. Traditional domain adaptation only considers adapting for one task. In this paper, we explore multi-task representation learning under the domain adaptation scenario. We propose a neural network framework that supports domain adaptation for multiple tasks simultaneously, and learns shared representations that better generalize for domain adaptation. We apply the proposed framework to domain adaptation for sequence tagging problems considering two tasks: Chinese word segmentation and named entity recognition. Experiments show that multi-task domain adaptation works better than disjoint domain adaptation for each task, and achieves the state-of-the-art results for both tasks in the social media domain.","pages":"91--100","doi":"10.18653\/v1\/W17-2612","url":"https:\/\/www.aclweb.org\/anthology\/W17-2612","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2613","title":"Beyond Bilingual: Multi-sense Word Embeddings using Multilingual Context","authors":["Upadhyay, Shyam","Chang, Kai-Wei","Taddy, Matt","Kalai, Adam","Zou, James"],"emails":["upadhya3@illinois.edu","kw@kwchang.net","taddy@microsoft.com","adum@microsoft.com","jamesyzou@gmail.com"],"author_id":["shyam-upadhyay","kai-wei-chang","matt-taddy","adam-kalai","james-zou"],"abstract":"Word embeddings, which represent a word as a point in a vector space, have become ubiquitous to several NLP tasks. A recent line of work uses bilingual (two languages) corpora to learn a different vector for each sense of a word, by exploiting crosslingual signals to aid sense identification. We present a multi-view Bayesian non-parametric algorithm which improves multi-sense wor d embeddings by (a) using multilingual (i.e., more than two languages) corpora to significantly improve sense embeddings beyond what one achieves with bilingual information, and (b) uses a principled approach to learn a variable number of senses per word, in a data-driven manner. Ours is the first approach with the ability to leverage multilingual corpora efficiently for multi-sense representation learning. Experiments show that multilingual training significantly improves performance over monolingual and bilingual training, by allowing us to combine different parallel corpora to leverage multilingual context. Multilingual training yields comparable performance to a state of the art monolingual model trained on five times more training data.","pages":"101--110","doi":"10.18653\/v1\/W17-2613","url":"https:\/\/www.aclweb.org\/anthology\/W17-2613","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2614","title":"{D}oc{T}ag2{V}ec: An Embedding Based Multi-label Learning Approach for Document Tagging","authors":["Chen, Sheng","Soni, Akshay","Pappu, Aasish","Mehdad, Yashar"],"emails":["chen2832@umn.edu","akshaysoni@yahoo-inc.com","aasishkp@yahoo-inc.com","yashar.mehdad@airbnb.com"],"author_id":["sheng-chen","akshay-soni","aasish-pappu","yashar-mehdad"],"abstract":"Tagging news articles or blog posts with relevant tags from a collection of predefined ones is coined as document tagging in this work. Accurate tagging of articles can benefit several downstream applications such as recommendation and search. In this work, we propose a novel yet simple approach called DocTag2Vec to accomplish this task. We substantially extend Word2Vec and Doc2Vec {--} two popular models for learning distributed representation of words and documents. In DocTag2Vec, we simultaneously learn the representation of words, documents, and tags in a joint vector space during training, and employ the simple k-nearest neighbor search to predict tags for unseen documents. In contrast to previous multi-label learning methods, DocTag2Vec directly deals with raw text instead of provided feature vector, and in addition, enjoys advantages like the learning of tag representation, and the ability of handling newly created tags. To demonstrate the effectiveness of our approach, we conduct experiments on several datasets and show promising results against state-of-the-art methods.","pages":"111--120","doi":"10.18653\/v1\/W17-2614","url":"https:\/\/www.aclweb.org\/anthology\/W17-2614","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2615","title":"Binary Paragraph Vectors","authors":["Grzegorczyk, Karol","Kurdziel, Marcin"],"emails":["kgr@agh.edu.pl","kurdziel@agh.edu.pl"],"author_id":["karol-grzegorczyk","marcin-kurdziel"],"abstract":"Recently Le {\\&} Mikolov described two log-linear models, called Paragraph Vector, that can be used to learn state-of-the-art distributed representations of documents. Inspired by this work, we present Binary Paragraph Vector models: simple neural networks that learn short binary codes for fast information retrieval. We show that binary paragraph vectors outperform autoencoder-based binary codes, despite using fewer bits. We also evaluate their precision in transfer learning settings, where binary codes are inferred for documents unrelated to the training corpus. Results from these experiments indicate that binary paragraph vectors can capture semantics relevant for various domain-specific documents. Finally, we present a model that simultaneously learns short binary codes and longer, real-valued representations. This model can be used to rapidly retrieve a short list of highly relevant documents from a large document collection.","pages":"121--130","doi":"10.18653\/v1\/W17-2615","url":"https:\/\/www.aclweb.org\/anthology\/W17-2615","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2616","title":"Representing Compositionality based on Multiple Timescales Gated Recurrent Neural Networks with Adaptive Temporal Hierarchy for Character-Level Language Models","authors":["Moirangthem, Dennis Singh","Son, Jegyung","Lee, Minho"],"emails":["mdennissingh@gmail.com","wprud4@gmail.com","mholee@gmail.com"],"author_id":["dennis-singh-moirangthem","jegyung-son","minho-lee"],"abstract":"A novel character-level neural language model is proposed in this paper. The proposed model incorporates a biologically inspired temporal hierarchy in the architecture for representing multiple compositions of language in order to handle longer sequences for the character-level language model. The temporal hierarchy is introduced in the language model by utilizing a Gated Recurrent Neural Network with multiple timescales. The proposed model incorporates a timescale adaptation mechanism for enhancing the performance of the language model. We evaluate our proposed model using the popular Penn Treebank and Text8 corpora. The experiments show that the use of multiple timescales in a Neural Language Model (NLM) enables improved performance despite having fewer parameters and with no additional computation requirements. Our experiments also demonstrate the ability of the adaptive temporal hierarchies to represent multiple compositonality without the help of complex hierarchical architectures and shows that better representation of the longer sequences lead to enhanced performance of the probabilistic language model.","pages":"131--138","doi":"10.18653\/v1\/W17-2616","url":"https:\/\/www.aclweb.org\/anthology\/W17-2616","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2617","title":"Learning Bilingual Projections of Embeddings for Vocabulary Expansion in Machine Translation","authors":["Madhyastha, Pranava Swaroop","Espa{\\~n}a-Bonet, Cristina"],"emails":["p.madhyastha@sheffield.ac.uk","cristinae@dfki.de"],"author_id":["pranava-swaroop-madhyastha","cristina-espana-bonet"],"abstract":"We propose a simple log-bilinear softmax-based model to deal with vocabulary expansion in machine translation. Our model uses word embeddings trained on significantly large unlabelled monolingual corpora and learns over a fairly small, word-to-word bilingual dictionary. Given an out-of-vocabulary source word, the model generates a probabilistic list of possible translations in the target language using the trained bilingual embeddings. We integrate these translation options into a standard phrase-based statistical machine translation system and obtain consistent improvements in translation quality on the English{--}Spanish language pair. When tested over an out-of-domain testset, we get a significant improvement of 3.9 BLEU points.","pages":"139--145","doi":"10.18653\/v1\/W17-2617","url":"https:\/\/www.aclweb.org\/anthology\/W17-2617","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2618","title":"Prediction of Frame-to-Frame Relations in the {F}rame{N}et Hierarchy with Frame Embeddings","authors":["Botschen, Teresa","Mousselly-Sergieh, Hatem","Gurevych, Iryna"],"emails":["","",""],"author_id":["teresa-botschen","hatem-mousselly-sergieh","iryna-gurevych"],"abstract":"Automatic completion of frame-to-frame (F2F) relations in the FrameNet (FN) hierarchy has received little attention, although they incorporate meta-level commonsense knowledge and are used in downstream approaches. We address the problem of sparsely annotated F2F relations. First, we examine whether the manually defined F2F relations emerge from text by learning text-based frame embeddings. Our analysis reveals insights about the difficulty of reconstructing F2F relations purely from text. Second, we present different systems for predicting F2F relations; our best-performing one uses the FN hierarchy to train on and to ground embeddings in. A comparison of systems and embeddings exposes the crucial influence of knowledge-based embeddings to a system{'}s performance in predicting F2F relations.","pages":"146--156","doi":"10.18653\/v1\/W17-2618","url":"https:\/\/www.aclweb.org\/anthology\/W17-2618","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2619","title":"Learning Joint Multilingual Sentence Representations with Neural Machine Translation","authors":["Schwenk, Holger","Douze, Matthijs"],"emails":["schwenk@fb.com","matthijs@fb.com"],"author_id":["holger-schwenk","matthijs-douze"],"abstract":"In this paper, we use the framework of neural machine translation to learn joint sentence representations across six very different languages. Our aim is that a representation which is independent of the language, is likely to capture the underlying semantics. We define a new cross-lingual similarity measure, compare up to 1.4M sentence representations and study the characteristics of close sentences. We provide experimental evidence that sentences that are close in embedding space are indeed semantically highly related, but often have quite different structure and syntax. These relations also hold when comparing sentences in different languages.","pages":"157--167","doi":"10.18653\/v1\/W17-2619","url":"https:\/\/www.aclweb.org\/anthology\/W17-2619","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2620","title":"Transfer Learning for Speech Recognition on a Budget","authors":["Kunze, Julius","Kirsch, Louis","Kurenkov, Ilia","Krug, Andreas","Johannsmeier, Jens","Stober, Sebastian"],"emails":["juliuskunze@gmail.com","mail@louiskirsch.com","kurenkov@uni-potsdam.de","ankrug@uni-potsdam.de","johannsmeier@uni-potsdam.de","sstober@uni-potsdam.de"],"author_id":["julius-kunze","louis-kirsch","ilia-kurenkov","andreas-krug","jens-johannsmeier","sebastian-stober"],"abstract":"End-to-end training of automated speech recognition (ASR) systems requires massive data and compute resources. We explore transfer learning based on model adaptation as an approach for training ASR models under constrained GPU memory, throughput and training data. We conduct several systematic experiments adapting a Wav2Letter convolutional neural network originally trained for English ASR to the German language. We show that this technique allows faster training on consumer-grade resources while requiring less training data in order to achieve the same accuracy, thereby lowering the cost of training ASR models in other languages. Model introspection revealed that small adaptations to the network{'}s weights were sufficient for good performance, especially for inner layers.","pages":"168--177","doi":"10.18653\/v1\/W17-2620","url":"https:\/\/www.aclweb.org\/anthology\/W17-2620","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2621","title":"Gradual Learning of Matrix-Space Models of Language for Sentiment Analysis","authors":["Asaadi, Shima","Rudolph, Sebastian"],"emails":["shima.asaadi@tu-dresden.de","sebastian.rudolph@tu-dresden.de"],"author_id":["shima-asaadi","sebastian-rudolph"],"abstract":"Learning word representations to capture the semantics and compositionality of language has received much research interest in natural language processing. Beyond the popular vector space models, matrix representations for words have been proposed, since then, matrix multiplication can serve as natural composition operation. In this work, we investigate the problem of learning matrix representations of words. We present a learning approach for compositional matrix-space models for the task of sentiment analysis. We show that our approach, which learns the matrices gradually in two steps, outperforms other approaches and a gradient-descent baseline in terms of quality and computational cost.","pages":"178--185","doi":"10.18653\/v1\/W17-2621","url":"https:\/\/www.aclweb.org\/anthology\/W17-2621","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2622","title":"Improving Language Modeling using Densely Connected Recurrent Neural Networks","authors":["Godin, Fr{\\'e}deric","Dambre, Joni","De Neve, Wesley"],"emails":["fr{\\'e}deric.godin@ugent.be","joni.dambre@ugent.be","wesley.de neve@ugent.be"],"author_id":["frederic-godin","joni-dambre","wesley-de-neve"],"abstract":"In this paper, we introduce the novel concept of densely connected layers into recurrent neural networks. We evaluate our proposed architecture on the Penn Treebank language modeling task. We show that we can obtain similar perplexity scores with six times fewer parameters compared to a standard stacked 2-layer LSTM model trained with dropout (Zaremba et al., 2014). In contrast with the current usage of skip connections, we show that densely connecting only a few stacked layers with skip connections already yields significant perplexity reductions.","pages":"186--190","doi":"10.18653\/v1\/W17-2622","url":"https:\/\/www.aclweb.org\/anthology\/W17-2622","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2623","title":"{N}ews{QA}: A Machine Comprehension Dataset","authors":["Trischler, Adam","Wang, Tong","Yuan, Xingdi","Harris, Justin","Sordoni, Alessandro","Bachman, Philip","Suleman, Kaheer"],"emails":["adam.trischler@microsoft.com","tong.wang@microsoft.com","eric.yuan@microsoft.com","justin.harris@microsoft.com","kasulema@microsoft.com","phbachma@microsoft.com","alsordon@microsoft.com"],"author_id":["adam-trischler","tong-wang","xingdi-yuan","justin-harris","alessandro-sordoni","philip-bachman","kaheer-suleman"],"abstract":"We present NewsQA, a challenging machine comprehension dataset of over 100,000 human-generated question-answer pairs. Crowdworkers supply questions and answers based on a set of over 10,000 news articles from CNN, with answers consisting of spans of text in the articles. We collect this dataset through a four-stage process designed to solicit exploratory questions that require reasoning. Analysis confirms that NewsQA demands abilities beyond simple word matching and recognizing textual entailment. We measure human performance on the dataset and compare it to several strong neural models. The performance gap between humans and machines (13.3{\\%} F1) indicates that significant progress can be made on NewsQA through future research. The dataset is freely available online.","pages":"191--200","doi":"10.18653\/v1\/W17-2623","url":"https:\/\/www.aclweb.org\/anthology\/W17-2623","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2624","title":"Intrinsic and Extrinsic Evaluation of Spatiotemporal Text Representations in Twitter Streams","authors":["Phillips, Lawrence","Shaffer, Kyle","Arendt, Dustin","Hodas, Nathan","Volkova, Svitlana"],"emails":["","","","",""],"author_id":["lawrence-phillips","kyle-shaffer","dustin-arendt","nathan-hodas","svitlana-volkova"],"abstract":"Language in social media is a dynamic system, constantly evolving and adapting, with words and concepts rapidly emerging, disappearing, and changing their meaning. These changes can be estimated using word representations in context, over time and across locations. A number of methods have been proposed to track these spatiotemporal changes but no general method exists to evaluate the quality of these representations. Previous work largely focused on qualitative evaluation, which we improve by proposing a set of visualizations that highlight changes in text representation over both space and time. We demonstrate usefulness of novel spatiotemporal representations to explore and characterize specific aspects of the corpus of tweets collected from European countries over a two-week period centered around the terrorist attacks in Brussels in March 2016. In addition, we quantitatively evaluate spatiotemporal representations by feeding them into a downstream classification task {--} event type prediction. Thus, our work is the first to provide both intrinsic (qualitative) and extrinsic (quantitative) evaluation of text representations for spatiotemporal trends.","pages":"201--210","doi":"10.18653\/v1\/W17-2624","url":"https:\/\/www.aclweb.org\/anthology\/W17-2624","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2625","title":"Rethinking Skip-thought: A Neighborhood based Approach","authors":["Tang, Shuai","Jin, Hailin","Fang, Chen","Wang, Zhaowen","de Sa, Virginia"],"emails":["shuaitang93@ucsd.edu","hljin@adobe.com","cfang@adobe.com","zhawang@adobe.com","desa@ucsd.edu"],"author_id":["shuai-tang","hailin-jin","chen-fang","zhaowen-wang","virginia-de-sa"],"abstract":"We study the skip-thought model with neighborhood information as weak supervision. More specifically, we propose a skip-thought neighbor model to consider the adjacent sentences as a neighborhood. We train our skip-thought neighbor model on a large corpus with continuous sentences, and then evaluate the trained model on 7 tasks, which include semantic relatedness, paraphrase detection, and classification benchmarks. Both quantitative comparison and qualitative investigation are conducted. We empirically show that, our skip-thought neighbor model performs as well as the skip-thought model on evaluation tasks. In addition, we found that, incorporating an autoencoder path in our model didn{'}t aid our model to perform better, while it hurts the performance of the skip-thought model.","pages":"211--218","doi":"10.18653\/v1\/W17-2625","url":"https:\/\/www.aclweb.org\/anthology\/W17-2625","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2626","title":"A Frame Tracking Model for Memory-Enhanced Dialogue Systems","authors":["Schulz, Hannes","Zumer, Jeremie","El Asri, Layla","Sharma, Shikhar"],"emails":["hannes.schulz@microsoft.com","jeremie.zumer@microsoft.com","layla.el asri@microsoft.com","shikhar.sharma@microsoft.com"],"author_id":["hannes-schulz","jeremie-zumer","layla-el-asri","shikhar-kr-sarma"],"abstract":"Recently, resources and tasks were proposed to go beyond state tracking in dialogue systems. An example is the frame tracking task, which requires recording multiple frames, one for each user goal set during the dialogue. This allows a user, for instance, to compare items corresponding to different goals. This paper proposes a model which takes as input the list of frames created so far during the dialogue, the current user utterance as well as the dialogue acts, slot types, and slot values associated with this utterance. The model then outputs the frame being referenced by each triple of dialogue act, slot type, and slot value. We show that on the recently published Frames dataset, this model significantly outperforms a previously proposed rule-based baseline. In addition, we propose an extensive analysis of the frame tracking task by dividing it into sub-tasks and assessing their difficulty with respect to our model.","pages":"219--227","doi":"10.18653\/v1\/W17-2626","url":"https:\/\/www.aclweb.org\/anthology\/W17-2626","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2627","title":"Plan, Attend, Generate: Character-Level Neural Machine Translation with Planning","authors":["Gulcehre, Caglar","Dutil, Francis","Trischler, Adam","Bengio, Yoshua"],"emails":["","","",""],"author_id":["caglar-gulcehre","francis-dutil","adam-trischler","yoshua-bengio"],"abstract":"We investigate the integration of a planning mechanism into an encoder-decoder architecture with attention. We develop a model that can plan ahead when it computes alignments between the source and target sequences not only for a single time-step but for the next k time-steps as well by constructing a matrix of proposed future alignments and a commitment vector that governs whether to follow or recompute the plan. This mechanism is inspired by strategic attentive reader and writer (STRAW) model, a recent neural architecture for planning with hierarchical reinforcement learning that can also learn higher level temporal abstractions. Our proposed model is end-to-end trainable with differentiable operations. We show that our model outperforms strong baselines on character-level translation task from WMT{'}15 with fewer parameters and computes alignments that are qualitatively intuitive.","pages":"228--234","doi":"10.18653\/v1\/W17-2627","url":"https:\/\/www.aclweb.org\/anthology\/W17-2627","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2628","title":"Does the Geometry of Word Embeddings Help Document Classification? A Case Study on Persistent Homology-Based Representations","authors":["Michel, Paul","Ravichander, Abhilasha","Rijhwani, Shruti"],"emails":["pmichel1@cs.cmu.edu","aravicha@cs.cmu.edu","srijhwan@cs.cmu.edu"],"author_id":["paul-michel","abhilasha-ravichander","shruti-rijhwani"],"abstract":"We investigate the pertinence of methods from algebraic topology for text data analysis. These methods enable the development of mathematically-principled isometric-invariant mappings from a set of vectors to a document embedding, which is stable with respect to the geometry of the document in the selected metric space. In this work, we evaluate the utility of these topology-based document representations in traditional NLP tasks, specifically document clustering and sentiment classification. We find that the embeddings do not benefit text analysis. In fact, performance is worse than simple techniques like tf-idf, indicating that the geometry of the document does not provide enough variability for classification on the basis of topic or sentiment in the chosen datasets.","pages":"235--240","doi":"10.18653\/v1\/W17-2628","url":"https:\/\/www.aclweb.org\/anthology\/W17-2628","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2629","title":"Adversarial Generation of Natural Language","authors":["Subramanian, Sandeep","Rajeswar, Sai","Dutil, Francis","Pal, Chris","Courville, Aaron"],"emails":["sandeep.subramanian.1@umontreal.ca","sai.rajeswar.mudumba@umontreal.ca","frdutil@gmail.com","christopher.pal@polymtl.ca","aaron.courville@umontreal.ca"],"author_id":["sandeep-subramanian","sai-rajeswar","francis-dutil","christopher-pal","aaron-courville"],"abstract":"Generative Adversarial Networks (GANs) have gathered a lot of attention from the computer vision community, yielding impressive results for image generation. Advances in the adversarial generation of natural language from noise however are not commensurate with the progress made in generating images, and still lag far behind likelihood based methods. In this paper, we take a step towards generating natural language with a GAN objective alone. We introduce a simple baseline that addresses the discrete output space problem without relying on gradient estimators and show that it is able to achieve state-of-the-art results on a Chinese poem generation dataset. We present quantitative results on generating sentences from context-free and probabilistic context-free grammars, and qualitative language modeling results. A conditional version is also described that can generate sequences conditioned on sentence characteristics.","pages":"241--251","doi":"10.18653\/v1\/W17-2629","url":"https:\/\/www.aclweb.org\/anthology\/W17-2629","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2630","title":"Deep Active Learning for Named Entity Recognition","authors":["Shen, Yanyao","Yun, Hyokun","Lipton, Zachary","Kronrod, Yakov","Anandkumar, Animashree"],"emails":["shenyanyao@utexas.edu","yunhyoku@amazon.com","liptoz@amazon.com","kronrod@amazon.com","anima@amazon.com"],"author_id":["yanyao-shen","hyokun-yun","zachary-c-lipton","yakov-kronrod","animashree-anandkumar"],"abstract":"Deep neural networks have advanced the state of the art in named entity recognition. However, under typical training procedures, advantages over classical methods emerge only with large datasets. As a result, deep learning is employed only when large public datasets or a large budget for manually labeling data is available. In this work, we show otherwise: by combining deep learning with active learning, we can outperform classical methods even with a significantly smaller amount of training data.","pages":"252--256","doi":"10.18653\/v1\/W17-2630","url":"https:\/\/www.aclweb.org\/anthology\/W17-2630","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2631","title":"Learning when to skim and when to read","authors":["Johansen, Alexander","Socher, Richard"],"emails":["ajohansen@salesforce.com","rsocher@salesforce.com"],"author_id":["alexander-johansen","richard-socher"],"abstract":"Many recent advances in deep learning for natural language processing have come at increasing computational cost, but the power of these state-of-the-art models is not needed for every example in a dataset. We demonstrate two approaches to reducing unnecessary computation in cases where a fast but weak baseline classier and a stronger, slower model are both available. Applying an AUC-based metric to the task of sentiment classification, we find significant efficiency gains with both a probability-threshold method for reducing computational cost and one that uses a secondary decision network.","pages":"257--264","doi":"10.18653\/v1\/W17-2631","url":"https:\/\/www.aclweb.org\/anthology\/W17-2631","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"},{"id":"W17-2632","title":"Learning to Embed Words in Context for Syntactic Tasks","authors":["Tu, Lifu","Gimpel, Kevin","Livescu, Karen"],"emails":["lifu@ttic.edu","kgimpel@ttic.edu","klivescu@ttic.edu"],"author_id":["lifu-tu","kevin-gimpel","karen-livescu"],"abstract":"We present models for embedding words in the context of surrounding words. Such models, which we refer to as token embeddings, represent the characteristics of a word that are specific to a given context, such as word sense, syntactic category, and semantic role. We explore simple, efficient token embedding models based on standard neural network architectures. We learn token embeddings on a large amount of unannotated text and evaluate them as features for part-of-speech taggers and dependency parsers trained on much smaller amounts of annotated data. We find that predictors endowed with token embeddings consistently outperform baseline predictors across a range of context window and training set sizes.","pages":"265--275","doi":"10.18653\/v1\/W17-2632","url":"https:\/\/www.aclweb.org\/anthology\/W17-2632","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 2nd Workshop on Representation Learning for {NLP}"}]