[{"id":"W17-1001","title":"{M}ulti{L}ing 2017 Overview","authors":["Giannakopoulos, George","Conroy, John","Kubina, Jeff","Rankel, Peter A.","Lloret, Elena","Steinberger, Josef","Litvak, Marina","Favre, Benoit"],"emails":["","","","","","","",""],"author_id":["george-giannakopoulos","john-conroy","jeff-kubina","peter-a-rankel","elena-lloret","josef-steinberger","marina-litvak","benoit-favre"],"abstract":"In this brief report we present an overview of the MultiLing 2017 effort and workshop, as implemented within EACL 2017. MultiLing is a community-driven initiative that pushes the state-of-the-art in Automatic Summarization by providing data sets and fostering further research and development of summarization systems. This year the scope of the workshop was widened, bringing together researchers that work on summarization across sources, languages and genres. We summarize the main tasks planned and implemented this year, the contributions received, and we also provide insights on next steps.","pages":"1--6","doi":"10.18653\/v1\/W17-1001","url":"https:\/\/www.aclweb.org\/anthology\/W17-1001","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the {M}ulti{L}ing 2017 Workshop on Summarization and Summary Evaluation Across Source Types and Genres"},{"id":"W17-1002","title":"Decoupling Encoder and Decoder Networks for Abstractive Document Summarization","authors":["Xu, Ying","Lau, Jey Han","Baldwin, Timothy","Cohn, Trevor"],"emails":["ying.xu@monash.edu","jeyhan.lau@gmail.com","tb@ldwin.net","trevor.cohn@unimelb.edu.au"],"author_id":["ying-xu","jey-han-lau","timothy-baldwin","trevor-cohn"],"abstract":"Abstractive document summarization seeks to automatically generate a summary for a document, based on some abstract {``}understanding{''} of the original document. State-of-the-art techniques traditionally use attentive encoder{--}decoder architectures. However, due to the large number of parameters in these models, they require large training datasets and long training times. In this paper, we propose decoupling the encoder and decoder networks, and training them separately. We encode documents using an unsupervised document encoder, and then feed the document vector to a recurrent neural network decoder. With this decoupled architecture, we decrease the number of parameters in the decoder substantially, and shorten its training time. Experiments show that the decoupled model achieves comparable performance with state-of-the-art models for in-domain documents, but less well for out-of-domain documents.","pages":"7--11","doi":"10.18653\/v1\/W17-1002","url":"https:\/\/www.aclweb.org\/anthology\/W17-1002","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the {M}ulti{L}ing 2017 Workshop on Summarization and Summary Evaluation Across Source Types and Genres"},{"id":"W17-1003","title":"Centroid-based Text Summarization through Compositionality of Word Embeddings","authors":["Rossiello, Gaetano","Basile, Pierpaolo","Semeraro, Giovanni"],"emails":["firstname.secondname@uniba.it","",""],"author_id":["gaetano-rossiello","pierpaolo-basile","giovanni-semeraro"],"abstract":"The textual similarity is a crucial aspect for many extractive text summarization methods. A bag-of-words representation does not allow to grasp the semantic relationships between concepts when comparing strongly related sentences with no words in common. To overcome this issue, in this paper we propose a centroid-based method for text summarization that exploits the compositional capabilities of word embeddings. The evaluations on multi-document and multilingual datasets prove the effectiveness of the continuous vector representation of words compared to the bag-of-words model. Despite its simplicity, our method achieves good performance even in comparison to more complex deep learning models. Our method is unsupervised and it can be adopted in other summarization tasks.","pages":"12--21","doi":"10.18653\/v1\/W17-1003","url":"https:\/\/www.aclweb.org\/anthology\/W17-1003","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the {M}ulti{L}ing 2017 Workshop on Summarization and Summary Evaluation Across Source Types and Genres"},{"id":"W17-1004","title":"Query-based summarization using {MDL} principle","authors":["Litvak, Marina","Vanetik, Natalia"],"emails":["marinal@sce.ac.il","natalyav@sce.ac.il"],"author_id":["marina-litvak","natalia-vanetik"],"abstract":"Query-based text summarization is aimed at extracting essential information that answers the query from original text. The answer is presented in a minimal, often predefined, number of words. In this paper we introduce a new unsupervised approach for query-based extractive summarization, based on the minimum description length (MDL) principle that employs Krimp compression algorithm (Vreeken et al., 2011). The key idea of our approach is to select frequent word sets related to a given query that compress document sentences better and therefore describe the document better. A summary is extracted by selecting sentences that best cover query-related frequent word sets. The approach is evaluated based on the DUC 2005 and DUC 2006 datasets which are specifically designed for query-based summarization (DUC, 2005 2006). It competes with the best results.","pages":"22--31","doi":"10.18653\/v1\/W17-1004","url":"https:\/\/www.aclweb.org\/anthology\/W17-1004","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the {M}ulti{L}ing 2017 Workshop on Summarization and Summary Evaluation Across Source Types and Genres"},{"id":"W17-1005","title":"Word Embedding and Topic Modeling Enhanced Multiple Features for Content Linking and Argument \/ Sentiment Labeling in Online Forums","authors":["Li, Lei","Mao, Liyuan","Chen, Moye"],"emails":["leili@bupt.edu.cn","circleyuan@bupt.edu.cn","moyec@bupt.edu.cn"],"author_id":["lei-li","liyuan-mao","moye-chen"],"abstract":"Multiple grammatical and semantic features are adopted in content linking and argument\/sentiment labeling for online forums in this paper. There are mainly two different methods for content linking. First, we utilize the deep feature obtained from Word Embedding Model in deep learning and compute sentence similarity. Second, we use multiple traditional features to locate candidate linking sentences, and then adopt a voting method to obtain the final result. LDA topic modeling is used to mine latent semantic feature and K-means clustering is implemented for argument labeling, while features from sentiment dictionaries and rule-based sentiment analysis are integrated for sentiment labeling. Experimental results have shown that our methods are valid.","pages":"32--36","doi":"10.18653\/v1\/W17-1005","url":"https:\/\/www.aclweb.org\/anthology\/W17-1005","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the {M}ulti{L}ing 2017 Workshop on Summarization and Summary Evaluation Across Source Types and Genres"},{"id":"W17-1006","title":"Ultra-Concise Multi-genre Summarisation of Web2.0: towards Intelligent Content Generation","authors":["Lloret, Elena","Boldrini, Ester","Mart{\\'\\i}nez-Barco, Patricio","Palomar, Manuel"],"emails":["elloret@dlsi.ua.es","eboldrini@dlsi.ua.es","patricio@dlsi.ua.es","mpalomar@dlsi.ua.es"],"author_id":["elena-lloret","ester-boldrini","patricio-martinez-barco","manuel-palomar"],"abstract":"The electronic Word of Mouth has become the most powerful communication channel thanks to the wide usage of the Social Media. Our research proposes an approach towards the production of automatic ultra-concise summaries from multiple Web 2.0 sources. We exploit user-generated content from reviews and microblogs in different domains, and compile and analyse four types of ultra-concise summaries: a)positive information, b) negative information; c) both or d) objective information. The appropriateness and usefulness of our model is demonstrated by its successful results and great potential in real-life applications, thus meaning a relevant advancement of the state-of-the-art approaches.","pages":"37--46","doi":"10.18653\/v1\/W17-1006","url":"https:\/\/www.aclweb.org\/anthology\/W17-1006","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the {M}ulti{L}ing 2017 Workshop on Summarization and Summary Evaluation Across Source Types and Genres"},{"id":"W17-1007","title":"Machine Learning Approach to Evaluate {M}ulti{L}ingual Summaries","authors":["Ellouze, Samira","Jaoua, Maher","Hadrich Belguith, Lamia"],"emails":["llouze@fsegs.rnu.tn","maher.jaoua@fsegs.rnu.tn","l.belguith@fsegs.rnu.tn"],"author_id":["samira-ellouze","maher-jaoua","lamia-hadrich-belguith"],"abstract":"The present paper introduces a new MultiLing text summary evaluation method. This method relies on machine learning approach which operates by combining multiple features to build models that predict the human score (overall responsiveness) of a new summary. We have tried several single and {``}ensemble learning{''} classifiers to build the best model. We have experimented our method in summary level evaluation where we evaluate each text summary separately. The correlation between built models and human score is better than the correlation between baselines and manual score.","pages":"47--54","doi":"10.18653\/v1\/W17-1007","url":"https:\/\/www.aclweb.org\/anthology\/W17-1007","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the {M}ulti{L}ing 2017 Workshop on Summarization and Summary Evaluation Across Source Types and Genres"}]