[{"id":"W17-5201","title":"Detecting Sarcasm Using Different Forms Of Incongruity","authors":["Joshi, Aditya"],"emails":["adityaj@cse.iitb.ac.in"],"author_id":["aditya-joshi"],"abstract":"Sarcasm is a form of verbal irony that is intended to express contempt or ridicule. Often quoted as a challenge to sentiment analysis, sarcasm involves use of words of positive or no polarity to convey negative sentiment. Incongruity has been observed to be at the heart of sarcasm understanding in humans. Our work in sarcasm detection identifies different forms of incongruity and employs different machine learning techniques to capture them. This talk will describe the approach, datasets and challenges in sarcasm detection using different forms of incongruity. We identify two forms of incongruity: incongruity which can be understood based on the target text and common background knowledge, and incongruity which can be understood based on the target text and additional, specific context. The former involves use of sentiment-based features, word embeddings, and topic models. The latter involves creation of author{'}s historical context based on their historical data, and creation of conversational context for sarcasm detection of dialogue.","pages":"1","doi":"10.18653\/v1\/W17-5201","url":"https:\/\/www.aclweb.org\/anthology\/W17-5201","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5202","title":"Assessing State-of-the-Art Sentiment Models on State-of-the-Art Sentiment Datasets","authors":["Barnes, Jeremy","Klinger, Roman","Schulte im Walde, Sabine"],"emails":["barnesjy@ims.uni-stuttgart.de","klinger@ims.uni-stuttgart.de","schulte@ims.uni-stuttgart.de"],"author_id":["jeremy-barnes","roman-klinger","sabine-schulte-im-walde"],"abstract":"There has been a good amount of progress in sentiment analysis over the past 10 years, including the proposal of new methods and the creation of benchmark datasets. In some papers, however, there is a tendency to compare models only on one or two datasets, either because of time restraints or because the model is tailored to a specific task. Accordingly, it is hard to understand how well a certain model generalizes across different tasks and datasets. In this paper, we contribute to this situation by comparing several models on six different benchmarks, which belong to different domains and additionally have different levels of granularity (binary, 3-class, 4-class and 5-class). We show that Bi-LSTMs perform well across datasets and that both LSTMs and Bi-LSTMs are particularly good at fine-grained sentiment tasks (\\textit{i.e.}, with more than two classes). Incorporating sentiment information into word embeddings during training gives good results for datasets that are lexically similar to the training data. With our experiments, we contribute to a better understanding of the performance of different model architectures on different data sets. Consequently, we detect novel state-of-the-art results on the \\textit{SenTube} datasets.","pages":"2--12","doi":"10.18653\/v1\/W17-5202","url":"https:\/\/www.aclweb.org\/anthology\/W17-5202","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5203","title":"Annotation, Modelling and Analysis of Fine-Grained Emotions on a Stance and Sentiment Detection Corpus","authors":["Schuff, Hendrik","Barnes, Jeremy","Mohme, Julian","Pad{\\'o}, Sebastian","Klinger, Roman"],"emails":["firstname@ims.uni-stuttgart.de","","","lastname@ims.uni-stuttgart.de",""],"author_id":["hendrik-schuff","jeremy-barnes","julian-mohme","sebastian-pado","roman-klinger"],"abstract":"There is a rich variety of data sets for sentiment analysis (viz., polarity and subjectivity classification). For the more challenging task of detecting discrete emotions following the definitions of Ekman and Plutchik, however, there are much fewer data sets, and notably no resources for the social media domain. This paper contributes to closing this gap by extending the \\textit{SemEval 2016 stance and sentiment dataset} with emotion annotation. We (a) analyse annotation reliability and annotation merging; (b) investigate the relation between emotion annotation and the other annotation layers (stance, sentiment); (c) report modelling results as a baseline for future work.","pages":"13--23","doi":"10.18653\/v1\/W17-5203","url":"https:\/\/www.aclweb.org\/anthology\/W17-5203","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5204","title":"Ranking Right-Wing Extremist Social Media Profiles by Similarity to Democratic and Extremist Groups","authors":["Hartung, Matthias","Klinger, Roman","Schmidtke, Franziska","Vogel, Lars"],"emails":["mhartung@cit-ec.uni-bielefeld.de","klinger@ims.uni-stuttgart.de","franziska.schmidtke@uni-jena.de","lars.vogel@uni-jena.de"],"author_id":["matthias-hartung","roman-klinger","franziska-schmidtke","lars-vogel"],"abstract":"Social media are used by an increasing number of political actors. A small subset of these is interested in pursuing extremist motives such as mobilization, recruiting or radicalization activities. In order to counteract these trends, online providers and state institutions reinforce their monitoring efforts, mostly relying on manual workflows. We propose a machine learning approach to support manual attempts towards identifying right-wing extremist content in German Twitter profiles. Based on a fine-grained conceptualization of right-wing extremism, we frame the task as ranking each individual profile on a continuum spanning different degrees of right-wing extremism, based on a nearest neighbour approach. A quantitative evaluation reveals that our ranking model yields robust performance (up to 0.81 F$_1$ score) when being used for predicting discrete class labels. At the same time, the model provides plausible continuous ranking scores for a small sample of borderline cases at the division of right-wing extremism and New Right political movements.","pages":"24--33","doi":"10.18653\/v1\/W17-5204","url":"https:\/\/www.aclweb.org\/anthology\/W17-5204","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5205","title":"{WASSA}-2017 Shared Task on Emotion Intensity","authors":["Mohammad, Saif","Bravo-Marquez, Felipe"],"emails":["saif.mohammad@nrc-cnrc.gc.ca","felipe.bravo@waikato.ac.nz"],"author_id":["saif-mohammad","felipe-bravo-marquez"],"abstract":"We present the first shared task on detecting the intensity of emotion felt by the speaker of a tweet. We create the first datasets of tweets annotated for anger, fear, joy, and sadness intensities using a technique called best{--}worst scaling (BWS). We show that the annotations lead to reliable fine-grained intensity scores (rankings of tweets by intensity). The data was partitioned into training, development, and test sets for the competition. Twenty-two teams participated in the shared task, with the best system obtaining a Pearson correlation of 0.747 with the gold intensity scores. We summarize the machine learning setups, resources, and tools used by the participating teams, with a focus on the techniques and resources that are particularly useful for the task. The emotion intensity dataset and the shared task are helping improve our understanding of how we convey more or less intense emotions through language.","pages":"34--49","doi":"10.18653\/v1\/W17-5205","url":"https:\/\/www.aclweb.org\/anthology\/W17-5205","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5206","title":"{IMS} at {E}mo{I}nt-2017: Emotion Intensity Prediction with Affective Norms, Automatically Extended Resources and Deep Learning","authors":["K{\\\"o}per, Maximilian","Kim, Evgeny","Klinger, Roman"],"emails":["maximilian.koeper@ims.uni-stuttgart.de","evgeny.kim@ims.uni-stuttgart.de","roman.klinger@ims.uni-stuttgart.de"],"author_id":["maximilian-koper","evgeny-kim","roman-klinger"],"abstract":"Our submission to the WASSA-2017 shared task on the prediction of emotion intensity in tweets is a supervised learning method with extended lexicons of affective norms. We combine three main information sources in a random forrest regressor, namely (1), manually created resources, (2) automatically extended lexicons, and (3) the output of a neural network (CNN-LSTM) for sentence regression. All three feature sets perform similarly well in isolation ({\\mbox{$\\approx$}} .67 macro average Pearson correlation). The combination achieves .72 on the official test set (ranked 2nd out of 22 participants). Our analysis reveals that performance is increased by providing cross-emotional intensity predictions. The automatic extension of lexicon features benefit from domain specific embeddings. Complementary ratings for affective norms increase the impact of lexicon features. Our resources (ratings for 1.6 million twitter specific words) and our implementation is publicly available at \\url{http:\/\/www.ims.uni-stuttgart.de\/data\/ims_emoint}.","pages":"50--57","doi":"10.18653\/v1\/W17-5206","url":"https:\/\/www.aclweb.org\/anthology\/W17-5206","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5207","title":"Prayas at {E}mo{I}nt 2017: An Ensemble of Deep Neural Architectures for Emotion Intensity Prediction in Tweets","authors":["Goel, Pranav","Kulshreshtha, Devang","Jain, Prayas","Shukla, Kaushal Kumar"],"emails":["pranav.goel.cse14@iitbu.ac.in","devang.kulshreshtha.cse14@iitbu.ac.in","prayas.jain.cse14@iitbu.ac.in","kkshkla.cse@iitbu.ac.in"],"author_id":["pranav-goel","devang-kulshreshtha","prayas-jain","kaushal-kumar-shukla"],"abstract":"The paper describes the best performing system for EmoInt - a shared task to predict the intensity of emotions in tweets. Intensity is a real valued score, between 0 and 1. The emotions are classified as - anger, fear, joy and sadness. We apply three different deep neural network based models, which approach the problem from essentially different directions. Our final performance quantified by an average pearson correlation score of 74.7 and an average spearman correlation score of 73.5 is obtained using an ensemble of the three models. We outperform the baseline model of the shared task by 9.9{\\%} and 9.4{\\%} pearson and spearman correlation scores respectively.","pages":"58--65","doi":"10.18653\/v1\/W17-5207","url":"https:\/\/www.aclweb.org\/anthology\/W17-5207","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5208","title":"Latest News in Computational Argumentation: Surfing on the Deep Learning Wave, Scuba Diving in the Abyss of Fundamental Questions","authors":["Gurevych, Iryna"],"emails":["gurevych@ukp.informatik.tu-darmstadt.de"],"author_id":["iryna-gurevych"],"abstract":"Mining arguments from natural language texts, parsing argumentative structures, and assessing argument quality are among the recent challeng-es tackled in computational argumentation. While advanced deep learning models provide state-of-the-art performance in many of these tasks, much attention is also paid to the underly-ing fundamental questions. How are arguments expressed in natural language across genres and domains? What is the essence of an argument{'}s claim? Can we reliably annotate convincingness of an argument? How can we approach logic and common-sense reasoning in argumentation? This talk highlights some recent advances in computa-tional argumentation and shows why researchers must be both {``}surfers{''} and {``}scuba divers{''}.","pages":"66","doi":"10.18653\/v1\/W17-5208","url":"https:\/\/www.aclweb.org\/anthology\/W17-5208","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5209","title":"Towards Syntactic {I}berian Polarity Classification","authors":["Vilares, David","Garcia, Marcos","Alonso, Miguel A.","G{\\'o}mez-Rodr{\\'\\i}guez, Carlos"],"emails":["david.vilares@udc.es","marcos.garcia.gonzalez@udc.es","miguel.alonso@udc.es","carlos.gomez@udc.es"],"author_id":["david-vilares","marcos-garcia","miguel-a-alonso","carlos-gomez-rodriguez"],"abstract":"Lexicon-based methods using syntactic rules for polarity classification rely on parsers that are dependent on the language and on treebank guidelines. Thus, rules are also dependent and require adaptation, especially in multilingual scenarios. We tackle this challenge in the context of the Iberian Peninsula, releasing the first symbolic syntax-based Iberian system with rules shared across five official languages: Basque, Catalan, Galician, Portuguese and Spanish. The model is made available.","pages":"67--73","doi":"10.18653\/v1\/W17-5209","url":"https:\/\/www.aclweb.org\/anthology\/W17-5209","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5210","title":"Toward Stance Classification Based on Claim Microstructures","authors":["Boltu{\\v{z}}i{\\'c}, Filip","{\\v{S}}najder, Jan"],"emails":["filip.boltuzic@fer.hr","jan.snajder@fer.hr"],"author_id":["filip-boltuzic","jan-snajder"],"abstract":"Claims are the building blocks of arguments and the reasons underpinning opinions, thus analyzing claims is important for both argumentation mining and opinion mining. We propose a framework for representing claims as microstructures, which express the beliefs, judgments, and policies about the relations between domain-specific concepts. In a proof-of-concept study, we manually build microstructures for over 800 claims extracted from an online debate. We test the so-obtained microstructures on the task of claim stance classification, achieving considerable improvements over text-based baselines.","pages":"74--80","doi":"10.18653\/v1\/W17-5210","url":"https:\/\/www.aclweb.org\/anthology\/W17-5210","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5211","title":"Linguistic Reflexes of Well-Being and Happiness in Echo","authors":["Wu, Jiaqi","Walker, Marilyn","Anand, Pranav","Whittaker, Steve"],"emails":["jwu64@ucsc.edu","mawalker@ucsc.edu","panand@ucsc.edu","swhittak@ucsc.edu"],"author_id":["jiaqi-wu","marilyn-walker","pranav-anand","steve-whittaker"],"abstract":"Different theories posit different sources for feelings of well-being and happiness. Appraisal theory grounds our emotional responses in our goals and desires and their fulfillment, or lack of fulfillment. Self-Determination theory posits that the basis for well-being rests on our assessments of our competence, autonomy and social connection. And surveys that measure happiness empirically note that people require their basic needs to be met for food and shelter, but beyond that tend to be happiest when socializing, eating or having sex. We analyze a corpus of private micro-blogs from a well-being application called Echo, where users label each written post about daily events with a happiness score between 1 and 9. Our goal is to ground the linguistic descriptions of events that users experience in theories of well-being and happiness, and then examine the extent to which different theoretical accounts can explain the variance in the happiness scores. We show that recurrent event types, such as obligation and incompetence, which affect people{'}s feelings of well-being are not captured in current lexical or semantic resources.","pages":"81--91","doi":"10.18653\/v1\/W17-5211","url":"https:\/\/www.aclweb.org\/anthology\/W17-5211","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5212","title":"Forecasting Consumer Spending from Purchase Intentions Expressed on Social Media","authors":["Pekar, Viktor","Binner, Jane"],"emails":["v.pekar@bham.ac.uk","j.m.binner@bham.ac.uk"],"author_id":["viktor-pekar","jane-binner"],"abstract":"Consumer spending is an important macroeconomic indicator that is used by policy-makers to judge the health of an economy. In this paper we present a novel method for predicting future consumer spending from social media data. In contrast to previous work that largely relied on sentiment analysis, the proposed method models consumer spending from purchase intentions found on social media. Our experiments with time series analysis models and machine-learning regression models reveal utility of this data for making short-term forecasts of consumer spending: for three- and seven-day horizons, prediction variables derived from social media help to improve forecast accuracy by 11{\\%} to 18{\\%} for all the three models, in comparison to models that used only autoregressive predictors.","pages":"92--101","doi":"10.18653\/v1\/W17-5212","url":"https:\/\/www.aclweb.org\/anthology\/W17-5212","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5213","title":"Mining fine-grained opinions on closed captions of {Y}ou{T}ube videos with an attention-{RNN}","authors":["Marrese-Taylor, Edison","Balazs, Jorge","Matsuo, Yutaka"],"emails":["emarrese@weblab.t.u-tokyo.ac.jp","jorge@weblab.t.u-tokyo.ac.jp","matsuo@weblab.t.u-tokyo.ac.jp"],"author_id":["edison-marrese-taylor","jorge-balazs","yutaka-matsuo"],"abstract":"Video reviews are the natural evolution of written product reviews. In this paper we target this phenomenon and introduce the first dataset created from closed captions of YouTube product review videos as well as a new attention-RNN model for aspect extraction and joint aspect extraction and sentiment classification. Our model provides state-of-the-art performance on aspect extraction without requiring the usage of hand-crafted features on the SemEval ABSA corpus, while it outperforms the baseline on the joint task. In our dataset, the attention-RNN model outperforms the baseline for both tasks, but we observe important performance drops for all models in comparison to SemEval. These results, as well as further experiments on domain adaptation for aspect extraction, suggest that differences between speech and written text, which have been discussed extensively in the literature, also extend to the domain of product reviews, where they are relevant for fine-grained opinion mining.","pages":"102--111","doi":"10.18653\/v1\/W17-5213","url":"https:\/\/www.aclweb.org\/anthology\/W17-5213","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5214","title":"Understanding human values and their emotional effect","authors":["Balahur, Alexandra"],"emails":["alexandra.balahur@ec.europa.eu"],"author_id":["alexandra-balahur"],"abstract":"Emotions can be triggered by various factors. According to the Appraisal Theories (De Rivera, 1977; Frijda, 1986; Ortony et al., 1988; Johnson-Laird and Oatley, 1989) emotions are elicited and differentiated on the basis of the cognitive evaluation of the personal significance of a situation, object or event based on {``}appraisal criteria{''} (intrinsic characteristics of objects and events, significance of events to individual needs and goals, individual{'}s ability to cope with the consequences of the event, compatibility of event with social or personal standards, norms and values). These differences in values can trigger reactions such as anger, disgust (contempt), sadness, etc., because these behaviors are evaluated by the public as being incompatible with their social\/personal standards, norms or values. Such arguments are frequently present both in mainstream media, as well as social media, building a society-wide view, attitude and emotional reaction towards refugees\/immigrants. In this demo, I will talk about experiments to annotate and detect factual arguments that are linked to human needs\/motivations from text and in consequence trigger emotion in the media audience and propose a new task for next year{'}s WASSA.","pages":"112","doi":"10.18653\/v1\/W17-5214","url":"https:\/\/www.aclweb.org\/anthology\/W17-5214","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5215","title":"Did you ever read about Frogs drinking Coffee? Investigating the Compositionality of Multi-Emoji Expressions","authors":["Padilla L{\\'o}pez, Rebeca","Cap, Fabienne"],"emails":["",""],"author_id":["rebeca-padilla-lopez","fabienne-cap"],"abstract":"In this work, we present a first attempt to investigate multi-emoji expressions and whether they behave similarly to multiword expressions in terms of non-compositionality. We focus on the combination of the frog and the hot beverage emoji, but also show some preliminary results for other non-compositional emoji combinations. We use off-the-shelf sentiment analysers as well as manual classifications to approach the compositionality of these emoji combinations.","pages":"113--117","doi":"10.18653\/v1\/W17-5215","url":"https:\/\/www.aclweb.org\/anthology\/W17-5215","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5216","title":"Investigating Redundancy in Emoji Use: Study on a Twitter Based Corpus","authors":["Donato, Giulia","Paggio, Patrizia"],"emails":["giulia.dnt@gmail.com","paggio@hum.ku.dk"],"author_id":["giulia-donato","patrizia-paggio"],"abstract":"In this paper we present an annotated corpus created with the aim of analyzing the informative behaviour of emoji {--} an issue of importance for sentiment analysis and natural language processing. The corpus consists of 2475 tweets all containing at least one emoji, which has been annotated using one of the three possible classes: Redundant, Non Redundant, and Non Redundant + POS. We explain how the corpus was collected, describe the annotation procedure and the interface developed for the task. We provide an analysis of the corpus, considering also possible predictive features, discuss the problematic aspects of the annotation, and suggest future improvements.","pages":"118--126","doi":"10.18653\/v1\/W17-5216","url":"https:\/\/www.aclweb.org\/anthology\/W17-5216","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5217","title":"Modeling Temporal Progression of Emotional Status in Mental Health Forum: A Recurrent Neural Net Approach","authors":["Halder, Kishaloy","Poddar, Lahari","Kan, Min-Yen"],"emails":["kishaloy@comp.nus.edu.sg","lahari@comp.nus.edu.sg","kanmy@comp.nus.edu.sg"],"author_id":["kishaloy-halder","lahari-poddar","min-yen-kan"],"abstract":"Patients turn to Online Health Communities not only for information on specific conditions but also for emotional support. Previous research has indicated that the progression of emotional status can be studied through the linguistic patterns of an individual{'}s posts. We analyze a real-world dataset from the Mental Health section of HealthBoards.com. Estimated from the word usages in their posts, we find that the emotional progress across patients vary widely. We study the problem of predicting a patient{'}s emotional status in the future from her past posts and we propose a Recurrent Neural Network (RNN) based architecture to address it. We find that the future emotional status can be predicted with reasonable accuracy given her historical posts and participation features. Our evaluation results demonstrate the efficacy of our proposed architecture, by outperforming state-of-the-art approaches with over 0.13 reduction in Mean Absolute Error.","pages":"127--135","doi":"10.18653\/v1\/W17-5217","url":"https:\/\/www.aclweb.org\/anthology\/W17-5217","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5218","title":"Towards an integrated pipeline for aspect-based sentiment analysis in various domains","authors":["De Clercq, Orph{\\'e}e","Lefever, Els","Jacobs, Gilles","Carpels, Tijl","Hoste, V{\\'e}ronique"],"emails":["orphee.declercq@ugent.be","els.lefever@ugent.be","gillesm.jacobs@ugent.be","tijl@hellocustomer.com","veronique.hoste@ugent.be"],"author_id":["orphee-de-clercq","els-lefever","gilles-jacobs","tijl-carpels","veronique-hoste"],"abstract":"This paper presents an integrated ABSA pipeline for Dutch that has been developed and tested on qualitative user feedback coming from three domains: retail, banking and human resources. The two latter domains provide service-oriented data, which has not been investigated before in ABSA. By performing in-domain and cross-domain experiments the validity of our approach was investigated. We show promising results for the three ABSA subtasks, aspect term extraction, aspect category classification and aspect polarity classification.","pages":"136--142","doi":"10.18653\/v1\/W17-5218","url":"https:\/\/www.aclweb.org\/anthology\/W17-5218","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5219","title":"Building a {S}enti{W}ord{N}et for {O}dia","authors":["Mohanty, Gaurav","Kannan, Abishek","Mamidi, Radhika"],"emails":["gaurav.mohanty@research.iiit.ac.in","abishek.kannan@research.iiit.ac.in","radhika.mamidi@iiit.ac.in"],"author_id":["gaurav-mohanty","abishek-kannan","radhika-mamidi"],"abstract":"As a discipline of Natural Language Processing, Sentiment Analysis is used to extract and analyze subjective information present in natural language data. The task of Sentiment Analysis has acquired wide commercial uses including social media monitoring tasks, survey responses, review systems, etc. Languages like English have several resources which aid in the task of Sentiment Analysis. SentiWordNet and Subjectivity WordList are examples of such tools and resources. With more data being available in native vernacular, language-specific SentiWordNet(s) have become essential. For resource poor languages, creating such SentiWordNet(s) is a difficult task to achieve. One solution is to use available resources in English and translate the final source lexicon to target lexicon via machine translation. Machine translation systems for the English-Odia language pair have not yet been developed. In this paper, we discuss a method to create a SentiWordNet for Odia, which is resource-poor, by only using resources which are currently available for Indian languages. The lexicon created, would serve as a tool for Sentiment Analysis related task specific to Odia data.","pages":"143--148","doi":"10.18653\/v1\/W17-5219","url":"https:\/\/www.aclweb.org\/anthology\/W17-5219","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5220","title":"Lexicon Integrated {CNN} Models with Attention for Sentiment Analysis","authors":["Shin, Bonggun","Lee, Timothy","Choi, Jinho D."],"emails":["bonggun.shin@emory.edu","timothy.lee@emory.edu","jinho.choi@emory.edu"],"author_id":["bonggun-shin","timothy-lee","jinho-d-choi"],"abstract":"With the advent of word embeddings, lexicons are no longer fully utilized for sentiment analysis although they still provide important features in the traditional setting. This paper introduces a novel approach to sentiment analysis that integrates lexicon embeddings and an attention mechanism into Convolutional Neural Networks. Our approach performs separate convolutions for word and lexicon embeddings and provides a global view of the document using attention. Our models are experimented on both the SemEval{'}16 Task 4 dataset and the Stanford Sentiment Treebank and show comparative or better results against the existing state-of-the-art systems. Our analysis shows that lexicon embeddings allow building high-performing models with much smaller word embeddings, and the attention mechanism effectively dims out noisy words for sentiment analysis.","pages":"149--158","doi":"10.18653\/v1\/W17-5220","url":"https:\/\/www.aclweb.org\/anthology\/W17-5220","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5221","title":"Explaining Recurrent Neural Network Predictions in Sentiment Analysis","authors":["Arras, Leila","Montavon, Gr{\\'e}goire","M{\\\"u}ller, Klaus-Robert","Samek, Wojciech"],"emails":["leila.arras@hhi.fraunhofer.de","","","wojciech.samek@hhi.fraunhofer.de"],"author_id":["leila-arras","gregoire-montavon","klaus-robert-muller","wojciech-samek"],"abstract":"Recently, a technique called Layer-wise Relevance Propagation (LRP) was shown to deliver insightful explanations in the form of input space relevances for understanding feed-forward neural network classification decisions. In the present work, we extend the usage of LRP to recurrent neural networks. We propose a specific propagation rule applicable to multiplicative connections as they arise in recurrent network architectures such as LSTMs and GRUs. We apply our technique to a word-based bi-directional LSTM model on a five-class sentiment prediction task, and evaluate the resulting LRP relevances both qualitatively and quantitatively, obtaining better results than a gradient-based related method which was used in previous work.","pages":"159--168","doi":"10.18653\/v1\/W17-5221","url":"https:\/\/www.aclweb.org\/anthology\/W17-5221","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5222","title":"{G}rad{A}scent at {E}mo{I}nt-2017: Character and Word Level Recurrent Neural Network Models for Tweet Emotion Intensity Detection","authors":["Lakomkin, Egor","Bothe, Chandrakant","Wermter, Stefan"],"emails":["lakomkin@informatik.uni-hamburg.de","bothe@informatik.uni-hamburg.de","wermter@informatik.uni-hamburg.de"],"author_id":["egor-lakomkin","chandrakant-bothe","stefan-wermter"],"abstract":"The WASSA 2017 EmoInt shared task has the goal to predict emotion intensity values of tweet messages. Given the text of a tweet and its emotion category (anger, joy, fear, and sadness), the participants were asked to build a system that assigns emotion intensity values. Emotion intensity estimation is a challenging problem given the short length of the tweets, the noisy structure of the text and the lack of annotated data. To solve this problem, we developed an ensemble of two neural models, processing input on the character. and word-level with a lexicon-driven system. The correlation scores across all four emotions are averaged to determine the bottom-line competition metric, and our system ranks place forth in full intensity range and third in 0.5-1 range of intensity among 23 systems at the time of writing (June 2017).","pages":"169--174","doi":"10.18653\/v1\/W17-5222","url":"https:\/\/www.aclweb.org\/anthology\/W17-5222","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5223","title":"{NUIG} at {E}mo{I}nt-2017: {B}i{LSTM} and {SVR} Ensemble to Detect Emotion Intensity","authors":["Andryushechkin, Vladimir","Wood, Ian","O{'} Neill, James"],"emails":["vladimir.andryushechkin@insight-centre.org","ian.wood@insight-centre.org","james.oneill@insight-centre.org"],"author_id":["vladimir-andryushechkin","ian-wood","james-o-neill"],"abstract":"This paper describes the entry NUIG in the WASSA 2017 (8th Workshop on Computational Approaches to Subjectivity, Sentiment {\\&} Social Media Analysis) shared task on emotion recognition. The NUIG system used an SVR (SVM regression) and BLSTM ensemble, utilizing primarily n-grams (for SVR features) and tweet word embeddings (for BLSTM features). Experiments were carried out on several other candidate features, some of which were added to the SVR model. Parameter selection for the SVR model was run as a grid search whilst parameters for the BLSTM model were selected through a non-exhaustive ad-hoc search.","pages":"175--179","doi":"10.18653\/v1\/W17-5223","url":"https:\/\/www.aclweb.org\/anthology\/W17-5223","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5224","title":"Unsupervised Aspect Term Extraction with B-{LSTM} {\\&} {CRF} using Automatically Labelled Datasets","authors":["Giannakopoulos, Athanasios","Musat, Claudiu","Hossmann, Andreea","Baeriswyl, Michael"],"emails":["","","","ame@swisscom.com"],"author_id":["athanasios-giannakopoulos","claudiu-musat","andreea-hossmann","michael-baeriswyl"],"abstract":"Aspect Term Extraction (ATE) identifies opinionated aspect terms in texts and is one of the tasks in the SemEval Aspect Based Sentiment Analysis (ABSA) contest. The small amount of available datasets for supervised ATE and the costly human annotation for aspect term labelling give rise to the need for unsupervised ATE. In this paper, we introduce an architecture that achieves top-ranking performance for supervised ATE. Moreover, it can be used efficiently as feature extractor and classifier for unsupervised ATE. Our second contribution is a method to automatically construct datasets for ATE. We train a classifier on our automatically labelled datasets and evaluate it on the human annotated SemEval ABSA test sets. Compared to a strong rule-based baseline, we obtain a dramatically higher F-score and attain precision values above 80{\\%}. Our unsupervised method beats the supervised ABSA baseline from SemEval, while preserving high precision scores.","pages":"180--188","doi":"10.18653\/v1\/W17-5224","url":"https:\/\/www.aclweb.org\/anthology\/W17-5224","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5225","title":"{PLN}-{PUCRS} at {E}mo{I}nt-2017: Psycholinguistic features for emotion intensity prediction in tweets","authors":["Santos, Henrique","Vieira, Renata"],"emails":["henrique.santos.003@acad.pucrs.br","renata.vieira@pucrs.br"],"author_id":["henrique-santos","renata-vieira"],"abstract":"Linguistic Inquiry and Word Count (LIWC) is a rich dictionary that map words into several psychological categories such as Affective, Social, Cognitive, Perceptual and Biological processes. In this work, we have used LIWC psycholinguistic categories to train regression models and predict emotion intensity in tweets for the EmoInt-2017 task. Results show that LIWC features may boost emotion intensity prediction on the basis of a low dimension set.","pages":"189--192","doi":"10.18653\/v1\/W17-5225","url":"https:\/\/www.aclweb.org\/anthology\/W17-5225","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5226","title":"Textmining at {E}mo{I}nt-2017: A Deep Learning Approach to Sentiment Intensity Scoring of {E}nglish Tweets","authors":["Meisheri, Hardik","Saha, Rupsa","Sinha, Priyanka","Dey, Lipika"],"emails":["hardik.meisheri@tcs.com","rupsa.s@tcs.com","priyanka27.s@tcs.com","lipika.dey@tcs.com"],"author_id":["hardik-meisheri","rupsa-saha","priyanka-sinha","lipika-dey"],"abstract":"This paper describes our approach to the Emotion Intensity shared task. A parallel architecture of Convolutional Neural Network (CNN) and Long short term memory networks (LSTM) alongwith two sets of features are extracted which aid the network in judging emotion intensity. Experiments on different models and various features sets are described and analysis on results has also been presented.","pages":"193--199","doi":"10.18653\/v1\/W17-5226","url":"https:\/\/www.aclweb.org\/anthology\/W17-5226","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5227","title":"{YNU}-{HPCC} at {E}mo{I}nt-2017: Using a {CNN}-{LSTM} Model for Sentiment Intensity Prediction","authors":["Zhang, You","Yuan, Hang","Wang, Jin","Zhang, Xuejie"],"emails":["xjzhang@ynu.edu.cn","","",""],"author_id":["you-zhang","hang-yuan","jin-wang","xuejie-zhang"],"abstract":"In this paper, we present a system that uses a convolutional neural network with long short-term memory (CNN-LSTM) model to complete the task. The CNN-LSTM model has two combined parts: CNN extracts local n-gram features within tweets and LSTM composes the features to capture long-distance dependency across tweets. Additionally, we used other three models (CNN, LSTM, BiLSTM) as baseline algorithms. Our introduced model showed good performance in the experimental results.","pages":"200--204","doi":"10.18653\/v1\/W17-5227","url":"https:\/\/www.aclweb.org\/anthology\/W17-5227","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5228","title":"Seernet at {E}mo{I}nt-2017: Tweet Emotion Intensity Estimator","authors":["Duppada, Venkatesh","Hiray, Sushant"],"emails":["venkatesh.duppada@seernet.io","sushant.hiray@seernet.io"],"author_id":["venkatesh-duppada","sushant-hiray"],"abstract":"The paper describes experiments on estimating emotion intensity in tweets using a generalized regressor system. The system combines various independent feature extractors, trains them on general regressors and finally combines the best performing models to create an ensemble. The proposed system stood 3rd out of 22 systems in leaderboard of WASSA-2017 Shared Task on Emotion Intensity.","pages":"205--211","doi":"10.18653\/v1\/W17-5228","url":"https:\/\/www.aclweb.org\/anthology\/W17-5228","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5229","title":"{IITP} at {E}mo{I}nt-2017: Measuring Intensity of Emotions using Sentence Embeddings and Optimized Features","authors":["Akhtar, Md Shad","Sawant, Palaash","Ekbal, Asif","Pawar, Jyoti","Bhattacharyya, Pushpak"],"emails":["shad.pcs15@iitp.ac.in","palaash77@gmail.com","asif@iitp.ac.in","jdp@unigoa.ac.in","pb@iitp.ac.in"],"author_id":["md-shad-akhtar","palaash-sawant","asif-ekbal","jyoti-pawar","pushpak-bhattacharyya"],"abstract":"This paper describes the system that we submitted as part of our participation in the shared task on Emotion Intensity (EmoInt-2017). We propose a Long short term memory (LSTM) based architecture cascaded with Support Vector Regressor (SVR) for intensity prediction. We also employ Particle Swarm Optimization (PSO) based feature selection algorithm for obtaining an optimized feature set for training and evaluation. System evaluation shows interesting results on the four emotion datasets i.e. anger, fear, joy and sadness. In comparison to the other participating teams our system was ranked 5th in the competition.","pages":"212--218","doi":"10.18653\/v1\/W17-5229","url":"https:\/\/www.aclweb.org\/anthology\/W17-5229","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5230","title":"{NSE}mo at {E}mo{I}nt-2017: An Ensemble to Predict Emotion Intensity in Tweets","authors":["Madisetty, Sreekanth","Desarkar, Maunendra Sankar"],"emails":["cs15resch11006@iith.ac.in","maunendra@iith.ac.in"],"author_id":["sreekanth-madisetty","maunendra-sankar-desarkar"],"abstract":"In this paper, we describe a method to predict emotion intensity in tweets. Our approach is an ensemble of three regression methods. The first method uses content-based features (hashtags, emoticons, elongated words, etc.). The second method considers word n-grams and character n-grams for training. The final method uses lexicons, word embeddings, word n-grams, character n-grams for training the model. An ensemble of these three methods gives better performance than individual methods. We applied our method on WASSA emotion dataset. Achieved results are as follows: average Pearson correlation is 0.706, average Spearman correlation is 0.696, average Pearson correlation for gold scores in range 0.5 to 1 is 0.539, and average Spearman correlation for gold scores in range 0.5 to 1 is 0.514.","pages":"219--224","doi":"10.18653\/v1\/W17-5230","url":"https:\/\/www.aclweb.org\/anthology\/W17-5230","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5231","title":"{T}ecnolengua {L}ingmotif at {E}mo{I}nt-2017: A lexicon-based approach","authors":["Moreno-Ortiz, Antonio"],"emails":["amo@uma.es"],"author_id":["antonio-moreno-ortiz"],"abstract":"In this paper we describe Tecnolengua Group{'}s participation in the shared task on emotion intensity at WASSA 2017. We used the Lingmotif tool and a new, complementary tool, Lingmotif Learn, which we developed for this occasion. We based our intensity predictions for the four test datasets entirely on Lingmotif{'}s TSS (text sentiment score) feature. We also developed mechanisms for dealing with the idiosyncrasies of Twitter text. Results were comparatively poor, but the experience meant a good opportunity for us to identify issues in our score calculation for short texts, a genre for which the Lingmotif tool was not originally designed.","pages":"225--232","doi":"10.18653\/v1\/W17-5231","url":"https:\/\/www.aclweb.org\/anthology\/W17-5231","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5232","title":"{E}mo{A}tt at {E}mo{I}nt-2017: Inner attention sentence embedding for Emotion Intensity","authors":["Marrese-Taylor, Edison","Matsuo, Yutaka"],"emails":["emarrese@weblab.t.u-tokyo.ac.jp","matsuo@weblab.t.u-tokyo.ac.jp"],"author_id":["edison-marrese-taylor","yutaka-matsuo"],"abstract":"In this paper we describe a deep learning system that has been designed and built for the WASSA 2017 Emotion Intensity Shared Task. We introduce a representation learning approach based on inner attention on top of an RNN. Results show that our model offers good capabilities and is able to successfully identify emotion-bearing words to predict intensity without leveraging on lexicons, obtaining the 13t place among 22 shared task competitors.","pages":"233--237","doi":"10.18653\/v1\/W17-5232","url":"https:\/\/www.aclweb.org\/anthology\/W17-5232","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5233","title":"{YZU}-{NLP} at {E}mo{I}nt-2017: Determining Emotion Intensity Using a Bi-directional {LSTM}-{CNN} Model","authors":["He, Yuanye","Yu, Liang-Chih","Lai, K. Robert","Liu, Weiyi"],"emails":["","lcyu@saturn.yzu.edu.tw","",""],"author_id":["yuanye-he","liang-chih-yu","k-robert-lai","weiyi-liu"],"abstract":"The EmoInt-2017 task aims to determine a continuous numerical value representing the intensity to which an emotion is expressed in a tweet. Compared to classification tasks that identify 1 among n emotions for a tweet, the present task can provide more fine-grained (real-valued) sentiment analysis. This paper presents a system that uses a bi-directional LSTM-CNN model to complete the competition task. Combining bi-directional LSTM and CNN, the prediction process considers both global information in a tweet and local important information. The proposed method ranked sixth among twenty-one teams in terms of Pearson Correlation Coefficient.","pages":"238--242","doi":"10.18653\/v1\/W17-5233","url":"https:\/\/www.aclweb.org\/anthology\/W17-5233","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5234","title":"{DMG}roup at {E}mo{I}nt-2017: Emotion Intensity Using Ensemble Method","authors":["Jiang, Song","Han, Xiaotian"],"emails":["jiangson15@mails.tsinghua.edu.cn","stentor@163.com"],"author_id":["song-jiang","xiaotian-han"],"abstract":"In this paper, we present a novel ensemble learning architecture for emotion intensity analysis, particularly a novel framework of ensemble method. The ensemble method has two stages and each stage includes several single machine learning models. In stage1, we employ both linear and nonlinear regression models to obtain a more diverse emotion intensity representation. In stage2, we use two regression models including linear regression and XGBoost. The result of stage1 serves as the input of stage2, so the two different type models (linear and non-linear) in stage2 can describe the input in two opposite aspects. We also added a method for analyzing and splitting multi-words hashtags and appending them to the emotion intensity corpus before feeding it to our model. Our model achieves 0.571 Pearson-measure for the average of four emotions.","pages":"243--248","doi":"10.18653\/v1\/W17-5234","url":"https:\/\/www.aclweb.org\/anthology\/W17-5234","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5235","title":"{UW}at-Emote at {E}mo{I}nt-2017: Emotion Intensity Detection using Affect Clues, Sentiment Polarity and Word Embeddings","authors":["John, Vineet","Vechtomova, Olga"],"emails":["vineet.john@uwaterloo.ca","ovechtom@uwaterloo.ca"],"author_id":["vineet-john","olga-vechtomova"],"abstract":"This paper describes the UWaterloo affect prediction system developed for EmoInt-2017. We delve into our feature selection approach for affect intensity, affect presence, sentiment intensity and sentiment presence lexica alongside pre-trained word embeddings, which are utilized to extract emotion intensity signals from tweets in an ensemble learning approach. The system employs emotion specific model training, and utilizes distinct models for each of the emotion corpora in isolation. Our system utilizes gradient boosted regression as the primary learning technique to predict the final emotion intensities.","pages":"249--254","doi":"10.18653\/v1\/W17-5235","url":"https:\/\/www.aclweb.org\/anthology\/W17-5235","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5236","title":"{LIPN}-{UAM} at {E}mo{I}nt-2017:Combination of Lexicon-based features and Sentence-level Vector Representations for Emotion Intensity Determination","authors":["Buscaldi, Davide","Priego, Belem"],"emails":["buscaldi@lipn.univ-paris13.fr","belemps@gmail.com"],"author_id":["davide-buscaldi","belem-priego-sanchez"],"abstract":"This paper presents the combined LIPN-UAM participation in the WASSA 2017 Shared Task on Emotion Intensity. In particular, the paper provides some highlights on the Tweetaneuse system that was presented to the shared task. We combined lexicon-based features with sentence-level vector representations to implement a random forest regressor.","pages":"255--258","doi":"10.18653\/v1\/W17-5236","url":"https:\/\/www.aclweb.org\/anthology\/W17-5236","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"},{"id":"W17-5237","title":"deep{C}yb{E}r{N}et at {E}mo{I}nt-2017: Deep Emotion Intensities in Tweets","authors":["R, Vinayakumar","B, Premjith","S, Sachin Kumar","KP, Soman","Poornachandran, Prabaharan"],"emails":["vinayakumarr77@gmail.com","","","",""],"author_id":["vinayakumar-r","premjith-b","sachin-kumar-s","soman-kp","prabaharan-poornachandran"],"abstract":"This working note presents the methodology used in deepCybErNet submission to the shared task on Emotion Intensities in Tweets (EmoInt) WASSA-2017. The goal of the task is to predict a real valued score in the range [0-1] for a particular tweet with an emotion type. To do this, we used Bag-of-Words and embedding based on recurrent network architecture. We have developed two systems and experiments are conducted on the Emotion Intensity shared Task 1 data base at WASSA-2017. A system which uses word embedding based on recurrent network architecture has achieved highest 5 fold cross-validation accuracy. This has used embedding with recurrent network to extract optimal features at tweet level and logistic regression for prediction. These methods are highly language independent and experimental results shows that the proposed methods are apt for predicting a real valued score in than range [0-1] for a given tweet with its emotion type.","pages":"259--263","doi":"10.18653\/v1\/W17-5237","url":"https:\/\/www.aclweb.org\/anthology\/W17-5237","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 8th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis"}]