[{"id":"W17-1201","title":"Findings of the {V}ar{D}ial Evaluation Campaign 2017","authors":["Zampieri, Marcos","Malmasi, Shervin","Ljube{\\v{s}}i{\\'c}, Nikola","Nakov, Preslav","Ali, Ahmed","Tiedemann, J{\\\"o}rg","Scherrer, Yves","Aepli, No{\\\"e}mi"],"emails":["","","","","","","",""],"author_id":["marcos-zampieri","shervin-malmasi","nikola-ljubesic","preslav-nakov","ahmed-ali","jorg-tiedemann","yves-scherrer","noemi-aepli"],"abstract":"We present the results of the VarDial Evaluation Campaign on Natural Language Processing (NLP) for Similar Languages, Varieties and Dialects, which we organized as part of the fourth edition of the VarDial workshop at EACL{'}2017. This year, we included four shared tasks: Discriminating between Similar Languages (DSL), Arabic Dialect Identification (ADI), German Dialect Identification (GDI), and Cross-lingual Dependency Parsing (CLP). A total of 19 teams submitted runs across the four tasks, and 15 of them wrote system description papers.","pages":"1--15","doi":"10.18653\/v1\/W17-1201","url":"https:\/\/www.aclweb.org\/anthology\/W17-1201","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1202","title":"Dialectometric analysis of language variation in Twitter","authors":["Donoso, Gonzalo","S{\\'a}nchez, David"],"emails":["gdonoso94@hotmail.com","david.sanchez@uib.es"],"author_id":["gonzalo-donoso","david-sanchez"],"abstract":"In the last few years, microblogging platforms such as Twitter have given rise to a deluge of textual data that can be used for the analysis of informal communication between millions of individuals. In this work, we propose an information-theoretic approach to geographic language variation using a corpus based on Twitter. We test our models with tens of concepts and their associated keywords detected in Spanish tweets geolocated in Spain. We employ dialectometric measures (cosine similarity and Jensen-Shannon divergence) to quantify the linguistic distance on the lexical level between cells created in a uniform grid over the map. This can be done for a single concept or in the general case taking into account an average of the considered variants. The latter permits an analysis of the dialects that naturally emerge from the data. Interestingly, our results reveal the existence of two dialect macrovarieties. The first group includes a region-specific speech spoken in small towns and rural areas whereas the second cluster encompasses cities that tend to use a more uniform variety. Since the results obtained with the two different metrics qualitatively agree, our work suggests that social media corpora can be efficiently used for dialectometric analyses.","pages":"16--25","doi":"10.18653\/v1\/W17-1202","url":"https:\/\/www.aclweb.org\/anthology\/W17-1202","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1203","title":"Computational analysis of {G}ondi dialects","authors":["Rama, Taraka","{\\c{C}}{\\\"o}ltekin, {\\c{C}}a{\\u{g}}r{\\i}","Sofroniev, Pavel"],"emails":["taraka-rama.kasicheyanula@uni-tuebingen.de","cagri.coeltekin@sfs.uni-tuebingen.de","pavel.sofroniev@student.uni-tuebingen.de"],"author_id":["taraka-rama","cagri-coltekin","pavel-sofroniev"],"abstract":"This paper presents a computational analysis of Gondi dialects spoken in central India. We present a digitized data set of the dialect area, and analyze the data using different techniques from dialectometry, deep learning, and computational biology. We show that the methods largely agree with each other and with the earlier non-computational analyses of the language group.","pages":"26--35","doi":"10.18653\/v1\/W17-1203","url":"https:\/\/www.aclweb.org\/anthology\/W17-1203","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1204","title":"Investigating Diatopic Variation in a Historical Corpus","authors":["Dipper, Stefanie","Waldenberger, Sandra"],"emails":["dipper@linguistics.rub.de","sandra.waldenberger@rub.de"],"author_id":["stefanie-dipper","sandra-waldenberger"],"abstract":"This paper investigates diatopic variation in a historical corpus of German. Based on equivalent word forms from different language areas, replacement rules and mappings are derived which describe the relations between these word forms. These rules and mappings are then interpreted as reflections of morphological, phonological or graphemic variation. Based on sample rules and mappings, we show that our approach can replicate results from historical linguistics. While previous studies were restricted to predefined word lists, or confined to single authors or texts, our approach uses a much wider range of data available in historical corpora.","pages":"36--45","doi":"10.18653\/v1\/W17-1204","url":"https:\/\/www.aclweb.org\/anthology\/W17-1204","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1205","title":"Author Profiling at {PAN}: from Age and Gender Identification to Language Variety Identification (invited talk)","authors":["Rosso, Paolo"],"emails":["prosso@dsic.upv.es"],"author_id":["paolo-rosso"],"abstract":"Author profiling is the study of how language is shared by people, a problem of growing importance in applications dealing with security, in order to understand who could be behind an anonymous threat message, and marketing, where companies may be interested in knowing the demographics of people that in online reviews liked or disliked their products. In this talk we will give an overview of the PAN shared tasks that since 2013 have been organised at CLEF and FIRE evaluation forums, mainly on age and gender identification in social media, although also personality recognition in Twitter as well as in code sources was also addressed. In 2017 the PAN author profiling shared task addresses jointly gender and language variety identification in Twitter where tweets have been annotated with authors{'} gender and their specific variation of their native language: English (Australia, Canada, Great Britain, Ireland, New Zealand, United States), Spanish (Argentina, Chile, Colombia, Mexico, Peru, Spain, Venezuela), Portuguese (Brazil, Portugal), and Arabic (Egypt, Gulf, Levantine, Maghrebi).","pages":"46","doi":"10.18653\/v1\/W17-1205","url":"https:\/\/www.aclweb.org\/anthology\/W17-1205","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1206","title":"The similarity and Mutual Intelligibility between {A}mharic and {T}igrigna Varieties","authors":["Feleke, Tekabe Legesse"],"emails":["hitakeleg@gmail.com"],"author_id":["tekabe-legesse-feleke"],"abstract":"The present study has examined the similarity and the mutual intelligibility between Amharic and Tigrigna using three tools namely Levenshtein distance, intelligibility test and questionnaires. The study has shown that both Tigrigna varieties have almost equal phonetic and lexical distances from Amharic. The study also indicated that Amharic speakers understand less than 50{\\%} of the two varieties. Furthermore, the study showed that Amharic speakers are more positive about the Ethiopian Tigrigna variety than the Eritrean Variety. However, their attitude towards the two varieties does not have an impact on their intelligibility. The Amharic speakers{'} familiarity to the Tigrigna varieties is largely dependent on the genealogical relation between Amharic and the two Tigrigna varieties.","pages":"47--54","doi":"10.18653\/v1\/W17-1206","url":"https:\/\/www.aclweb.org\/anthology\/W17-1206","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1207","title":"Why {C}atalan-{S}panish Neural Machine Translation? Analysis, comparison and combination with standard Rule and Phrase-based technologies","authors":["Costa-juss{\\`a}, Marta R."],"emails":["marta.ruiz@upc.edu"],"author_id":["marta-r-costa-jussa"],"abstract":"Catalan and Spanish are two related languages given that both derive from Latin. They share similarities in several linguistic levels including morphology, syntax and semantics. This makes them particularly interesting for the MT task. Given the recent appearance and popularity of neural MT, this paper analyzes the performance of this new approach compared to the well-established rule-based and phrase-based MT systems. Experiments are reported on a large database of 180 million words. Results, in terms of standard automatic measures, show that neural MT clearly outperforms the rule-based and phrase-based MT system on in-domain test set, but it is worst in the out-of-domain test set. A naive system combination specially works for the latter. In-domain manual analysis shows that neural MT tends to improve both adequacy and fluency, for example, by being able to generate more natural translations instead of literal ones, choosing to the adequate target word when the source word has several translations and improving gender agreement. However, out-of-domain manual analysis shows how neural MT is more affected by unknown words or contexts.","pages":"55--62","doi":"10.18653\/v1\/W17-1207","url":"https:\/\/www.aclweb.org\/anthology\/W17-1207","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1208","title":"{K}urdish Interdialect Machine Translation","authors":["Hassani, Hossein"],"emails":["hosseinh@ukh.edu.krd"],"author_id":["hossein-hassani"],"abstract":"This research suggests a method for machine translation among two Kurdish dialects. We chose the two widely spoken dialects, Kurmanji and Sorani, which are considered to be mutually unintelligible. Also, despite being spoken by about 30 million people in different countries, Kurdish is among less-resourced languages. The research used bi-dialectal dictionaries and showed that the lack of parallel corpora is not a major obstacle in machine translation between the two dialects. The experiments showed that the machine translated texts are comprehensible to those who do not speak the dialect. The research is the first attempt for inter-dialect machine translation in Kurdish and particularly could help in making online texts in one dialect comprehensible to those who only speak the target dialect. The results showed that the translated texts are in 71{\\%} and 79{\\%} cases rated as understandable for Kurmanji and Sorani respectively. They are rated as slightly-understandable in 29{\\%} cases for Kurmanji and 21{\\%} for Sorani.","pages":"63--72","doi":"10.18653\/v1\/W17-1208","url":"https:\/\/www.aclweb.org\/anthology\/W17-1208","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1209","title":"Twitter Language Identification Of Similar Languages And Dialects Without Ground Truth","authors":["Williams, Jennifer","Dagli, Charlie"],"emails":["jennifer.williams@ll.mit.edu","dagli@ll.mit.edu"],"author_id":["jennifer-williams","charlie-dagli"],"abstract":"We present a new method to bootstrap filter Twitter language ID labels in our dataset for automatic language identification (LID). Our method combines geo-location, original Twitter LID labels, and Amazon Mechanical Turk to resolve missing and unreliable labels. We are the first to compare LID classification performance using the MIRA algorithm and langid.py. We show classifier performance on different versions of our dataset with high accuracy using only Twitter data, without ground truth, and very few training examples. We also show how Platt Scaling can be use to calibrate MIRA classifier output values into a probability distribution over candidate classes, making the output more intuitive. Our method allows for fine-grained distinctions between similar languages and dialects and allows us to rediscover the language composition of our Twitter dataset.","pages":"73--83","doi":"10.18653\/v1\/W17-1209","url":"https:\/\/www.aclweb.org\/anthology\/W17-1209","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1210","title":"Multi-source morphosyntactic tagging for spoken {R}usyn","authors":["Scherrer, Yves","Rabus, Achim"],"emails":["yves.scherrer@unige.ch","achim.rabus@slavistik.uni-freiburg.de"],"author_id":["yves-scherrer","achim-rabus"],"abstract":"This paper deals with the development of morphosyntactic taggers for spoken varieties of the Slavic minority language Rusyn. As neither annotated corpora nor parallel corpora are electronically available for Rusyn, we propose to combine existing resources from the etymologically close Slavic languages Russian, Ukrainian, Slovak, and Polish and adapt them to Rusyn. Using MarMoT as tagging toolkit, we show that a tagger trained on a balanced set of the four source languages outperforms single language taggers by about 9{\\%}, and that additional automatically induced morphosyntactic lexicons lead to further improvements. The best observed accuracies for Rusyn are 82.4{\\%} for part-of-speech tagging and 75.5{\\%} for full morphological tagging.","pages":"84--92","doi":"10.18653\/v1\/W17-1210","url":"https:\/\/www.aclweb.org\/anthology\/W17-1210","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1211","title":"Identifying dialects with textual and acoustic cues","authors":["Hanani, Abualsoud","Qaroush, Aziz","Taylor, Stephen"],"emails":["ahanani@birzeit.edu","qaroush@birzeit.edu","staylor@fitchburgstate.edu"],"author_id":["abualsoud-hanani","aziz-qaroush","stephen-taylor"],"abstract":"We describe several systems for identifying short samples of Arabic or Swiss-German dialects, which were prepared for the shared task of the 2017 DSL Workshop (Zampieri et al., 2017). The Arabic data comprises both text and acoustic files, and our best run combined both. The Swiss-German data is text-only. Coincidently, our best runs achieved a accuracy of nearly 63{\\%} on both the Swiss-German and Arabic dialects tasks.","pages":"93--101","doi":"10.18653\/v1\/W17-1211","url":"https:\/\/www.aclweb.org\/anthology\/W17-1211","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1212","title":"Evaluating {H}e{LI} with Non-Linear Mappings","authors":["Jauhiainen, Tommi","Lind{\\'e}n, Krister","Jauhiainen, Heidi"],"emails":["elsinki@helsinki.fi","elsinki@helsinki.fi","elsinki@helsinki.fi"],"author_id":["tommi-jauhiainen","krister-linden","heidi-jauhiainen"],"abstract":"In this paper we describe the non-linear mappings we used with the Helsinki language identification method, HeLI, in the 4th edition of the Discriminating between Similar Languages (DSL) shared task, which was organized as part of the VarDial 2017 workshop. Our SUKI team participated on the closed track together with 10 other teams. Our system reached the 7th position in the track. We describe the HeLI method and the non-linear mappings in mathematical notation. The HeLI method uses a probabilistic model with character n-grams and word-based backoff. We also describe our trials using the non-linear mappings instead of relative frequencies and we present statistics about the back-off function of the HeLI method.","pages":"102--108","doi":"10.18653\/v1\/W17-1212","url":"https:\/\/www.aclweb.org\/anthology\/W17-1212","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1213","title":"A Perplexity-Based Method for Similar Languages Discrimination","authors":["Gamallo, Pablo","Pichel, Jose Ramom","Alegria, I{\\~n}aki"],"emails":["pablo.gamallo@usc.es","jramompichel@imaxin.com","i.alegria@ehu.eus"],"author_id":["pablo-gamallo","jose-ramom-pichel-campos","inaki-alegria"],"abstract":"This article describes the system submitted by the Citius{\\_}Ixa{\\_}Imaxin team to the VarDial 2017 (DSL and GDI tasks). The strategy underlying our system is based on a language distance computed by means of model perplexity. The best model configuration we have tested is a voting system making use of several $n$-grams models of both words and characters, even if word unigrams turned out to be a very competitive model with reasonable results in the tasks we have participated. An error analysis has been performed in which we identified many test examples with no linguistic evidences to distinguish among the variants.","pages":"109--114","doi":"10.18653\/v1\/W17-1213","url":"https:\/\/www.aclweb.org\/anthology\/W17-1213","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1214","title":"Improving the Character Ngram Model for the {DSL} Task with {BM}25 Weighting and Less Frequently Used Feature Sets","authors":["Bestgen, Yves"],"emails":["yves.bestgen@uclouvain.be"],"author_id":["yves-bestgen"],"abstract":"This paper describes the system developed by the Centre for English Corpus Linguistics (CECL) to discriminating similar languages, language varieties and dialects. Based on a SVM with character and POStag n-grams as features and the BM25 weighting scheme, it achieved 92.7{\\%} accuracy in the Discriminating between Similar Languages (DSL) task, ranking first among eleven systems but with a lead over the next three teams of only 0.2{\\%}. A simpler version of the system ranked second in the German Dialect Identification (GDI) task thanks to several ad hoc postprocessing steps. Complementary analyses carried out by a cross-validation procedure suggest that the BM25 weighting scheme could be competitive in this type of tasks, at least in comparison with the sublinear TF-IDF. POStag n-grams also improved the system performance.","pages":"115--123","doi":"10.18653\/v1\/W17-1214","url":"https:\/\/www.aclweb.org\/anthology\/W17-1214","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1215","title":"Discriminating between Similar Languages with Word-level Convolutional Neural Networks","authors":["Criscuolo, Marcelo","Alu{\\'\\i}sio, Sandra Maria"],"emails":["mcrisc@icmc.usp.br","sandra@icmc.usp.br"],"author_id":["marcelo-criscuolo","sandra-aluisio"],"abstract":"Discriminating between Similar Languages (DSL) is a challenging task addressed at the VarDial Workshop series. We report on our participation in the DSL shared task with a two-stage system. In the first stage, character n-grams are used to separate language groups, then specialized classifiers distinguish similar language varieties. We have conducted experiments with three system configurations and submitted one run for each. Our main approach is a word-level convolutional neural network (CNN) that learns task-specific vectors with minimal text preprocessing. We also experiment with multi-layer perceptron (MLP) networks and another hybrid configuration. Our best run achieved an accuracy of 90.76{\\%}, ranking 8th among 11 participants and getting very close to the system that ranked first (less than 2 points). Even though the CNN model could not achieve the best results, it still makes a viable approach to discriminating between similar languages.","pages":"124--130","doi":"10.18653\/v1\/W17-1215","url":"https:\/\/www.aclweb.org\/anthology\/W17-1215","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1216","title":"Cross-lingual dependency parsing for closely related languages - {H}elsinki{'}s submission to {V}ar{D}ial 2017","authors":["Tiedemann, J{\\\"o}rg"],"emails":["first.lastname@helsinki.fi"],"author_id":["jorg-tiedemann"],"abstract":"This paper describes the submission from the University of Helsinki to the shared task on cross-lingual dependency parsing at VarDial 2017. We present work on annotation projection and treebank translation that gave good results for all three target languages in the test set. In particular, Slovak seems to work well with information coming from the Czech treebank, which is in line with related work. The attachment scores for cross-lingual models even surpass the fully supervised models trained on the target language treebank. Croatian is the most difficult language in the test set and the improvements over the baseline are rather modest. Norwegian works best with information coming from Swedish whereas Danish contributes surprisingly little.","pages":"131--136","doi":"10.18653\/v1\/W17-1216","url":"https:\/\/www.aclweb.org\/anthology\/W17-1216","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1217","title":"Discriminating between Similar Languages Using a Combination of Typed and Untyped Character N-grams and Words","authors":["Gomez, Helena","Markov, Ilia","Baptista, Jorge","Sidorov, Grigori","Pinto, David"],"emails":["helena.adorno@gmail.com","markovilya@yahoo.com","jbaptis@ualg.pt","sidorov@cic.ipn.mx","dpinto@cs.buap.mx"],"author_id":["helena-gomez","ilia-markov","jorge-baptista","grigori-sidorov","david-pinto"],"abstract":"This paper presents the cic{\\_}ualg{'}s system that took part in the Discriminating between Similar Languages (DSL) shared task, held at the VarDial 2017 Workshop. This year{'}s task aims at identifying 14 languages across 6 language groups using a corpus of excerpts of journalistic texts. Two classification approaches were compared: a single-step (all languages) approach and a two-step (language group and then languages within the group) approach. Features exploited include lexical features (unigrams of words) and character n-grams. Besides traditional (untyped) character n-grams, we introduce typed character n-grams in the DSL task. Experiments were carried out with different feature representation methods (binary and raw term frequency), frequency threshold values, and machine-learning algorithms {--} Support Vector Machines (SVM) and Multinomial Naive Bayes (MNB). Our best run in the DSL task achieved 91.46{\\%} accuracy.","pages":"137--145","doi":"10.18653\/v1\/W17-1217","url":"https:\/\/www.aclweb.org\/anthology\/W17-1217","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1218","title":"T{\\\"u}bingen system in {V}ar{D}ial 2017 shared task: experiments with language identification and cross-lingual parsing","authors":["{\\c{C}}{\\\"o}ltekin, {\\c{C}}a{\\u{g}}r{\\i}","Rama, Taraka"],"emails":["ccoltekin@sfs.uni-tuebingen.de","taraka-rama.kasicheyanula@uni-tuebingen.de"],"author_id":["cagri-coltekin","taraka-rama"],"abstract":"This paper describes our systems and results on VarDial 2017 shared tasks. Besides three language\/dialect discrimination tasks, we also participated in the cross-lingual dependency parsing (CLP) task using a simple methodology which we also briefly describe in this paper. For all the discrimination tasks, we used linear SVMs with character and word features. The system achieves competitive results among other systems in the shared task. We also report additional experiments with neural network models. The performance of neural network models was close but always below the corresponding SVM classifiers in the discrimination tasks. For the cross-lingual parsing task, we experimented with an approach based on automatically translating the source treebank to the target language, and training a parser on the translated treebank. We used off-the-shelf tools for both translation and parsing. Despite achieving better-than-baseline results, our scores in CLP tasks were substantially lower than the scores of the other participants.","pages":"146--155","doi":"10.18653\/v1\/W17-1218","url":"https:\/\/www.aclweb.org\/anthology\/W17-1218","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1219","title":"When Sparse Traditional Models Outperform Dense Neural Networks: the Curious Case of Discriminating between Similar Languages","authors":["Medvedeva, Maria","Kroon, Martin","Plank, Barbara"],"emails":["mariam@coli.uni-saarland.de","martinkroon06@gmail.com","b.plank@rug.nl"],"author_id":["maria-medvedeva","martin-kroon","barbara-plank"],"abstract":"We present the results of our participation in the VarDial 4 shared task on discriminating closely related languages. Our submission includes simple traditional models using linear support vector machines (SVMs) and a neural network (NN). The main idea was to leverage language group information. We did so with a two-layer approach in the traditional model and a multi-task objective in the neural network case. Our results confirm earlier findings: simple traditional models outperform neural networks consistently for this task, at least given the amount of systems we could examine in the available time. Our two-layer linear SVM ranked 2nd in the shared task.","pages":"156--163","doi":"10.18653\/v1\/W17-1219","url":"https:\/\/www.aclweb.org\/anthology\/W17-1219","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1220","title":"{G}erman Dialect Identification in Interview Transcriptions","authors":["Malmasi, Shervin","Zampieri, Marcos"],"emails":["shervin.malmasi@mq.edu.au","mzampie2@uni-koeln.de"],"author_id":["shervin-malmasi","marcos-zampieri"],"abstract":"This paper presents three systems submitted to the German Dialect Identification (GDI) task at the VarDial Evaluation Campaign 2017. The task consists of training models to identify the dialect of Swiss-German speech transcripts. The dialects included in the GDI dataset are Basel, Bern, Lucerne, and Zurich. The three systems we submitted are based on: a plurality ensemble, a mean probability ensemble, and a meta-classifier trained on character and word n-grams. The best results were obtained by the meta-classifier achieving 68.1{\\%} accuracy and 66.2{\\%} F1-score, ranking first among the 10 teams which participated in the GDI shared task.","pages":"164--169","doi":"10.18653\/v1\/W17-1220","url":"https:\/\/www.aclweb.org\/anthology\/W17-1220","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1221","title":"{CLUZH} at {V}ar{D}ial {GDI} 2017: Testing a Variety of Machine Learning Tools for the Classification of Swiss {G}erman Dialects","authors":["Clematide, Simon","Makarov, Peter"],"emails":["simon.clematide@cl.uzh.ch","makarov@cl.uzh.ch"],"author_id":["simon-clematide","peter-makarov"],"abstract":"Our submissions for the GDI 2017 Shared Task are the results from three different types of classifiers: Na{\\\"\\i}ve Bayes, Conditional Random Fields (CRF), and Support Vector Machine (SVM). Our CRF-based run achieves a weighted F1 score of 65{\\%} (third rank) being beaten by the best system by 0.9{\\%}. Measured by classification accuracy, our ensemble run (Na{\\\"\\i}ve Bayes, CRF, SVM) reaches 67{\\%} (second rank) being 1{\\%} lower than the best system. We also describe our experiments with Recurrent Neural Network (RNN) architectures. Since they performed worse than our non-neural approaches we did not include them in the submission.","pages":"170--177","doi":"10.18653\/v1\/W17-1221","url":"https:\/\/www.aclweb.org\/anthology\/W17-1221","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1222","title":"{A}rabic Dialect Identification Using i{V}ectors and {ASR} Transcripts","authors":["Malmasi, Shervin","Zampieri, Marcos"],"emails":["shervin.malmasi@mq.edu.au","mzampie2@uni-koeln.de"],"author_id":["shervin-malmasi","marcos-zampieri"],"abstract":"This paper presents the systems submitted by the MAZA team to the Arabic Dialect Identification (ADI) shared task at the VarDial Evaluation Campaign 2017. The goal of the task is to evaluate computational models to identify the dialect of Arabic utterances using both audio and text transcriptions. The ADI shared task dataset included Modern Standard Arabic (MSA) and four Arabic dialects: Egyptian, Gulf, Levantine, and North-African. The three systems submitted by MAZA are based on combinations of multiple machine learning classifiers arranged as (1) voting ensemble; (2) mean probability ensemble; (3) meta-classifier. The best results were obtained by the meta-classifier achieving 71.7{\\%} accuracy, ranking second among the six teams which participated in the ADI shared task.","pages":"178--183","doi":"10.18653\/v1\/W17-1222","url":"https:\/\/www.aclweb.org\/anthology\/W17-1222","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1223","title":"Discriminating between Similar Languages using Weighted Subword Features","authors":["Barbaresi, Adrien"],"emails":["adrien.barbaresi@oeaw.ac.at"],"author_id":["adrien-barbaresi"],"abstract":"The present contribution revolves around a contrastive subword n-gram model which has been tested in the Discriminating between Similar Languages shared task. I present and discuss the method used in this 14-way language identification task comprising varieties of 6 main language groups. It features the following characteristics: (1) the preprocessing and conversion of a collection of documents to sparse features; (2) weighted character n-gram profiles; (3) a multinomial Bayesian classifier. Meaningful bag-of-n-grams features can be used as a system in a straightforward way, my approach outperforms most of the systems used in the DSL shared task (3rd rank).","pages":"184--189","doi":"10.18653\/v1\/W17-1223","url":"https:\/\/www.aclweb.org\/anthology\/W17-1223","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1224","title":"Exploring Lexical and Syntactic Features for Language Variety Identification","authors":["van der Lee, Chris","van den Bosch, Antal"],"emails":["c.vdrlee@tilburguniversity.edu","antal.van.den.bosch@meertens.knaw.nl"],"author_id":["chris-van-der-lee","antal-van-den-bosch"],"abstract":"We present a method to discriminate between texts written in either the Netherlandic or the Flemish variant of the Dutch language. The method draws on a feature bundle representing text statistics, syntactic features, and word $n$-grams. Text statistics include average word length and sentence length, while syntactic features include ratios of function words and part-of-speech $n$-grams. The effectiveness of the classifier was measured by classifying Dutch subtitles developed for either Dutch or Flemish television. Several machine learning algorithms were compared as well as feature combination methods in order to find the optimal generalization performance. A machine-learning meta classifier based on AdaBoost attained the best F-score of 0.92.","pages":"190--199","doi":"10.18653\/v1\/W17-1224","url":"https:\/\/www.aclweb.org\/anthology\/W17-1224","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1225","title":"Learning to Identify {A}rabic and {G}erman Dialects using Multiple Kernels","authors":["Ionescu, Radu Tudor","Butnaru, Andrei"],"emails":["raducu.ionescu@gmail.com","butnaruandreimadalin@gmail.com"],"author_id":["radu-tudor-ionescu","andrei-butnaru"],"abstract":"We present a machine learning approach for the Arabic Dialect Identification (ADI) and the German Dialect Identification (GDI) Closed Shared Tasks of the DSL 2017 Challenge. The proposed approach combines several kernels using multiple kernel learning. While most of our kernels are based on character p-grams (also known as n-grams) extracted from speech transcripts, we also use a kernel based on i-vectors, a low-dimensional representation of audio recordings, provided only for the Arabic data. In the learning stage, we independently employ Kernel Discriminant Analysis (KDA) and Kernel Ridge Regression (KRR). Our approach is shallow and simple, but the empirical results obtained in the shared tasks prove that it achieves very good results. Indeed, we ranked on the first place in the ADI Shared Task with a weighted F1 score of 76.32{\\%} (4.62{\\%} above the second place) and on the fifth place in the GDI Shared Task with a weighted F1 score of 63.67{\\%} (2.57{\\%} below the first place).","pages":"200--209","doi":"10.18653\/v1\/W17-1225","url":"https:\/\/www.aclweb.org\/anthology\/W17-1225","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"},{"id":"W17-1226","title":"{S}lavic Forest, {N}orwegian Wood","authors":["Rosa, Rudolf","Zeman, Daniel","Mare{\\v{c}}ek, David","{\\v{Z}}abokrtsk{\\'y}, Zden{\\v{e}}k"],"emails":["rosa@ufal.mff.cuni.cz","zeman@ufal.mff.cuni.cz","marecek@ufal.mff.cuni.cz","zabokrtsky@ufal.mff.cuni.cz"],"author_id":["rudolf-rosa","daniel-zeman","david-marecek","zdenek-zabokrtsky"],"abstract":"We once had a corp, or should we say, it once had us They showed us its tags, isn{'}t it great, unified tags They asked us to parse and they told us to use everything So we looked around and we noticed there was near nothing We took other langs, bitext aligned: words one-to-one We played for two weeks, and then they said, here is the test The parser kept training till morning, just until deadline So we had to wait and hope what we get would be just fine And, when we awoke, the results were done, we saw we{'}d won So, we wrote this paper, isn{'}t it good, Norwegian wood.","pages":"210--219","doi":"10.18653\/v1\/W17-1226","url":"https:\/\/www.aclweb.org\/anthology\/W17-1226","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Fourth Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial)"}]