[{"id":"W17-1501","title":"Use Generalized Representations, But Do Not Forget Surface Features","authors":["Moosavi, Nafise Sadat","Strube, Michael"],"emails":["nafise.moosavi@h-its.org","michael.strube@h-its.org"],"author_id":["nafise-sadat-moosavi","michael-strube"],"abstract":"Only a year ago, all state-of-the-art coreference resolvers were using an extensive amount of surface features. Recently, there was a paradigm shift towards using word embeddings and deep neural networks, where the use of surface features is very limited. In this paper, we show that a simple SVM model with surface features outperforms more complex neural models for detecting anaphoric mentions. Our analysis suggests that using generalized representations and surface features have different strength that should be both taken into account for improving coreference resolution.","pages":"1--7","doi":"10.18653\/v1\/W17-1501","url":"https:\/\/www.aclweb.org\/anthology\/W17-1501","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the 2nd Workshop on Coreference Resolution Beyond {O}nto{N}otes ({CORBON} 2017)"},{"id":"W17-1502","title":"Enriching Basque Coreference Resolution System using Semantic Knowledge sources","authors":["Soraluze, Ander","Arregi, Olatz","Arregi, Xabier","D{\\'\\i}az de Ilarraza, Arantza"],"emails":["ander.soraluze@ehu.eus","olatz.arregi@ehu.eus","xabier.arregi@ehu.eus","a.diazdeilarraza@ehu.eus"],"author_id":["ander-soraluze","olatz-arregi","xabier-arregi","arantza-diaz-de-ilarraza"],"abstract":"In this paper we present a Basque coreference resolution system enriched with semantic knowledge. An error analysis carried out revealed the deficiencies that the system had in resolving coreference cases in which semantic or world knowledge is needed. We attempt to improve the deficiencies using two semantic knowledge sources, specifically Wikipedia and WordNet.","pages":"8--16","doi":"10.18653\/v1\/W17-1502","url":"https:\/\/www.aclweb.org\/anthology\/W17-1502","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the 2nd Workshop on Coreference Resolution Beyond {O}nto{N}otes ({CORBON} 2017)"},{"id":"W17-1503","title":"Improving Polish Mention Detection with Valency Dictionary","authors":["Ogrodniczuk, Maciej","Nito{\\'n}, Bart{\\l}omiej"],"emails":["maciej.ogrodniczuk@ipipan.waw.pl","bartek.niton@gmail.com"],"author_id":["maciej-ogrodniczuk","bartlomiej-niton"],"abstract":"This paper presents results of an experiment integrating information from valency dictionary of Polish into a mention detection system. Two types of information is acquired: positions of syntactic schemata for nominal and verbal constructs and secondary prepositions present in schemata. The syntactic schemata are used to prevent (for verbal realizations) or encourage (for nominal groups) constructing mentions from phrases filling multiple schema positions, the secondary prepositions {--} to filter out artificial mentions created from their nominal components. Mention detection is evaluated against the manual annotation of the Polish Coreference Corpus in two settings: taking into account only mention heads or exact borders.","pages":"17--23","doi":"10.18653\/v1\/W17-1503","url":"https:\/\/www.aclweb.org\/anthology\/W17-1503","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the 2nd Workshop on Coreference Resolution Beyond {O}nto{N}otes ({CORBON} 2017)"},{"id":"W17-1504","title":"A {G}oogle-Proof Collection of {F}rench {W}inograd Schemas","authors":["Amsili, Pascal","Seminck, Olga"],"emails":["amsili@linguist.univ-paris-diderot.fr","olga.seminck@cri-paris.org"],"author_id":["pascal-amsili","olga-seminck"],"abstract":"This article presents the first collection of French Winograd Schemas. Winograd Schemas form anaphora resolution problems that can only be resolved with extensive world knowledge. For this reason the Winograd Schema Challenge has been proposed as an alternative to the Turing Test. A very important feature of Winograd Schemas is that it should be impossible to resolve them with statistical information about word co-occurrences: they should be Google-proof. We propose a measure of Google-proofness based on Mutual Information, and demonstrate the method on our collection of French Winograd Schemas.","pages":"24--29","doi":"10.18653\/v1\/W17-1504","url":"https:\/\/www.aclweb.org\/anthology\/W17-1504","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the 2nd Workshop on Coreference Resolution Beyond {O}nto{N}otes ({CORBON} 2017)"},{"id":"W17-1505","title":"Using Coreference Links to Improve {S}panish-to-{E}nglish Machine Translation","authors":["Miculicich Werlen, Lesly","Popescu-Belis, Andrei"],"emails":["lmiculicich@idiap.ch","apbelis@idiap.ch"],"author_id":["lesly-miculicich-werlen","andrei-popescu-belis"],"abstract":"In this paper, we present a proof-of-concept implementation of a coreference-aware decoder for document-level machine translation. We consider that better translations should have coreference links that are closer to those in the source text, and implement this criterion in two ways. First, we define a similarity measure between source and target coreference structures, by projecting the target ones onto the source and reusing existing coreference metrics. Based on this similarity measure, we re-rank the translation hypotheses of a baseline system for each sentence. Alternatively, to address the lack of diversity of mentions in the MT hypotheses, we focus on mention pairs and integrate their coreference scores with MT ones, resulting in post-editing decisions for mentions. The experimental results for Spanish to English MT on the AnCora-ES corpus show that the second approach yields a substantial increase in the accuracy of pronoun translation, with BLEU scores remaining constant.","pages":"30--40","doi":"10.18653\/v1\/W17-1505","url":"https:\/\/www.aclweb.org\/anthology\/W17-1505","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the 2nd Workshop on Coreference Resolution Beyond {O}nto{N}otes ({CORBON} 2017)"},{"id":"W17-1506","title":"Multi-source annotation projection of coreference chains: assessing strategies and testing opportunities","authors":["Grishina, Yulia","Stede, Manfred"],"emails":["grishina@uni-potsdam.de","stede@uni-potsdam.de"],"author_id":["yulia-grishina","manfred-stede"],"abstract":"In this paper, we examine the possibility of using annotation projection from multiple sources for automatically obtaining coreference annotations in the target language. We implement a multi-source annotation projection algorithm and apply it on an English-German-Russian parallel corpus in order to transfer coreference chains from two sources to the target side. Operating in two settings {--} a low-resource and a more linguistically-informed one {--} we show that automatic coreference transfer could benefit from combining information from multiple languages, and assess the quality of both the extraction and the linking of target coreference mentions.","pages":"41--50","doi":"10.18653\/v1\/W17-1506","url":"https:\/\/www.aclweb.org\/anthology\/W17-1506","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the 2nd Workshop on Coreference Resolution Beyond {O}nto{N}otes ({CORBON} 2017)"},{"id":"W17-1507","title":"{CORBON} 2017 Shared Task: Projection-Based Coreference Resolution","authors":["Grishina, Yulia"],"emails":["grishina@uni-potsdam.de"],"author_id":["yulia-grishina"],"abstract":"The CORBON 2017 Shared Task, organised as part of the Coreference Resolution Beyond OntoNotes workshop at EACL 2017, presented a new challenge for multilingual coreference resolution: we offer a projection-based setting in which one is supposed to build a coreference resolver for a new language exploiting little or even no knowledge of it, with our languages of interest being German and Russian. We additionally offer a more traditional setting, targeting the development of a multilingual coreference resolver without any restrictions on the resources and methods used. In this paper, we describe the task setting and provide the results of one participant who successfully completed the task, comparing their results to the closely related previous research. Analysing the task setting and the results, we discuss the major challenges and make suggestions on the future directions of coreference evaluation.","pages":"51--55","doi":"10.18653\/v1\/W17-1507","url":"https:\/\/www.aclweb.org\/anthology\/W17-1507","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the 2nd Workshop on Coreference Resolution Beyond {O}nto{N}otes ({CORBON} 2017)"},{"id":"W17-1508","title":"Projection-based Coreference Resolution Using Deep Syntax","authors":["Nov{\\'a}k, Michal","Nedoluzhko, Anna","{\\v{Z}}abokrtsk{\\'y}, Zden{\\v{e}}k"],"emails":["mnovak@ufal.mff.cuni.cz","nedoluzko@ufal.mff.cuni.cz","zabokrtsky@ufal.mff.cuni.cz"],"author_id":["michal-novak","anna-nedoluzhko","zdenek-zabokrtsky"],"abstract":"The paper describes the system for coreference resolution in German and Russian, trained exclusively on coreference relations project ed through a parallel corpus from English. The resolver operates on the level of deep syntax and makes use of multiple specialized models. It achieves 32 and 22 points in terms of CoNLL score for Russian and German, respectively. Analysis of the evaluation results show that the resolver for Russian is able to preserve 66{\\%} of the English resolver{'}s quality in terms of CoNLL score. The system was submitted to the Closed track of the CORBON 2017 Shared task.","pages":"56--64","doi":"10.18653\/v1\/W17-1508","url":"https:\/\/www.aclweb.org\/anthology\/W17-1508","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the 2nd Workshop on Coreference Resolution Beyond {O}nto{N}otes ({CORBON} 2017)"}]