[{"id":"W18-0601","title":"What type of happiness are you looking for? - A closer look at detecting mental health from language","authors":["Arseniev-Koehler, Alina","Mozgai, Sharon","Scherer, Stefan"],"emails":["arsena@g.ucla.edu","",""],"author_id":["alina-arseniev-koehler","sharon-mozgai","stefan-scherer"],"abstract":"Computational models to detect mental illnesses from text and speech could enhance our understanding of mental health while offering opportunities for early detection and intervention. However, these models are often disconnected from the lived experience of depression and the larger diagnostic debates in mental health. This article investigates these disconnects, primarily focusing on the labels used to diagnose depression, how these labels are computationally represented, and the performance metrics used to evaluate computational models. We also consider how medical instruments used to measure depression, such as the Patient Health Questionnaire (PHQ), contribute to these disconnects. To illustrate our points, we incorporate mixed-methods analyses of 698 interviews on emotional health, which are coupled with self-report PHQ screens for depression. We propose possible strategies to bridge these gaps between modern psychiatric understandings of depression, lay experience of depression, and computational representation.","pages":"1--12","doi":"10.18653\/v1\/W18-0601","url":"https:\/\/www.aclweb.org\/anthology\/W18-0601","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0602","title":"A Linguistically-Informed Fusion Approach for Multimodal Depression Detection","authors":["Morales, Michelle","Scherer, Stefan","Levitan, Rivka"],"emails":["mmorales@gradcenter.cuny.edu","scherer@ict.usc.edu","levitan@sci.brooklyn.cuny.edu"],"author_id":["michelle-morales","stefan-scherer","rivka-levitan"],"abstract":"Automated depression detection is inherently a multimodal problem. Therefore, it is critical that researchers investigate fusion techniques for multimodal design. This paper presents the first-ever comprehensive study of fusion techniques for depression detection. In addition, we present novel linguistically-motivated fusion techniques, which we find outperform existing approaches.","pages":"13--24","doi":"10.18653\/v1\/W18-0602","url":"https:\/\/www.aclweb.org\/anthology\/W18-0602","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0603","title":"Expert, Crowdsourced, and Machine Assessment of Suicide Risk via Online Postings","authors":["Shing, Han-Chin","Nair, Suraj","Zirikly, Ayah","Friedenberg, Meir","Daum{\\'e} III, Hal","Resnik, Philip"],"emails":["shing@umd.edu","srnair@umd.edu","ayah.zirikly@nih.gov","mdf224@cornell.edu","hal@umd.edu","resnik@umd.edu"],"author_id":["han-chin-shing","suraj-nair","ayah-zirikly","meir-friedenberg","hal-daume-iii","philip-resnik"],"abstract":"We report on the creation of a dataset for studying assessment of suicide risk via online postings in Reddit. Evaluation of risk-level annotations by experts yields what is, to our knowledge, the first demonstration of reliability in risk assessment by clinicians based on social media postings. We also introduce and demonstrate the value of a new, detailed rubric for assessing suicide risk, compare crowdsourced with expert performance, and present baseline predictive modeling experiments using the new dataset, which will be made available to researchers through the American Association of Suicidology.","pages":"25--36","doi":"10.18653\/v1\/W18-0603","url":"https:\/\/www.aclweb.org\/anthology\/W18-0603","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0604","title":"{CLP}sych 2018 Shared Task: Predicting Current and Future Psychological Health from Childhood Essays","authors":["Lynn, Veronica","Goodman, Alissa","Niederhoffer, Kate","Loveys, Kate","Resnik, Philip","Schwartz, H. Andrew"],"emails":["velynn@cs.stonybrook.edu","alissa.goodman@ucl.ac.uk","kate@circadialabs.com","kate@qntfy.com","resnik@umd.edu","has@cs.stonybrook.edu"],"author_id":["veronica-lynn","alissa-goodman","kate-niederhoffer","kate-loveys","philip-resnik","h-andrew-schwartz"],"abstract":"We describe the shared task for the CLPsych 2018 workshop, which focused on predicting current and future psychological health from an essay authored in childhood. Language-based predictions of a person{'}s current health have the potential to supplement traditional psychological assessment such as questionnaires, improving intake risk measurement and monitoring. Predictions of future psychological health can aid with both early detection and the development of preventative care. Research into the mental health trajectory of people, beginning from their childhood, has thus far been an area of little work within the NLP community. This shared task represents one of the first attempts to evaluate the use of early language to predict future health; this has the potential to support a wide variety of clinical health care tasks, from early assessment of lifetime risk for mental health problems, to optimal timing for targeted interventions aimed at both prevention and treatment.","pages":"37--46","doi":"10.18653\/v1\/W18-0604","url":"https:\/\/www.aclweb.org\/anthology\/W18-0604","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0605","title":"An Approach to the {CLP}sych 2018 Shared Task Using Top-Down Text Representation and Simple Bottom-Up Model Selection","authors":["Iserman, Micah","Ireland, Molly","Littlefield, Andrew","Davis, Tyler","Maliepaard, Sage"],"emails":["micah.iserman@ttu.edu","molly.ireland@ttu.edu","","",""],"author_id":["micah-iserman","molly-ireland","andrew-littlefield","tyler-davis","sage-maliepaard"],"abstract":"The Computational Linguistics and Clinical Psychology (CLPsych) 2018 Shared Task asked teams to predict cross-sectional indices of anxiety and distress, and longitudinal indices of psychological distress from a subsample of the National Child Development Study, started in the United Kingdom in 1958. Teams aimed to predict mental health outcomes from essays written by 11-year-olds about what they believed their lives would be like at age 25. In the hopes of producing results that could be easily disseminated and applied, we used largely theory-based dictionaries to process the texts, and a simple data-driven approach to model selection. This approach yielded only modest results in terms of out-of-sample accuracy, but most of the category-level findings are interpretable and consistent with existing literature on psychological distress, anxiety, and depression.","pages":"47--56","doi":"10.18653\/v1\/W18-0605","url":"https:\/\/www.aclweb.org\/anthology\/W18-0605","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0606","title":"Using contextual information for automatic triage of posts in a peer-support forum","authors":["Altszyler, Edgar","Berenstein, Ariel J.","Milne, David","Calvo, Rafael A.","Fernandez Slezak, Diego"],"emails":["ealtszyler@dc.uba.ar","arieljberenstein@gmail.com","david.milne@sydney.edu.au","alvo@sydney.edu.au","dfslezak@dc.uba.ar"],"author_id":["edgar-altszyler","ariel-j-berenstein","david-n-milne","rafael-a-calvo","diego-fernandez-slezak"],"abstract":"Mental health forums are online spaces where people can share their experiences anonymously and get peer support. These forums, require the supervision of moderators to provide support in delicate cases, such as posts expressing suicide ideation. The large increase in the number of forum users makes the task of the moderators unmanageable without the help of automatic triage systems. In the present paper, we present a Machine Learning approach for the triage of posts. Most approaches in the literature focus on the content of the posts, but only a few authors take advantage of features extracted from the context in which they appear. Our approach consists of the development and implementation of a large variety of new features from both, the content and the context of posts, such as previous messages, interaction with other users and author{'}s history. Our method has competed in the CLPsych 2017 Shared Task, obtaining the first place for several of the subtasks. Moreover, we also found that models that take advantage of post context improve significantly its performance in the detection of flagged posts (posts that require moderators attention), as well as those that focus on post content outperforms in the detection of most urgent events.","pages":"57--68","doi":"10.18653\/v1\/W18-0606","url":"https:\/\/www.aclweb.org\/anthology\/W18-0606","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0607","title":"Hierarchical neural model with attention mechanisms for the classification of social media text related to mental health","authors":["Ive, Julia","Gkotsis, George","Dutta, Rina","Stewart, Robert","Velupillai, Sumithra"],"emails":["julia.ive@kcl.ac.uk","george.gkotsis@kcl.ac.uk","rina.dutta@kcl.ac.uk","robert.stewart@kcl.ac.uk","sumithra.velupillai@kcl.ac.uk"],"author_id":["julia-ive","george-gkotsis","rina-dutta","robert-stewart","sumithra-velupillai"],"abstract":"Mental health problems represent a major public health challenge. Automated analysis of text related to mental health is aimed to help medical decision-making, public health policies and to improve health care. Such analysis may involve text classification. Traditionally, automated classification has been performed mainly using machine learning methods involving costly feature engineering. Recently, the performance of those methods has been dramatically improved by neural methods. However, mainly Convolutional neural networks (CNNs) have been explored. In this paper, we apply a hierarchical Recurrent neural network (RNN) architecture with an attention mechanism on social media data related to mental health. We show that this architecture improves overall classification results as compared to previously reported results on the same data. Benefitting from the attention mechanism, it can also efficiently select text elements crucial for classification decisions, which can also be used for in-depth analysis.","pages":"69--77","doi":"10.18653\/v1\/W18-0607","url":"https:\/\/www.aclweb.org\/anthology\/W18-0607","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0608","title":"Cross-cultural differences in language markers of depression online","authors":["Loveys, Kate","Torrez, Jonathan","Fine, Alex","Moriarty, Glen","Coppersmith, Glen"],"emails":["kate@qntfy.com","jonathan.torrez@qntfy.com","alex.fine@qntfy.com","glen.moriarty@7cups.com","glen@qntfy.com"],"author_id":["kate-loveys","jonathan-torrez","alex-fine","glen-moriarty","glen-coppersmith"],"abstract":"Depression is a global mental health condition that affects all cultures. Despite this, the way depression is expressed varies by culture. Uptake of machine learning technology for diagnosing mental health conditions means that increasingly more depression classifiers are created from online language data. Yet, culture is rarely considered as a factor affecting online language in this literature. This study explores cultural differences in online language data of users with depression. Written language data from 1,593 users with self-reported depression from the online peer support community 7 Cups of Tea was analyzed using the Linguistic Inquiry and Word Count (LIWC), topic modeling, data visualization, and other techniques. We compared the language of users identifying as White, Black or African American, Hispanic or Latino, and Asian or Pacific Islander. Exploratory analyses revealed cross-cultural differences in depression expression in online language data, particularly in relation to emotion expression, cognition, and functioning. The results have important implications for avoiding depression misclassification from machine-driven assessments when used in a clinical setting, and for avoiding inadvertent cultural biases in this line of research more broadly.","pages":"78--87","doi":"10.18653\/v1\/W18-0608","url":"https:\/\/www.aclweb.org\/anthology\/W18-0608","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0609","title":"Deep Learning for Depression Detection of Twitter Users","authors":["Husseini Orabi, Ahmed","Buddhitha, Prasadith","Husseini Orabi, Mahmoud","Inkpen, Diana"],"emails":["ahuss045@uottawa.ca","pkiri056@uottawa.ca","mhuss092@uottawa.ca","diana.inkpen@uottawa.ca"],"author_id":["ahmed-husseini-orabi","prasadith-buddhitha","mahmoud-husseini-orabi","diana-inkpen"],"abstract":"Mental illness detection in social media can be considered a complex task, mainly due to the complicated nature of mental disorders. In recent years, this research area has started to evolve with the continuous increase in popularity of social media platforms that became an integral part of people{'}s life. This close relationship between social media platforms and their users has made these platforms to reflect the users{'} personal life with different limitations. In such an environment, researchers are presented with a wealth of information regarding one{'}s life. In addition to the level of complexity in identifying mental illnesses through social media platforms, adopting supervised machine learning approaches such as deep neural networks have not been widely accepted due to the difficulties in obtaining sufficient amounts of annotated training data. Due to these reasons, we try to identify the most effective deep neural network architecture among a few of selected architectures that were successfully used in natural language processing tasks. The chosen architectures are used to detect users with signs of mental illnesses (depression in our case) given limited unstructured text data extracted from the Twitter social media platform.","pages":"88--97","doi":"10.18653\/v1\/W18-0609","url":"https:\/\/www.aclweb.org\/anthology\/W18-0609","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0610","title":"Current and Future Psychological Health Prediction using Language and Socio-Demographics of Children for the {CLP}ysch 2018 Shared Task","authors":["Guntuku, Sharath Chandra","Giorgi, Salvatore","Ungar, Lyle"],"emails":["","",""],"author_id":["sharath-chandra-guntuku","salvatore-giorgi","lyle-ungar"],"abstract":"This article is a system description and report on the submission of a team from the University of Pennsylvania in the {'}CLPsych 2018{'} shared task. The goal of the shared task was to use childhood language as a marker for both current and future psychological health over individual lifetimes. Our system employs multiple textual features derived from the essays written and individuals{'} socio-demographic variables at the age of 11. We considered several word clustering approaches, and explore the use of linear regression based on different feature sets. Our approach showed best results for predicting distress at the age of 42 and for predicting current anxiety on Disattenuated Pearson Correlation, and ranked fourth in the future health prediction task. In addition to the subtasks presented, we attempted to provide insight into mental health aspects at different ages. Our findings indicate that misspellings, words with illegible letters and increased use of personal pronouns are correlated with poor mental health at age 11, while descriptions about future physical activity, family and friends are correlated with good mental health.","pages":"98--106","doi":"10.18653\/v1\/W18-0610","url":"https:\/\/www.aclweb.org\/anthology\/W18-0610","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0611","title":"Predicting Psychological Health from Childhood Essays with Convolutional Neural Networks for the {CLP}sych 2018 Shared Task (Team {UKNLP})","authors":["Rios, Anthony","Tran, Tung","Kavuluru, Ramakanth"],"emails":["","","ramakanth.kavuluru@uky.edu"],"author_id":["anthony-rios","tung-tran","ramakanth-kavuluru"],"abstract":"This paper describes the systems we developed for tasks A and B of the 2018 CLPsych shared task. The first task (task A) focuses on predicting behavioral health scores at age 11 using childhood essays. The second task (task B) asks participants to predict future psychological distress at ages 23, 33, 42, and 50 using the age 11 essays. We propose two convolutional neural network based methods that map each task to a regression problem. Among seven teams we ranked third on task A with disattenuated Pearson correlation (DPC) score of 0.5587. Likewise, we ranked third on task B with an average DPC score of 0.3062.","pages":"107--112","doi":"10.18653\/v1\/W18-0611","url":"https:\/\/www.aclweb.org\/anthology\/W18-0611","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0612","title":"A Psychologically Informed Approach to {CLP}sych Shared Task 2018","authors":["Simchon, Almog","Gilead, Michael"],"emails":["almogsi@post.bgu.ac.il","mgilead@bgu.ac.il"],"author_id":["almog-simchon","michael-gilead"],"abstract":"This paper describes our approach to the CLPsych 2018 Shared Task, in which we attempted to predict cross-sectional psychological health at age 11 and future psychological distress based on childhood essays. We attempted several modeling approaches and observed best cross-validated prediction accuracy with relatively simple models based on psychological theory. The models provided reasonable predictions in most outcomes. Notably, our model was especially successful in predicting out-of-sample psychological distress (across people and across time) at age 50.","pages":"113--118","doi":"10.18653\/v1\/W18-0612","url":"https:\/\/www.aclweb.org\/anthology\/W18-0612","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0613","title":"Predicting Psychological Health from Childhood Essays. The {UG}ent-{IDL}ab {CLP}sych 2018 Shared Task System.","authors":["Zaporojets, Klim","Sterckx, Lucas","Deleu, Johannes","Demeester, Thomas","Develder, Chris"],"emails":["klim.zaporojets@ugent.be","lucas.sterckx@ugent.be","johannes.deleu@ugent.be","thomas.demeester@ugent.be","chris.develder@ugent.be"],"author_id":["klim-zaporojets","lucas-sterckx","johannes-deleu","thomas-demeester","chris-develder"],"abstract":"This paper describes the IDLab system submitted to Task A of the CLPsych 2018 shared task. The goal of this task is predicting psychological health of children based on language used in hand-written essays and socio-demographic control variables. Our entry uses word- and character-based features as well as lexicon-based features and features derived from the essays such as the quality of the language. We apply linear models, gradient boosting as well as neural-network based regressors (feed-forward, CNNs and RNNs) to predict scores. We then make ensembles of our best performing models using a weighted average.","pages":"119--125","doi":"10.18653\/v1\/W18-0613","url":"https:\/\/www.aclweb.org\/anthology\/W18-0613","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0614","title":"Can adult mental health be predicted by childhood future-self narratives? Insights from the {CLP}sych 2018 Shared Task","authors":["Radford, Kylie","Lavrencic, Louise","Peters, Ruth","Kiely, Kim","Hachey, Ben","Nowson, Scott","Radford, Will"],"emails":["wejradford@gmail.com","","","","ben.hachey@gmail.com","nowson@gmail.com","initial.lastname@neura.edu.au"],"author_id":["kylie-radford","louise-lavrencic","ruth-peters","kim-kiely","ben-hachey","scott-nowson","will-radford"],"abstract":"The CLPsych 2018 Shared Task B explores how childhood essays can predict psychological distress throughout the author{'}s life. Our main aim was to build tools to help our psychologists understand the data, propose features and interpret predictions. We submitted two linear regression models: ModelA uses simple demographic and word-count features, while ModelB uses linguistic, entity, typographic, expert-gazetteer, and readability features. Our models perform best at younger prediction ages, with our best unofficial score at 23 of 0.426 disattenuated Pearson correlation. This task is challenging and although predictive performance is limited, we propose that tight integration of expertise across computational linguistics and clinical psychology is a productive direction.","pages":"126--135","doi":"10.18653\/v1\/W18-0614","url":"https:\/\/www.aclweb.org\/anthology\/W18-0614","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0615","title":"Automatic Detection of Incoherent Speech for Diagnosing Schizophrenia","authors":["Iter, Dan","Yoon, Jong","Jurafsky, Dan"],"emails":["daniter@stanford.edu","jhyoon1@stanford.edu","jurafsky@stanford.edu"],"author_id":["dan-iter","jong-yoon","dan-jurafsky"],"abstract":"Schizophrenia is a mental disorder which afflicts an estimated 0.7{\\%} of adults world wide. It affects many areas of mental function, often evident from incoherent speech. Diagnosing schizophrenia relies on subjective judgments resulting in disagreements even among trained clinicians. Recent studies have proposed the use of natural language processing for diagnosis by drawing on automatically-extracted linguistic features like discourse coherence and lexicon. Here, we present the first benchmark comparison of previously proposed coherence models for detecting symptoms of schizophrenia and evaluate their performance on a new dataset of recorded interviews between subjects and clinicians. We also present two alternative coherence metrics based on modern sentence embedding techniques that outperform the previous methods on our dataset. Lastly, we propose a novel computational model for reference incoherence based on ambiguous pronoun usage and show that it is a highly predictive feature on our data. While the number of subjects is limited in this pilot study, our results suggest new directions for diagnosing common symptoms of schizophrenia.","pages":"136--146","doi":"10.18653\/v1\/W18-0615","url":"https:\/\/www.aclweb.org\/anthology\/W18-0615","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0616","title":"Oral-Motor and Lexical Diversity During Naturalistic Conversations in Adults with Autism Spectrum Disorder","authors":["Parish-Morris, Julia","Sariyanidi, Evangelos","Zampella, Casey","Bartley, G. Keith","Ferguson, Emily","Pallathra, Ashley A.","Bateman, Leila","Plate, Samantha","Cola, Meredith","Pandey, Juhi","Brodkin, Edward S.","Schultz, Robert T.","Tun{\\c{c}}, Birkan"],"emails":["","","","","","","","","","","","",""],"author_id":["julia-parish-morris","evangelos-sariyanidi","casey-zampella","g-keith-bartley","emily-ferguson","ashley-a-pallathra","leila-bateman","samantha-plate","meredith-cola","juhi-pandey","edward-s-brodkin","robert-t-schultz","birkan-tunc"],"abstract":"Autism spectrum disorder (ASD) is a neurodevelopmental condition characterized by impaired social communication and the presence of restricted, repetitive patterns of behaviors and interests. Prior research suggests that restricted patterns of behavior in ASD may be cross-domain phenomena that are evident in a variety of modalities. Computational studies of language in ASD provide support for the existence of an underlying dimension of restriction that emerges during a conversation. Similar evidence exists for restricted patterns of facial movement. Using tools from computational linguistics, computer vision, and information theory, this study tests whether cognitive-motor restriction can be detected across multiple behavioral domains in adults with ASD during a naturalistic conversation. Our methods identify restricted behavioral patterns, as measured by entropy in word use and mouth movement. Results suggest that adults with ASD produce significantly less diverse mouth movements and words than neurotypical adults, with an increased reliance on repeated patterns in both domains. The diversity values of the two domains are not significantly correlated, suggesting that they provide complementary information.","pages":"147--157","doi":"10.18653\/v1\/W18-0616","url":"https:\/\/www.aclweb.org\/anthology\/W18-0616","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0617","title":"Dynamics of an idiostyle of a {R}ussian suicidal blogger","authors":["Litvinova, Tatiana","Litvinova, Olga","Seredin, Pavel"],"emails":["centr_rus_yaz@mail.ru","","paul@phys.vsu.ru"],"author_id":["tatiana-litvinova","olga-litvinova","pavel-seredin"],"abstract":"Over 800000 people die of suicide each year. It is es-timated that by the year 2020, this figure will have in-creased to 1.5 million. It is considered to be one of the major causes of mortality during adolescence. Thus there is a growing need for methods of identifying su-icidal individuals. Language analysis is known to be a valuable psychodiagnostic tool, however the material for such an analysis is not easy to obtain. Currently as the Internet communications are developing, there is an opportunity to study texts of suicidal individuals. Such an analysis can provide a useful insight into the peculiarities of suicidal thinking, which can be used to further develop methods for diagnosing the risk of suicidal behavior. The paper analyzes the dynamics of a number of linguistic parameters of an idiostyle of a Russian-language blogger who died by suicide. For the first time such an analysis has been conducted using the material of Russian online texts. For text processing, the LIWC program is used. A correlation analysis was performed to identify the relationship between LIWC variables and number of days prior to suicide. Data visualization, as well as comparison with the results of related studies was performed.","pages":"158--167","doi":"10.18653\/v1\/W18-0617","url":"https:\/\/www.aclweb.org\/anthology\/W18-0617","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0618","title":"{RSDD}-Time: Temporal Annotation of Self-Reported Mental Health Diagnoses","authors":["MacAvaney, Sean","Desmet, Bart","Cohan, Arman","Soldaini, Luca","Yates, Andrew","Zirikly, Ayah","Goharian, Nazli"],"emails":["firstname@ir.cs.georgetown.edu","bart.desmet@ugent.be","","","ayates@mpi-inf.mpg.de","ayah.zirikly@nih.gov",""],"author_id":["sean-macavaney","bart-desmet","arman-cohan","luca-soldaini","andrew-yates","ayah-zirikly","nazli-goharian"],"abstract":"Self-reported diagnosis statements have been widely employed in studying language related to mental health in social media. However, existing research has largely ignored the temporality of mental health diagnoses. In this work, we introduce RSDD-Time: a new dataset of 598 manually annotated self-reported depression diagnosis posts from Reddit that include temporal information about the diagnosis. Annotations include whether a mental health condition is present and how recently the diagnosis happened. Furthermore, we include exact temporal spans that relate to the date of diagnosis. This information is valuable for various computational methods to examine mental health through social media because one{'}s mental health state is not static. We also test several baseline classification and extraction approaches, which suggest that extracting temporal information from self-reported diagnosis statements is challenging.","pages":"168--173","doi":"10.18653\/v1\/W18-0618","url":"https:\/\/www.aclweb.org\/anthology\/W18-0618","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0619","title":"Predicting Human Trustfulness from {F}acebook Language","authors":["Zamani, Mohammadzaman","Buffone, Anneke","Schwartz, H. Andrew"],"emails":["mzamani@cs.stonybrook.edu","buffonea@sas.upenn.edu","has@cs.stonybrook.edu"],"author_id":["mohammadzaman-zamani","anneke-buffone","h-andrew-schwartz"],"abstract":"Trustfulness {---} one{'}s general tendency to have confidence in unknown people or situations {---} predicts many important real-world outcomes such as mental health and likelihood to cooperate with others such as clinicians. While data-driven measures of interpersonal trust have previously been introduced, here, we develop the first language-based assessment of the personality trait of trustfulness by fitting one{'}s language to an accepted questionnaire-based trust score. Further, using trustfulness as a type of case study, we explore the role of questionnaire size as well as word count in developing language-based predictive models of users{'} psychological traits. We find that leveraging a longer questionnaire can yield greater test set accuracy, while, for training, we find it beneficial to include users who took smaller questionnaires which offers more observations for training. Similarly, after noting a decrease in individual prediction error as word count increased, we found a word count-weighted training scheme was helpful when there were very few users in the first place.","pages":"174--181","doi":"10.18653\/v1\/W18-0619","url":"https:\/\/www.aclweb.org\/anthology\/W18-0619","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0620","title":"Within and Between-Person Differences in Language Used Across Anxiety Support and Neutral {R}eddit Communities","authors":["Ireland, Molly","Iserman, Micah"],"emails":["molly.ireland@ttu.edu","micah.iserman@ttu.edu"],"author_id":["molly-ireland","micah-iserman"],"abstract":"Although many studies have distinguished between the social media language use of people who do and do not have a mental health condition, within-person context-sensitive comparisons (for example, analyzing individuals{'} language use when seeking support or discussing neutral topics) are less common. Two dictionary-based analyses of Reddit communities compared (1) anxious individuals{'} comments in anxiety support communities (e.g., \/r\/PanicParty) with the same users{'} comments in neutral communities (e.g., \/r\/todayilearned), and, (2) within popular neutral communities, comments by members of anxiety subreddits with comments by other users. Each comparison yielded theory-consistent effects as well as unexpected results that suggest novel hypotheses to be tested in the future. Results have relevance for improving researchers{'} and practitioners{'} ability to unobtrusively assess anxiety symptoms in conversations that are not explicitly about mental health.","pages":"182--193","doi":"10.18653\/v1\/W18-0620","url":"https:\/\/www.aclweb.org\/anthology\/W18-0620","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"},{"id":"W18-0621","title":"Helping or Hurting? Predicting Changes in Users{'} Risk of Self-Harm Through Online Community Interactions","authors":["Soldaini, Luca","Walsh, Timothy","Cohan, Arman","Han, Julien","Goharian, Nazli"],"emails":["luca@ir.cs.georgetown.edu","tw614@georgetown.edu","arman@ir.cs.georgetown.edu","mh1795@georgetown.edu","nazli@ir.cs.georgetown.edu"],"author_id":["luca-soldaini","timothy-walsh","arman-cohan","julien-han","nazli-goharian"],"abstract":"In recent years, online communities have formed around suicide and self-harm prevention. While these communities offer support in moment of crisis, they can also normalize harmful behavior, discourage professional treatment, and instigate suicidal ideation. In this work, we focus on how interaction with others in such a community affects the mental state of users who are seeking support. We first build a dataset of conversation threads between users in a distressed state and community members offering support. We then show how to construct a classifier to predict whether distressed users are helped or harmed by the interactions in the thread, and we achieve a macro-F1 score of up to 0.69.","pages":"194--203","doi":"10.18653\/v1\/W18-0621","url":"https:\/\/www.aclweb.org\/anthology\/W18-0621","publisher":"Association for Computational Linguistics","address":"New Orleans, LA","year":"2018","month":"June","booktitle":"Proceedings of the Fifth Workshop on Computational Linguistics and Clinical Psychology: From Keyboard to Clinic"}]