[{"id":"W18-6901","title":"Context-sensitive Natural Language Generation for robot-assisted second language tutoring","authors":["Willemsen, Bram","de Wit, Jan","Krahmer, Emiel","de Haas, Mirjam","Vogt, Paul"],"emails":["b.willemsen@uvt.nl","j.m.s.dewit@uvt.nl","e.j.krahmer@uvt.nl","mirjam.dehaas@uvt.nl","p.a.vogt@uvt.nl"],"author_id":["bram-willemsen","jan-de-wit","emiel-krahmer","mirjam-de-haas","paul-vogt"],"abstract":"This paper describes the L2TOR intelligent tutoring system (ITS), focusing primarily on its output generation module. The L2TOR ITS is developed for the purpose of investigating the efficacy of robot-assisted second language tutoring in early childhood. We explain the process of generating contextually-relevant utterances, such as task-specific feedback messages, and discuss challenges regarding multimodality and multilingualism for situated natural language generation from a robot tutoring perspective.","pages":"1--7","doi":"10.18653\/v1\/W18-6901","url":"https:\/\/www.aclweb.org\/anthology\/W18-6901","publisher":"Association for Computational Linguistics","address":"Tilburg, The Netherlands","year":"2018","month":"November","booktitle":"Proceedings of the Workshop on {NLG} for Human{--}Robot Interaction"},{"id":"W18-6902","title":"Learning from limited datasets: Implications for Natural Language Generation and Human-Robot Interaction","authors":["Belakova, Jekaterina","Gkatzia, Dimitra"],"emails":["ekaterinabeljakova@gmail.com","d.gkatzia@napier.ac.uk"],"author_id":["jekaterina-belakova","dimitra-gkatzia"],"abstract":"One of the most natural ways for human robot communication is through spoken language. Training human-robot interaction systems require access to large datasets which are expensive to obtain and labour intensive. In this paper, we describe an approach for learning from minimal data, using as a toy example language understanding in spoken dialogue systems. Understanding of spoken language is crucial because it has implications for natural language generation, i.e. correctly understanding a user{'}s utterance will lead to choosing the right response\/action. Finally, we discuss implications for Natural Language Generation in Human-Robot Interaction.","pages":"8--11","doi":"10.18653\/v1\/W18-6902","url":"https:\/\/www.aclweb.org\/anthology\/W18-6902","publisher":"Association for Computational Linguistics","address":"Tilburg, The Netherlands","year":"2018","month":"November","booktitle":"Proceedings of the Workshop on {NLG} for Human{--}Robot Interaction"},{"id":"W18-6903","title":"Shaping a social robot{'}s humor with Natural Language Generation and socially-aware reinforcement learning","authors":["Ritschel, Hannes","Andr{\\'e}, Elisabeth"],"emails":["ritschel@hcm-lab.de","andre@hcm-lab.de"],"author_id":["hannes-ritschel","elisabeth-andre"],"abstract":"Humor is an important aspect in human interaction to regulate conversations, increase interpersonal attraction and trust. For social robots, humor is one aspect to make interactions more natural, enjoyable, and to increase credibility and acceptance. In combination with appropriate non-verbal behavior, natural language generation offers the ability to create content on-the-fly. This work outlines the building-blocks for providing an individual, multimodal interaction experience by shaping the robot{'}s humor with the help of Natural Language Generation and Reinforcement Learning based on human social signals.","pages":"12--16","doi":"10.18653\/v1\/W18-6903","url":"https:\/\/www.aclweb.org\/anthology\/W18-6903","publisher":"Association for Computational Linguistics","address":"Tilburg, The Netherlands","year":"2018","month":"November","booktitle":"Proceedings of the Workshop on {NLG} for Human{--}Robot Interaction"},{"id":"W18-6904","title":"From sensors to sense: Integrated heterogeneous ontologies for Natural Language Generation","authors":["Pomarlan, Mihai","Porzel, Robert","Bateman, John","Malaka, Rainer"],"emails":["pomarlan@uni-bremen.de","porzel@tzi.de","bateman@uni-bremen.de","malaka@tzi.de"],"author_id":["mihai-pomarlan","robert-porzel","john-bateman","rainer-malaka"],"abstract":"We propose the combination of a robotics ontology (KnowRob) with a linguistically motivated one (GUM) under the upper ontology DUL. We use the DUL Event, Situation, Description pattern to formalize reasoning techniques to convert between a robot{'}s beliefstate and its linguistic utterances. We plan to employ these techniques to equip robots with a reason-aloud ability, through which they can explain their actions as they perform them, in natural language, at a level of granularity appropriate to the user, their query and the context at hand.","pages":"17--21","doi":"10.18653\/v1\/W18-6904","url":"https:\/\/www.aclweb.org\/anthology\/W18-6904","publisher":"Association for Computational Linguistics","address":"Tilburg, The Netherlands","year":"2018","month":"November","booktitle":"Proceedings of the Workshop on {NLG} for Human{--}Robot Interaction"},{"id":"W18-6905","title":"A farewell to arms: Non-verbal communication for non-humanoid robots","authors":["Cass, Aaron G.","Striegnitz, Kristina","Webb, Nick"],"emails":["cassa@union.edu","striegnk@union.edu","webbn@union.edu"],"author_id":["aaron-g-cass","kristina-striegnitz","nick-webb"],"abstract":"Human-robot interactions situated in a dynamic environment create a unique mix of challenges for conversational systems. We argue that, on the one hand, NLG can contribute to addressing these challenges and that, on the other hand, they pose interesting research problems for NLG. To illustrate our position we describe our research on non-humanoid robots using non-verbal signals to support communication.","pages":"22--26","doi":"10.18653\/v1\/W18-6905","url":"https:\/\/www.aclweb.org\/anthology\/W18-6905","publisher":"Association for Computational Linguistics","address":"Tilburg, The Netherlands","year":"2018","month":"November","booktitle":"Proceedings of the Workshop on {NLG} for Human{--}Robot Interaction"},{"id":"W18-6906","title":"Being data-driven is not enough: Revisiting interactive instruction giving as a challenge for {NLG}","authors":["Zarrie{\\ss}, Sina","Schlangen, David"],"emails":["sina.zarriess@uni-bielefeld.de","david.schlangen@uni-bielefeld.de"],"author_id":["sina-zarriess","david-schlangen"],"abstract":"Modeling traditional NLG tasks with data-driven techniques has been a major focus of research in NLG in the past decade. We argue that existing modeling techniques are mostly tailored to textual data and are not sufficient to make NLG technology meet the requirements of agents which target fluid interaction and collaboration in the real world. We revisit interactive instruction giving as a challenge for datadriven NLG and, based on insights from previous GIVE challenges, propose that instruction giving should be addressed in a setting that involves visual grounding and spoken language. These basic design decisions will require NLG frameworks that are capable of monitoring their environment as well as timing and revising their verbal output. We believe that these are core capabilities for making NLG technology transferrable to interactive systems.","pages":"27--31","doi":"10.18653\/v1\/W18-6906","url":"https:\/\/www.aclweb.org\/anthology\/W18-6906","publisher":"Association for Computational Linguistics","address":"Tilburg, The Netherlands","year":"2018","month":"November","booktitle":"Proceedings of the Workshop on {NLG} for Human{--}Robot Interaction"}]