[{"id":"W18-1501","title":"Learning to Listen: Critically Considering the Role of {AI} in Human Storytelling and Character Creation","authors":["Kasunic, Anna","Kaufman, Geoff"],"emails":["akasunic@andrew.cmu.edu","gfk@cs.cmu.edu"],"author_id":["anna-kasunic","geoff-kaufman"],"abstract":"In this opinion piece, we argue that there is a need for alternative design directions to complement existing AI efforts in narrative and character generation and algorithm development. To make our argument, we a) outline the predominant roles and goals of AI research in storytelling; b) present existing discourse on the benefits and harms of narratives; and c) highlight the pain points in character creation revealed by semi-structured interviews we conducted with 14 individuals deeply involved in some form of character creation. We conclude by proffering several specific design avenues that we believe can seed fruitful research collaborations. In our vision, AI collaborates with humans during creative processes and narrative generation, helps amplify voices and perspectives that are currently marginalized or misrepresented, and engenders experiences of narrative that support spectatorship and listening roles.","pages":"1--13","doi":"10.18653\/v1\/W18-1501","url":"https:\/\/www.aclweb.org\/anthology\/W18-1501","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the First Workshop on Storytelling"},{"id":"W18-1502","title":"Linguistic Features of Helpfulness in Automated Support for Creative Writing","authors":["Roemmele, Melissa","Gordon, Andrew"],"emails":["roemmele@ict.usc.edu","gordon@ict.usc.edu"],"author_id":["melissa-roemmele","andrew-gordon"],"abstract":"We examine an emerging NLP application that supports creative writing by automatically suggesting continuing sentences in a story. The application tracks users{'} modifications to generated sentences, which can be used to quantify their {``}helpfulness{''} in advancing the story. We explore the task of predicting helpfulness based on automatically detected linguistic features of the suggestions. We illustrate this analysis on a set of user interactions with the application using an initial selection of features relevant to story generation.","pages":"14--19","doi":"10.18653\/v1\/W18-1502","url":"https:\/\/www.aclweb.org\/anthology\/W18-1502","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the First Workshop on Storytelling"},{"id":"W18-1503","title":"A Pipeline for Creative Visual Storytelling","authors":["Lukin, Stephanie","Hobbs, Reginald","Voss, Clare"],"emails":["stephanie.m.lukin.civ@mail.mil","",""],"author_id":["stephanie-lukin","reginald-hobbs","clare-voss"],"abstract":"Computational visual storytelling produces a textual description of events and interpretations depicted in a sequence of images. These texts are made possible by advances and cross-disciplinary approaches in natural language processing, generation, and computer vision. We define a computational creative visual storytelling as one with the ability to alter the telling of a story along three aspects: to speak about different environments, to produce variations based on narrative goals, and to adapt the narrative to the audience. These aspects of creative storytelling and their effect on the narrative have yet to be explored in visual storytelling. This paper presents a pipeline of task-modules, Object Identification, Single-Image Inferencing, and Multi-Image Narration, that serve as a preliminary design for building a creative visual storyteller. We have piloted this design for a sequence of images in an annotation task. We present and analyze the collected corpus and describe plans towards automation.","pages":"20--32","doi":"10.18653\/v1\/W18-1503","url":"https:\/\/www.aclweb.org\/anthology\/W18-1503","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the First Workshop on Storytelling"},{"id":"W18-1504","title":"Telling Stories with Soundtracks: An Empirical Analysis of Music in Film","authors":["Gillick, Jon","Bamman, David"],"emails":["jongillick@berkeley.edu","dbamman@berkeley.edu"],"author_id":["jon-gillick","david-bamman"],"abstract":"Soundtracks play an important role in carrying the story of a film. In this work, we collect a corpus of movies and television shows matched with subtitles and soundtracks and analyze the relationship between story, song, and audience reception. We look at the content of a film through the lens of its latent topics and at the content of a song through descriptors of its musical attributes. In two experiments, we find first that individual topics are strongly associated with musical attributes, and second, that musical attributes of soundtracks are predictive of film ratings, even after controlling for topic and genre.","pages":"33--42","doi":"10.18653\/v1\/W18-1504","url":"https:\/\/www.aclweb.org\/anthology\/W18-1504","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the First Workshop on Storytelling"},{"id":"W18-1505","title":"Towards Controllable Story Generation","authors":["Peng, Nanyun","Ghazvininejad, Marjan","May, Jonathan","Knight, Kevin"],"emails":["npeng@isi.edu","ghazvini@isi.edu","jonmay@isi.edu","knight@isi.edu"],"author_id":["nanyun-peng","marjan-ghazvininejad","jonathan-may","kevin-knight"],"abstract":"We present a general framework of analyzing existing story corpora to generate controllable and creative new stories. The proposed framework needs little manual annotation to achieve controllable story generation. It creates a new interface for humans to interact with computers to generate personalized stories. We apply the framework to build recurrent neural network (RNN)-based generation models to control story ending valence and storyline. Experiments show that our methods successfully achieve the control and enhance the coherence of stories through introducing storylines. with additional control factors, the generation model gets lower perplexity, and yields more coherent stories that are faithful to the control factors according to human evaluation.","pages":"43--49","doi":"10.18653\/v1\/W18-1505","url":"https:\/\/www.aclweb.org\/anthology\/W18-1505","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the First Workshop on Storytelling"},{"id":"W18-1506","title":"An Encoder-decoder Approach to Predicting Causal Relations in Stories","authors":["Roemmele, Melissa","Gordon, Andrew"],"emails":["roemmele@ict.usc.edu","gordon@ict.usc.edu"],"author_id":["melissa-roemmele","andrew-gordon"],"abstract":"We address the task of predicting causally related events in stories according to a standard evaluation framework, the Choice of Plausible Alternatives (COPA). We present a neural encoder-decoder model that learns to predict relations between adjacent sequences in stories as a means of modeling causality. We explore this approach using different methods for extracting and representing sequence pairs as well as different model architectures. We also compare the impact of different training datasets on our model. In particular, we demonstrate the usefulness of a corpus not previously applied to COPA, the ROCStories corpus. While not state-of-the-art, our results establish a new reference point for systems evaluated on COPA, and one that is particularly informative for future neural-based approaches.","pages":"50--59","doi":"10.18653\/v1\/W18-1506","url":"https:\/\/www.aclweb.org\/anthology\/W18-1506","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the First Workshop on Storytelling"},{"id":"W18-1507","title":"Neural Event Extraction from Movies Description","authors":["Tozzo, Alex","Jovanovi{\\'c}, Dejan","Amer, Mohamed"],"emails":["","dejan.jovanovic@sri.com","mohamed.amer@sri.com"],"author_id":["alex-tozzo","dejan-jovanovic","mohamed-r-amer"],"abstract":"We present a novel approach for event extraction and abstraction from movie descriptions. Our event frame consists of {``}who{''}, {``}did what{''} {``}to whom{''}, {``}where{''}, and {``}when{''}. We formulate our problem using a recurrent neural network, enhanced with structural features extracted from syntactic parser, and trained using curriculum learning by progressively increasing the difficulty of the sentences. Our model serves as an intermediate step towards question answering systems, visual storytelling, and story completion tasks. We evaluate our approach on MovieQA dataset.","pages":"60--66","doi":"10.18653\/v1\/W18-1507","url":"https:\/\/www.aclweb.org\/anthology\/W18-1507","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the First Workshop on Storytelling"}]