[{"id":"W18-1301","title":"Using Hedge Detection to Improve Committed Belief Tagging","authors":["Ulinski, Morgan","Benjamin, Seth","Hirschberg, Julia"],"emails":["","",""],"author_id":["morgan-ulinski","seth-benjamin","julia-hirschberg"],"abstract":"We describe a novel method for identifying hedge terms using a set of manually constructed rules. We present experiments adding hedge features to a committed belief system to improve classification. We compare performance of this system (a) without hedging features, (b) with dictionary-based features, and (c) with rule-based features. We find that using hedge features improves performance of the committed belief system, particularly in identifying instances of non-committed belief and reported belief.","pages":"1--5","doi":"10.18653\/v1\/W18-1301","url":"https:\/\/www.aclweb.org\/anthology\/W18-1301","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Workshop on Computational Semantics beyond Events and Roles"},{"id":"W18-1302","title":"Paths for uncertainty: Exploring the intricacies of uncertainty identification for news","authors":["Zerva, Chrysoula","Ananiadou, Sophia"],"emails":["chrysoula.zerva@manchester.ac.uk","sophia.ananiadou@manchester.ac.uk"],"author_id":["chrysoula-zerva","sophia-ananiadou"],"abstract":"Currently, news articles are produced, shared and consumed at an extremely rapid rate. Although their quantity is increasing, at the same time, their quality and trustworthiness is becoming fuzzier. Hence, it is important not only to automate information extraction but also to quantify the certainty of this information. Automated identification of certainty has been studied both in the scientific and newswire domains, but performance is considerably higher in tasks focusing on scientific text. We compare the differences in the definition and expression of uncertainty between a scientific domain, i.e., biomedicine, and newswire. We delve into the different aspects that affect the certainty of an extracted event in a news article and examine whether they can be easily identified by techniques already validated in the biomedical domain. Finally, we present a comparison of the syntactic and lexical differences between the the expression of certainty in the biomedical and newswire domains, using two annotated corpora.","pages":"6--20","doi":"10.18653\/v1\/W18-1302","url":"https:\/\/www.aclweb.org\/anthology\/W18-1302","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Workshop on Computational Semantics beyond Events and Roles"},{"id":"W18-1303","title":"Detecting Sarcasm is Extremely Easy ;-)","authors":["Parde, Natalie","Nielsen, Rodney"],"emails":["natalie.parde@unt.edu","rodney.nielsen@unt.edu"],"author_id":["natalie-parde","rodney-nielsen"],"abstract":"Detecting sarcasm in text is a particularly challenging problem in computational semantics, and its solution may vary across different types of text. We analyze the performance of a domain-general sarcasm detection system on datasets from two very different domains: Twitter, and Amazon product reviews. We categorize the errors that we identify with each, and make recommendations for addressing these issues in NLP systems in the future.","pages":"21--26","doi":"10.18653\/v1\/W18-1303","url":"https:\/\/www.aclweb.org\/anthology\/W18-1303","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Workshop on Computational Semantics beyond Events and Roles"},{"id":"W18-1304","title":"{GKR}: the Graphical Knowledge Representation for semantic parsing","authors":["Kalouli, Aikaterini-Lida","Crouch, Richard"],"emails":["aikaterini-lida.kalouli@uni-konstanz.de","dick.crouch@gmail.com"],"author_id":["aikaterini-lida-kalouli","richard-crouch"],"abstract":"This paper describes the first version of an open-source semantic parser that creates graphical representations of sentences to be used for further semantic processing, e.g. for natural language inference, reasoning and semantic similarity. The Graphical Knowledge Representation which is output by the parser is inspired by the Abstract Knowledge Representation, which separates out conceptual and contextual levels of representation that deal respectively with the subject matter of a sentence and its existential commitments. Our representation is a layered graph with each sub-graph holding different kinds of information, including one sub-graph for concepts and one for contexts. Our first evaluation of the system shows an F-score of 85{\\%} in accurately representing sentences as semantic graphs.","pages":"27--37","doi":"10.18653\/v1\/W18-1304","url":"https:\/\/www.aclweb.org\/anthology\/W18-1304","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Workshop on Computational Semantics beyond Events and Roles"},{"id":"W18-1305","title":"Computational Argumentation: A Journey Beyond Semantics, Logic, Opinions, and Easy Tasks","authors":["Habernal, Ivan"],"emails":["habernal@ukp.informatik.tu-darmstadt.de"],"author_id":["ivan-habernal"],"abstract":"The classical view on argumentation, such that arguments are logical structures consisting of different distinguishable parts and that parties exchange arguments in a rational way, is prevalent in textbooks but nonexistent in the real world. Instead, argumentation is a multifaceted communication tool built upon humans{'} capabilities to easily use common sense, emotions, and social context. As humans, we are pretty good at it. Computational Argumentation tries to tackle these phenomena but has a long and not so easy way to go. In this talk, I would like to shed a light on several recent attempts to deal with argumentation computationally, such as addressing argument quality, understanding argument reasoning, dealing with fallacies, and how should we never ever argue online.","pages":"38","doi":"10.18653\/v1\/W18-1305","url":"https:\/\/www.aclweb.org\/anthology\/W18-1305","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Workshop on Computational Semantics beyond Events and Roles"}]