[{"id":"W18-3101","title":"Economic Event Detection in Company-Specific News Text","authors":["Jacobs, Gilles","Lefever, Els","Hoste, V{\\'e}ronique"],"emails":["gillesm.jacobs@ugent.be","els.lefever@ugent.be","veronique.hoste@ugent.be"],"author_id":["gilles-jacobs","els-lefever","veronique-hoste"],"abstract":"This paper presents a dataset and supervised classification approach for economic event detection in English news articles. Currently, the economic domain is lacking resources and methods for data-driven supervised event detection. The detection task is conceived as a sentence-level classification task for 10 different economic event types. Two different machine learning approaches were tested: a rich feature set Support Vector Machine (SVM) set-up and a word-vector-based long short-term memory recurrent neural network (RNN-LSTM) set-up. We show satisfactory results for most event types, with the linear kernel SVM outperforming the other experimental set-ups","pages":"1--10","doi":"10.18653\/v1\/W18-3101","url":"https:\/\/www.aclweb.org\/anthology\/W18-3101","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"},{"id":"W18-3102","title":"Causality Analysis of Twitter Sentiments and Stock Market Returns","authors":["Tabari, Narges","Biswas, Piyusha","Praneeth, Bhanu","Seyeditabari, Armin","Hadzikadic, Mirsad","Zadrozny, Wlodek"],"emails":["sseyedi1@uncc.edu","pbiswas1@uncc.edu","bsirukur@uncc.edu","nseyedit@uncc.edu","irsad@uncc.edu","wzadrozn@uncc.edu"],"author_id":["narges-tabari","piyusha-biswas","bhanu-praneeth","armin-seyeditabari","mirsad-hadzikadic","wlodek-zadrozny"],"abstract":"Sentiment analysis is the process of identifying the opinion expressed in text. Recently, it has been used to study behavioral finance, and in particular the effect of opinions and emotions on economic or financial decisions. In this paper, we use a public dataset of labeled tweets that has been labeled by Amazon Mechanical Turk and then we propose a baseline classification model. Then, by using Granger causality of both sentiment datasets with the different stocks, we shows that there is causality between social media and stock market returns (in both directions) for many stocks. Finally, We evaluate this causality analysis by showing that in the event of a specific news on certain dates, there are evidences of trending the same news on Twitter for that stock.","pages":"11--19","doi":"10.18653\/v1\/W18-3102","url":"https:\/\/www.aclweb.org\/anthology\/W18-3102","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"},{"id":"W18-3103","title":"A Corpus of Corporate Annual and Social Responsibility Reports: 280 Million Tokens of Balanced Organizational Writing","authors":["H{\\\"a}ndschke, Sebastian G.M.","Buechel, Sven","Goldenstein, Jan","Poschmann, Philipp","Duan, Tinghui","Walgenbach, Peter","Hahn, Udo"],"emails":["","","","","","",""],"author_id":["sebastian-g-m-handschke","sven-buechel","jan-goldenstein","philipp-poschmann","tinghui-duan","peter-walgenbach","udo-hahn"],"abstract":"We introduce JOCo, a novel text corpus for NLP analytics in the field of economics, business and management. This corpus is composed of corporate annual and social responsibility reports of the top 30 US, UK and German companies in the major (DJIA, FTSE 100, DAX), middle-sized (S{\\&}P 500, FTSE 250, MDAX) and technology (NASDAQ, FTSE AIM 100, TECDAX) stock indices, respectively. Altogether, this adds up to 5,000 reports from 270 companies headquartered in three of the world{'}s most important economies. The corpus spans a time frame from 2000 up to 2015 and contains, in total, 282M tokens. We also feature JOCo in a small-scale experiment to demonstrate its potential for NLP-fueled studies in economics, business and management research.","pages":"20--31","doi":"10.18653\/v1\/W18-3103","url":"https:\/\/www.aclweb.org\/anthology\/W18-3103","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"},{"id":"W18-3104","title":"Word Embeddings-Based Uncertainty Detection in Financial Disclosures","authors":["Theil, Christoph Kilian","{\\v{S}}tajner, Sanja","Stuckenschmidt, Heiner"],"emails":["christoph@informatik.uni-mannheim.de","sanja@informatik.uni-mannheim.de","heiner@informatik.uni-mannheim.de"],"author_id":["christoph-kilian-theil","sanja-stajner","heiner-stuckenschmidt"],"abstract":"In this paper, we use NLP techniques to detect linguistic uncertainty in financial disclosures. Leveraging general-domain and domain-specific word embedding models, we automatically expand an existing dictionary of uncertainty triggers. We furthermore examine how an expert filtering affects the quality of such an expansion. We show that the dictionary expansions significantly improve regressions on stock return volatility. Lastly, we prove that the expansions significantly boost the automatic detection of uncertain sentences.","pages":"32--37","doi":"10.18653\/v1\/W18-3104","url":"https:\/\/www.aclweb.org\/anthology\/W18-3104","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"},{"id":"W18-3105","title":"A Simple End-to-End Question Answering Model for Product Information","authors":["Lai, Tuan","Bui, Trung","Li, Sheng","Lipka, Nedim"],"emails":["tlai@adobe.com","bui@adobe.com","sheli@adobe.com","lipka@adobe.com"],"author_id":["tuan-lai","trung-bui","sheng-li","nedim-lipka"],"abstract":"When evaluating a potential product purchase, customers may have many questions in mind. They want to get adequate information to determine whether the product of interest is worth their money. In this paper we present a simple deep learning model for answering questions regarding product facts and specifications. Given a question and a product specification, the model outputs a score indicating their relevance. To train and evaluate our proposed model, we collected a dataset of 7,119 questions that are related to 153 different products. Experimental results demonstrate that {--}despite its simplicity{--} the performance of our model is shown to be comparable to a more complex state-of-the-art baseline.","pages":"38--43","doi":"10.18653\/v1\/W18-3105","url":"https:\/\/www.aclweb.org\/anthology\/W18-3105","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"},{"id":"W18-3106","title":"Sentence Classification for Investment Rules Detection","authors":["Mansar, Youness","Ferradans, Sira"],"emails":["youness.mansar@fortia.fr","sira.ferradans@fortia.fr"],"author_id":["youness-mansar","sira-ferradans"],"abstract":"In the last years, compliance requirements for the banking sector have greatly augmented, making the current compliance processes difficult to maintain. Any process that allows to accelerate the identification and implementation of compliance requirements can help address this issues. The contributions of the paper are twofold: we propose a new NLP task that is the investment rule detection, and a group of methods identify them. We show that the proposed methods are highly performing and fast, thus can be deployed in production.","pages":"44--48","doi":"10.18653\/v1\/W18-3106","url":"https:\/\/www.aclweb.org\/anthology\/W18-3106","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"},{"id":"W18-3107","title":"Leveraging News Sentiment to Improve Microblog Sentiment Classification in the Financial Domain","authors":["Daudert, Tobias","Buitelaar, Paul","Negi, Sapna"],"emails":["tobias.daudert@insight-centre.org","paul.buitelaar@insight-centre.org","sapna.negi@insight-centre.org"],"author_id":["tobias-daudert","paul-buitelaar","sapna-negi"],"abstract":"With the rising popularity of social media in the society and in research, analysing texts short in length, such as microblogs, becomes an increasingly important task. As a medium of communication, microblogs carry peoples sentiments and express them to the public. Given that sentiments are driven by multiple factors including the news media, the question arises if the sentiment expressed in news and the news article themselves can be leveraged to detect and classify sentiment in microblogs. Prior research has highlighted the impact of sentiments and opinions on the market dynamics, making the financial domain a prime case study for this approach. Therefore, this paper describes ongoing research dealing with the exploitation of news contained sentiment to improve microblog sentiment classification in a financial context.","pages":"49--54","doi":"10.18653\/v1\/W18-3107","url":"https:\/\/www.aclweb.org\/anthology\/W18-3107","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"},{"id":"W18-3108","title":"Implicit and Explicit Aspect Extraction in Financial Microblogs","authors":["Gaillat, Thomas","Stearns, Bernardo","Sridhar, Gopal","McDermott, Ross","Zarrouk, Manel","Davis, Brian"],"emails":["thomas.gaillat@insight-centre.org","bernardo.stearns@insight-centre.org","gopal.sridhar@insight-centre.org","ross.mcdermott@insight-centre.org","manel.zarrouk@insight-centre.org","brian.davis@mu.ie"],"author_id":["thomas-gaillat","bernardo-stearns","gopal-sridhar","ross-mcdermott","manel-zarrouk","brian-davis"],"abstract":"This paper focuses on aspect extraction which is a sub-task of Aspect-based Sentiment Analysis. The goal is to report an extraction method of financial aspects in microblog messages. Our approach uses a stock-investment taxonomy for the identification of explicit and implicit aspects. We compare supervised and unsupervised methods to assign predefined categories at message level. Results on 7 aspect classes show 0.71 accuracy, while the 32 class classification gives 0.82 accuracy for messages containing explicit aspects and 0.35 for implicit aspects.","pages":"55--61","doi":"10.18653\/v1\/W18-3108","url":"https:\/\/www.aclweb.org\/anthology\/W18-3108","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"},{"id":"W18-3109","title":"Unsupervised Word Influencer Networks from News Streams","authors":["Balashankar, Ananth","Chakraborty, Sunandan","Subramanian, Lakshminarayanan"],"emails":["ananth@nyu.edu","sunchak@iu.edu","lakshmi@cs.nyu.edu"],"author_id":["ananth-balashankar","sunandan-chakraborty","lakshminarayanan-subramanian"],"abstract":"In this paper, we propose a new unsupervised learning framework to use news events for predicting trends in stock prices. We present Word Influencer Networks (WIN), a graph framework to extract longitudinal temporal relationships between any pair of informative words from news streams. Using the temporal occurrence of words, WIN measures how the appearance of one word in a news stream influences the emergence of another set of words in the future. The latent word-word influencer relationships in WIN are the building blocks for causal reasoning and predictive modeling. We demonstrate the efficacy of WIN by using it for unsupervised extraction of latent features for stock price prediction and obtain 2 orders lower prediction error compared to a similar causal graph based method. WIN discovered influencer links from seemingly unrelated words from topics like politics to finance. WIN also validated 67{\\%} of the causal evidence found manually in the text through a direct edge and the rest 33{\\%} through a path of length 2.","pages":"62--68","doi":"10.18653\/v1\/W18-3109","url":"https:\/\/www.aclweb.org\/anthology\/W18-3109","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Economics and Natural Language Processing"}]