[{"id":"W18-4301","title":"Every Object Tells a Story","authors":["Pustejovsky, James","Krishnaswamy, Nikhil"],"emails":["jamesp@brandeis.edu","nkrishna@brandeis.edu"],"author_id":["james-pustejovsky","nikhil-krishnaswamy"],"abstract":"Most work within the computational event modeling community has tended to focus on the interpretation and ordering of events that are associated with verbs and event nominals in linguistic expressions. What is often overlooked in the construction of a global interpretation of a narrative is the role contributed by the objects participating in these structures, and the latent events and activities conventionally associated with them. Recently, the analysis of visual images has also enriched the scope of how events can be identified, by anchoring both linguistic expressions and ontological labels to segments, subregions, and properties of images. By semantically grounding event descriptions in their visualization, the importance of object-based attributes becomes more apparent. In this position paper, we look at the narrative structure of objects: that is, how objects reference events through their intrinsic attributes, such as affordances, purposes, and functions. We argue that, not only do objects encode conventionalized events, but that when they are composed within specific habitats, the ensemble can be viewed as modeling coherent event sequences, thereby enriching the global interpretation of the evolving narrative being constructed.","pages":"1--6","url":"https:\/\/www.aclweb.org\/anthology\/W18-4301","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4302","title":"A Rich Annotation Scheme for Mental Events","authors":["Croft, William","Pe{\\v{s}}kov{\\'a}, Pavl{\\'\\i}na","Regan, Michael","Lee, Sook-kyung"],"emails":["wcroft@unm.edu","pavlinap@unm.edu","reganman@unm.edu","sklee@unm.edu"],"author_id":["william-croft","pavlina-peskova","michael-regan","sook-kyung-lee"],"abstract":"We present a rich annotation scheme for the structure of mental events. Mental events are those in which the verb describes a mental state or process, usually oriented towards an external situation. While physical events have been described in detail and there are numerous studies of their semantic analysis and annotation, mental events are less thoroughly studied. The annotation scheme proposed here is based on decompositional analyses in the semantic and typological linguistic literature. The scheme was applied to the news corpus from the 2016 Events workshop, and error analysis of the test annotation provides suggestions for refinement and clarification of the annotation scheme.","pages":"7--17","url":"https:\/\/www.aclweb.org\/anthology\/W18-4302","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4303","title":"Cross-Document Narrative Alignment of Environmental News: A Position Paper on the Challenge of Using Event Chains to Proxy Narrative Features","authors":["Miller, Ben"],"emails":["b.j.miller@emory.edu"],"author_id":["ben-miller"],"abstract":"Cross-document event chain co-referencing in corpora of news articles would achieve increased precision and generalizability from a method that consistently recognizes narrative, discursive, and phenomenological features such as tense, mood, tone, canonicity and breach, person, hermeneutic composability, speed, and time. Current models that capture primarily linguistic data such as entities, times, and relations or causal relationships may only incidentally capture narrative framing features of events. That limits efforts at narrative and event chain segmentation, among other predicate tasks for narrative search and narrative-based reasoning. It further limits research on audience engagement with journalism about complex subjects. This position paper explores the above proposition with respect to narrative theory and ongoing research on segmenting event chains into narrative units. Our own work in progress approaches this task using event segmentation, word embeddings, and variable length pattern matching in a corpus of 2,000 articles describing environmental events. Our position is that narrative features may or may not be implicitly captured by current methods explicitly focused on events as linguistic phenomena, that they are not explicitly captured, and that further research is required.","pages":"18--24","url":"https:\/\/www.aclweb.org\/anthology\/W18-4303","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4304","title":"Identifying the Discourse Function of News Article Paragraphs","authors":["Yarlott, W. Victor","Cornelio, Cristina","Gao, Tian","Finlayson, Mark"],"emails":["wvyar@cs.fiu.edu","ccornel@us.ibm.com","tgao@us.ibm.com","markaf@fiu.edu"],"author_id":["w-victor-yarlott","cristina-cornelio","tian-gao","mark-finlayson"],"abstract":"Discourse structure is a key aspect of all forms of text, providing valuable information both to humans and machines. We applied the hierarchical theory of news discourse developed by van Dijk to examine how paragraphs operate as units of discourse structure within news articles{---}what we refer to here as document-level discourse. This document-level discourse provides a characterization of the content of each paragraph that describes its relation to the events presented in the article (such as main events, backgrounds, and consequences) as well as to other components of the story (such as commentary and evaluation). The purpose of a news discourse section is of great utility to story understanding as it affects both the importance and temporal order of items introduced in the text{---}therefore, if we know the news discourse purpose for different sections, we should be able to better rank events for their importance and better construct timelines. We test two hypotheses: first, that people can reliably annotate news articles with van Dijk{'}s theory; second, that we can reliably predict these labels using machine learning. We show that people have a high degree of agreement with each other when annotating the theory (F1 {\\textgreater} 0.8, Cohen{'}s kappa {\\textgreater} 0.6), demonstrating that it can be both learned and reliably applied by human annotators. Additionally, we demonstrate first steps toward machine learning of the theory, achieving a performance of F1 = 0.54, which is 65{\\%} of human performance. Moreover, we have generated a gold-standard, adjudicated corpus of 50 documents for document-level discourse annotation based on the ACE Phase 2 corpus.","pages":"25--33","url":"https:\/\/www.aclweb.org\/anthology\/W18-4304","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4305","title":"An Evaluation of Information Extraction Tools for Identifying Health Claims in News Headlines","authors":["Yuan, Shi","Yu, Bei"],"emails":["ystone1025@buaa.edu.cn","byu@syr.edu"],"author_id":["shi-yuan","bei-yu"],"abstract":"This study evaluates the performance of four information extraction tools (extractors) on identifying health claims in health news headlines. A health claim is defined as a triplet: IV (what is being manipulated), DV (what is being measured) and their relation. Tools that can identify health claims provide the foundation for evaluating the accuracy of these claims against authoritative resources. The evaluation result shows that 26{\\%} headlines do not in-clude health claims, and all extractors face difficulty separating them from the rest. For those with health claims, OPENIE-5.0 performed the best with F-measure at 0.6 level for ex-tracting {``}IV-relation-DV{''}. However, the characteristic linguistic structures in health news headlines, such as incomplete sentences and non-verb relations, pose particular challenge to existing tools.","pages":"34--43","url":"https:\/\/www.aclweb.org\/anthology\/W18-4305","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4306","title":"Crowdsourcing {S}tory{L}ines: Harnessing the Crowd for Causal Relation Annotation","authors":["Caselli, Tommaso","Inel, Oana"],"emails":["t.caselli@rug.nl","oana.inel@vu.nl"],"author_id":["tommaso-caselli","oana-inel"],"abstract":"This paper describes a crowdsourcing experiment on the annotation of plot-like structures in English news articles. CrowdThruth methodology and metrics have been applied to select valid annotations from the crowd. We further run an in-depth analysis of the annotated data by comparing them with available expert data. Our results show a valuable use of crowdsourcing annotations for such complex semantic tasks, and suggest a new annotation approach which combine crowd and experts.","pages":"44--54","url":"https:\/\/www.aclweb.org\/anthology\/W18-4306","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4307","title":"Can You Spot the Semantic Predicate in this Video?","authors":["Reale, Christopher","Bonial, Claire","Kwon, Heesung","Voss, Clare"],"emails":["christopher.reale@gmail.com","claire.n.bonial.civ@mail.mil","heesung.kwon.civ@mail.mil","clare.r.voss.civ@mail.mil"],"author_id":["christopher-reale","claire-bonial","heesung-kwon","clare-voss"],"abstract":"We propose a method to improve human activity recognition in video by leveraging semantic information about the target activities from an expert-defined linguistic resource, VerbNet. Our hypothesis is that activities that share similar event semantics, as defined by the semantic predicates of VerbNet, will be more likely to share some visual components. We use a deep convolutional neural network approach as a baseline and incorporate linguistic information from VerbNet through multi-task learning. We present results of experiments showing the added information has negligible impact on recognition performance. We discuss how this may be because the lexical semantic information defined by VerbNet is generally not visually salient given the video processing approach used here, and how we may handle this in future approaches.","pages":"55--60","url":"https:\/\/www.aclweb.org\/anthology\/W18-4307","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4308","title":"Fine-grained Structure-based News Genre Categorization","authors":["Dai, Zeyu","Taneja, Himanshu","Huang, Ruihong"],"emails":["zeyudai@tamu.edu","himanshu27@tamu.edu","huangrh@tamu.edu"],"author_id":["zeyu-dai","himanshu-taneja","ruihong-huang"],"abstract":"Journalists usually organize and present the contents of a news article following a well-defined structure. In this work, we propose a new task to categorize news articles based on their content presentation structures, which is beneficial for various NLP applications. We first define a small set of news elements considering their functions (e.g., \\textit{introducing the main story or event, catching the reader{'}s attention} and \\textit{providing details}) in a news story and their writing style (\\textit{narrative} or \\textit{expository}), and then formally define four commonly used news article structures based on their selections and organizations of news elements. We create an annotated dataset for structure-based news genre identification, and finally, we build a predictive model to assess the feasibility of this classification task using structure indicative features.","pages":"61--67","url":"https:\/\/www.aclweb.org\/anthology\/W18-4308","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4309","title":"On Training Classifiers for Linking Event Templates","authors":["Piskorski, Jakub","{\\v{S}}ari{\\'c}, Fredi","Zavarella, Vanni","Atkinson, Martin"],"emails":["jakub.piskorski@ec.europa.eu","fredi.saric@fer.hr","vanni.zavarella@ec.europa.eu","martin.atkinson@ec.europa.eu"],"author_id":["jakub-piskorski","fredi-saric","vanni-zavarella","martin-atkinson"],"abstract":"The paper reports on exploring various machine learning techniques and a range of textual and meta-data features to train classifiers for linking related event templates automatically extracted from online news. With the best model using textual features only we achieved 94.7{\\%} (92.9{\\%}) F1 score on GOLD (SILVER) dataset. These figures were further improved to 98.6{\\%} (GOLD) and 97{\\%} (SILVER) F1 score by adding meta-data features, mainly thanks to the strong discriminatory power of automatically extracted geographical information related to events.","pages":"68--78","url":"https:\/\/www.aclweb.org\/anthology\/W18-4309","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"},{"id":"W18-4310","title":"{HEI}: Hunter Events Interface A platform based on services for the detection and reasoning about events","authors":["Sorgente, Antonio","Calabrese, Antonio","Coda, Gianluca","Vanacore, Paolo","Mele, Francesco"],"emails":["a.sorgente@isasi.cnr.it","a.calabrese@isasi.cnr.it","g.coda@isasi.cnr.it","p.vanacore@isasi.cnr.it","f.mele@isasi.cnr.it"],"author_id":["antonio-sorgente","antonio-calabrese","gianluca-coda","paolo-vanacore","francesco-mele"],"abstract":"In this paper we present the definition and implementation of the Hunter Events Interface (HEI) System. The HEI System is a system for events annotation and temporal reasoning in Natural Language Texts and media, mainly oriented to texts of historical and cultural contents available on the Web. In this work we assume that events are defined through various components: actions, participants, locations, and occurrence intervals. The HEI system, through independent services, locates (annotates) the various components, and successively associates them to a specific event. The objective of this work is to build a system integrating services for the identification of events, the discovery of their connections, and the evaluation of their consistency. We believe this interface is useful to develop applications that use the notion of story, to integrate data of digital cultural archives, and to build systems of fruition in the same field. The HEI system has been partially developed within the TrasTest project","pages":"79--88","url":"https:\/\/www.aclweb.org\/anthology\/W18-4310","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, U.S.A","year":"2018","month":"August","booktitle":"Proceedings of the Workshop Events and Stories in the News 2018"}]