[{"id":"W18-4901","title":"Annotation Schemes for Surface Construction Labeling","authors":["Levin, Lori"],"emails":["lsl@cs.cmu.edu"],"author_id":["lori-levin"],"abstract":"In this talk I will describe the interaction of linguistics and language technologies in Surface Construction Labeling (SCL) from the perspective of corpus annotation tasks such as definiteness, modality, and causality. Linguistically, following Construction Grammar, SCL recognizes that meaning may be carried by morphemes, words, or arbitrary constellations of morpho-lexical elements. SCL is like Shallow Semantic Parsing in that it does not attempt a full compositional analysis of meaning, but rather identifies only the main elements of a semantic frame, where the frames may be invoked by constructions as well as lexical items. Computationally, SCL is different from tasks such as information extraction in that it deals only with meanings that are expressed in a conventional, grammaticalized way and does not address inferred meanings. I review the work of Dunietz (2018) on the labeling of causal frames including causal connectives and cause and effect arguments. I will describe how to design an annotation scheme for SCL, including isolating basic units of form and meaning and building a {``}constructicon{''}. I will conclude with remarks about the nature of universal categories and universal meaning representations in language technologies. This talk describes joint work with Jaime Carbonell, Jesse Dunietz, Nathan Schneider, and Miriam Petruck.","pages":"1","url":"https:\/\/www.aclweb.org\/anthology\/W18-4901","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4902","title":"From Lexical Functional Grammar to Enhanced Universal Dependencies","authors":["Przepi{\\'o}rkowski, Adam","Patejuk, Agnieszka"],"emails":["adamp@ipipan.waw.pl","aep@ipipan.waw.pl"],"author_id":["adam-przepiorkowski","agnieszka-patejuk"],"abstract":"This is a summary of an invited talk.","pages":"2--4","url":"https:\/\/www.aclweb.org\/anthology\/W18-4902","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4903","title":"Leaving no token behind: comprehensive (and delicious) annotation of {MWE}s and supersenses","authors":["Schneider, Nathan"],"emails":["nathan.schneider@georgetown.edu"],"author_id":["nathan-schneider"],"abstract":"I will describe an unorthodox approach to lexical semantic annotation that prioritizes corpus coverage, democratizing analysis of a wide range of expression types. I argue that a lexicon-free lexical semantics{---}defined in terms of units and supersense tags{---}is an appetizing direction for NLP, as it is robust, cost-effective, easily understood, not too language-specific, and can serve as a foundation for richer semantic structure. Linguistic delicacies from the STREUSLE and DiMSUM corpora, which have been multiword- and supersense-annotated, attest to the veritable sm{\\\"o}rg{\\aa}sbord of noncanonical constructions in English, including various flavors of prepositions, MWEs, and other curiosities. Bio: Nathan Schneider is an annotation schemer and computational modeler for natural language. As Assistant Professor of Linguistics and Computer Science at Georgetown University, he looks for synergies between practical language technologies and the scientific study of language. He specializes in broad-coverage semantic analysis: designing linguistic meaning representations, annotating them in corpora, and automating them with statistical natural language processing techniques. A central focus in this research is the nexus between grammar and lexicon as manifested in multiword expressions and adpositions\/case markers. He has inhabited UC Berkeley (BA in Computer Science and Linguistics), Carnegie Mellon University (Ph.D. in Language Technologies), and the University of Edinburgh (postdoc). Now a Hoya and leader of NERT, he continues to play with data and algorithms for linguistic meaning.","pages":"5","url":"https:\/\/www.aclweb.org\/anthology\/W18-4903","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4904","title":"Processing {MWE}s: Neurocognitive Bases of Verbal {MWE}s and Lexical Cohesiveness within {MWE}s","authors":["Bhattasali, Shohini","Fabre, Murielle","Hale, John"],"emails":["sb2295@cornell.edu","mf684@cornell.edu","jthale@cornell.edu"],"author_id":["shohini-bhattasali","murielle-fabre","john-hale"],"abstract":"Multiword expressions have posed a challenge in the past for computational linguistics since they comprise a heterogeneous family of word clusters and are difficult to detect in natural language data. In this paper, we present a fMRI study based on language comprehension to provide neuroimaging evidence for processing MWEs. We investigate whether different MWEs have distinct neural bases, e.g. if verbal MWEs involve separate brain areas from non-verbal MWEs and if MWEs with varying levels of cohesiveness activate dissociable brain regions. Our study contributes neuroimaging evidence illustrating that different MWEs elicit spatially distinct patterns of activation. We also adapt an association measure, usually used to detect MWEs, as a cognitively plausible metric for language processing.","pages":"6--17","url":"https:\/\/www.aclweb.org\/anthology\/W18-4904","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4905","title":"The Interplay of Form and Meaning in Complex Medical Terms: Evidence from a Clinical Corpus","authors":["Gr{\\\"o}n, Leonie","Bertels, Ann","Heylen, Kris"],"emails":["leonie.gron@kuleuven.be","ann.bertels@kuleuven.be","kris.heylen@kuleuven.be"],"author_id":["leonie-gron","ann-bertels","kris-heylen"],"abstract":"We conduct a corpus study to investigate the structure of multi-word expressions (MWEs) in the clinical domain. Based on an existing medical taxonomy, we develop an annotation scheme and label a sample of MWEs from a Dutch corpus with semantic and grammatical features. The analysis of the annotated data shows that the formal structure of clinical MWEs correlates with their conceptual properties. The insights gained from this study could inform the design of Natural Language Processing (NLP) systems for clinical writing, but also for other specialized genres.","pages":"18--29","url":"https:\/\/www.aclweb.org\/anthology\/W18-4905","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4906","title":"Discourse and Lexicons: Lexemes, {MWE}s, Grammatical Constructions and Compositional Word Combinations to Signal Discourse Relations","authors":["Danlos, Laurence"],"emails":["anlos@linguist.univ-paris-diderot.fr"],"author_id":["laurence-danlos"],"abstract":"Lexicons generally record a list of lexemes or non-compositional multiword expressions. We propose to build lexicons for compositional word combinations, namely {``}secondary discourse connectives{''}. Secondary discourse connectives play the same function as {``}primary discourse connectives{''} but the latter are either lexemes or non-compositional multiword expressions. The paper defines primary and secondary connectives, and explains why it is possible to build a lexicon for the compositional ones and how it could be organized. It also puts forward the utility of such a lexicon in discourse annotation and parsing. Finally, it opens the discussion on the constructions that signal a discourse relation between two spans of text.","pages":"30--40","url":"https:\/\/www.aclweb.org\/anthology\/W18-4906","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4907","title":"From {C}hinese Word Segmentation to Extraction of Constructions: Two Sides of the Same Algorithmic Coin","authors":["Colson, Jean-Pierre"],"emails":["jean-pierre.colson@uclouvain.be"],"author_id":["jean-pierre-colson"],"abstract":"This paper presents the results of two experiments carried out within the framework of computational construction grammar. Starting from the constructionist point of view that there are just constructions in language, including lexical ones, we tested the validity of a clustering algorithm that was primarily designed for MWE extraction, the cpr-score (Colson, 2017), on Chinese word segmentation. Our results indicate a striking recall rate of 75 percent without any special adaptation to Chinese or to the lexicon, which confirms that there is some similarity between extracting MWEs and CWS. Our second experiment also suggests that the same methodology might be used for extracting more schematic or abstract constructions, thereby providing evidence for the statistical foundation of construction grammar.","pages":"41--50","url":"https:\/\/www.aclweb.org\/anthology\/W18-4907","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4908","title":"Fixed Similes: Measuring aspects of the relation between {MWE} idiomatic semantics and syntactic flexibility","authors":["Markantonatou, Stella","Kouris, Panagiotis","Maistros, Yanis"],"emails":["stiliani.markantonatou@gmail.com","pkouris@islab.ntua.gr","maistros@cs.ntua.gr"],"author_id":["stella-markantonatou","panagiotis-kouris","yanis-maistros"],"abstract":"We shed light on aspects of the relation between the semantics and the syntactic flexibility of multiword expressions by investigating fixed adjective similes (FS), a predicative multiword expression class not studied in this respect before. We find that only a subset of the syntactic structures observed in the data are related with idiomaticity. We identify and measure two aspects of idiomaticity, one of which seems to allow for predictions about FS syntactic flexibility. Our research draws on a resource developed with the semantic and detailed syntactic annotation of web-retrieved Modern Greek material, indicating frequency of use of the individual similes.","pages":"51--61","url":"https:\/\/www.aclweb.org\/anthology\/W18-4908","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4909","title":"Fine-Grained Termhood Prediction for {G}erman Compound Terms Using Neural Networks","authors":["H{\\\"a}tty, Anna","Schulte im Walde, Sabine"],"emails":["anna.haetty@de.bosch.com","schulte@ims.uni-stuttgart.de"],"author_id":["anna-hatty","sabine-schulte-im-walde"],"abstract":"Automatic term identification and investigating the understandability of terms in a specialized domain are often treated as two separate lines of research. We propose a combined approach for this matter, by defining fine-grained classes of termhood and framing a classification task. The classes reflect tiers of a term{'}s association to a domain. The new setup is applied to German closed compounds as term candidates in the domain of cooking. For the prediction of the classes, we compare several neural network architectures and also take salient information about the compounds{'} components into account. We show that applying a similar class distinction to the compounds{'} components and propagating this information within the network improves the compound class prediction results.","pages":"62--73","url":"https:\/\/www.aclweb.org\/anthology\/W18-4909","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4910","title":"Towards a Computational Lexicon for {M}oroccan {D}arija: Words, Idioms, and Constructions","authors":["Laoudi, Jamal","Bonial, Claire","Donatelli, Lucia","Tratz, Stephen","Voss, Clare"],"emails":["jamal.laoudi.ctr@mail.mil","claire.n.bonial.civ@mail.mil","led66@georgetown.edu","stephen.c.tratz.civ@mail.mil","clare.r.voss.civ@mail.mil"],"author_id":["jamal-laoudi","claire-bonial","lucia-donatelli","stephen-tratz","clare-voss"],"abstract":"In this paper, we explore the challenges of building a computational lexicon for Moroccan Darija (MD), an Arabic dialect spoken by over 32 million people worldwide but which only recently has begun appearing frequently in written form in social media. We raise the question of what belongs in such a lexicon and start by describing our work building traditional word-level lexicon entries with their English translations. We then discuss challenges in translating idiomatic MD text that led to creating multi-word expression lexicon entries whose meanings could not be fully derived from the individual words. Finally, we provide a preliminary exploration of constructions to be considered for inclusion in an MD constructicon by translating examples of English constructions and examining their MD counterparts.","pages":"74--85","url":"https:\/\/www.aclweb.org\/anthology\/W18-4910","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4911","title":"Verbal Multiword Expressions in Basque Corpora","authors":["I{\\~n}urrieta, Uxoa","Aduriz, Itziar","Estarrona, Ainara","Gonzalez-Dios, Itziar","Gurrutxaga, Antton","Urizar, Ruben","Alegria, I{\\~n}aki"],"emails":["usoa.inurrieta@ehu.eus","itziar.aduriz@ub.edu","ainara.estarrona@ehu.eus","itziar.gonzalezd@ehu.eus","a.gurrutxaga@elhuyar.eus","ruben.urizar@ehu.eus","i.alegria@ehu.eus"],"author_id":["uxoa-inurrieta","itziar-aduriz","ainara-estarrona","itziar-gonzalez-dios","antton-gurrutxaga","ruben-urizar","inaki-alegria"],"abstract":"This paper presents a Basque corpus where Verbal Multiword Expressions (VMWEs) were annotated following universal guidelines. Information on the annotation is given, and some ideas for discussion upon the guidelines are also proposed. The corpus is useful not only for NLP-related research, but also to draw conclusions on Basque phraseology in comparison with other languages.","pages":"86--95","url":"https:\/\/www.aclweb.org\/anthology\/W18-4911","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4912","title":"Annotation of Tense and Aspect Semantics for Sentential {AMR}","authors":["Donatelli, Lucia","Regan, Michael","Croft, William","Schneider, Nathan"],"emails":["led66@georgetown.edu","michael.regan@colorado.edu","wcroft@unm.edu","nathan.schneider@georgetown.edu"],"author_id":["lucia-donatelli","michael-regan","william-croft","nathan-schneider"],"abstract":"Although English grammar encodes a number of semantic contrasts with tense and aspect marking, these semantics are currently ignored by Abstract Meaning Representation (AMR) annotations. This paper extends sentence-level AMR to include a coarse-grained treatment of tense and aspect semantics. The proposed framework augments the representation of finite predications to include a four-way temporal distinction (event time before, up to, at, or after speech time) and several aspectual distinctions (including static vs. dynamic, habitual vs. episodic, and telic vs. atelic). This will enable AMR to be used for NLP tasks and applications that require sophisticated reasoning about time and event structure.","pages":"96--108","url":"https:\/\/www.aclweb.org\/anthology\/W18-4912","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4913","title":"A Syntax-Based Scheme for the Annotation and Segmentation of {G}erman Spoken Language Interactions","authors":["Westpfahl, Swantje","Gorisch, Jan"],"emails":["westpfahl@ids-mannheim.de","gorisch@ids-mannheim.de"],"author_id":["swantje-westpfahl","jan-gorisch"],"abstract":"Unlike corpora of written language where segmentation can mainly be derived from orthographic punctuation marks, the basis for segmenting spoken language corpora is not predetermined by the primary data, but rather has to be established by the corpus compilers. This impedes consistent querying and visualization of such data. Several ways of segmenting have been proposed, some of which are based on syntax. In this study, we developed and evaluated annotation and segmentation guidelines in reference to the topological field model for German. We can show that these guidelines are used consistently across annotators. We also investigated the influence of various interactional settings with a rather simple measure, the word-count per segment and unit-type. We observed that the word count and the distribution of each unit type differ in varying interactional settings and that our developed segmentation and annotation guidelines are used consistently across annotators. In conclusion, our syntax-based segmentations reflect interactional properties that are intrinsic to the social interactions that participants are involved in. This can be used for further analysis of social interaction and opens the possibility for automatic segmentation of transcripts.","pages":"109--120","url":"https:\/\/www.aclweb.org\/anthology\/W18-4913","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4914","title":"An Annotated Corpus of Picture Stories Retold by Language Learners","authors":["K{\\\"o}hn, Christine","K{\\\"o}hn, Arne"],"emails":["ckoehn@informatik.uni-hamburg.de","koehn@informatik.uni-hamburg.de"],"author_id":["christine-kohn","arne-kohn"],"abstract":"Corpora with language learner writing usually consist of essays, which are difficult to annotate reliably and to process automatically due to the high degree of freedom and the nature of learner language. We develop a task which mildly constrains learner utterances to facilitate consistent annotation and reliable automatic processing but at the same time does not prime learners with textual information. In this task, learners retell a comic strip. We present the resulting task-based corpus of stories written by learners of German. We designed the corpus to be able to serve multiple purposes: The corpus was manually annotated, including target hypotheses and syntactic structures. We achieve a very high inter-annotator agreement: κ = 0.765 for the annotation of minimal target hypotheses and κ = 0.507 for the extended target hypotheses. We attribute this to the design of our task and the annotation guidelines, which are based on those for the Falko corpus (Reznicek et al., 2012).","pages":"121--132","url":"https:\/\/www.aclweb.org\/anthology\/W18-4914","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4915","title":"Developing and Evaluating Annotation Procedures for Twitter Data during Hazard Events","authors":["Stowe, Kevin","Palmer, Martha","Anderson, Jennings","Kogan, Marina","Palen, Leysia","Anderson, Kenneth M.","Morss, Rebecca","Demuth, Julie","Lazrus, Heather"],"emails":["","","","","","","","",""],"author_id":["kevin-stowe","martha-palmer","jennings-anderson","marina-kogan","leysia-palen","kenneth-m-anderson","rebecca-morss","julie-demuth","heather-lazrus"],"abstract":"When a hazard such as a hurricane threatens, people are forced to make a wide variety of decisions, and the information they receive and produce can influence their own and others{'} actions. As social media grows more popular, an increasing number of people are using social media platforms to obtain and share information about approaching threats and discuss their interpretations of the threat and their protective decisions. This work aims to improve understanding of natural disasters through social media and provide an annotation scheme to identify themes in user{'}s social media behavior and facilitate efforts in supervised machine learning. To that end, this work has three contributions: (1) the creation of an annotation scheme to consistently identify hazard-related themes in Twitter, (2) an overview of agreement rates and difficulties in identifying annotation categories, and (3) a public release of both the dataset and guidelines developed from this scheme.","pages":"133--143","url":"https:\/\/www.aclweb.org\/anthology\/W18-4915","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4916","title":"A Treebank for the Healthcare Domain","authors":["Oinam, Nganthoibi","Mishra, Diwakar","Patel, Pinal","Choudhary, Narayan","Desai, Hitesh"],"emails":["oinam.n@ezdi.us","diwakar.m@ezdi.us","pinal.p@ezdi.us","choudharynarayan@gmail.com","hitesh.d@ezdi.us"],"author_id":["nganthoibi-oinam","diwakar-mishra","pinal-patel","narayan-choudhary","hitesh-desai"],"abstract":"This paper presents a treebank for the healthcare domain developed at ezDI. The treebank is created from a wide array of clinical health record documents across hospitals. The data has been de-identified and annotated for constituent syntactic structure. The treebank contains a total of 52053 sentences that have been sampled for subdomains as well as linguistic variations. The paper outlines the sampling process followed to ensure a better domain representation in the corpus, the annotation process and challenges, and corpus statistics. The Penn Treebank tagset and guidelines were largely followed, but there were many syntactic contexts that warranted adaptation of the guidelines. The treebank created was used to re-train the Berkeley parser and the Stanford parser. These parsers were also trained with the GENIA treebank for comparative quality assessment. Our treebank yielded great-er accuracy on both parsers. Berkeley parser performed better on our treebank with an average F1 measure of 91 across 5-folds. This was a significant jump from the out-of-the-box F1 score of 70 on Berkeley parser{'}s default grammar.","pages":"144--155","url":"https:\/\/www.aclweb.org\/anthology\/W18-4916","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4917","title":"The {RST} {S}panish-{C}hinese Treebank","authors":["Cao, Shuyuan","da Cunha, Iria","Iruskieta, Mikel"],"emails":["shuyuan.cao@hotmail.com","iriad@flog.uned.es","mikel.iruskieta@ehu.eus"],"author_id":["shuyuan-cao","iria-da-cunha","mikel-iruskieta"],"abstract":"Discourse analysis is necessary for different tasks of Natural Language Processing (NLP). As two of the most spoken languages in the world, discourse analysis between Spanish and Chinese is important for NLP research. This paper aims to present the first open Spanish-Chinese parallel corpus annotated with discourse information, whose theoretical framework is based on the Rhetorical Structure Theory (RST). We have evaluated and harmonized each annotation part to obtain a high annotated-quality corpus. The corpus is already available to the public.","pages":"156--166","url":"https:\/\/www.aclweb.org\/anthology\/W18-4917","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4918","title":"All Roads Lead to {UD}: Converting {S}tanford and {P}enn Parses to {E}nglish Universal Dependencies with Multilayer Annotations","authors":["Peng, Siyao","Zeldes, Amir"],"emails":["sp1184@georgetown.edu","amir.zeldes@georgetown.edu"],"author_id":["siyao-peng","amir-zeldes"],"abstract":"We describe and evaluate different approaches to the conversion of gold standard corpus data from Stanford Typed Dependencies (SD) and Penn-style constituent trees to the latest English Universal Dependencies representation (UD 2.2). Our results indicate that pure SD to UD conversion is highly accurate across multiple genres, resulting in around 1.5{\\%} errors, but can be improved further to fewer than 0.5{\\%} errors given access to annotations beyond the pure syntax tree, such as entity types and coreference resolution, which are necessary for correct generation of several UD relations. We show that constituent-based conversion using CoreNLP (with automatic NER) performs substantially worse in all genres, including when using gold constituent trees, primarily due to underspecification of phrasal grammatical functions.","pages":"167--177","url":"https:\/\/www.aclweb.org\/anthology\/W18-4918","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4919","title":"The Other Side of the Coin: Unsupervised Disambiguation of Potentially Idiomatic Expressions by Contrasting Senses","authors":["Haagsma, Hessel","Nissim, Malvina","Bos, Johan"],"emails":["hessel.haagsma@rug.nl","m.nissim@rug.nl","johan.bos@rug.nl"],"author_id":["hessel-haagsma","malvina-nissim","johan-bos"],"abstract":"Disambiguation of potentially idiomatic expressions involves determining the sense of a potentially idiomatic expression in a given context, e.g. determining that make hay in {`}Investment banks made hay while takeovers shone.{'} is used in a figurative sense. This enables automatic interpretation of idiomatic expressions, which is important for applications like machine translation and sentiment analysis. In this work, we present an unsupervised approach for English that makes use of literalisations of idiom senses to improve disambiguation, which is based on the lexical cohesion graph-based method by Sporleder and Li (2009). Experimental results show that, while literalisation carries novel information, its performance falls short of that of state-of-the-art unsupervised methods.","pages":"178--184","url":"https:\/\/www.aclweb.org\/anthology\/W18-4919","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4920","title":"Do Character-Level Neural Network Language Models Capture Knowledge of Multiword Expression Compositionality?","authors":["Hakimi Parizi, Ali","Cook, Paul"],"emails":["ahakimi@unb.ca","paul.cook@unb.ca"],"author_id":["ali-hakimi-parizi","paul-cook"],"abstract":"In this paper, we propose the first model for multiword expression (MWE) compositionality prediction based on character-level neural network language models. Experimental results on two kinds of MWEs (noun compounds and verb-particle constructions) and two languages (English and German) suggest that character-level neural network language models capture knowledge of multiword expression compositionality, in particular for English noun compounds and the particle component of English verb-particle constructions. In contrast to many other approaches to MWE compositionality prediction, this character-level approach does not require token-level identification of MWEs in a training corpus, and can potentially predict the compositionality of out-of-vocabulary MWEs.","pages":"185--192","url":"https:\/\/www.aclweb.org\/anthology\/W18-4920","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4921","title":"Constructing an Annotated Corpus of Verbal {MWE}s for {E}nglish","authors":["Walsh, Abigail","Bonial, Claire","Geeraert, Kristina","McCrae, John P.","Schneider, Nathan","Somers, Clarissa"],"emails":["abigail.walsh@adaptcentre.ie","claire.n.bonial.civ@mail.mil","geeraert@ualberta.ca","john.mccrae@insight-centre.org","nathan.schneider@georgetown.edu",""],"author_id":["abigail-walsh","claire-bonial","kristina-geeraert","john-philip-mccrae","nathan-schneider","clarissa-somers"],"abstract":"This paper describes the construction and annotation of a corpus of verbal MWEs for English, as part of the PARSEME Shared Task 1.1 on automatic identification of verbal MWEs. The criteria for corpus selection, the categories of MWEs used, and the training process are discussed, along with the particular issues that led to revisions in edition 1.1 of the annotation guidelines. Finally, an overview of the characteristics of the final annotated corpus is presented, as well as some discussion on inter-annotator agreement.","pages":"193--200","url":"https:\/\/www.aclweb.org\/anthology\/W18-4921","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4922","title":"Cooperating Tools for {MWE} Lexicon Management and Corpus Annotation","authors":["Matsumoto, Yuji","Kato, Akihiko","Shindo, Hiroyuki","Morita, Toshio"],"emails":["matsu@is.naist.jp","kato.akihiko.ju6@is.naist.jp","shindo@is.naist.jp","morita@sowa.com"],"author_id":["yuji-matsumoto","akihiko-kato","hiroyuki-shindo","toshio-morita"],"abstract":"We present tools for lexicon and corpus management that offer cooperating functionality in corpus annotation. The former, named Cradle, stores a set of words and expressions where multi-word expressions are defined with their own part-of-speech information and internal syntactic structures. The latter, named ChaKi, manages text corpora with part-of-speech (POS) and syntactic dependency structure annotations. Those two tools cooperate so that the words and multi-word expressions stored in Cradle are directly referred to by ChaKi in conducting corpus annotation, and the words and expressions annotated in ChaKi can be output as a list of lexical entities that are to be stored in Cradle.","pages":"201--206","url":"https:\/\/www.aclweb.org\/anthology\/W18-4922","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4923","title":"{``}Fingers in the Nose{''}: Evaluating Speakers{'} Identification of Multi-Word Expressions Using a Slightly Gamified Crowdsourcing Platform","authors":["Fort, Kar{\\\"e}n","Guillaume, Bruno","Constant, Matthieu","Lef{\\`e}bvre, Nicolas","Pilatte, Yann-Alan"],"emails":["karen.fort@sorbonne-universite.fr","bruno.guillaume@inria.fr","onstant@univ-lorraine.fr","nicolas.lefebvre@inria.fr","yann-alan.pilatte@etu.sorbonne-universite.fr"],"author_id":["karen-fort","bruno-guillaume","matthieu-constant","nicolas-lefebvre","yann-alan-pilatte"],"abstract":"This article presents the results we obtained in crowdsourcing French speakers{'} intuition concerning multi-work expressions (MWEs). We developed a slightly gamified crowdsourcing platform, part of which is designed to test users{'} ability to identify MWEs with no prior training. The participants perform relatively well at the task, with a recall reaching 65{\\%} for MWEs that do not behave as function words.","pages":"207--213","url":"https:\/\/www.aclweb.org\/anthology\/W18-4923","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4924","title":"Improving Domain Independent Question Parsing with Synthetic Treebanks","authors":["Boukaram, Halim-Antoine","Habash, Nizar","Ziadee, Micheline","Sakr, Majd"],"emails":["hboukaram@aust.edu.lb","nizar.habash@nyu.edu","mziadee@aust.edu.lb","msakr@cs.cmu.edu"],"author_id":["halim-antoine-boukaram","nizar-habash","micheline-ziadee","majd-sakr"],"abstract":"Automatic syntactic parsing for question constructions is a challenging task due to the paucity of training examples in most treebanks. The near absence of question constructions is due to the dominance of the news domain in treebanking efforts. In this paper, we compare two synthetic low-cost question treebank creation methods with a conventional manual high-cost annotation method in the context of three domains (news questions, political talk shows, and chatbots) for Modern Standard Arabic, a language with relatively low resources and rich morphology. Our results show that synthetic methods can be effective at significantly reducing parsing errors for a target domain without having to invest large resources on manual annotation; and the combination of manual and synthetic methods is our best domain-independent performer.","pages":"214--221","url":"https:\/\/www.aclweb.org\/anthology\/W18-4924","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4925","title":"Edition 1.1 of the {PARSEME} Shared Task on Automatic Identification of Verbal Multiword Expressions","authors":["Ramisch, Carlos","Cordeiro, Silvio Ricardo","Savary, Agata","Vincze, Veronika","Barbu Mititelu, Verginica","Bhatia, Archna","Buljan, Maja","Candito, Marie","Gantar, Polona","Giouli, Voula","G{\\\"u}ng{\\\"o}r, Tunga","Hawwari, Abdelati","I{\\~n}urrieta, Uxoa","Kovalevskait{\\.e}, Jolanta","Krek, Simon","Lichte, Timm","Liebeskind, Chaya","Monti, Johanna","Parra Escart{\\'\\i}n, Carla","QasemiZadeh, Behrang","Ramisch, Renata","Schneider, Nathan","Stoyanova, Ivelina","Vaidya, Ashwini","Walsh, Abigail"],"emails":["","","","","","","","","","","","","","","","","","","","","","","","",""],"author_id":["carlos-ramisch","silvio-cordeiro","agata-savary","veronika-vincze","verginica-barbu-mititelu","archna-bhatia","maja-buljan","marie-candito","polona-gantar","voula-giouli","tunga-gungor","abdelati-hawwari","uxoa-inurrieta","jolanta-kovalevskaite","simon-krek","timm-lichte","chaya-liebeskind","johanna-monti","carla-parra-escartin","behrang-qasemizadeh","renata-ramisch","nathan-schneider","ivelina-stoyanova","ashwini-vaidya","abigail-walsh"],"abstract":"This paper describes the PARSEME Shared Task 1.1 on automatic identification of verbal multiword expressions. We present the annotation methodology, focusing on changes from last year{'}s shared task. Novel aspects include enhanced annotation guidelines, additional annotated data for most languages, corpora for some new languages, and new evaluation settings. Corpora were created for 20 languages, which are also briefly discussed. We report organizational principles behind the shared task and the evaluation metrics employed for ranking. The 17 participating systems, their methods and obtained results are also presented and analysed.","pages":"222--240","url":"https:\/\/www.aclweb.org\/anthology\/W18-4925","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4926","title":"{CRF}-Seq and {CRF}-{D}ep{T}ree at {PARSEME} Shared Task 2018: Detecting Verbal {MWE}s using Sequential and Dependency-Based Approaches","authors":["Moreau, Erwan","Alsulaimani, Ashjan","Maldonado, Alfredo","Vogel, Carl"],"emails":["erwan.moreau@adaptcentre.ie","alsulaia@tcd.ie","alfredo.maldonado@adaptcentre.ie","vogel@scss.tcd.ie"],"author_id":["erwan-moreau","ashjan-alsulaimani","alfredo-maldonado","carl-vogel"],"abstract":"This paper describes two systems for detecting Verbal Multiword Expressions (VMWEs) which both competed in the closed track at the PARSEME VMWE Shared Task 2018. CRF-DepTree-categs implements an approach based on the dependency tree, intended to exploit the syntactic and semantic relations between tokens; CRF-Seq-nocategs implements a robust sequential method which requires only lemmas and morphosyntactic tags. Both systems ranked in the top half of the ranking, the latter ranking second for token-based evaluation. The code for both systems is published under the GNU General Public License version 3.0 and is available at \\url{http:\/\/github.com\/erwanm\/adapt-vmwe18}.","pages":"241--247","url":"https:\/\/www.aclweb.org\/anthology\/W18-4926","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4927","title":"Deep-{BGT} at {PARSEME} Shared Task 2018: Bidirectional {LSTM}-{CRF} Model for Verbal Multiword Expression Identification","authors":["Berk, G{\\\"o}zde","Erden, Berna","G{\\\"u}ng{\\\"o}r, Tunga"],"emails":["gozde.berk@boun.edu.tr","berna.erden@boun.edu.tr","gungort@boun.edu.tr"],"author_id":["gozde-berk","berna-erden","tunga-gungor"],"abstract":"This paper describes the Deep-BGT system that participated to the PARSEME shared task 2018 on automatic identification of verbal multiword expressions (VMWEs). Our system is language-independent and uses the bidirectional Long Short-Term Memory model with a Conditional Random Field layer on top (bidirectional LSTM-CRF). To the best of our knowledge, this paper is the first one that employs the bidirectional LSTM-CRF model for VMWE identification. Furthermore, the gappy 1-level tagging scheme is used for discontiguity and overlaps. Our system was evaluated on 10 languages in the open track and it was ranked the second in terms of the general ranking metric.","pages":"248--253","url":"https:\/\/www.aclweb.org\/anthology\/W18-4927","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4928","title":"{GBD}-{NER} at {PARSEME} Shared Task 2018: Multi-Word Expression Detection Using Bidirectional Long-Short-Term Memory Networks and Graph-Based Decoding","authors":["Boros, Tiberiu","Burtica, Ruxandra"],"emails":["boros@adobe.com","burtica@adobe.com"],"author_id":["tiberiu-boros","ruxandra-burtica"],"abstract":"This paper addresses the issue of multi-word expression (MWE) detection by employing a new decoding strategy inspired after graph-based parsing. We show that this architecture achieves state-of-the-art results with minimum feature-engineering, just by relying on lexicalized and morphological attributes. We validate our approach in a multilingual setting, using standard MWE corpora supplied in the PARSEME Shared Task.","pages":"254--260","url":"https:\/\/www.aclweb.org\/anthology\/W18-4928","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4929","title":"{M}umpitz at {PARSEME} Shared Task 2018: A Bidirectional {LSTM} for the Identification of Verbal Multiword Expressions","authors":["Ehren, Rafael","Lichte, Timm","Samih, Younes"],"emails":["ehren@phil.hhu.de","lichte@phil.hhu.de","samih@phil.hhu.de"],"author_id":["rafael-ehren","timm-lichte","younes-samih"],"abstract":"In this paper, we describe Mumpitz, the system we submitted to the PARSEME Shared task on automatic identification of verbal multiword expressions (VMWEs). Mumpitz consists of a Bidirectional Recurrent Neural Network (BRNN) with Long Short-Term Memory (LSTM) units and a heuristic that leverages the dependency information provided in the PARSEME corpus data to differentiate VMWEs in a sentence. We submitted results for seven languages in the closed track of the task and for one language in the open track. For the open track we used the same system, but with pretrained instead of randomly initialized word embeddings to improve the system performance.","pages":"261--267","url":"https:\/\/www.aclweb.org\/anthology\/W18-4929","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4930","title":"{TRAPACC} and {TRAPACCS} at {PARSEME} Shared Task 2018: Neural Transition Tagging of Verbal Multiword Expressions","authors":["Stodden, Regina","QasemiZadeh, Behrang","Kallmeyer, Laura"],"emails":["regina.stodden@hhu.de","zadeh@phil.hhu.de","kallmeyer@phil.hhu.de"],"author_id":["regina-stodden","behrang-qasemizadeh","laura-kallmeyer"],"abstract":"We describe the TRAPACC system and its variant TRAPACCS that participated in the closed track of the PARSEME Shared Task 2018 on labeling verbal multiword expressions (VMWEs). TRAPACC is a modified arc-standard transition system based on Constant and Nivre{'}s (2016) model of joint syntactic and lexical analysis in which the oracle is approximated using a classifier. For TRAPACC, the classifier consists of a data-independent dimension reduction and a convolutional neural network (CNN) for learning and labelling transitions. TRAPACCS extends TRAPACC by replacing the softmax layer of the CNN with a support vector machine (SVM). We report the results obtained for 19 languages, for 8 of which our system yields the best results compared to other participating systems in the closed-track of the shared task.","pages":"268--274","url":"https:\/\/www.aclweb.org\/anthology\/W18-4930","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4931","title":"{TRAVERSAL} at {PARSEME} Shared Task 2018: Identification of Verbal Multiword Expressions Using a Discriminative Tree-Structured Model","authors":["Waszczuk, Jakub"],"emails":["waszczuk@phil.hhu.de"],"author_id":["jakub-waszczuk"],"abstract":"This paper describes a system submitted to the closed track of the PARSEME shared task (edition 1.1) on automatic identification of verbal multiword expressions (VMWEs). The system represents VMWE identification as a labeling task where one of two labels (MWE or not-MWE) must be predicted for each node in the dependency tree based on local context, including adjacent nodes and their labels. The system relies on multiclass logistic regression to determine the globally optimal labeling of a tree. The system ranked 1st in the general cross-lingual ranking of the closed track systems, according to both official evaluation measures: MWE-based F1 and token-based F1.","pages":"275--282","url":"https:\/\/www.aclweb.org\/anthology\/W18-4931","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4932","title":"{V}ar{IDE} at {PARSEME} Shared Task 2018: Are Variants Really as Alike as Two Peas in a Pod?","authors":["Pasquer, Caroline","Ramisch, Carlos","Savary, Agata","Antoine, Jean-Yves"],"emails":["","","",""],"author_id":["caroline-pasquer","carlos-ramisch","agata-savary","jean-yves-antoine"],"abstract":"We describe the VarIDE system (standing for Variant IDEntification) which participated in the edition 1.1 of the PARSEME shared task on automatic identification of verbal multiword expressions (VMWEs). Our system focuses on the task of VMWE variant identification by using morphosyntactic information in the training data to predict if candidates extracted from the test corpus could be idiomatic, thanks to a naive Bayes classifier. We report results for 19 languages.","pages":"283--289","url":"https:\/\/www.aclweb.org\/anthology\/W18-4932","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"},{"id":"W18-4933","title":"{V}eyn at {PARSEME} Shared Task 2018: Recurrent Neural Networks for {VMWE} Identification","authors":["Zampieri, Nicolas","Scholivet, Manon","Ramisch, Carlos","Favre, Benoit"],"emails":["nicolas.zampieri@etu.univ-amu.fr","manon.scholivet@lis-lab.fr","carlos.ramisch@lis-lab.fr","benoit.favre@lis-lab.fr"],"author_id":["nicolas-zampieri","manon-scholivet","carlos-ramisch","benoit-favre"],"abstract":"This paper describes the Veyn system, submitted to the closed track of the PARSEME Shared Task 2018 on automatic identification of verbal multiword expressions (VMWEs). Veyn is based on a sequence tagger using recurrent neural networks. We represent VMWEs using a variant of the begin-inside-outside encoding scheme combined with the VMWE category tag. In addition to the system description, we present development experiments to determine the best tagging scheme. Veyn is freely available, covers 19 languages, and was ranked ninth (MWE-based) and eight (Token-based) among 13 submissions, considering macro-averaged F1 across languages.","pages":"290--296","url":"https:\/\/www.aclweb.org\/anthology\/W18-4933","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the Joint Workshop on Linguistic Annotation, Multiword Expressions and Constructions ({LAW}-{MWE}-{C}x{G}-2018)"}]