[{"id":"W18-1201","title":"Morphological Word Embeddings for {A}rabic Neural Machine Translation in Low-Resource Settings","authors":["Shapiro, Pamela","Duh, Kevin"],"emails":["pshapiro@jhu.edu","kevinduh@cs.jhu.edu"],"author_id":["pamela-shapiro","kevin-duh"],"abstract":"Neural machine translation has achieved impressive results in the last few years, but its success has been limited to settings with large amounts of parallel data. One way to improve NMT for lower-resource settings is to initialize a word-based NMT model with pretrained word embeddings. However, rare words still suffer from lower quality word embeddings when trained with standard word-level objectives. We introduce word embeddings that utilize morphological resources, and compare to purely unsupervised alternatives. We work with Arabic, a morphologically rich language with available linguistic resources, and perform Ar-to-En MT experiments on a small corpus of TED subtitles. We find that word embeddings utilizing subword information consistently outperform standard word embeddings on a word similarity task and as initialization of the source word embeddings in a low-resource NMT system.","pages":"1--11","doi":"10.18653\/v1\/W18-1201","url":"https:\/\/www.aclweb.org\/anthology\/W18-1201","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1202","title":"Entropy-Based Subword Mining with an Application to Word Embeddings","authors":["El-Kishky, Ahmed","Xu, Frank","Zhang, Aston","Macke, Stephen","Han, Jiawei"],"emails":["elkishk2@illinois.edu","frankxu@sjtu.edu.cn","astonz@amazon.com","smacke@illinois.edu","hanj@illinois.edu"],"author_id":["ahmed-el-kishky","frank-f-xu","aston-zhang","stephen-macke","jiawei-han"],"abstract":"Recent literature has shown a wide variety of benefits to mapping traditional one-hot representations of words and phrases to lower-dimensional real-valued vectors known as word embeddings. Traditionally, most word embedding algorithms treat each word as the finest meaningful semantic granularity and perform embedding by learning distinct embedding vectors for each word. Contrary to this line of thought, technical domains such as scientific and medical literature compose words from subword structures such as prefixes, suffixes, and root-words as well as compound words. Treating individual words as the finest-granularity unit discards meaningful shared semantic structure between words sharing substructures. This not only leads to poor embeddings for text corpora that have long-tail distributions, but also heuristic methods for handling out-of-vocabulary words. In this paper we propose SubwordMine, an entropy-based subword mining algorithm that is fast, unsupervised, and fully data-driven. We show that this allows for great cross-domain performance in identifying semantically meaningful subwords. We then investigate utilizing the mined subwords within the FastText embedding model and compare performance of the learned representations in a downstream language modeling task.","pages":"12--21","doi":"10.18653\/v1\/W18-1202","url":"https:\/\/www.aclweb.org\/anthology\/W18-1202","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1203","title":"A Comparison of Character Neural Language Model and Bootstrapping for Language Identification in Multilingual Noisy Texts","authors":["Adouane, Wafia","Dobnik, Simon","Bernardy, Jean-Philippe","Semmar, Nasredine"],"emails":["wafia.adouane@gu.se","simon.dobnik@gu.se","jean-philippe.bernardy@gu.se","nasredine.semmar@cea.fr"],"author_id":["wafia-adouane","simon-dobnik","jean-philippe-bernardy","nasredine-semmar"],"abstract":"This paper seeks to examine the effect of including background knowledge in the form of character pre-trained neural language model (LM), and data bootstrapping to overcome the problem of unbalanced limited resources. As a test, we explore the task of language identification in mixed-language short non-edited texts with an under-resourced language, namely the case of Algerian Arabic for which both labelled and unlabelled data are limited. We compare the performance of two traditional machine learning methods and a deep neural networks (DNNs) model. The results show that overall DNNs perform better on labelled data for the majority categories and struggle with the minority ones. While the effect of the untokenised and unlabelled data encoded as LM differs for each category, bootstrapping, however, improves the performance of all systems and all categories. These methods are language independent and could be generalised to other under-resourced languages for which a small labelled data and a larger unlabelled data are available.","pages":"22--31","doi":"10.18653\/v1\/W18-1203","url":"https:\/\/www.aclweb.org\/anthology\/W18-1203","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1204","title":"Addressing Low-Resource Scenarios with Character-aware Embeddings","authors":["Papay, Sean","Pad{\\'o}, Sebastian","Vu, Ngoc Thang"],"emails":["sean.papay@ims.uni-stuttgart.de","pado@ims.uni-stuttgart.de","thangvu@ims.uni-stuttgart.de"],"author_id":["sean-papay","sebastian-pado","ngoc-thang-vu"],"abstract":"Most modern approaches to computing word embeddings assume the availability of text corpora with billions of words. In this paper, we explore a setup where only corpora with millions of words are available, and many words in any new text are out of vocabulary. This setup is both of practical interests {--} modeling the situation for specific domains and low-resource languages {--} and of psycholinguistic interest, since it corresponds much more closely to the actual experiences and challenges of human language learning and use. We compare standard skip-gram word embeddings with character-based embeddings on word relatedness prediction. Skip-grams excel on large corpora, while character-based embeddings do well on small corpora generally and rare and complex words specifically. The models can be combined easily.","pages":"32--37","doi":"10.18653\/v1\/W18-1204","url":"https:\/\/www.aclweb.org\/anthology\/W18-1204","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1205","title":"Subword-level Composition Functions for Learning Word Embeddings","authors":["Li, Bofang","Drozd, Aleksandr","Liu, Tao","Du, Xiaoyong"],"emails":["1libofang@ruc.edu.cn","2alex@smg.is.titech.ac.jp","3tliu@ruc.edu.cn","4duyong@ruc.edu.cn"],"author_id":["bofang-li","aleksandr-drozd","tao-liu","xiaoyong-du"],"abstract":"Subword-level information is crucial for capturing the meaning and morphology of words, especially for out-of-vocabulary entries. We propose CNN- and RNN-based subword-level composition functions for learning word embeddings, and systematically compare them with popular word-level and subword-level models (Skip-Gram and FastText). Additionally, we propose a hybrid training scheme in which a pure subword-level model is trained jointly with a conventional word-level embedding model based on lookup-tables. This increases the fitness of all types of subword-level word embeddings; the word-level embeddings can be discarded after training, leaving only compact subword-level representation with much smaller data volume. We evaluate these embeddings on a set of intrinsic and extrinsic tasks, showing that subword-level models have advantage on tasks related to morphology and datasets with high OOV rate, and can be combined with other types of embeddings.","pages":"38--48","doi":"10.18653\/v1\/W18-1205","url":"https:\/\/www.aclweb.org\/anthology\/W18-1205","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1206","title":"Discovering Phonesthemes with Sparse Regularization","authors":["Liu, Nelson F.","Levow, Gina-Anne","Smith, Noah A."],"emails":["nfliu@cs.washington.edu","levow@uw.edu","nasmith@cs.washington.edu"],"author_id":["nelson-f-liu","gina-anne-levow","noah-a-smith"],"abstract":"We introduce a simple method for extracting non-arbitrary form-meaning representations from a collection of semantic vectors. We treat the problem as one of feature selection for a model trained to predict word vectors from subword features. We apply this model to the problem of automatically discovering phonesthemes, which are submorphemic sound clusters that appear in words with similar meaning. Many of our model-predicted phonesthemes overlap with those proposed in the linguistics literature, and we validate our approach with human judgments.","pages":"49--54","doi":"10.18653\/v1\/W18-1206","url":"https:\/\/www.aclweb.org\/anthology\/W18-1206","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1207","title":"Meaningless yet meaningful: Morphology grounded subword-level {NMT}","authors":["Banerjee, Tamali","Bhattacharyya, Pushpak"],"emails":["tamali@cse.iitb.ac.in","pb@cse.iitb.ac.in"],"author_id":["tamali-banerjee","pushpak-bhattacharyya"],"abstract":"We explore the use of two independent subsystems Byte Pair Encoding (BPE) and Morfessor as basic units for subword-level neural machine translation (NMT). We show that, for linguistically distant language-pairs Morfessor-based segmentation algorithm produces significantly better quality translation than BPE. However, for close language-pairs BPE-based subword-NMT may translate better than Morfessor-based subword-NMT. We propose a combined approach of these two segmentation algorithms Morfessor-BPE (M-BPE) which outperforms these two baseline systems in terms of BLEU score. Our results are supported by experiments on three language-pairs: English-Hindi, Bengali-Hindi and English-Bengali.","pages":"55--60","doi":"10.18653\/v1\/W18-1207","url":"https:\/\/www.aclweb.org\/anthology\/W18-1207","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1208","title":"Fast Query Expansion on an Accounting Corpus using Sub-Word Embeddings","authors":["Ganu, Hrishikesh","P., Viswa Datha"],"emails":["hrishikeshvganu@gmail.com","mail@vishwa.be"],"author_id":["hrishikesh-ganu","viswa-datha-p"],"abstract":"We present early results from a system under development which uses sub-word embeddings for query expansion in presence of mis-spelled words and other aberrations. We work for a company which creates accounting software and the end goal is to improve customer experience when they search for help on our {``}Customer Care{''} portal. Our customers use colloquial language, non-standard acronyms and sometimes mis-spell words when they use our Search portal or interact over other channels. However, our Knowledge Base has curated content which leverages technical terms and is in language which is quite formal. This results in the answer not being retrieved even though the answer might actually be present in the documentation (as assessed by a human). We address this problem by creating equivalence classes of words with similar meanings (with the additional property that the mappings to these equivalence classes are robust to mis-spellings) using sub-word embeddings and then use them to fine tune an Elasticsearch index to improve recall. We demonstrate through an end-end system that using sub-word embeddings leads to a significant lift in correct answers retrieved for an accounting corpus available in the public domain.","pages":"61--65","doi":"10.18653\/v1\/W18-1208","url":"https:\/\/www.aclweb.org\/anthology\/W18-1208","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1209","title":"Incorporating Subword Information into Matrix Factorization Word Embeddings","authors":["Salle, Alexandre","Villavicencio, Aline"],"emails":["alex@alexsalle.com","avillavicencio@inf.ufrgs.br"],"author_id":["alexandre-salle","aline-villavicencio"],"abstract":"The positive effect of adding subword information to word embeddings has been demonstrated for predictive models. In this paper we investigate whether similar benefits can also be derived from incorporating subwords into counting models. We evaluate the impact of different types of subwords (n-grams and unsupervised morphemes), with results confirming the importance of subword information in learning representations of rare and out-of-vocabulary words.","pages":"66--71","doi":"10.18653\/v1\/W18-1209","url":"https:\/\/www.aclweb.org\/anthology\/W18-1209","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"},{"id":"W18-1210","title":"A Multi-Context Character Prediction Model for a Brain-Computer Interface","authors":["Dudy, Shiran","Xu, Shaobin","Bedrick, Steven","Smith, David"],"emails":["dudy@ohsu.edu","shaobinx@ccs.neu.edu","bedricks@ohsu.edu","dasmith@ccs.neu.edu"],"author_id":["shiran-dudy","shaobin-xu","steven-bedrick","david-a-smith"],"abstract":"Brain-computer interfaces and other augmentative and alternative communication devices introduce language-modeing challenges distinct from other character-entry methods. In particular, the acquired signal of the EEG (electroencephalogram) signal is noisier, which, in turn, makes the user intent harder to decipher. In order to adapt to this condition, we propose to maintain ambiguous history for every time step, and to employ, apart from the character language model, word information to produce a more robust prediction system. We present preliminary results that compare this proposed Online-Context Language Model (OCLM) to current algorithms that are used in this type of setting. Evaluation on both perplexity and predictive accuracy demonstrates promising results when dealing with ambiguous histories in order to provide to the front end a distribution of the next character the user might type.","pages":"72--77","doi":"10.18653\/v1\/W18-1210","url":"https:\/\/www.aclweb.org\/anthology\/W18-1210","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Subword\/Character {LE}vel Models"}]