[{"id":"W18-5201","title":"Argumentative Link Prediction using Residual Networks and Multi-Objective Learning","authors":["Galassi, Andrea","Lippi, Marco","Torroni, Paolo"],"emails":["a.galassi@unibo.it","marco.lippi@unimore.it","paolo.torroni@unibo.it"],"author_id":["andrea-galassi","marco-lippi","paolo-torroni"],"abstract":"We explore the use of residual networks for argumentation mining, with an emphasis on link prediction. We propose a domain-agnostic method that makes no assumptions on document or argument structure. We evaluate our method on a challenging dataset consisting of user-generated comments collected from an online platform. Results show that our model outperforms an equivalent deep network and offers results comparable with state-of-the-art methods that rely on domain knowledge.","pages":"1--10","doi":"10.18653\/v1\/W18-5201","url":"https:\/\/www.aclweb.org\/anthology\/W18-5201","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5202","title":"End-to-End Argument Mining for Discussion Threads Based on Parallel Constrained Pointer Architecture","authors":["Morio, Gaku","Fujita, Katsuhide"],"emails":["morio@katfuji.lab.tuat.ac.jp","katfuji@cc.tuat.ac.jp"],"author_id":["gaku-morio","katsuhide-fujita"],"abstract":"Argument Mining (AM) is a relatively recent discipline, which concentrates on extracting claims or premises from discourses, and inferring their structures. However, many existing works do not consider micro-level AM studies on discussion threads sufficiently.","pages":"11--21","doi":"10.18653\/v1\/W18-5202","url":"https:\/\/www.aclweb.org\/anthology\/W18-5202","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5203","title":"{A}rgumin{S}ci: A Tool for Analyzing Argumentation and Rhetorical Aspects in Scientific Writing","authors":["Lauscher, Anne","Glava{\\v{s}}, Goran","Eckert, Kai"],"emails":["anne@informatik.uni-mannheim.de","goran@informatik.uni-mannheim.de","eckert@hdm-stuttgart.de"],"author_id":["anne-lauscher","goran-glavas","kai-eckert"],"abstract":"Argumentation is arguably one of the central features of scientific language. We present \\textit{ArguminSci}, an easy-to-use tool that analyzes argumentation and other rhetorical aspects of scientific writing, which we collectively dub \\textit{scitorics}. The main aspect we focus on is the fine-grained argumentative analysis of scientific text through identification of argument components. The functionality of \\textit{ArguminSci} is accessible via three interfaces: as a command line tool, via a RESTful application programming interface, and as a web application.","pages":"22--28","doi":"10.18653\/v1\/W18-5203","url":"https:\/\/www.aclweb.org\/anthology\/W18-5203","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5204","title":"Evidence Type Classification in Randomized Controlled Trials","authors":["Mayer, Tobias","Cabrio, Elena","Villata, Serena"],"emails":["tmayer@i3s.unice.fr","cabrio@i3s.unice.fr","villata@i3s.unice.fr"],"author_id":["tobias-mayer","elena-cabrio","serena-villata"],"abstract":"Randomized Controlled Trials (RCT) are a common type of experimental studies in the medical domain for evidence-based decision making. The ability to automatically extract the \\textit{arguments} proposed therein can be of valuable support for clinicians and practitioners in their daily evidence-based decision making activities. Given the peculiarity of the medical domain and the required level of detail, standard approaches to argument component detection in \\textit{argument(ation) mining} are not fine-grained enough to support such activities. In this paper, we introduce a new sub-task of the argument component identification task: \\textit{evidence type classification}. To address it, we propose a supervised approach and we test it on a set of RCT abstracts on different medical topics.","pages":"29--34","doi":"10.18653\/v1\/W18-5204","url":"https:\/\/www.aclweb.org\/anthology\/W18-5204","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5205","title":"Predicting the Usefulness of {A}mazon Reviews Using Off-The-Shelf Argumentation Mining","authors":["Passon, Marco","Lippi, Marco","Serra, Giuseppe","Tasso, Carlo"],"emails":["marco.passon@spes.uniud.it","marco.lippi@unimore.it","giuseppe.serra@uniud.it","carlo.tasso@uniud.it"],"author_id":["marco-passon","marco-lippi","giuseppe-serra","carlo-tasso"],"abstract":"Internet users generate content at unprecedented rates. Building intelligent systems capable of discriminating useful content within this ocean of information is thus becoming a urgent need. In this paper, we aim to predict the usefulness of Amazon reviews, and to do this we exploit features coming from an off-the-shelf argumentation mining system. We argue that the usefulness of a review, in fact, is strictly related to its argumentative content, whereas the use of an already trained system avoids the costly need of relabeling a novel dataset. Results obtained on a large publicly available corpus support this hypothesis.","pages":"35--39","doi":"10.18653\/v1\/W18-5205","url":"https:\/\/www.aclweb.org\/anthology\/W18-5205","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5206","title":"An Argument-Annotated Corpus of Scientific Publications","authors":["Lauscher, Anne","Glava{\\v{s}}, Goran","Ponzetto, Simone Paolo"],"emails":["anne@informatik.uni-mannheim.de","goran@informatik.uni-mannheim.de","simone@informatik.uni-mannheim.de"],"author_id":["anne-lauscher","goran-glavas","simone-paolo-ponzetto"],"abstract":"Argumentation is an essential feature of scientific language. We present an annotation study resulting in a corpus of scientific publications annotated with argumentative components and relations. The argumentative annotations have been added to the existing Dr. Inventor Corpus, already annotated for four other rhetorical aspects. We analyze the annotated argumentative structures and investigate the relations between argumentation and other rhetorical aspects of scientific writing, such as discourse roles and citation contexts.","pages":"40--46","doi":"10.18653\/v1\/W18-5206","url":"https:\/\/www.aclweb.org\/anthology\/W18-5206","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5207","title":"Annotating Claims in the Vaccination Debate","authors":["Torsi, Benedetta","Morante, Roser"],"emails":["b.torsi@student.vu.nl","r.morantevallejo@vu.nl"],"author_id":["benedetta-torsi","roser-morante"],"abstract":"In this paper we present annotation experiments with three different annotation schemes for the identification of argument components in texts related to the vaccination debate. Identifying claims about vaccinations made by participants in the debate is of great societal interest, as the decision to vaccinate or not has impact in public health and safety. Since most corpora that have been annotated with argumentation information contain texts that belong to a specific genre and have a well defined argumentation structure, we needed to adjust the annotation schemes to our corpus, which contains heterogeneous texts from the Web. We started with a complex annotation scheme that had to be simplified due to low IAA. In our final experiment, which focused on annotating claims, annotators reached 57.3{\\%} IAA.","pages":"47--56","doi":"10.18653\/v1\/W18-5207","url":"https:\/\/www.aclweb.org\/anthology\/W18-5207","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5208","title":"Argument Component Classification for Classroom Discussions","authors":["Lugini, Luca","Litman, Diane"],"emails":["lul32@pitt.edu","dlitman@pitt.edu"],"author_id":["luca-lugini","diane-litman"],"abstract":"This paper focuses on argument component classification for transcribed spoken classroom discussions, with the goal of automatically classifying student utterances into claims, evidence, and warrants.","pages":"57--67","doi":"10.18653\/v1\/W18-5208","url":"https:\/\/www.aclweb.org\/anthology\/W18-5208","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5209","title":"Evidence Types, Credibility Factors, and Patterns or Soft Rules for Weighing Conflicting Evidence: Argument Mining in the Context of Legal Rules Governing Evidence Assessment","authors":["Walker, Vern R.","Foerster, Dina","Ponce, Julia Monica","Rosen, Matthew"],"emails":["","","",""],"author_id":["vern-walker","dina-foerster","julia-monica-ponce","matthew-rosen"],"abstract":"This paper reports on the results of an empirical study of adjudicatory decisions about veterans{'} claims for disability benefits in the United States. It develops a typology of kinds of relevant evidence (argument premises) employed in cases, and it identifies factors that the tribunal considers when assessing the credibility or trustworthiness of individual items of evidence. It also reports on patterns or {``}soft rules{''} that the tribunal uses to comparatively weigh the probative value of conflicting evidence. These evidence types, credibility factors, and comparison patterns are developed to be inter-operable with legal rules governing the evidence assessment process in the U.S. This approach should be transferable to other legal and non-legal domains.","pages":"68--78","doi":"10.18653\/v1\/W18-5209","url":"https:\/\/www.aclweb.org\/anthology\/W18-5209","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5210","title":"Feasible Annotation Scheme for Capturing Policy Argument Reasoning using Argument Templates","authors":["Reisert, Paul","Inoue, Naoya","Kuribayashi, Tatsuki","Inui, Kentaro"],"emails":["paul.reisert@riken.jp","naoya-i@ecei.tohoku.ac.jp","kuribayashi@ecei.tohoku.ac.jp","inui@ecei.tohoku.ac.jp"],"author_id":["paul-reisert","naoya-inoue","tatsuki-kuribayashi","kentaro-inui"],"abstract":"Most of the existing works on argument mining cast the problem of argumentative structure identification as classification tasks (e.g. attack-support relations, stance, explicit premise\/claim).","pages":"79--89","doi":"10.18653\/v1\/W18-5210","url":"https:\/\/www.aclweb.org\/anthology\/W18-5210","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5211","title":"Frame- and Entity-Based Knowledge for Common-Sense Argumentative Reasoning","authors":["Botschen, Teresa","Sorokin, Daniil","Gurevych, Iryna"],"emails":["","",""],"author_id":["teresa-botschen","daniil-sorokin","iryna-gurevych"],"abstract":"Common-sense argumentative reasoning is a challenging task that requires holistic understanding of the argumentation where external knowledge about the world is hypothesized to play a key role. We explore the idea of using event knowledge about prototypical situations from FrameNet and fact knowledge about concrete entities from Wikidata to solve the task. We find that both resources can contribute to an improvement over the non-enriched approach and point out two persisting challenges: first, integration of many annotations of the same type, and second, fusion of complementary annotations. After our explorations, we question the key role of external world knowledge with respect to the argumentative reasoning task and rather point towards a logic-based analysis of the chain of reasoning.","pages":"90--96","doi":"10.18653\/v1\/W18-5211","url":"https:\/\/www.aclweb.org\/anthology\/W18-5211","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5212","title":"Incorporating Topic Aspects for Online Comment Convincingness Evaluation","authors":["Gu, Yunfan","Wei, Zhongyu","Xu, Maoran","Fu, Hao","Liu, Yang","Huang, Xuanjing"],"emails":["17210980015@fudan.edu.cn","zywei@fudan.edu.cn","14300180099@fudan.edu.cn","14307130013@fudan.edu.cn","yang.liu@liulishuo.com","xjhuang@fudan.edu.cn"],"author_id":["yunfan-gu","zhongyu-wei","maoran-xu","hao-fu","yang-liu-icsi","xuan-jing-huang"],"abstract":"In this paper, we propose to incorporate topic aspects information for online comments convincingness evaluation. Our model makes use of graph convolutional network to utilize implicit topic information within a discussion thread to assist the evaluation of convincingness of each single comment. In order to test the effectiveness of our proposed model, we annotate topic information on top of a public dataset for argument convincingness evaluation. Experimental results show that topic information is able to improve the performance for convincingness evaluation. We also make a move to detect topic aspects automatically.","pages":"97--104","doi":"10.18653\/v1\/W18-5212","url":"https:\/\/www.aclweb.org\/anthology\/W18-5212","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5213","title":"Proposed Method for Annotation of Scientific Arguments in Terms of Semantic Relations and Argument Schemes","authors":["Green, Nancy"],"emails":["nlgreen@uncg.edu"],"author_id":["nancy-green"],"abstract":"This paper presents a proposed method for annotation of scientific arguments in biological\/biomedical journal articles. Semantic entities and relations are used to represent the propositional content of arguments in instances of argument schemes. We describe an experiment in which we encoded the arguments in a journal article to identify issues in this approach. Our catalogue of argument schemes and a copy of the annotated article are now publically available.","pages":"105--110","doi":"10.18653\/v1\/W18-5213","url":"https:\/\/www.aclweb.org\/anthology\/W18-5213","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5214","title":"Using context to identify the language of face-saving","authors":["Naderi, Nona","Hirst, Graeme"],"emails":["nona@cs.toronto.edu","gh@cs.toronto.edu"],"author_id":["nona-naderi","graeme-hirst"],"abstract":"We created a corpus of utterances that attempt to save face from parliamentary debates and use it to automatically analyze the language of reputation defence. Our proposed model that incorporates information regarding threats to reputation can predict reputation defence language with high confidence. Further experiments and evaluations on different datasets show that the model is able to generalize to new utterances and can predict the language of reputation defence in a new dataset.","pages":"111--120","doi":"10.18653\/v1\/W18-5214","url":"https:\/\/www.aclweb.org\/anthology\/W18-5214","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5215","title":"Dave the debater: a retrieval-based and generative argumentative dialogue agent","authors":["Le, Dieu Thu","Nguyen, Cam-Tu","Nguyen, Kim Anh"],"emails":["thu@ims.uni-stuttgart.de","ncamtu@nju.edu.cn","anhnk14@fpt.com.vn"],"author_id":["dieu-thu-le1","cam-tu-nguyen","kim-anh-nguyen"],"abstract":"In this paper, we explore the problem of developing an argumentative dialogue agent that can be able to discuss with human users on controversial topics. We describe two systems that use retrieval-based and generative models to make argumentative responses to the users. The experiments show promising results although they have been trained on a small dataset.","pages":"121--130","doi":"10.18653\/v1\/W18-5215","url":"https:\/\/www.aclweb.org\/anthology\/W18-5215","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5216","title":"{PD}3: Better Low-Resource Cross-Lingual Transfer By Combining Direct Transfer and Annotation Projection","authors":["Eger, Steffen","R{\\\"u}ckl{\\'e}, Andreas","Gurevych, Iryna"],"emails":["","",""],"author_id":["steffen-eger","andreas-ruckle","iryna-gurevych"],"abstract":"We consider unsupervised cross-lingual transfer on two tasks, viz., sentence-level argumentation mining and standard POS tagging. We combine direct transfer using bilingual embeddings with annotation projection, which projects labels across unlabeled parallel data. We do so by either merging respective source and target language datasets or alternatively by using multi-task learning. Our combination strategy considerably improves upon both direct transfer and projection with few available parallel sentences, the most realistic scenario for many low-resource target languages.","pages":"131--143","doi":"10.18653\/v1\/W18-5216","url":"https:\/\/www.aclweb.org\/anthology\/W18-5216","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5217","title":"Cross-Lingual Argumentative Relation Identification: from {E}nglish to {P}ortuguese","authors":["Rocha, Gil","Stab, Christian","Lopes Cardoso, Henrique","Gurevych, Iryna"],"emails":["","","",""],"author_id":["gil-rocha","christian-stab","henrique-lopes-cardoso","iryna-gurevych"],"abstract":"Argument mining aims to detect and identify argument structures from textual resources. In this paper, we aim to address the task of argumentative relation identification, a subtask of argument mining, for which several approaches have been recently proposed in a monolingual setting. To overcome the lack of annotated resources in less-resourced languages, we present the first attempt to address","pages":"144--154","doi":"10.18653\/v1\/W18-5217","url":"https:\/\/www.aclweb.org\/anthology\/W18-5217","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"},{"id":"W18-5218","title":"More or less controlled elicitation of argumentative text: Enlarging a microtext corpus via crowdsourcing","authors":["Skeppstedt, Maria","Peldszus, Andreas","Stede, Manfred"],"emails":["maria.skeppstedt@lnu.se","andreas.peldszus@retresco.de","stede@uni-potsdam.de"],"author_id":["maria-skeppstedt","andreas-peldszus","manfred-stede"],"abstract":"We present an extension of an annotated corpus of short argumentative texts that had originally been built in a controlled text production experiment. Our extension more than doubles the size of the corpus by means of crowdsourcing. We report on the setup of this experiment and on the consequences that crowdsourcing had for assembling the data, and in particular for annotation. We labeled the argumentative structure by marking claims, premises, and relations between them, following the scheme used in the original corpus, but had to make a few modifications in response to interesting phenomena in the data. Finally, we report on an experiment with the automatic prediction of this argumentation structure: We first replicated the approach of an earlier study on the original corpus, and compare the performance to various settings involving the extension.","pages":"155--163","doi":"10.18653\/v1\/W18-5218","url":"https:\/\/www.aclweb.org\/anthology\/W18-5218","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"November","booktitle":"Proceedings of the 5th Workshop on Argument Mining"}]