[{"id":"W18-1401","title":"Exploring the Functional and Geometric Bias of Spatial Relations Using Neural Language Models","authors":["Dobnik, Simon","Ghanimifard, Mehdi","Kelleher, John"],"emails":["simon.dobnik@gu.se","mehdi.ghanimifard@gu.se","john.d.kelleher@dit.ie"],"author_id":["simon-dobnik","mehdi-ghanimifard","john-kelleher"],"abstract":"The challenge for computational models of spatial descriptions for situated dialogue systems is the integration of information from different modalities. The semantics of spatial descriptions are grounded in at least two sources of information: (i) a geometric representation of space and (ii) the functional interaction of related objects that. We train several neural language models on descriptions of scenes from a dataset of image captions and examine whether the functional or geometric bias of spatial descriptions reported in the literature is reflected in the estimated perplexity of these models. The results of these experiments have implications for the creation of models of spatial lexical semantics for human-robot dialogue systems. Furthermore, they also provide an insight into the kinds of the semantic knowledge captured by neural language models trained on spatial descriptions, which has implications for image captioning systems.","pages":"1--11","doi":"10.18653\/v1\/W18-1401","url":"https:\/\/www.aclweb.org\/anthology\/W18-1401","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the First International Workshop on Spatial Language Understanding"},{"id":"W18-1402","title":"Building and Learning Structures in a Situated Blocks World Through Deep Language Understanding","authors":["Perera, Ian","Allen, James","Teng, Choh Man","Galescu, Lucian"],"emails":["iperera@ihmc.us","jallen@ihmc.us","cmteng@ihmc.us","lgalescu@ihmc.us"],"author_id":["ian-perera","james-allen","choh-man-teng","lucian-galescu"],"abstract":"We demonstrate a system for understanding natural language utterances for structure description and placement in a situated blocks world context. By relying on a rich, domain-specific adaptation of a generic ontology and a logical form structure produced by a semantic parser, we obviate the need for an intermediate, domain-specific representation and can produce a reasoner that grounds and reasons over concepts and constraints with real-valued data. This linguistic base enables more flexibility in interpreting natural language expressions invoking intrinsic concepts and features of structures and space. We demonstrate some of the capabilities of a system grounded in deep language understanding and present initial results in a structure learning task.","pages":"12--20","doi":"10.18653\/v1\/W18-1402","url":"https:\/\/www.aclweb.org\/anthology\/W18-1402","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the First International Workshop on Spatial Language Understanding"},{"id":"W18-1403","title":"Computational Models for Spatial Prepositions","authors":["Platonov, Georgiy","Schubert, Lenhart"],"emails":["gplatono@cs.rochester.edu","schubert@cs.rochester.edu"],"author_id":["georgiy-platonov","lenhart-schubert"],"abstract":"Developing computational models of spatial prepositions (such as on, in, above, etc.) is crucial for such tasks as human-machine collaboration, story understanding, and 3D model generation from descriptions. However, these prepositions are notoriously vague and ambiguous, with meanings depending on the types, shapes and sizes of entities in the argument positions, the physical and task context, and other factors. As a result truth value judgments for prepositional relations are often uncertain and variable. In this paper we treat the modeling task as calling for assignment of probabilities to such relations as a function of multiple factors, where such probabilities can be viewed as estimates of whether humans would judge the relations to hold in given circumstances. We implemented our models in a 3D blocks world and a room world in a computer graphics setting, and found that true\/false judgments based on these models do not differ much more from human judgments that the latter differ from one another. However, what really matters pragmatically is not the accuracy of truth value judgments but whether, for instance, the computer models suffice for identifying objects described in terms of prepositional relations, (e.g., {``}the box to the left of the table{''}, where there are multiple boxes). For such tasks, our models achieved accuracies above 90{\\%} for most relations.","pages":"21--30","doi":"10.18653\/v1\/W18-1403","url":"https:\/\/www.aclweb.org\/anthology\/W18-1403","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the First International Workshop on Spatial Language Understanding"},{"id":"W18-1404","title":"Lexical Conceptual Structure of Literal and Metaphorical Spatial Language: A Case Study of {``}Push{''}","authors":["Dorr, Bonnie","Olsen, Mari"],"emails":["bdorr@ihmc.us","molsen@microsoft.com"],"author_id":["bonnie-dorr","mari-broman-olsen"],"abstract":"Prior methodologies for understanding spatial language have treated literal expressions such as {``}Mary pushed the car over the edge{''} differently from metaphorical extensions such as {``}Mary{'}s job pushed her over the edge{''}. We demonstrate a methodology for standardizing literal and metaphorical meanings, by building on work in Lexical Conceptual Structure (LCS), a general-purpose representational component used in machine translation. We argue that spatial predicates naturally extend into other fields (e.g., circumstantial or temporal), and that LCS provides both a framework for distinguishing spatial from non-spatial, and a system for finding metaphorical meaning extensions. We start with MetaNet (MN), a large repository of conceptual metaphors, condensing 197 spatial entries into sixteen top-level categories of motion frames. Using naturally occurring instances of English push , and expansions of MN frames, we demonstrate that literal and metaphorical extensions exhibit patterns predicted and represented by the LCS model.","pages":"31--40","doi":"10.18653\/v1\/W18-1404","url":"https:\/\/www.aclweb.org\/anthology\/W18-1404","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the First International Workshop on Spatial Language Understanding"},{"id":"W18-1405","title":"Representing Spatial Relations in {F}rame{N}et","authors":["Petruck, Miriam R. L.","Ellsworth, Michael J."],"emails":["miriamp@icsi.berkeley.edu","infinity@icsi.berkeley.edu"],"author_id":["miriam-r-l-petruck","michael-ellsworth"],"abstract":"While humans use natural language to express spatial relations between and across entities in the world with great facility, natural language systems have a facility that depends on that human facility. This position paper presents approach to representing spatial relations in language, and advocates its adoption for representing the meaning of spatial language. This work shows the importance of axis-orientation systems for capturing the complexity of spatial relations, which FrameNet encodes with semantic types.","pages":"41--45","doi":"10.18653\/v1\/W18-1405","url":"https:\/\/www.aclweb.org\/anthology\/W18-1405","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the First International Workshop on Spatial Language Understanding"},{"id":"W18-1406","title":"Points, Paths, and Playscapes: Large-scale Spatial Language Understanding Tasks Set in the Real World","authors":["Baldridge, Jason","Bedrax-Weiss, Tania","Luong, Daphne","Narayanan, Srini","Pang, Bo","Pereira, Fernando","Soricut, Radu","Tseng, Michael","Zhang, Yuan"],"emails":["jridge@google.com","tbedrax@google.com","daphnel@google.com","srinin@google.com","bopang@google.com","pereira@google.com","rsoricut@google.com","michaeltseng@google.com","zhangyua@google.com"],"author_id":["jason-baldridge","tania-bedrax-weiss","daphne-luong","srini-narayanan","bo-pang","fernando-pereira","radu-soricut","michael-tseng","yuan-zhang"],"abstract":"Spatial language understanding is important for practical applications and as a building block for better abstract language understanding. Much progress has been made through work on understanding spatial relations and values in images and texts as well as on giving and following navigation instructions in restricted domains. We argue that the next big advances in spatial language understanding can be best supported by creating large-scale datasets that focus on points and paths based in the real world, and then extending these to create online, persistent playscapes that mix human and bot players, where the bot players must learn, evolve, and survive according to their depth of understanding of scenes, navigation, and interactions.","pages":"46--52","doi":"10.18653\/v1\/W18-1406","url":"https:\/\/www.aclweb.org\/anthology\/W18-1406","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the First International Workshop on Spatial Language Understanding"},{"id":"W18-1407","title":"Anaphora Resolution for Improving Spatial Relation Extraction from Text","authors":["Manzoor, Umar","Kordjamshidi, Parisa"],"emails":["umanzoor@tulane.edu","pkordjam@tulane.edu"],"author_id":["umar-manzoor","parisa-kordjamshidi"],"abstract":"Spatial relation extraction from generic text is a challenging problem due to the ambiguity of the prepositions spatial meaning as well as the nesting structure of the spatial descriptions. In this work, we highlight the difficulties that the anaphora can make in the extraction of spatial relations. We use external multi-modal (here visual) resources to find the most probable candidates for resolving the anaphoras that refer to the landmarks of the spatial relations. We then use global inference to decide jointly on resolving the anaphora and extraction of the spatial relations. Our preliminary results show that resolving anaphora improves the state-of-the-art results on spatial relation extraction.","pages":"53--62","doi":"10.18653\/v1\/W18-1407","url":"https:\/\/www.aclweb.org\/anthology\/W18-1407","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the First International Workshop on Spatial Language Understanding"},{"id":"W18-1408","title":"The Case for Systematically Derived Spatial Language Usage","authors":["Dorr, Bonnie","Voss, Clare"],"emails":["bdorr@ihmc.us","clare.r.voss.civ@mail.mil"],"author_id":["bonnie-dorr","clare-voss"],"abstract":"This position paper argues that, while prior work in spatial language understanding for tasks such as robot navigation focuses on mapping natural language into deep conceptual or non-linguistic representations, it is possible to systematically derive regular patterns of spatial language usage from existing lexical-semantic resources. Furthermore, even with access to such resources, effective solutions to many application areas such as robot navigation and narrative generation also require additional knowledge at the syntax-semantics interface to cover the wide range of spatial expressions observed and available to natural language speakers. We ground our insights in, and present our extensions to, an existing lexico-semantic resource, covering 500 semantic classes of verbs, of which 219 fall within a spatial subset. We demonstrate that these extensions enable systematic derivation of regular patterns of spatial language without requiring manual annotation.","pages":"63--70","doi":"10.18653\/v1\/W18-1408","url":"https:\/\/www.aclweb.org\/anthology\/W18-1408","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the First International Workshop on Spatial Language Understanding"}]