[{"id":"W18-5601","title":"Detecting Diabetes Risk from Social Media Activity","authors":["Bell, Dane","Laparra, Egoitz","Kousik, Aditya","Ishihara, Terron","Surdeanu, Mihai","Kobourov, Stephen"],"emails":["dane@email.arizona.edu","laparra@email.arizona.edu","adityak@email.arizona.edu","tishihara@email.arizona.edu","msurdeanu@email.arizona.edu","kobourov@email.arizona.edu"],"author_id":["dane-bell","egoitz-laparra","aditya-kousik","terron-ishihara","mihai-surdeanu","stephen-kobourov"],"abstract":"This work is the first to explore the detection of individuals{'} risk of type 2 diabetes mellitus (T2DM) directly from their social media (Twitter) activity. Our approach extends a deep learning architecture with several contributions: following previous observations that language use differs by gender, it captures and uses gender information through domain adaptation; it captures recency of posts under the hypothesis that more recent posts are more representative of an individual{'}s current risk status; and, lastly, it demonstrates that in this scenario where activity factors are sparsely represented in the data, a bag-of-word neural network model using custom dictionaries of food and activity words performs better than other neural sequence models. Our best model, which incorporates all these contributions, achieves a risk-detection F1 of 41.9, considerably higher than the baseline rate (36.9).","pages":"1--11","doi":"10.18653\/v1\/W18-5601","url":"https:\/\/www.aclweb.org\/anthology\/W18-5601","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5602","title":"Treatment Side Effect Prediction from Online User-generated Content","authors":["Nguyen, Van Hoang","Sugiyama, Kazunari","Kan, Min-Yen","Halder, Kishaloy"],"emails":["nguyen@u.nus.edu","sugiyama@comp.nus.edu.sg","kanmy@comp.nus.edu.sg","kishaloy@comp.nus.edu.sg"],"author_id":["van-hoang-nguyen","kazunari-sugiyama","min-yen-kan","kishaloy-halder"],"abstract":"With Health 2.0, patients and caregivers increasingly seek information regarding possible drug side effects during their medical treatments in online health communities. These online communities are helpful platforms for non-professional medical opinions, yet pose risk of being unreliable in quality and insufficient in quantity to cover the wide range of potential drug reactions. Current approaches to analysing such user-generated content in online forums heavily rely on feature engineering of both documents and users, and often overlook the relationships between posts within a common discussion thread. Inspired by recent advancements, we propose a neural architecture that models the textual content of user-generated documents and user experiences in online communities to predict side effects during treatment. Experimental results show that our proposed architecture outperforms baseline models.","pages":"12--21","doi":"10.18653\/v1\/W18-5602","url":"https:\/\/www.aclweb.org\/anthology\/W18-5602","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5603","title":"Revisiting neural relation classification in clinical notes with external information","authors":["{\\v{S}}uster, Simon","Sushil, Madhumita","Daelemans, Walter"],"emails":["simon.{\\v{s}}uster@uantwerpen.be","madhumita.sushil@uantwerpen.be","walter.daelemans@uantwerpen.be"],"author_id":["simon-suster","madhumita-sushil","walter-daelemans"],"abstract":"Recently, segment convolutional neural networks have been proposed for end-to-end relation extraction in the clinical domain, achieving results comparable to or outperforming the approaches with heavy manual feature engineering. In this paper, we analyze the errors made by the neural classifier based on confusion matrices, and then investigate three simple extensions to overcome its limitations. We find that including ontological association between drugs and problems, and data-induced association between medical concepts does not reliably improve the performance, but that large gains are obtained by the incorporation of semantic classes to capture relation triggers.","pages":"22--28","doi":"10.18653\/v1\/W18-5603","url":"https:\/\/www.aclweb.org\/anthology\/W18-5603","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5604","title":"Supervised Machine Learning for Extractive Query Based Summarisation of Biomedical Data","authors":["Kaur, Mandeep","Moll{\\'a}, Diego"],"emails":["mandeep-kaur.mandeep-kaur@students.mq.edu.au","diego.molla-aliod@mq.edu.au"],"author_id":["mandeep-kaur","diego-molla"],"abstract":"The automation of text summarisation of biomedical publications is a pressing need due to the plethora of information available on-line. This paper explores the impact of several supervised machine learning approaches for extracting multi-document summaries for given queries. In particular, we compare classification and regression approaches for query-based extractive summarisation using data provided by the BioASQ Challenge. We tackled the problem of annotating sentences for training classification systems and show that a simple annotation approach outperforms regression-based summarisation.","pages":"29--37","doi":"10.18653\/v1\/W18-5604","url":"https:\/\/www.aclweb.org\/anthology\/W18-5604","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5605","title":"Comparing {CNN} and {LSTM} character-level embeddings in {B}i{LSTM}-{CRF} models for chemical and disease named entity recognition","authors":["Zhai, Zenan","Nguyen, Dat Quoc","Verspoor, Karin"],"emails":["zenanz@student.unimelb.edu.au","dqnguyen@unimelb.edu.au","karin.verspoor@unimelb.edu.au"],"author_id":["zenan-zhai","dat-quoc-nguyen","karin-verspoor"],"abstract":"We compare the use of LSTM-based and CNN-based character-level word embeddings in BiLSTM-CRF models to approach chemical and disease named entity recognition (NER) tasks. Empirical results over the BioCreative V CDR corpus show that the use of either type of character-level word embeddings in conjunction with the BiLSTM-CRF models leads to comparable state-of-the-art performance. However, the models using CNN-based character-level word embeddings have a computational performance advantage, increasing training time over word-based models by 25{\\%} while the LSTM-based character-level word embeddings more than double the required training time.","pages":"38--43","doi":"10.18653\/v1\/W18-5605","url":"https:\/\/www.aclweb.org\/anthology\/W18-5605","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5606","title":"Deep learning for language understanding of mental health concepts derived from Cognitive Behavioural Therapy","authors":["Rojas-Barahona, Lina M.","Tseng, Bo-Hsiang","Dai, Yinpei","Mansfield, Clare","Ramadan, Osman","Ultes, Stefan","Crawford, Michael","Ga{\\v{s}}i{\\'c}, Milica"],"emails":["","","","","","","mg436@cam.ac.uk",""],"author_id":["lina-m-rojas-barahona","bo-hsiang-tseng","yinpei-dai","clare-mansfield","osman-ramadan","stefan-ultes","michael-crawford","milica-gasic"],"abstract":"In recent years, we have seen deep learning and distributed representations of words and sentences make impact on a number of natural language processing tasks, such as similarity, entailment and sentiment analysis. Here we introduce a new task: understanding of mental health concepts derived from Cognitive Behavioural Therapy (CBT). We define a mental health ontology based on the CBT principles, annotate a large corpus where this phenomena is exhibited and perform understanding using deep learning and distributed representations. Our results show that the performance of deep learning models combined with word embeddings or sentence embeddings significantly outperform non-deep-learning models in this difficult task. This understanding module will be an essential component of a statistical dialogue system delivering therapy.","pages":"44--54","doi":"10.18653\/v1\/W18-5606","url":"https:\/\/www.aclweb.org\/anthology\/W18-5606","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5607","title":"Investigating the Challenges of Temporal Relation Extraction from Clinical Text","authors":["Galvan, Diana","Okazaki, Naoaki","Matsuda, Koji","Inui, Kentaro"],"emails":["dianags@ecei.tohoku.ac.jp","okazaki@dc.titech.ac.jp","matsuda@ecei.tohoku.ac.jp","inui@ecei.tohoku.ac.jp"],"author_id":["diana-galvan","naoaki-okazaki","koji-matsuda","kentaro-inui"],"abstract":"Temporal reasoning remains as an unsolved task for Natural Language Processing (NLP), particularly demonstrated in the clinical domain. The complexity of temporal representation in language is evident as results of the 2016 Clinical TempEval challenge show: the current state-of-the-art systems perform well in solving mention-identification tasks of event and time expression, but poorly in temporal relation extraction, showing a gap of around 0.25 point below human performance. We explore to adapt the tree-based LSTM-RNN model proposed by Miwa and Bansal (2016) to temporal relation extraction from clinical text, obtaining a five point improvement over the best 2016 Clinical TempEval system and two points over the state-of-the-art. We deliver a deep analysis of the results and discuss the next step towards human-like temporal reasoning.","pages":"55--64","doi":"10.18653\/v1\/W18-5607","url":"https:\/\/www.aclweb.org\/anthology\/W18-5607","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5608","title":"De-identifying Free Text of {J}apanese Dummy Electronic Health Records","authors":["Kajiyama, Kohei","Horiguchi, Hiromasa","Okumura, Takashi","Morita, Mizuki","Kano, Yoshinobu"],"emails":["","","","",""],"author_id":["kohei-kajiyama","hiromasa-horiguchi","takashi-okumura","mizuki-morita","yoshinobu-kano"],"abstract":"A new law was established in Japan to promote utilization of EHRs for research and developments, while de-identification is required to use EHRs. However, studies of automatic anonymization in the healthcare domain is not active for Japanese language, no de-identification tool available in practical performance for Japanese medical domains, as far as we know. Previous works show that rule-based methods are still effective, while deep learning methods are reported to be better recently. In order to implement and evaluate an de-identification tool in a practical level, we implemented three methods, rule-based, CRF, and LSTM. We prepared three datasets of pseudo EHRs with de-identification tags manually annoated. These datasets are derived from shared task data to compare with previous works, and our new data to increase training data. Our result shows that our LSTM-based method is better and robust, which leads to our future work that plans to apply our system to actual de-identification tasks in hospitals.","pages":"65--70","doi":"10.18653\/v1\/W18-5608","url":"https:\/\/www.aclweb.org\/anthology\/W18-5608","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5609","title":"Unsupervised Identification of Study Descriptors in Toxicology Research: An Experimental Study","authors":["Herrmannova, Drahomira","Young, Steven","Patton, Robert","Stahl, Christopher","Kleinstreuer, Nicole","Wolfe, Mary"],"emails":["herrmannovad@ornl.gov","youngsr@ornl.gov","pattonrm@ornl.gov","stahlcg@ornl.gov","nicole.kleinstreuer@nih.gov","wolfe@niehs.nih.gov"],"author_id":["drahomira-herrmannova","steve-young","robert-patton","christopher-stahl","nicole-kleinstreuer","mary-wolfe"],"abstract":"Identifying and extracting data elements such as study descriptors in publication full texts is a critical yet manual and labor-intensive step required in a number of tasks. In this paper we address the question of identifying data elements in an unsupervised manner. Specifically, provided a set of criteria describing specific study parameters, such as species, route of administration, and dosing regimen, we develop an unsupervised approach to identify text segments relevant to the criteria. A binary classifier trained to identify publications that met the criteria performs better when trained on the candidate sentences than when trained on sentences randomly picked from the text, supporting the intuition that our method is able to accurately identify study descriptors.","pages":"71--82","doi":"10.18653\/v1\/W18-5609","url":"https:\/\/www.aclweb.org\/anthology\/W18-5609","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5610","title":"Identification of Parallel Sentences in Comparable Monolingual Corpora from Different Registers","authors":["Cardon, R{\\'e}mi","Grabar, Natalia"],"emails":["remi.cardon@univ-lille.fr","natalia.grabar@univ-lille.fr"],"author_id":["remi-cardon","natalia-grabar"],"abstract":"Parallel aligned sentences provide useful information for different NLP applications.","pages":"83--93","doi":"10.18653\/v1\/W18-5610","url":"https:\/\/www.aclweb.org\/anthology\/W18-5610","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5611","title":"Evaluation of a Prototype System that Automatically Assigns Subject Headings to Nursing Narratives Using Recurrent Neural Network","authors":["Moen, Hans","Hakala, Kai","Peltonen, Laura-Maria","Suhonen, Henry","Loukasm{\\\"a}ki, Petri","Salakoski, Tapio","Ginter, Filip","Salanter{\\\"a}, Sanna"],"emails":["hanmoe@utu.fi","kahaka@utu.fi","lmemur@utu.fi","hajsuh@utu.fi","peerlo@utu.fi","tapio.salakoski@utu.fi","figint@utu.fi","sansala@utu.fi"],"author_id":["hans-moen","kai-hakala","laura-maria-peltonen","henry-suhonen","petri-loukasmaki","tapio-salakoski","filip-ginter","sanna-salantera"],"abstract":"We present our initial evaluation of a prototype system designed to assist nurses in assigning subject headings to nursing narratives - written in the context of documenting patient care in hospitals. Currently nurses may need to memorize several hundred subject headings from standardized nursing terminologies when structuring and assigning the right section\/subject headings to their text. Our aim is to allow nurses to write in a narrative manner without having to plan and structure the text with respect to sections and subject headings, instead the system should assist with the assignment of subject headings and restructuring afterwards. We hypothesize that this could reduce the time and effort needed for nursing documentation in hospitals. A central component of the system is a text classification model based on a long short-term memory (LSTM) recurrent neural network architecture, trained on a large data set of nursing notes. A simple Web-based interface has been implemented for user interaction. To evaluate the system, three nurses write a set of artificial nursing shift notes in a fully unstructured narrative manner, without planning for or consider the use of sections and subject headings. These are then fed to the system which assigns subject headings to each sentence and then groups them into paragraphs. Manual evaluation is conducted by a group of nurses. The results show that about 70{\\%} of the sentences are assigned to correct subject headings. The nurses believe that such a system can be of great help in making nursing documentation in hospitals easier and less time consuming. Finally, various measures and approaches for improving the system are discussed.","pages":"94--100","doi":"10.18653\/v1\/W18-5611","url":"https:\/\/www.aclweb.org\/anthology\/W18-5611","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5612","title":"Automatically Detecting the Position and Type of Psychiatric Evaluation Report Sections","authors":["Banisakher, Deya","Rishe, Naphtali","Finlayson, Mark A."],"emails":["dbani001@fiu.edu","rishe@fiu.edu","markaf@fiu.edu"],"author_id":["deya-banisakher","naphtali-rishe","mark-finlayson"],"abstract":"Psychiatric evaluation reports represent a rich and still mostly-untapped","pages":"101--110","doi":"10.18653\/v1\/W18-5612","url":"https:\/\/www.aclweb.org\/anthology\/W18-5612","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5613","title":"Iterative development of family history annotation guidelines using a synthetic corpus of clinical text","authors":["Rama, Taraka","Brekke, P{\\aa}l","Nytr{\\o}, {\\O}ystein","{\\O}vrelid, Lilja"],"emails":["tarakark@ifi.uio.no","pabrek@ous-hf.no","nytroe@ntnu.no","liljao@ifi.uio.no"],"author_id":["taraka-rama","pal-brekke","oystein-nytro","lilja-ovrelid"],"abstract":"In this article, we describe the development of annotation","pages":"111--121","doi":"10.18653\/v1\/W18-5613","url":"https:\/\/www.aclweb.org\/anthology\/W18-5613","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5614","title":"{CAS}: {F}rench Corpus with Clinical Cases","authors":["Grabar, Natalia","Claveau, Vincent","Dalloux, Cl{\\'e}ment"],"emails":["natalia.grabar@univ-lille.fr","vincent.claveau@irisa.fr","clement.dalloux@irisa.fr"],"author_id":["natalia-grabar","vincent-claveau","clement-dalloux"],"abstract":"Textual corpora are extremely important for various NLP applications as they provide information necessary for creating, setting and testing these applications and the corresponding tools. They are also crucial for designing reliable methods and reproducible results. Yet, in some areas, such as the medical area, due to confidentiality or to ethical reasons, it is complicated and even impossible to access textual data representative of those produced in these areas. We propose the CAS corpus built with clinical cases, such as they are reported in the published scientific literature in French. We describe this corpus, currently containing over 397,000 word occurrences, and the existing linguistic and semantic annotations.","pages":"122--128","doi":"10.18653\/v1\/W18-5614","url":"https:\/\/www.aclweb.org\/anthology\/W18-5614","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5615","title":"Analysis of Risk Factor Domains in Psychosis Patient Health Records","authors":["Holderness, Eben","Miller, Nicholas","Bolton, Kirsten","Cawkwell, Philip","Meteer, Marie","Pustejovsky, James","Hua-Hall, Mei"],"emails":["eholderness@mclean.harvard.edu","nicholas.anthony.miller@gmail.com","kbolton@partners.org","pcawkwell@partners.org","mmeteer@cs.brandeis.edu","jamesp@cs.brandeis.edu","mhall@mclean.harvard.edu"],"author_id":["eben-holderness","nicholas-miller","kirsten-bolton","philip-cawkwell","marie-meteer","james-pustejovsky","mei-hua-hall"],"abstract":"Readmission after discharge from a hospital is disruptive and costly, regardless of the reason. However, it can be particularly problematic for psychiatric patients, so predicting which patients may be readmitted is critically important but also very difficult. Clinical narratives in psychiatric electronic health records (EHRs) span a wide range of topics and vocabulary; therefore, a psychiatric readmission prediction model must begin with a robust and interpretable topic extraction component. We created a data pipeline for using document vector similarity metrics to perform topic extraction on psychiatric EHR data in service of our long-term goal of creating a readmission risk classifier. We show initial results for our topic extraction model and identify additional features we will be incorporating in the future.","pages":"129--138","doi":"10.18653\/v1\/W18-5615","url":"https:\/\/www.aclweb.org\/anthology\/W18-5615","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5616","title":"Patient Risk Assessment and Warning Symptom Detection Using Deep Attention-Based Neural Networks","authors":["Girardi, Ivan","Ji, Pengfei","Nguyen, An-phi","Hollenstein, Nora","Ivankay, Adam","Kuhn, Lorenz","Marchiori, Chiara","Zhang, Ce"],"emails":["ivg@zurich.ibm.com","pji@student.ethz.ch","uye@zurich.ibm.com","noraho@ethz.ch","aiv@zurich.ibm.com","kuhnl@student.ethz.ch","chi@zurich.ibm.com","ce.zhang@ethz.ch"],"author_id":["ivan-girardi","pengfei-ji","an-phi-nguyen","nora-hollenstein","adam-ivankay","lorenz-kuhn","chiara-marchiori","ce-zhang"],"abstract":"We present an operational component of a real-world patient triage system. Given a specific patient presentation, the system is able to assess the level of medical urgency and issue the most appropriate recommendation in terms of best point of care and time to treat. We use an attention-based convolutional neural network","pages":"139--148","doi":"10.18653\/v1\/W18-5616","url":"https:\/\/www.aclweb.org\/anthology\/W18-5616","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5617","title":"Syntax-based Transfer Learning for the Task of Biomedical Relation Extraction","authors":["Legrand, Jo{\\\"e}l","Toussaint, Yannick","Ra{\\\"\\i}ssi, Chedy","Coulet, Adrien"],"emails":["joel.legrand@loria.fr","","",""],"author_id":["joel-legrand","yannick-toussaint","chedy-raissi","adrien-coulet"],"abstract":"Transfer learning (TL) proposes to enhance machine learning performance on a problem, by reusing labeled data originally designed for a related problem. In particular, domain adaptation consists, for a specific task, in reusing training data developed for the same task but a distinct domain. This is particularly relevant to the applications of deep learning in Natural Language Processing, because those usually require large annotated corpora that may not exist for the targeted domain, but exist for side domains.","pages":"149--159","doi":"10.18653\/v1\/W18-5617","url":"https:\/\/www.aclweb.org\/anthology\/W18-5617","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5618","title":"In-domain Context-aware Token Embeddings Improve Biomedical Named Entity Recognition","authors":["Sheikhshabbafghi, Golnar","Birol, Inanc","Sarkar, Anoop"],"emails":["gsheikhs@sfu.ca","ibirol@bcgsc.ca","gsheikhs@sfu.ca"],"author_id":["golnar-sheikhshab","inanc-birol","anoop-sarkar"],"abstract":"Rapidly expanding volume of publications in the biomedical domain makes it increasingly difficult for a timely evaluation of the latest literature. That, along with a push for automated evaluation of clinical reports, present opportunities for effective natural language processing methods. In this study we target the problem of named entity recognition, where texts are processed to annotate terms that are relevant for biomedical studies. Terms of interest in the domain include gene and protein names, and cell lines and types. Here we report on a pipeline built on Embeddings from Language Models (ELMo) and a deep learning package for natural language processing (AllenNLP). We trained context-aware token embeddings on a dataset of biomedical papers using ELMo, and incorporated these embeddings in the LSTM-CRF model used by AllenNLP for named entity recognition. We show these representations improve named entity recognition for different types of biomedical named entities. We also achieve a new state of the art in gene mention detection on the BioCreative II gene mention shared task.","pages":"160--164","doi":"10.18653\/v1\/W18-5618","url":"https:\/\/www.aclweb.org\/anthology\/W18-5618","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5619","title":"Self-training improves Recurrent Neural Networks performance for Temporal Relation Extraction","authors":["Lin, Chen","Miller, Timothy","Dligach, Dmitriy","Amiri, Hadi","Bethard, Steven","Savova, Guergana"],"emails":["chen.lin@childrens.harvard.edu","timothy.miller@childrens.harvard.edu","ddligach@luc.edu","hadi.amiri@childrens.harvard.edu","bethard@email.arizona.edu","guergana.savova@childrens.harvard.edu"],"author_id":["chen-lin","timothy-miller","dmitriy-dligach","hadi-amiri","steven-bethard","guergana-savova"],"abstract":"Neural network models are oftentimes restricted by limited labeled instances and resort to advanced architectures and features for cutting edge performance. We propose to build a recurrent neural network with multiple semantically heterogeneous embeddings within a self-training framework. Our framework makes use of labeled, unlabeled, and social media data, operates on basic features, and is scalable and generalizable. With this method, we establish the state-of-the-art result for both in- and cross-domain for a clinical temporal relation extraction task.","pages":"165--176","doi":"10.18653\/v1\/W18-5619","url":"https:\/\/www.aclweb.org\/anthology\/W18-5619","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5620","title":"Listwise temporal ordering of events in clinical notes","authors":["Jeblee, Serena","Hirst, Graeme"],"emails":["sjeblee@cs.toronto.edu","gh@cs.toronto.edu"],"author_id":["serena-jeblee","graeme-hirst"],"abstract":"We present metrics for listwise temporal ordering of events in clinical notes, as well as a baseline listwise temporal ranking model that generates a timeline of events that can be used in downstream medical natural language processing tasks.","pages":"177--182","doi":"10.18653\/v1\/W18-5620","url":"https:\/\/www.aclweb.org\/anthology\/W18-5620","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5621","title":"Time Expressions in Mental Health Records for Symptom Onset Extraction","authors":["Viani, Natalia","Yin, Lucia","Kam, Joyce","Alawi, Ayunni","Bittar, Andr{\\'e}","Dutta, Rina","Patel, Rashmi","Stewart, Robert","Velupillai, Sumithra"],"emails":["","","","","","","","",""],"author_id":["natalia-viani","lucia-yin","joyce-kam","ayunni-alawi","andre-bittar","rina-dutta","rashmi-patel","robert-stewart","sumithra-velupillai"],"abstract":"For psychiatric disorders such as schizophrenia, longer durations of untreated psychosis are associated with worse intervention outcomes. Data included in electronic health records (EHRs) can be useful for retrospective clinical studies, but much of this is stored as unstructured text which cannot be directly used in computation. Natural Language Processing (NLP) methods can be used to extract this data, in order to identify symptoms and treatments from mental health records, and temporally anchor the first emergence of these. We are developing an EHR corpus annotated with time expressions, clinical entities and their relations, to be used for NLP development.","pages":"183--192","doi":"10.18653\/v1\/W18-5621","url":"https:\/\/www.aclweb.org\/anthology\/W18-5621","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5622","title":"Evaluation of a Sequence Tagging Tool for Biomedical Texts","authors":["Tourille, Julien","Doutreligne, Matthieu","Ferret, Olivier","N{\\'e}v{\\'e}ol, Aur{\\'e}lie","Paris, Nicolas","Tannier, Xavier"],"emails":["julien.tourille@limsi.fr","matthieu.doutreligne@limsi.fr","olivier.ferret@cea.fr","aurelie.neveol@limsi.fr","nicolas.paris@aphp.fr","xavier.tannier@sorbonne-universite.fr"],"author_id":["julien-tourille","matthieu-doutreligne","olivier-ferret","aurelie-neveol","nicolas-paris","xavier-tannier"],"abstract":"Many applications in biomedical natural language processing rely on sequence tagging as an initial step to perform more complex analysis. To support text analysis in the biomedical domain, we introduce Yet Another SEquence Tagger (YASET), an open-source multi purpose sequence tagger that implements state-of-the-art deep learning algorithms for sequence tagging. Herein, we evaluate YASET on part-of-speech tagging and named entity recognition in a variety of text genres including articles from the biomedical literature in English and clinical narratives in French. To further characterize performance, we report distributions over 30 runs and different sizes of training datasets. YASET provides state-of-the-art performance on the CoNLL 2003 NER dataset (F1=0.87), MEDPOST corpus (F1=0.97), MERLoT corpus (F1=0.99) and NCBI disease corpus (F1=0.81). We believe that YASET is a versatile and efficient tool that can be used for sequence tagging in biomedical and clinical texts.","pages":"193--203","doi":"10.18653\/v1\/W18-5622","url":"https:\/\/www.aclweb.org\/anthology\/W18-5622","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"},{"id":"W18-5623","title":"Learning to Summarize Radiology Findings","authors":["Zhang, Yuhao","Ding, Daisy Yi","Qian, Tianpei","Manning, Christopher D.","Langlotz, Curtis P."],"emails":["yuhaozhang@stanford.edu","dingd@stanford.edu","tianpei@stanford.edu","manning@stanford.edu","langlotz@stanford.edu"],"author_id":["yuhao-zhang","daisy-yi-ding","tianpei-qian","christopher-d-manning","curtis-p-langlotz"],"abstract":"The Impression section of a radiology report summarizes crucial radiology findings in natural language and plays a central role in communicating these findings to physicians. However, the process of generating impressions by summarizing findings is time-consuming for radiologists and prone to errors. We propose to automate the generation of radiology impressions with neural sequence-to-sequence learning. We further propose a customized neural model for this task which learns to encode the study background information and use this information to guide the decoding process. On a large dataset of radiology reports collected from actual hospital studies, our model outperforms existing non-neural and neural baselines under the ROUGE metrics. In a blind experiment, a board-certified radiologist indicated that 67{\\%} of sampled system summaries are at least as good as the corresponding human-written summaries, suggesting significant clinical validity. To our knowledge our work represents the first attempt in this direction.","pages":"204--213","doi":"10.18653\/v1\/W18-5623","url":"https:\/\/www.aclweb.org\/anthology\/W18-5623","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Ninth International Workshop on Health Text Mining and Information Analysis"}]