[{"id":"W18-3301","title":"Getting the subtext without the text: Scalable multimodal sentiment classification from visual and acoustic modalities","authors":["Blanchard, Nathaniel","Moreira, Daniel","Bharati, Aparna","Scheirer, Walter"],"emails":["nblancha@nd.edu","dhenriq1@nd.edu","abharati@nd.edu","walter.scheirer@nd.edu"],"author_id":["nathaniel-blanchard","daniel-moreira","aparna-bharati","walter-scheirer"],"abstract":"In the last decade, video blogs (vlogs) have become an extremely popular method through which people express sentiment. The ubiquitousness of these videos has increased the importance of multimodal fusion models, which incorporate video and audio features with traditional text features for automatic sentiment detection. Multimodal fusion offers a unique opportunity to build models that learn from the full depth of expression available to human viewers. In the detection of sentiment in these videos, acoustic and video features provide clarity to otherwise ambiguous transcripts. In this paper, we present a multimodal fusion model that exclusively uses high-level video and audio features to analyze spoken sentences for sentiment. We discard traditional transcription features in order to minimize human intervention and to maximize the deployability of our model on at-scale real-world data. We select high-level features for our model that have been successful in non-affect domains in order to test their generalizability in the sentiment detection domain. We train and test our model on the newly released CMU Multimodal Opinion Sentiment and Emotion Intensity (CMU-MOSEI) dataset, obtaining an F1 score of 0.8049 on the validation set and an F1 score of 0.6325 on the held-out challenge test set.","pages":"1--10","doi":"10.18653\/v1\/W18-3301","url":"https:\/\/www.aclweb.org\/anthology\/W18-3301","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"},{"id":"W18-3302","title":"Recognizing Emotions in Video Using Multimodal {DNN} Feature Fusion","authors":["Williams, Jennifer","Kleinegesse, Steven","Comanescu, Ramona","Radu, Oana"],"emails":["j.williams@ed.ac.uk","","",""],"author_id":["jennifer-williams","steven-kleinegesse","ramona-comanescu","oana-radu"],"abstract":"We present our system description of input-level multimodal fusion of audio, video, and text for recognition of emotions and their intensities for the 2018 First Grand Challenge on Computational Modeling of Human Multimodal Language. Our proposed approach is based on input-level feature fusion with sequence learning from Bidirectional Long-Short Term Memory (BLSTM) deep neural networks (DNNs). We show that our fusion approach outperforms unimodal predictors. Our system performs 6-way simultaneous classification and regression, allowing for overlapping emotion labels in a video segment. This leads to an overall binary accuracy of 90{\\%}, overall 4-class accuracy of 89.2{\\%} and an overall mean-absolute-error (MAE) of 0.12. Our work shows that an early fusion technique can effectively predict the presence of multi-label emotions as well as their coarse-grained intensities. The presented multimodal approach creates a simple and robust baseline on this new Grand Challenge dataset. Furthermore, we provide a detailed analysis of emotion intensity distributions as output from our DNN, as well as a related discussion concerning the inherent difficulty of this task.","pages":"11--19","doi":"10.18653\/v1\/W18-3302","url":"https:\/\/www.aclweb.org\/anthology\/W18-3302","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"},{"id":"W18-3303","title":"Multimodal Relational Tensor Network for Sentiment and Emotion Classification","authors":["Sahay, Saurav","Kumar, Shachi H","Xia, Rui","Huang, Jonathan","Nachman, Lama"],"emails":["","","","uang@intel.com","lama.nachman@intel.com"],"author_id":["saurav-sahay","shachi-h-kumar","rui-xia","jonathan-huang","lama-nachman"],"abstract":"Understanding Affect from video segments has brought researchers from the language, audio and video domains together. Most of the current multimodal research in this area deals with various techniques to fuse the modalities, and mostly treat the segments of a video independently. Motivated by the work of (Zadeh et al., 2017) and (Poria et al., 2017), we present our architecture, Relational Tensor Network, where we use the inter-modal interactions within a segment (intra-segment) and also consider the sequence of segments in a video to model the inter-segment inter-modal interactions. We also generate rich representations of text and audio modalities by leveraging richer audio and linguistic context alongwith fusing fine-grained knowledge based polarity scores from text. We present the results of our model on CMU-MOSEI dataset and show that our model outperforms many baselines and state of the art methods for sentiment classification and emotion recognition.","pages":"20--27","doi":"10.18653\/v1\/W18-3303","url":"https:\/\/www.aclweb.org\/anthology\/W18-3303","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"},{"id":"W18-3304","title":"Convolutional Attention Networks for Multimodal Emotion Recognition from Speech and Text Data","authors":["Choi, Woo Yong","Song, Kyu Ye","Lee, Chan Woo"],"emails":["cchoi@orbisai.co","kysong@orbisai.co","cwlee@orbisai.co"],"author_id":["woo-yong-choi","kyu-ye-song","chan-woo-lee"],"abstract":"Emotion recognition has become a popular topic of interest, especially in the field of human computer interaction. Previous works involve unimodal analysis of emotion, while recent efforts focus on multimodal emotion recognition from vision and speech. In this paper, we propose a new method of learning about the hidden representations between just speech and text data using convolutional attention networks. Compared to the shallow model which employs simple concatenation of feature vectors, the proposed attention model performs much better in classifying emotion from speech and text data contained in the CMU-MOSEI dataset.","pages":"28--34","doi":"10.18653\/v1\/W18-3304","url":"https:\/\/www.aclweb.org\/anthology\/W18-3304","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"},{"id":"W18-3305","title":"Sentiment Analysis using Imperfect Views from Spoken Language and Acoustic Modalities","authors":["Sheikh, Imran","Dumpala, Sri Harsha","Chakraborty, Rupayan","Kopparapu, Sunil Kumar"],"emails":["imran.as@tcs.com","d.harsha@tcs.com","rupayan.chakraborty@tcs.com","sunilkumar.kopparapu@tcs.com"],"author_id":["imran-sheikh","sri-harsha-dumpala","rupayan-chakraborty","sunil-kumar-kopparapu"],"abstract":"Multimodal sentiment classification in practical applications may have to rely on erroneous and imperfect views, namely (a) language transcription from a speech recognizer and (b) under-performing acoustic views. This work focuses on improving the representations of these views by performing a deep canonical correlation analysis with the representations of the better performing manual transcription view. Enhanced representations of the imperfect views can be obtained even in absence of the perfect views and give an improved performance during test conditions. Evaluations on the CMU-MOSI and CMU-MOSEI datasets demonstrate the effectiveness of the proposed approach.","pages":"35--39","doi":"10.18653\/v1\/W18-3305","url":"https:\/\/www.aclweb.org\/anthology\/W18-3305","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"},{"id":"W18-3306","title":"Polarity and Intensity: the Two Aspects of Sentiment Analysis","authors":["Tian, Leimin","Lai, Catherine","Moore, Johanna"],"emails":["ian@monash.edu","clai@inf.ed.ac.uk","oore@ed.ac.uk"],"author_id":["leimin-tian","catherine-lai","johanna-d-moore"],"abstract":"Current multimodal sentiment analysis frames sentiment score prediction as a general Machine Learning task. However, what the sentiment score actually represents has often been overlooked. As a measurement of opinions and affective states, a sentiment score generally consists of two aspects: polarity and intensity. We decompose sentiment scores into these two aspects and study how they are conveyed through individual modalities and combined multimodal models in a naturalistic monologue setting. In particular, we build unimodal and multimodal multi-task learning models with sentiment score prediction as the main task and polarity and\/or intensity classification as the auxiliary tasks. Our experiments show that sentiment analysis benefits from multi-task learning, and individual modalities differ when conveying the polarity and intensity aspects of sentiment.","pages":"40--47","doi":"10.18653\/v1\/W18-3306","url":"https:\/\/www.aclweb.org\/anthology\/W18-3306","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"},{"id":"W18-3307","title":"{ASR}-based Features for Emotion Recognition: A Transfer Learning Approach","authors":["Tits, No{\\'e}","El Haddad, Kevin","Dutoit, Thierry"],"emails":["noe.tits@umons.ac.be","kevin.elhaddad@umons.ac.be","thierry.dutoit@umons.ac.be"],"author_id":["noe-tits","kevin-el-haddad1","thierry-dutoit"],"abstract":"During the last decade, the applications of signal processing have drastically improved with deep learning. However areas of affecting computing such as emotional speech synthesis or emotion recognition from spoken language remains challenging. In this paper, we investigate the use of a neural Automatic Speech Recognition (ASR) as a feature extractor for emotion recognition. We show that these features outperform the eGeMAPS feature set to predict the valence and arousal emotional dimensions, which means that the audio-to-text mapping learned by the ASR system contains information related to the emotional dimensions in spontaneous speech. We also examine the relationship between first layers (closer to speech) and last layers (closer to text) of the ASR and valence\/arousal.","pages":"48--52","doi":"10.18653\/v1\/W18-3307","url":"https:\/\/www.aclweb.org\/anthology\/W18-3307","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"},{"id":"W18-3308","title":"{S}eq2{S}eq2{S}entiment: Multimodal Sequence to Sequence Models for Sentiment Analysis","authors":["Pham, Hai","Manzini, Thomas","Liang, Paul Pu","Pocz{\\'o}s, Barnab{\\'a}s"],"emails":["htpham@cs.cmu.edu","tmanzini@cs.cmu.edu","pliang@cs.cmu.edu","bapoczos@cs.cmu.edu"],"author_id":["hai-pham","thomas-manzini","paul-pu-liang","barnabas-poczos"],"abstract":"Multimodal machine learning is a core research area spanning the language, visual and acoustic modalities. The central challenge in multimodal learning involves learning representations that can process and relate information from multiple modalities. In this paper, we propose two methods for unsupervised learning of joint multimodal representations using sequence to sequence (Seq2Seq) methods: a Seq2Seq Modality Translation Model and a Hierarchical Seq2Seq Modality Translation Model. We also explore multiple different variations on the multimodal inputs and outputs of these seq2seq models. Our experiments on multimodal sentiment analysis using the CMU-MOSI dataset indicate that our methods learn informative multimodal representations that outperform the baselines and achieve improved performance on multimodal sentiment analysis, specifically in the Bimodal case where our model is able to improve F1 Score by twelve points. We also discuss future directions for multimodal Seq2Seq methods.","pages":"53--63","doi":"10.18653\/v1\/W18-3308","url":"https:\/\/www.aclweb.org\/anthology\/W18-3308","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"},{"id":"W18-3309","title":"{DNN} Multimodal Fusion Techniques for Predicting Video Sentiment","authors":["Williams, Jennifer","Comanescu, Ramona","Radu, Oana","Tian, Leimin"],"emails":["j.williams@ed.ac.uk","","",""],"author_id":["jennifer-williams","ramona-comanescu","oana-radu","leimin-tian"],"abstract":"We present our work on sentiment prediction using the benchmark MOSI dataset from the CMU-MultimodalDataSDK. Previous work on multimodal sentiment analysis have been focused on input-level feature fusion or decision-level fusion for multimodal fusion. Here, we propose an intermediate-level feature fusion, which merges weights from each modality (audio, video, and text) during training with subsequent additional training. Moreover, we tested principle component analysis (PCA) for feature selection. We found that applying PCA increases unimodal performance, and multimodal fusion outperforms unimodal models. Our experiments show that our proposed intermediate-level feature fusion outperforms other fusion techniques, and it achieves the best performance with an overall binary accuracy of 74.0{\\%} on video+text modalities. Our work also improves feature selection for unimodal sentiment analysis, while proposing a novel and effective multimodal fusion architecture for this task.","pages":"64--72","doi":"10.18653\/v1\/W18-3309","url":"https:\/\/www.aclweb.org\/anthology\/W18-3309","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of Grand Challenge and Workshop on Human Multimodal Language (Challenge-{HML})"}]