[{"id":"W18-5001","title":"Zero-Shot Dialog Generation with Cross-Domain Latent Actions","authors":["Zhao, Tiancheng","Eskenazi, Maxine"],"emails":["",""],"author_id":["tiancheng-zhao","maxine-eskenazi"],"abstract":"This paper introduces zero-shot dialog generation (ZSDG), as a step towards neural dialog systems that can instantly generalize to new situations with minimum data. ZSDG requires an end-to-end generative dialog system to generalize to a new domain for which only a domain description is provided and no training dialogs are available. Then a novel learning framework, Action Matching, is proposed. This algorithm can learn a cross-domain embedding space that models the semantics of dialog responses which in turn, enables a neural dialog generation model to generalize to new domains. We evaluate our methods on two datasets, a new synthetic dialog dataset, and an existing human-human multi-domain dialog dataset. Experimental results show that our method is able to achieve superior performance in learning dialog models that can rapidly adapt their behavior to new domains and suggests promising future research.","pages":"1--10","doi":"10.18653\/v1\/W18-5001","url":"https:\/\/www.aclweb.org\/anthology\/W18-5001","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5002","title":"Changing the Level of Directness in Dialogue using Dialogue Vector Models and Recurrent Neural Networks","authors":["Pragst, Louisa","Ultes, Stefan"],"emails":["louisa.pragst@uni-ulm.de","su259@cam.ac.uk"],"author_id":["louisa-pragst","stefan-ultes"],"abstract":"In cooperative dialogues, identifying the intent of ones conversation partner and acting accordingly is of great importance. While this endeavour is facilitated by phrasing intentions as directly as possible, we can observe in human-human communication that a number of factors such as cultural norms and politeness may result in expressing one{'}s intent indirectly. Therefore, in human-computer communication we have to anticipate the possibility of users being indirect and be prepared to interpret their actual meaning. Furthermore, a dialogue system should be able to conform to human expectations by adjusting the degree of directness it uses to improve the user experience. To reach those goals, we propose an approach to differentiate between direct and indirect utterances and find utterances of the opposite characteristic that express the same intent. In this endeavour, we employ dialogue vector models and recurrent neural networks.","pages":"11--19","doi":"10.18653\/v1\/W18-5002","url":"https:\/\/www.aclweb.org\/anthology\/W18-5002","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5003","title":"Modeling Linguistic and Personality Adaptation for Natural Language Generation","authors":["Hu, Zhichao","Fox Tree, Jean","Walker, Marilyn"],"emails":["zhu@ucsc.edu","foxtree@ucsc.edu","mawalker@ucsc.edu"],"author_id":["zhichao-hu","jean-e-fox-tree","marilyn-walker"],"abstract":"Previous work has shown that conversants adapt to many aspects of their partners{'} language. Other work has shown that while every person is unique, they often share general patterns of behavior. Theories of personality aim to explain these shared patterns, and studies have shown that many linguistic cues are correlated with personality traits. We propose an adaptation measure for adaptive natural language generation for dialogs that integrates the predictions of both personality theories and adaptation theories, that can be applied as a dialog unfolds, on a turn by turn basis. We show that our measure meets criteria for validity, and that adaptation varies according to corpora and task, speaker, and the set of features used to model it. We also produce fine-grained models according to the dialog segmentation or the speaker, and demonstrate the decaying trend of adaptation.","pages":"20--31","doi":"10.18653\/v1\/W18-5003","url":"https:\/\/www.aclweb.org\/anthology\/W18-5003","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5004","title":"Estimating User Interest from Open-Domain Dialogue","authors":["Inaba, Michimasa","Takahashi, Kenichi"],"emails":["finaba@hiroshima-cu.ac.jp","takahashig@hiroshima-cu.ac.jp"],"author_id":["michimasa-inaba","kenichi-takahashi"],"abstract":"Dialogue personalization is an important issue in the field of open-domain chat-oriented dialogue systems. If these systems could consider their users{'} interests, user engagement and satisfaction would be greatly improved. This paper proposes a neural network-based method for estimating users{'} interests from their utterances in chat dialogues to personalize dialogue systems{'} responses. We introduce a method for effectively extracting topics and user interests from utterances and also propose a pre-training approach that increases learning efficiency. Our experimental results indicate that the proposed model can estimate user{'}s interest more accurately than baseline approaches.","pages":"32--40","doi":"10.18653\/v1\/W18-5004","url":"https:\/\/www.aclweb.org\/anthology\/W18-5004","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5005","title":"Does Ability Affect Alignment in Second Language Tutorial Dialogue?","authors":["Sinclair, Arabella","Lopez, Adam","Lucas, C. G.","Gasevic, Dragan"],"emails":["s0934062@sms.ed.ac.uk","alopez@inf.ed.ac.uk","clucas2@inf.ed.ac.uk","dragan.gasevic@monash.edu"],"author_id":["arabella-sinclair","adam-lopez","c-g-lucas","dragan-gasevic"],"abstract":"The role of alignment between interlocutors in second language learning is different to that in fluent conversational dialogue. Learners gain linguistic skill through increased alignment, yet the extent to which they can align will be constrained by their ability. Tutors may use alignment to teach and encourage the student, yet still must push the student and correct their errors, decreasing alignment. To understand how learner ability interacts with alignment, we measure the influence of ability on lexical priming, an indicator of alignment. We find that lexical priming in learner-tutor dialogues differs from that in conversational and task-based dialogues, and we find evidence that alignment increases with ability and with word complexity.","pages":"41--50","doi":"10.18653\/v1\/W18-5005","url":"https:\/\/www.aclweb.org\/anthology\/W18-5005","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5006","title":"Just Talking - Modelling Casual Conversation","authors":["Gilmartin, Emer","Saam, Christian","Vogel, Carl","Campbell, Nick","Wade, Vincent"],"emails":["gilmare@tcd.ie","saamc@cs.tcd.ie","vogel@tcd.ie","nick@tcd.ie","vwade@adaptcentre.ie"],"author_id":["emer-gilmartin","christian-saam","carl-vogel","nick-campbell","vincent-wade"],"abstract":"Casual conversation has become a focus for artificial dialogue applications. Such talk is ubiquitous and its structure differs from that found in the task-based interactions which have been the focus of dialogue system design for many years. It is unlikely that such conversations can be modelled as an extension of task-based talk. We review theories of casual conversation, report on our studies of the structure of casual dialogue, and outline challenges we see for the development of spoken dialog systems capable of carrying on casual friendly conversation in addition to performing well-defined tasks.","pages":"51--59","doi":"10.18653\/v1\/W18-5006","url":"https:\/\/www.aclweb.org\/anthology\/W18-5006","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5007","title":"Neural User Simulation for Corpus-based Policy Optimisation of Spoken Dialogue Systems","authors":["Kreyssig, Florian","Casanueva, I{\\~n}igo","Budzianowski, Pawe{\\l}","Ga{\\v{s}}i{\\'c}, Milica"],"emails":["flk24@cam.ac.uk","ic340@cam.ac.uk","pfb30@cam.ac.uk","mg436@cam.ac.uk"],"author_id":["florian-kreyssig","inigo-casanueva","pawel-budzianowski","milica-gasic"],"abstract":"User Simulators are one of the major tools that enable offline training of task-oriented dialogue systems. For this task the Agenda-Based User Simulator (ABUS) is often used. The ABUS is based on hand-crafted rules and its output is in semantic form. Issues arise from both properties such as limited diversity and the inability to interface a text-level belief tracker. This paper introduces the Neural User Simulator (NUS) whose behaviour is learned from a corpus and which generates natural language, hence needing a less labelled dataset than simulators generating a semantic output. In comparison to much of the past work on this topic, which evaluates user simulators on corpus-based metrics, we use the NUS to train the policy of a reinforcement learning based Spoken Dialogue System. The NUS is compared to the ABUS by evaluating the policies that were trained using the simulators. Cross-model evaluation is performed i.e. training on one simulator and testing on the other. Furthermore, the trained policies are tested on real users. In both evaluation tasks the NUS outperformed the ABUS.","pages":"60--69","doi":"10.18653\/v1\/W18-5007","url":"https:\/\/www.aclweb.org\/anthology\/W18-5007","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5008","title":"Introduction method for argumentative dialogue using paired question-answering interchange about personality","authors":["Sakai, Kazuki","Higashinaka, Ryuichiro","Yoshikawa, Yuichiro","Ishiguro, Hiroshi","Tomita, Junji"],"emails":["sakai.kazuki@irl.sys.es.osaka-u.ac.jp","higashinaka.ryuichiro@lab.ntt.co.jp","yoshikawa@irl.sys.es.osaka-u.ac.jp","ishiguro@irl.sys.es.osaka-u.ac.jp","tomita.junji@lab.ntt.co.jp"],"author_id":["kazuki-sakai","ryuichiro-higashinaka","yuichiro-yoshikawa","hiroshi-ishiguro","junji-tomita"],"abstract":"To provide a better discussion experience in current argumentative dialogue systems, it is necessary for the user to feel motivated to participate, even if the system already responds appropriately. In this paper, we propose a method that can smoothly introduce argumentative dialogue by inserting an initial discourse, consisting of question-answer pairs concerning personality. The system can induce interest of the users prior to agreement or disagreement during the main discourse. By disclosing their interests, the users will feel familiarity and motivation to further engage in the argumentative dialogue and understand the system{'}s intent. To verify the effectiveness of a question-answer dialogue inserted before the argument, a subjective experiment was conducted using a text chat interface. The results suggest that inserting the question-answer dialogue enhances familiarity and naturalness. Notably, the results suggest that women more than men regard the dialogue as more natural and the argument as deepened, following an exchange concerning personality.","pages":"70--79","doi":"10.18653\/v1\/W18-5008","url":"https:\/\/www.aclweb.org\/anthology\/W18-5008","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5009","title":"Automatic Token and Turn Level Language Identification for Code-Switched Text Dialog: An Analysis Across Language Pairs and Corpora","authors":["Ramanarayanan, Vikram","Pugh, Robert"],"emails":["vramanarayanan@ets.org","rpugh@ets.org"],"author_id":["vikram-ramanarayanan","robert-pugh"],"abstract":"We examine the efficacy of various feature{--}learner combinations for language identification in different types of text-based code-switched interactions {--} human-human dialog, human-machine dialog as well as monolog {--} at both the token and turn levels. In order to examine the generalization of such methods across language pairs and datasets, we analyze 10 different datasets of code-switched text. We extract a variety of character- and word-based text features and pass them into multiple learners, including conditional random fields, logistic regressors and recurrent neural networks. We further examine the efficacy of novel character-level embedding and GloVe features in improving performance and observe that our best-performing text system significantly outperforms a majority vote baseline across language pairs and datasets.","pages":"80--88","doi":"10.18653\/v1\/W18-5009","url":"https:\/\/www.aclweb.org\/anthology\/W18-5009","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5010","title":"A Situated Dialogue System for Learning Structural Concepts in Blocks World","authors":["Perera, Ian","Allen, James","Teng, Choh Man","Galescu, Lucian"],"emails":["iperera@ihmc.us","jallen@ihmc.us","cmteng@ihmc.us","lgalescu@ihmc.us"],"author_id":["ian-perera","james-allen","choh-man-teng","lucian-galescu"],"abstract":"We present a modular, end-to-end dialogue system for a situated agent to address a multimodal, natural language dialogue task in which the agent learns complex representations of block structure classes through assertions, demonstrations, and questioning. The concept to learn is provided to the user through a set of positive and negative visual examples, from which the user determines the underlying constraints to be provided to the system in natural language. The system in turn asks questions about demonstrated examples and simulates new examples to check its knowledge and verify the user{'}s description is complete. We find that this task is non-trivial for users and generates natural language that is varied yet understood by our deep language understanding architecture.","pages":"89--98","doi":"10.18653\/v1\/W18-5010","url":"https:\/\/www.aclweb.org\/anthology\/W18-5010","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5011","title":"Pardon the Interruption: Managing Turn-Taking through Overlap Resolution in Embodied Artificial Agents","authors":["Gervits, Felix","Scheutz, Matthias"],"emails":["felix.gervits@tufts.edu","matthias.scheutz@tufts.edu"],"author_id":["felix-gervits","matthias-scheutz"],"abstract":"Speech overlap is a common phenomenon in natural conversation and in task-oriented interactions. As human-robot interaction (HRI) becomes more sophisticated, the need to effectively manage turn-taking and resolve overlap becomes more important. In this paper, we introduce a computational model for speech overlap resolution in embodied artificial agents. The model identifies when overlap has occurred and uses timing information, dialogue history, and the agent{'}s goals to generate context-appropriate behavior. We implement this model in a Nao robot using the DIARC cognitive robotic architecture. The model is evaluated on a corpus of task-oriented human dialogue, and we find that the robot can replicate many of the most common overlap resolution behaviors found in the human data.","pages":"99--109","doi":"10.18653\/v1\/W18-5011","url":"https:\/\/www.aclweb.org\/anthology\/W18-5011","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5012","title":"Consequences and Factors of Stylistic Differences in Human-Robot Dialogue","authors":["Lukin, Stephanie","Pollard, Kimberly","Bonial, Claire","Marge, Matthew","Henry, Cassidy","Artstein, Ron","Traum, David","Voss, Clare"],"emails":["stephanie.m.lukin.civ@mail.mil","","","","","","",""],"author_id":["stephanie-lukin","kimberly-pollard","claire-bonial","matthew-marge","cassidy-henry","ron-artstein","david-traum","clare-voss"],"abstract":"This paper identifies stylistic differences in instruction-giving observed in a corpus of human-robot dialogue. Differences in verbosity and structure (i.e., single-intent vs. multi-intent instructions) arose naturally without restrictions or prior guidance on how users should speak with the robot. Different styles were found to produce different rates of miscommunication, and correlations were found between style differences and individual user variation, trust, and interaction experience with the robot. Understanding potential consequences and factors that influence style can inform design of dialogue systems that are robust to natural variation from human users.","pages":"110--118","doi":"10.18653\/v1\/W18-5012","url":"https:\/\/www.aclweb.org\/anthology\/W18-5012","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5013","title":"Turn-Taking Strategies for Human-Robot Peer-Learning Dialogue","authors":["Das, Ranjini","Pon-Barry, Heather"],"emails":["das22r@mtholyoke.edu","ponbarry@mtholyoke.edu"],"author_id":["ranjini-das","heather-pon-barry"],"abstract":"In this paper, we apply the contribution model of grounding to a corpus of human-human peer-mentoring dialogues. From this analysis, we propose effective turn-taking strategies for human-robot interaction with a teachable robot. Specifically, we focus on (1) how robots can encourage humans to present and (2) how robots can signal that they are going to begin a new presentation. We evaluate the strategies against a corpus of human-robot dialogues and offer three guidelines for teachable robots to follow to achieve more human-like collaborative dialogue.","pages":"119--129","doi":"10.18653\/v1\/W18-5013","url":"https:\/\/www.aclweb.org\/anthology\/W18-5013","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5014","title":"Predicting Perceived Age: Both Language Ability and Appearance are Important","authors":["Plane, Sarah","Marvasti, Ariel","Egan, Tyler","Kennington, Casey"],"emails":["","firstnamelastname@boisestate.edu","",""],"author_id":["sarah-plane","ariel-marvasti","tyler-egan","casey-kennington"],"abstract":"When interacting with robots in a situated spoken dialogue setting, human dialogue partners tend to assign anthropomorphic and social characteristics to those robots. In this paper, we explore the age and educational level that human dialogue partners assign to three different robotic systems, including an un-embodied spoken dialogue system. We found that how a robot speaks is as important to human perceptions as the way the robot looks. Using the data from our experiment, we derived prosodic, emotional, and linguistic features from the participants to train and evaluate a classifier that predicts perceived intelligence, age, and education level.","pages":"130--139","doi":"10.18653\/v1\/W18-5014","url":"https:\/\/www.aclweb.org\/anthology\/W18-5014","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5015","title":"Multimodal Hierarchical Reinforcement Learning Policy for Task-Oriented Visual Dialog","authors":["Zhang, Jiaping","Zhao, Tiancheng","Yu, Zhou"],"emails":["jpzhang@ucdavis.edu","tianchez@cs.cmu.edu","joyu@ucdavis.edu"],"author_id":["jiaping-zhang","tiancheng-zhao","zhou-yu"],"abstract":"Creating an intelligent conversational system that understands vision and language is one of the ultimate goals in Artificial Intelligence (AI) (Winograd, 1972). Extensive research has focused on vision-to-language generation, however, limited research has touched on combining these two modalities in a goal-driven dialog context. We propose a multimodal hierarchical reinforcement learning framework that dynamically integrates vision and language for task-oriented visual dialog. The framework jointly learns the multimodal dialog state representation and the hierarchical dialog policy to improve both dialog task success and efficiency. We also propose a new technique, state adaptation, to integrate context awareness in the dialog state representation. We evaluate the proposed framework and the state adaptation technique in an image guessing game and achieve promising results.","pages":"140--150","doi":"10.18653\/v1\/W18-5015","url":"https:\/\/www.aclweb.org\/anthology\/W18-5015","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5016","title":"Language-Guided Adaptive Perception for Efficient Grounded Communication with Robotic Manipulators in Cluttered Environments","authors":["Patki, Siddharth","Howard, Thomas"],"emails":["spatki@ur.rochester.edu","thoward@ece.rochester.edu"],"author_id":["siddharth-patki","thomas-howard"],"abstract":"The utility of collaborative manipulators for shared tasks is highly dependent on the speed and accuracy of communication between the human and the robot. The run-time of recently developed probabilistic inference models for situated symbol grounding of natural language instructions depends on the complexity of the representation of the environment in which they reason. As we move towards more complex bi-directional interactions, tasks, and environments, we need intelligent perception models that can selectively infer precise pose, semantics, and affordances of the objects when inferring exhaustively detailed world models is inefficient and prohibits real-time interaction with these robots. In this paper we propose a model of language and perception for the problem of adapting the configuration of the robot perception pipeline for tasks where constructing exhaustively detailed models of the environment is inefficient and inconsequential for symbol grounding. We present experimental results from a synthetic corpus of natural language instructions for robot manipulation in example environments. The results demonstrate that by adapting perception we get significant gains in terms of run-time for perception and situated symbol grounding of the language instructions without a loss in the accuracy of the latter.","pages":"151--160","doi":"10.18653\/v1\/W18-5016","url":"https:\/\/www.aclweb.org\/anthology\/W18-5016","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5017","title":"Unsupervised Counselor Dialogue Clustering for Positive Emotion Elicitation in Neural Dialogue System","authors":["Lubis, Nurul","Sakti, Sakriani","Yoshino, Koichiro","Nakamura, Satoshi"],"emails":["nurul.lubis.na4@is.naist.jp","ssakti@is.naist.jp","koichiro@is.naist.jp","s-nakamura@is.naist.jp"],"author_id":["nurul-lubis","sakriani-sakti","koichiro-yoshino","satoshi-nakamura"],"abstract":"Positive emotion elicitation seeks to improve user{'}s emotional state through dialogue system interaction, where a chat-based scenario is layered with an implicit goal to address user{'}s emotional needs. Standard neural dialogue system approaches still fall short in this situation as they tend to generate only short, generic responses. Learning from expert actions is critical, as these potentially differ from standard dialogue acts. In this paper, we propose using a hierarchical neural network for response generation that is conditioned on 1) expert{'}s action, 2) dialogue context, and 3) user emotion, encoded from user input. We construct a corpus of interactions between a counselor and 30 participants following a negative emotional exposure to learn expert actions and responses in a positive emotion elicitation scenario. Instead of relying on the expensive, labor intensive, and often ambiguous human annotations, we unsupervisedly cluster the expert{'}s responses and use the resulting labels to train the network. Our experiments and evaluation show that the proposed approach yields lower perplexity and generates a larger variety of responses.","pages":"161--170","doi":"10.18653\/v1\/W18-5017","url":"https:\/\/www.aclweb.org\/anthology\/W18-5017","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5018","title":"Discovering User Groups for Natural Language Generation","authors":["Engonopoulos, Nikos","Teichmann, Christoph","Koller, Alexander"],"emails":["nikos@coli.uni-saarland.de","cteichmann@coli.uni-saarland.de","koller@coli.uni-saarland.de"],"author_id":["nikos-engonopoulos","christoph-teichmann","alexander-koller"],"abstract":"We present a model which predicts how individual users of a dialog system understand and produce utterances based on user groups. In contrast to previous work, these user groups are not specified beforehand, but learned in training. We evaluate on two referring expression (RE) generation tasks; our experiments show that our model can identify user groups and learn how to most effectively talk to them, and can dynamically assign unseen users to the correct groups as they interact with the system.","pages":"171--179","doi":"10.18653\/v1\/W18-5018","url":"https:\/\/www.aclweb.org\/anthology\/W18-5018","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5019","title":"Controlling Personality-Based Stylistic Variation with Neural Natural Language Generators","authors":["Oraby, Shereen","Reed, Lena","Tandon, Shubhangi","T.S., Sharath","Lukin, Stephanie","Walker, Marilyn"],"emails":["soraby@ucsc.edu","lireed@ucsc.edu","shtandon@ucsc.edu","sturuvek@ucsc.edu","stephanie.m.lukin.civ@mail.mil","mawalker@ucsc.edu"],"author_id":["shereen-oraby","lena-reed","shubhangi-tandon","sharath-t-s","stephanie-lukin","marilyn-walker"],"abstract":"Natural language generators for task-oriented dialogue must effectively realize system dialogue actions and their associated semantics. In many applications, it is also desirable for generators to control the style of an utterance. To date, work on task-oriented neural generation has primarily focused on semantic fidelity rather than achieving stylistic goals, while work on style has been done in contexts where it is difficult to measure content preservation. Here we present three different sequence-to-sequence models and carefully test how well they disentangle content and style. We use a statistical generator, Personage, to synthesize a new corpus of over 88,000 restaurant domain utterances whose style varies according to models of personality, giving us total control over both the semantic content and the stylistic variation in the training data. We then vary the amount of explicit stylistic supervision given to the three models. We show that our most explicit model can simultaneously achieve high fidelity to both semantic and stylistic goals: this model adds a context vector of 36 stylistic parameters as input to the hidden state of the encoder at each time step, showing the benefits of explicit stylistic supervision, even when the amount of training data is large.","pages":"180--190","doi":"10.18653\/v1\/W18-5019","url":"https:\/\/www.aclweb.org\/anthology\/W18-5019","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5020","title":"A Context-aware Convolutional Natural Language Generation model for Dialogue Systems","authors":["Mangrulkar, Sourab","Shrivastava, Suhani","Thenkanidiyoor, Veena","Aroor Dinesh, Dileep"],"emails":["100rabmangrulkar@gmail.com","suhani1396@gmail.com","veenat@nitgoa.ac.in","addileep@iitmandi.ac.in"],"author_id":["sourab-mangrulkar","suhani-shrivastava","veena-thenkanidiyoor","dileep-aroor-dinesh"],"abstract":"Natural language generation (NLG) is an important component in spoken dialog systems (SDSs). A model for NLG involves sequence to sequence learning. State-of-the-art NLG models are built using recurrent neural network (RNN) based sequence to sequence models (Ond{\\v{r}}ej Du{\\v{s}}ek and Filip Jur{\\v{c}}{\\'\\i}{\\v{c}}ek, 2016a). Convolutional sequence to sequence based models have been used in the domain of machine translation but their application as Natural Language Generators in dialogue systems is still unexplored. In this work, we propose a novel approach to NLG using convolutional neural network (CNN) based sequence to sequence learning. CNN-based approach allows to build a hierarchical model which encapsulates dependencies between words via shorter path unlike RNNs. In contrast to recurrent models, convolutional approach allows for efficient utilization of computational resources by parallelizing computations over all elements, and eases the learning process by applying constant number of nonlinearities. We also propose to use CNN-based reranker for obtaining responses having semantic correspondence with input dialogue acts. The proposed model is capable of entrainment. Studies using a standard dataset shows the effectiveness of the proposed CNN-based approach to NLG.","pages":"191--200","doi":"10.18653\/v1\/W18-5020","url":"https:\/\/www.aclweb.org\/anthology\/W18-5020","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5021","title":"A Unified Neural Architecture for Joint Dialog Act Segmentation and Recognition in Spoken Dialog System","authors":["Zhao, Tianyu","Kawahara, Tatsuya"],"emails":["zhao@sap.ist.i.kyoto-u.ac.jp","kawahara@i.kyoto-u.ac.jp"],"author_id":["tianyu-zhao","tatsuya-kawahara"],"abstract":"In spoken dialog systems (SDSs), dialog act (DA) segmentation and recognition provide essential information for response generation. A majority of previous works assumed ground-truth segmentation of DA units, which is not available from automatic speech recognition (ASR) in SDS. We propose a unified architecture based on neural networks, which consists of a sequence tagger for segmentation and a classifier for recognition. The DA recognition model is based on hierarchical neural networks to incorporate the context of preceding sentences. We investigate sharing some layers of the two components so that they can be trained jointly and learn generalized features from both tasks. An evaluation on the Switchboard Dialog Act (SwDA) corpus shows that the jointly-trained models outperform independently-trained models, single-step models, and other reported results in DA segmentation, recognition, and joint tasks.","pages":"201--208","doi":"10.18653\/v1\/W18-5021","url":"https:\/\/www.aclweb.org\/anthology\/W18-5021","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5022","title":"Cost-Sensitive Active Learning for Dialogue State Tracking","authors":["Xie, Kaige","Chang, Cheng","Ren, Liliang","Chen, Lu","Yu, Kai"],"emails":["lightyear0117@sjtu.edu.cn","cheng.chang@sjtu.edu.cn","renll204@sjtu.edu.cn","chenlusz@sjtu.edu.cn","kai.yu@sjtu.edu.cn"],"author_id":["kaige-xie","cheng-chang","liliang-ren","lu-chen","kai-yu"],"abstract":"Dialogue state tracking (DST), when formulated as a supervised learning problem, relies on labelled data. Since dialogue state annotation usually requires labelling all turns of a single dialogue and utilizing context information, it is very expensive to annotate all available unlabelled data. In this paper, a novel cost-sensitive active learning framework is proposed based on a set of new dialogue-level query strategies. This is the first attempt to apply active learning for dialogue state tracking. Experiments on DSTC2 show that active learning with mixed data query strategies can effectively achieve the same DST performance with significantly less data annotation compared to traditional training approaches.","pages":"209--213","doi":"10.18653\/v1\/W18-5022","url":"https:\/\/www.aclweb.org\/anthology\/W18-5022","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5023","title":"Discourse Coherence in the Wild: A Dataset, Evaluation and Methods","authors":["Lai, Alice","Tetreault, Joel"],"emails":["aylai2@illinois.edu","joel.tetreault@grammarly.com"],"author_id":["alice-lai","joel-tetreault"],"abstract":"To date there has been very little work on assessing discourse coherence methods on real-world data. To address this, we present a new corpus of real-world texts (GCDC) as well as the first large-scale evaluation of leading discourse coherence algorithms. We show that neural models, including two that we introduce here (SentAvg and ParSeq), tend to perform best. We analyze these performance differences and discuss patterns we observed in low coherence texts in four domains.","pages":"214--223","doi":"10.18653\/v1\/W18-5023","url":"https:\/\/www.aclweb.org\/anthology\/W18-5023","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5024","title":"Neural Dialogue Context Online End-of-Turn Detection","authors":["Masumura, Ryo","Tanaka, Tomohiro","Ando, Atsushi","Ishii, Ryo","Higashinaka, Ryuichiro","Aono, Yushi"],"emails":["ryou.masumura.ba@hco.ntt.co.jp","","","","",""],"author_id":["ryo-masumura","tomohiro-tanaka","atsushi-ando","ryo-ishii","ryuichiro-higashinaka","yushi-aono"],"abstract":"This paper proposes a fully neural network based dialogue-context online end-of-turn detection method that can utilize long-range interactive information extracted from both speaker{'}s utterances and collocutor{'}s utterances. The proposed method combines multiple time-asynchronous long short-term memory recurrent neural networks, which can capture speaker{'}s and collocutor{'}s multiple sequential features, and their interactions. On the assumption of applying the proposed method to spoken dialogue systems, we introduce speaker{'}s acoustic sequential features and collocutor{'}s linguistic sequential features, each of which can be extracted in an online manner. Our evaluation confirms the effectiveness of taking dialogue context formed by the speaker{'}s utterances and collocutor{'}s utterances into consideration.","pages":"224--228","doi":"10.18653\/v1\/W18-5024","url":"https:\/\/www.aclweb.org\/anthology\/W18-5024","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5025","title":"Spoken Dialogue for Information Navigation","authors":["Papangelis, Alexandros","Papadakos, Panagiotis","Stylianou, Yannis","Tzitzikas, Yannis"],"emails":["alex.papangelis@crl.toshiba.co.uk","papadako@ics.forth.gr","yannis.stylianou@crl.toshiba.co.uk","tzitzik@ics.forth.gr"],"author_id":["alexandros-papangelis","panagiotis-papadakos","yannis-stylianou","yannis-tzitzikas"],"abstract":"Aiming to expand the current research paradigm for training conversational AI agents that can address real-world challenges, we take a step away from traditional slot-filling goal-oriented spoken dialogue systems (SDS) and model the dialogue in a way that allows users to be more expressive in describing their needs. The goal is to help users make informed decisions rather than being fed matching items. To this end, we describe the Linked-Data SDS (LD-SDS), a system that exploits semantic knowledge bases that connect to linked data, and supports complex constraints and preferences. We describe the required changes in language understanding and state tracking, and the need for mined features, and we report the promising results (in terms of semantic errors, effort, etc) of a preliminary evaluation after training two statistical dialogue managers in various conditions.","pages":"229--234","doi":"10.18653\/v1\/W18-5025","url":"https:\/\/www.aclweb.org\/anthology\/W18-5025","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5026","title":"Improving User Impression in Spoken Dialog System with Gradual Speech Form Control","authors":["Kageyama, Yukiko","Chiba, Yuya","Nose, Takashi","Ito, Akinori"],"emails":["","","",""],"author_id":["yukiko-kageyama","yuya-chiba","takashi-nose","akinori-ito"],"abstract":"This paper examines a method to improve the user impression of a spoken dialog system by introducing a mechanism that gradually changes form of utterances every time the user uses the system. In some languages, including Japanese, the form of utterances changes corresponding to social relationship between the talker and the listener. Thus, this mechanism can be effective to express the system{'}s intention to make social distance to the user closer; however, an actual effect of this method is not investigated enough when introduced to the dialog system. In this paper, we conduct dialog experiments and show that controlling the form of system utterances can improve the users{'} impression.","pages":"235--240","doi":"10.18653\/v1\/W18-5026","url":"https:\/\/www.aclweb.org\/anthology\/W18-5026","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5027","title":"A Bilingual Interactive Human Avatar Dialogue System","authors":["Abu Ali, Dana","Ahmad, Muaz","Al Hassan, Hayat","Dozsa, Paula","Hu, Ming","Varias, Jose","Habash, Nizar"],"emails":["daa389@nyu.edu","muaz.ahmad@nyu.edu","hayat.alhassan@nyu.edu","pauladozsa@nyu.edu","ming.hu@nyu.edu","jose.varias@nyu.edu","nizar.habash@nyu.edu"],"author_id":["dana-abu-ali","muaz-ahmad","hayat-al-hassan","paula-dozsa","ming-hu","jose-varias","nizar-habash"],"abstract":"This demonstration paper presents a bilingual (Arabic-English) interactive human avatar dialogue system. The system is named TOIA (time-offset interaction application), as it simulates face-to-face conversations between humans using digital human avatars recorded in the past. TOIA is a conversational agent, similar to a chat bot, except that it is based on an actual human being and can be used to preserve and tell stories. The system is designed to allow anybody, simply using a laptop, to create an avatar of themselves, thus facilitating cross-cultural and cross-generational sharing of narratives to wider audiences. The system currently supports monolingual and cross-lingual dialogues in Arabic and English, but can be extended to other languages.","pages":"241--244","doi":"10.18653\/v1\/W18-5027","url":"https:\/\/www.aclweb.org\/anthology\/W18-5027","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5028","title":"{D}ial{C}rowd: A toolkit for easy dialog system assessment","authors":["Lee, Kyusong","Zhao, Tiancheng","Black, Alan W.","Eskenazi, Maxine"],"emails":["","","",""],"author_id":["kyusong-lee","tiancheng-zhao","alan-w-black","maxine-eskenazi"],"abstract":"When creating a dialog system, developers need to test each version to ensure that it is performing correctly. Recently the trend has been to test on large datasets or to ask many users to try out a system. Crowdsourcing has solved the issue of finding users, but it presents new challenges such as how to use a crowdsourcing platform and what type of test is appropriate. DialCrowd has been designed to make system assessment easier and to ensure the quality of the result. This paper describes DialCrowd, what specific needs it fulfills and how it works. It then relates a test of DialCrowd by a group of dialog system developer.","pages":"245--248","doi":"10.18653\/v1\/W18-5028","url":"https:\/\/www.aclweb.org\/anthology\/W18-5028","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5029","title":"Leveraging Multimodal Dialog Technology for the Design of Automated and Interactive Student Agents for Teacher Training","authors":["Pautler, David","Ramanarayanan, Vikram","Cofino, Kirby","Lange, Patrick","Suendermann-Oeft, David"],"emails":["","","","",""],"author_id":["david-pautler","vikram-ramanarayanan","kirby-cofino","patrick-l-lange","david-suendermann-oeft"],"abstract":"We present a paradigm for interactive teacher training that leverages multimodal dialog technology to puppeteer custom-designed embodied conversational agents (ECAs) in student roles. We used the open-source multimodal dialog system HALEF to implement a small-group classroom math discussion involving Venn diagrams where a human teacher candidate has to interact with two student ECAs whose actions are controlled by the dialog system. Such an automated paradigm has the potential to be extended and scaled to a wide range of interactive simulation scenarios in education, medicine, and business where group interaction training is essential.","pages":"249--252","doi":"10.18653\/v1\/W18-5029","url":"https:\/\/www.aclweb.org\/anthology\/W18-5029","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5030","title":"An Empirical Study of Self-Disclosure in Spoken Dialogue Systems","authors":["Ravichander, Abhilasha","Black, Alan W."],"emails":["aravicha@cs.cmu.edu","awb@cs.cmu.edu"],"author_id":["abhilasha-ravichander","alan-w-black"],"abstract":"Self-disclosure is a key social strategy employed in conversation to build relations and increase conversational depth. It has been heavily studied in psychology and linguistic literature, particularly for its ability to induce self-disclosure from the recipient, a phenomena known as reciprocity. However, we know little about how self-disclosure manifests in conversation with automated dialog systems, especially as any self-disclosure on the part of a dialog system is patently disingenuous. In this work, we run a large-scale quantitative analysis on the effect of self-disclosure by analyzing interactions between real-world users and a spoken dialog system in the context of social conversation. We find that indicators of reciprocity occur even in human-machine dialog, with far-reaching implications for chatbots in a variety of domains including education, negotiation and social dialog.","pages":"253--263","doi":"10.18653\/v1\/W18-5030","url":"https:\/\/www.aclweb.org\/anthology\/W18-5030","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5031","title":"Role play-based question-answering by real users for building chatbots with consistent personalities","authors":["Higashinaka, Ryuichiro","Mizukami, Masahiro","Kawabata, Hidetoshi","Yamaguchi, Emi","Adachi, Noritake","Tomita, Junji"],"emails":["higashinaka.ryuichiro@lab.ntt.co.jp","mizukami.masahiro@lab.ntt.co.jp","","","adachi@dwango.co.jp","tomita.junji@lab.ntt.co.jp"],"author_id":["ryuichiro-higashinaka","masahiro-mizukami","hidetoshi-kawabata","emi-yamaguchi","noritake-adachi","junji-tomita"],"abstract":"Having consistent personalities is important for chatbots if we want them to be believable. Typically, many question-answer pairs are prepared by hand for achieving consistent responses; however, the creation of such pairs is costly. In this study, our goal is to collect a large number of question-answer pairs for a particular character by using role play-based question-answering in which multiple users play the roles of certain characters and respond to questions by online users. Focusing on two famous characters, we conducted a large-scale experiment to collect question-answer pairs by using real users. We evaluated the effectiveness of role play-based question-answering and found that, by using our proposed method, the collected pairs lead to good-quality chatbots that exhibit consistent personalities.","pages":"264--272","doi":"10.18653\/v1\/W18-5031","url":"https:\/\/www.aclweb.org\/anthology\/W18-5031","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5032","title":"Addressing Objects and Their Relations: The Conversational Entity Dialogue Model","authors":["Ultes, Stefan","Budzianowski, Pawe{\\l}","Casanueva, I{\\~n}igo","Rojas-Barahona, Lina M.","Tseng, Bo-Hsiang","Wu, Yen-Chen","Young, Steve","Ga{\\v{s}}i{\\'c}, Milica"],"emails":["su259@cam.ac.uk","pfb30@cam.ac.uk","ic340@cam.ac.uk","lmr46@cam.ac.uk","bht26@cam.ac.uk","ycw30@cam.ac.uk","sjy11@cam.ac.uk","mg436@cam.ac.uk"],"author_id":["stefan-ultes","pawel-budzianowski","inigo-casanueva","lina-m-rojas-barahona","bo-hsiang-tseng","yen-chen-wu","steve-young","milica-gasic"],"abstract":"Statistical spoken dialogue systems usually rely on a single- or multi-domain dialogue model that is restricted in its capabilities of modelling complex dialogue structures, e.g., relations. In this work, we propose a novel dialogue model that is centred around entities and is able to model relations as well as multiple entities of the same type. We demonstrate in a prototype implementation benefits of relation modelling on the dialogue level and show that a trained policy using these relations outperforms the multi-domain baseline. Furthermore, we show that by modelling the relations on the dialogue level, the system is capable of processing relations present in the user input and even learns to address them in the system response.","pages":"273--283","doi":"10.18653\/v1\/W18-5032","url":"https:\/\/www.aclweb.org\/anthology\/W18-5032","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5033","title":"Conversational Image Editing: Incremental Intent Identification in a New Dialogue Task","authors":["Manuvinakurike, Ramesh","Bui, Trung","Chang, Walter","Georgila, Kallirroi"],"emails":["manuvinakurike@ict.usc.edu","bui@adobe.com","wachang@adobe.com","kgeorgila@ict.usc.edu"],"author_id":["ramesh-manuvinakurike","trung-bui","walter-chang","kallirroi-georgila"],"abstract":"We present {``}conversational image editing{''}, a novel real-world application domain combining dialogue, visual information, and the use of computer vision. We discuss the importance of dialogue incrementality in this task, and build various models for incremental intent identification based on deep learning and traditional classification algorithms. We show how our model based on convolutional neural networks outperforms models based on random forests, long short term memory networks, and conditional random fields. By training embeddings based on image-related dialogue corpora, we outperform pre-trained out-of-the-box embeddings, for intention identification tasks. Our experiments also provide evidence that incremental intent processing may be more efficient for the user and could save time in accomplishing tasks.","pages":"284--295","doi":"10.18653\/v1\/W18-5033","url":"https:\/\/www.aclweb.org\/anthology\/W18-5033","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5034","title":"Fine-Grained Discourse Structures in Continuation Semantics","authors":["Bernard, Timoth{\\'e}e"],"emails":["timothee.bernard@ens-lyon.org"],"author_id":["timothee-bernard"],"abstract":"In this work, we are interested in the computation of logical representations of discourse. We argue that all discourse connectives are anaphors obeying different sets of constraints and show how this view allows one to account for the semantically parenthetical use of attitude verbs and verbs of report (e.g., think, say) and for sequences of conjunctions (A CONJ{\\_}1 B CONJ{\\_}2 C). We implement this proposal in event semantics using de Groote (2006){'}s dynamic framework.","pages":"296--305","doi":"10.18653\/v1\/W18-5034","url":"https:\/\/www.aclweb.org\/anthology\/W18-5034","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5035","title":"Automatic Extraction of Causal Relations from Text using Linguistically Informed Deep Neural Networks","authors":["Dasgupta, Tirthankar","Saha, Rupsa","Dey, Lipika","Naskar, Abir"],"emails":["dasgupta.tirthankar@tcs.com","rupsa.s@tcs.com","lipika.dey@tcs.com","abir.naskar@tcs.com"],"author_id":["tirthankar-dasgupta","rupsa-saha","lipika-dey","abir-naskar"],"abstract":"In this paper we have proposed a linguistically informed recursive neural network architecture for automatic extraction of cause-effect relations from text. These relations can be expressed in arbitrarily complex ways. The architecture uses word level embeddings and other linguistic features to detect causal events and their effects mentioned within a sentence. The extracted events and their relations are used to build a causal-graph after clustering and appropriate generalization, which is then used for predictive purposes. We have evaluated the performance of the proposed extraction model with respect to two baseline systems,one a rule-based classifier, and the other a conditional random field (CRF) based supervised model. We have also compared our results with related work reported in the past by other authors on SEMEVAL data set, and found that the proposed bi-directional LSTM model enhanced with an additional linguistic layer performs better. We have also worked extensively on creating new annotated datasets from publicly available data, which we are willing to share with the community.","pages":"306--316","doi":"10.18653\/v1\/W18-5035","url":"https:\/\/www.aclweb.org\/anthology\/W18-5035","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5036","title":"Toward zero-shot Entity Recognition in Task-oriented Conversational Agents","authors":["Guerini, Marco","Magnolini, Simone","Balaraman, Vevake","Magnini, Bernardo"],"emails":["guerini@fbk.eu","magnolini@fbk.eu","balaraman@fbk.eu","magnini@fbk.eu"],"author_id":["marco-guerini","simone-magnolini","vevake-balaraman","bernardo-magnini"],"abstract":"We present a domain portable zero-shot learning approach for entity recognition in task-oriented conversational agents, which does not assume any annotated sentences at training time. Rather, we derive a neural model of the entity names based only on available gazetteers, and then apply the model to recognize new entities in the context of user utterances. In order to evaluate our working hypothesis we focus on nominal entities that are largely used in e-commerce to name products. Through a set of experiments in two languages (English and Italian) and three different domains (furniture, food, clothing), we show that the neural gazetteer-based approach outperforms several competitive baselines, with minimal requirements of linguistic features.","pages":"317--326","doi":"10.18653\/v1\/W18-5036","url":"https:\/\/www.aclweb.org\/anthology\/W18-5036","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5037","title":"Identifying Explicit Discourse Connectives in {G}erman","authors":["Bourgonje, Peter","Stede, Manfred"],"emails":["peter.bourgonje@uni-potsdam.de","manfred.stede@uni-potsdam.de"],"author_id":["peter-bourgonje","manfred-stede"],"abstract":"We are working on an end-to-end Shallow Discourse Parsing system for German and in this paper focus on the first subtask: the identification of explicit connectives. Starting with the feature set from an English system and a Random Forest classifier, we evaluate our approach on a (relatively small) German annotated corpus, the Potsdam Commentary Corpus. We introduce new features and experiment with including additional training data obtained through annotation projection and achieve an f-score of 83.89.","pages":"327--331","doi":"10.18653\/v1\/W18-5037","url":"https:\/\/www.aclweb.org\/anthology\/W18-5037","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5038","title":"Feudal Dialogue Management with Jointly Learned Feature Extractors","authors":["Casanueva, I{\\~n}igo","Budzianowski, Pawe{\\l}","Ultes, Stefan","Kreyssig, Florian","Tseng, Bo-Hsiang","Wu, Yen-chen","Ga{\\v{s}}i{\\'c}, Milica"],"emails":["ic340@cam.ac.uk","pfb30@cam.ac.uk","","","","","mg436@cam.ac.uk"],"author_id":["inigo-casanueva","pawel-budzianowski","stefan-ultes","florian-kreyssig","bo-hsiang-tseng","yen-chen-wu1","milica-gasic"],"abstract":"Reinforcement learning (RL) is a promising dialogue policy optimisation approach, but traditional RL algorithms fail to scale to large domains. Recently, Feudal Dialogue Management (FDM), has shown to increase the scalability to large domains by decomposing the dialogue management decision into two steps, making use of the domain ontology to abstract the dialogue state in each step. In order to abstract the state space, however, previous work on FDM relies on handcrafted feature functions. In this work, we show that these feature functions can be learned jointly with the policy model while obtaining similar performance, even outperforming the handcrafted features in several environments and domains.","pages":"332--337","doi":"10.18653\/v1\/W18-5038","url":"https:\/\/www.aclweb.org\/anthology\/W18-5038","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5039","title":"Variational Cross-domain Natural Language Generation for Spoken Dialogue Systems","authors":["Tseng, Bo-Hsiang","Kreyssig, Florian","Budzianowski, Pawe{\\l}","Casanueva, I{\\~n}igo","Wu, Yen-Chen","Ultes, Stefan","Ga{\\v{s}}i{\\'c}, Milica"],"emails":["bht26@cam.ac.uk","flk24@cam.ac.uk","pfb30@cam.ac.uk","ic340@cam.ac.uk","ycw30@cam.ac.uk","su259@cam.ac.uk","mg436@cam.ac.uk"],"author_id":["bo-hsiang-tseng","florian-kreyssig","pawel-budzianowski","inigo-casanueva","yen-chen-wu","stefan-ultes","milica-gasic"],"abstract":"Cross-domain natural language generation (NLG) is still a difficult task within spoken dialogue modelling. Given a semantic representation provided by the dialogue manager, the language generator should generate sentences that convey desired information. Traditional template-based generators can produce sentences with all necessary information, but these sentences are not sufficiently diverse. With RNN-based models, the diversity of the generated sentences can be high, however, in the process some information is lost. In this work, we improve an RNN-based generator by considering latent information at the sentence level during generation using conditional variational auto-encoder architecture. We demonstrate that our model outperforms the original RNN-based generator, while yielding highly diverse sentences. In addition, our model performs better when the training data is limited.","pages":"338--343","doi":"10.18653\/v1\/W18-5039","url":"https:\/\/www.aclweb.org\/anthology\/W18-5039","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5040","title":"Coherence Modeling Improves Implicit Discourse Relation Recognition","authors":["Nishida, Noriki","Nakayama, Hideki"],"emails":["nishida@nlab.ci.i.u-tokyo.ac.jp","nakayama@nlab.ci.i.u-tokyo.ac.jp"],"author_id":["noriki-nishida","hideki-nakayama"],"abstract":"The research described in this paper examines how to learn linguistic knowledge associated with discourse relations from unlabeled corpora. We introduce an unsupervised learning method on text coherence that could produce numerical representations that improve implicit discourse relation recognition in a semi-supervised manner. We also empirically examine two variants of coherence modeling: order-oriented and topic-oriented negative sampling, showing that, of the two, topic-oriented negative sampling tends to be more effective.","pages":"344--349","doi":"10.18653\/v1\/W18-5040","url":"https:\/\/www.aclweb.org\/anthology\/W18-5040","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5041","title":"Adversarial Learning of Task-Oriented Neural Dialog Models","authors":["Liu, Bing","Lane, Ian"],"emails":["liubing@cmu.edu","lane@cmu.edu"],"author_id":["bing-liu","ian-lane"],"abstract":"In this work, we propose an adversarial learning method for reward estimation in reinforcement learning (RL) based task-oriented dialog models. Most of the current RL based task-oriented dialog systems require the access to a reward signal from either user feedback or user ratings. Such user ratings, however, may not always be consistent or available in practice. Furthermore, online dialog policy learning with RL typically requires a large number of queries to users, suffering from sample efficiency problem. To address these challenges, we propose an adversarial learning method to learn dialog rewards directly from dialog samples. Such rewards are further used to optimize the dialog policy with policy gradient based RL. In the evaluation in a restaurant search domain, we show that the proposed adversarial dialog learning method achieves advanced dialog success rate comparing to strong baseline methods. We further discuss the covariate shift problem in online adversarial dialog learning and show how we can address that with partial access to user feedback.","pages":"350--359","doi":"10.18653\/v1\/W18-5041","url":"https:\/\/www.aclweb.org\/anthology\/W18-5041","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5042","title":"Constructing a Lexicon of {E}nglish Discourse Connectives","authors":["Das, Debopam","Scheffler, Tatjana","Bourgonje, Peter","Stede, Manfred"],"emails":["debopam.das@uni-potsdam.de","tatjana.scheffler@uni-potsdam.de","peter.bourgonje@uni-potsdam.de","manfred.stede@uni-potsdam.de"],"author_id":["debopam-das","tatjana-scheffler","peter-bourgonje","manfred-stede"],"abstract":"We present a new lexicon of English discourse connectives called DiMLex-Eng, built by merging information from two annotated corpora and an additional list of relation signals from the literature. The format follows the German connective lexicon DiMLex, which provides a cross-linguistically applicable XML schema. DiMLex-Eng contains 149 English connectives, and gives information on syntactic categories, discourse semantics and non-connective uses (if any). We report on the development steps and discuss design decisions encountered in the lexicon expansion phase. The resource is freely available for use in studies of discourse structure and computational applications.","pages":"360--365","doi":"10.18653\/v1\/W18-5042","url":"https:\/\/www.aclweb.org\/anthology\/W18-5042","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5043","title":"Maximizing {SLU} Performance with Minimal Training Data Using Hybrid {RNN} Plus Rule-based Approach","authors":["Homma, Takeshi","Arantes, Adriano S.","Gonzalez Diaz, Maria Teresa","Togami, Masahito"],"emails":["takeshi.homma.ps@hitachi.com","","iaz@hal.hitachi.com",""],"author_id":["takeshi-homma","adriano-s-arantes","maria-teresa-gonzalez-diaz","masahito-togami"],"abstract":"Spoken language understanding (SLU) by using recurrent neural networks (RNN) achieves good performances for large training data sets, but collecting large training datasets is a challenge, especially for new voice applications. Therefore, the purpose of this study is to maximize SLU performances, especially for small training data sets. To this aim, we propose a novel CRF-based dialog act selector which chooses suitable dialog acts from outputs of RNN SLU and rule-based SLU. We evaluate the selector by using DSTC2 corpus when RNN SLU is trained by less than 1,000 training sentences. The evaluation demonstrates the selector achieves Micro F1 better than both RNN and rule-based SLUs. In addition, it shows the selector achieves better Macro F1 than RNN SLU and the same Macro F1 as rule-based SLU. Thus, we confirmed our method offers advantages in SLU performances for small training data sets.","pages":"366--370","doi":"10.18653\/v1\/W18-5043","url":"https:\/\/www.aclweb.org\/anthology\/W18-5043","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5044","title":"An Analysis of the Effect of Emotional Speech Synthesis on Non-Task-Oriented Dialogue System","authors":["Chiba, Yuya","Nose, Takashi","Kase, Taketo","Yamanaka, Mai","Ito, Akinori"],"emails":["","","","",""],"author_id":["yuya-chiba","takashi-nose","taketo-kase","mai-yamanaka","akinori-ito"],"abstract":"This paper explores the effect of emotional speech synthesis on a spoken dialogue system when the dialogue is non-task-oriented. Although the use of emotional speech responses have been shown to be effective in a limited domain, e.g., scenario-based and counseling dialogue, the effect is still not clear in the non-task-oriented dialogue such as voice chatting. For this purpose, we constructed a simple dialogue system with example- and rule-based dialogue management. In the system, two types of emotion labeling with emotion estimation are adopted, i.e., system-driven and user-cooperative emotion labeling. We conducted a dialogue experiment where subjects evaluate the subjective quality of the system and the dialogue from the multiple aspects such as richness of the dialogue and impression of the agent. We then analyze and discuss the results and show the advantage of using appropriate emotions for the expressive speech responses in the non-task-oriented system.","pages":"371--375","doi":"10.18653\/v1\/W18-5044","url":"https:\/\/www.aclweb.org\/anthology\/W18-5044","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5045","title":"Multi-task Learning for Joint Language Understanding and Dialogue State Tracking","authors":["Rastogi, Abhinav","Gupta, Raghav","Hakkani-Tur, Dilek"],"emails":["abhirast@google.com","raghavgupta@google.com","dilek@ieee.org"],"author_id":["abhinav-rastogi","raghav-gupta","dilek-hakkani-tur"],"abstract":"This paper presents a novel approach for multi-task learning of language understanding (LU) and dialogue state tracking (DST) in task-oriented dialogue systems. Multi-task training enables the sharing of the neural network layers responsible for encoding the user utterance for both LU and DST and improves performance while reducing the number of network parameters. In our proposed framework, DST operates on a set of candidate values for each slot that has been mentioned so far. These candidate sets are generated using LU slot annotations for the current user utterance, dialogue acts corresponding to the preceding system utterance and the dialogue state estimated for the previous turn, enabling DST to handle slots with a large or unbounded set of possible values and deal with slot values not seen during training. Furthermore, to bridge the gap between training and inference, we investigate the use of scheduled sampling on LU output for the current user utterance as well as the DST output for the preceding turn.","pages":"376--384","doi":"10.18653\/v1\/W18-5045","url":"https:\/\/www.aclweb.org\/anthology\/W18-5045","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5046","title":"Weighting Model Based on Group Dynamics to Measure Convergence in Multi-party Dialogue","authors":["Rahimi, Zahra","Litman, Diane"],"emails":["zar10@pitt.edu","litman@cs.pitt.edu"],"author_id":["zahra-rahimi","diane-litman"],"abstract":"This paper proposes a new weighting method for extending a dyad-level measure of convergence to multi-party dialogues by considering group dynamics instead of simply averaging. Experiments indicate the usefulness of the proposed weighted measure and also show that in general a proper weighting of the dyad-level measures performs better than non-weighted averaging in multiple tasks.","pages":"385--390","doi":"10.18653\/v1\/W18-5046","url":"https:\/\/www.aclweb.org\/anthology\/W18-5046","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5047","title":"Concept Transfer Learning for Adaptive Language Understanding","authors":["Zhu, Su","Yu, Kai"],"emails":["paul2204@sjtu.edu.cn","kai.yu@sjtu.edu.cn"],"author_id":["su-zhu","kai-yu"],"abstract":"Concept definition is important in language understanding (LU) adaptation since literal definition difference can easily lead to data sparsity even if different data sets are actually semantically correlated. To address this issue, in this paper, a novel concept transfer learning approach is proposed. Here, substructures within literal concept definition are investigated to reveal the relationship between concepts. A hierarchical semantic representation for concepts is proposed, where a semantic slot is represented as a composition of \\textit{atomic concepts}. Based on this new hierarchical representation, transfer learning approaches are developed for adaptive LU. The approaches are applied to two tasks: value set mismatch and domain adaptation, and evaluated on two LU benchmarks: ATIS and DSTC 2{\\&}3. Thorough empirical studies validate both the efficiency and effectiveness of the proposed method. In particular, we achieve state-of-the-art performance (F₁-score 96.08{\\%}) on ATIS by only using lexicon features.","pages":"391--399","doi":"10.18653\/v1\/W18-5047","url":"https:\/\/www.aclweb.org\/anthology\/W18-5047","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5048","title":"{C}ogent: A Generic Dialogue System Shell Based on a Collaborative Problem Solving Model","authors":["Galescu, Lucian","Teng, Choh Man","Allen, James","Perera, Ian"],"emails":["lgalescu@ihmc.us","cmteng@ihmc.us","jallen@ihmc.us","iperera@ihmc.us"],"author_id":["lucian-galescu","choh-man-teng","james-allen","ian-perera"],"abstract":"The bulk of current research in dialogue systems is focused on fairly simple task models, primarily state-based. Progress on developing dialogue systems for more complex tasks has been limited by the lack generic toolkits to build from. In this paper we report on our development from the ground up of a new dialogue model based on collaborative problem solving. We implemented the model in a dialogue system shell (Cogent) that al-lows developers to plug in problem-solving agents to create dialogue systems in new domains. The Cogent shell has now been used by several independent teams of researchers to develop dialogue systems in different domains, with varied lexicons and interaction style, each with their own problem-solving back-end. We believe this to be the first practical demonstration of the feasibility of a CPS-based dialogue system shell.","pages":"400--409","doi":"10.18653\/v1\/W18-5048","url":"https:\/\/www.aclweb.org\/anthology\/W18-5048","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W18-5049","title":"Identifying Domain Independent Update Intents in Task Based Dialogs","authors":["Biyani, Prakhar","Akkaya, Cem","Tsioutsiouliklis, Kostas"],"emails":["pbiyani@twitter.com","cakkaya@oath.com","kostas@oath.com"],"author_id":["prakhar-biyani","cem-akkaya","kostas-tsioutsiouliklis"],"abstract":"One important problem in task-based conversations is that of effectively updating the belief estimates of user-mentioned slot-value pairs. Given a user utterance, the intent of a slot-value pair is captured using dialog acts (DA) expressed in that utterance. However, in certain cases, DA{'}s fail to capture the actual update intent of the user. In this paper, we describe such cases and propose a new type of semantic class for user intents. This new type, Update Intents (UI), is directly related to the type of update a user intends to perform for a slot-value pair. We define five types of UI{'}s, which are independent of the domain of the conversation. We build a multi-class classification model using LSTM{'}s to identify the type of UI in user utterances in the Restaurant and Shopping domains. Experimental results show that our models achieve strong classification performance in terms of F-1 score.","pages":"410--419","doi":"10.18653\/v1\/W18-5049","url":"https:\/\/www.aclweb.org\/anthology\/W18-5049","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 19th Annual {SIG}dial Meeting on Discourse and Dialogue"}]