[{"id":"W18-0501","title":"Using exemplar responses for training and evaluating automated speech scoring systems","authors":["Loukina, Anastassia","Zechner, Klaus","Bruno, James","Beigman Klebanov, Beata"],"emails":["aloukina@ets.org","kzechner@ets.org","jbruno@ets.org","bbeigmanklebanov@ets.org"],"author_id":["anastassia-loukina","klaus-zechner","james-bruno","beata-beigman-klebanov"],"abstract":"Automated scoring engines are usually trained and evaluated against human scores and compared to the benchmark of human-human agreement. In this paper we compare the performance of an automated speech scoring engine using two corpora: a corpus of almost 700,000 randomly sampled spoken responses with scores assigned by one or two raters during operational scoring, and a corpus of 16,500 exemplar responses with scores reviewed by multiple expert raters. We show that the choice of corpus used for model evaluation has a major effect on estimates of system performance with r varying between 0.64 and 0.80. Surprisingly, this is not the case for the choice of corpus for model training: when the training corpus is sufficiently large, the systems trained on different corpora showed almost identical performance when evaluated on the same corpus. We show that this effect is consistent across several learning algorithms. We conclude that evaluating the model on a corpus of exemplar responses if one is available provides additional evidence about system validity; at the same time, investing effort into creating a corpus of exemplar responses for model training is unlikely to lead to a substantial gain in model performance.","pages":"1--12","doi":"10.18653\/v1\/W18-0501","url":"https:\/\/www.aclweb.org\/anthology\/W18-0501","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0502","title":"Using Paraphrasing and Memory-Augmented Models to Combat Data Sparsity in Question Interpretation with a Virtual Patient Dialogue System","authors":["Jin, Lifeng","King, David","Hussein, Amad","White, Michael","Danforth, Douglas"],"emails":["jin@ling.osu.edu","king@ling.osu.edu","amadh881@gmail.com","mwhite@ling.osu.edu","doug.danforth@osumc.edu"],"author_id":["lifeng-jin","david-king","amad-hussein","michael-white","douglas-danforth"],"abstract":"When interpreting questions in a virtual patient dialogue system one must inevitably tackle the challenge of a long tail of relatively infrequently asked questions. To make progress on this challenge, we investigate the use of paraphrasing for data augmentation and neural memory-based classification, finding that the two methods work best in combination. In particular, we find that the neural memory-based approach not only outperforms a straight CNN classifier on low frequency questions, but also takes better advantage of the augmented data created by paraphrasing, together yielding a nearly 10{\\%} absolute improvement in accuracy on the least frequently asked questions.","pages":"13--23","doi":"10.18653\/v1\/W18-0502","url":"https:\/\/www.aclweb.org\/anthology\/W18-0502","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0503","title":"Predicting misreadings from gaze in children with reading difficulties","authors":["Bingel, Joachim","Barrett, Maria","Klerke, Sigrid"],"emails":["bingel@di.ku.dk","barrett@hum.ku.dk","sk@eyejustread.com"],"author_id":["joachim-bingel","maria-barrett","sigrid-klerke"],"abstract":"We present the first work on predicting reading mistakes in children with reading difficulties based on eye-tracking data from real-world reading teaching. Our approach employs several linguistic and gaze-based features to inform an ensemble of different classifiers, including multi-task learning models that let us transfer knowledge about individual readers to attain better predictions. Notably, the data we use in this work stems from noisy readings in the wild, outside of controlled lab conditions. Our experiments show that despite the noise and despite the small fraction of misreadings, gaze data improves the performance more than any other feature group and our models achieve good performance. We further show that gaze patterns for misread words do not fully generalize across readers, but that we can transfer some knowledge between readers using multitask learning at least in some cases. Applications of our models include partial automation of reading assessment as well as personalized text simplification.","pages":"24--34","doi":"10.18653\/v1\/W18-0503","url":"https:\/\/www.aclweb.org\/anthology\/W18-0503","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0504","title":"Automatic Input Enrichment for Selecting Reading Material: An Online Study with {E}nglish Teachers","authors":["Chinkina, Maria","Oswal, Ankita","Meurers, Detmar"],"emails":["mchnkina@sfs.uni-tuebingen.de","aoswal@sfs.uni-tuebingen.de","dm@sfs.uni-tuebingen.de"],"author_id":["maria-chinkina","ankita-oswal","detmar-meurers"],"abstract":"Input material at the appropriate level is crucial for language acquisition. Automating the search for such material can systematically and efficiently support teachers in their pedagogical practice. This is the goal of the computational linguistic task of automatic input enrichment (Chinkina {\\&} Meurers, 2016): It analyzes and re-ranks a collection of texts in order to prioritize those containing target linguistic forms. In the online study described in the paper, we collected 240 responses from English teachers in order to investigate whether they preferred automatic input enrichment over web search when selecting reading material for class. Participants demonstrated a general preference for the material provided by an automatic input enrichment system. It was also rated significantly higher than the texts retrieved by a standard web search engine with regard to the representation of linguistic forms and equivalent with regard to the relevance of the content to the topic. We discuss the implications of the results for language teaching and consider the potential strands of future research.","pages":"35--44","doi":"10.18653\/v1\/W18-0504","url":"https:\/\/www.aclweb.org\/anthology\/W18-0504","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0505","title":"Estimating Linguistic Complexity for Science Texts","authors":["Nadeem, Farah","Ostendorf, Mari"],"emails":["farahn@uw.edu","ostendor@uw.edu"],"author_id":["farah-nadeem","mari-ostendorf"],"abstract":"Evaluation of text difficulty is important both for downstream tasks like text simplification, and for supporting educators in classrooms. Existing work on automated text complexity analysis uses linear models with engineered knowledge-driven features as inputs. While this offers interpretability, these models have lower accuracy for shorter texts. Traditional readability metrics have the additional drawback of not generalizing to informational texts such as science. We propose a neural approach, training on science and other informational texts, to mitigate both problems. Our results show that neural methods outperform knowledge-based linear models for short texts, and have the capacity to generalize to genres not present in the training data.","pages":"45--55","doi":"10.18653\/v1\/W18-0505","url":"https:\/\/www.aclweb.org\/anthology\/W18-0505","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0506","title":"Second Language Acquisition Modeling","authors":["Settles, Burr","Brust, Chris","Gustafson, Erin","Hagiwara, Masato","Madnani, Nitin"],"emails":["burr@duolingo.com","chrisb@duolingo.com","erin@duolingo.com","masato@duolingo.com","nmadnani@ets.org"],"author_id":["burr-settles","chris-brust","erin-gustafson","masato-hagiwara","nitin-madnani"],"abstract":"We present the task of \\textit{second language acquisition (SLA) modeling}. Given a history of errors made by learners of a second language, the task is to predict errors that they are likely to make at arbitrary points in the future. We describe a large corpus of more than 7M words produced by more than 6k learners of English, Spanish, and French using Duolingo, a popular online language-learning app. Then we report on the results of a shared task challenge aimed studying the SLA task via this corpus, which attracted 15 teams and synthesized work from various fields including cognitive science, linguistics, and machine learning.","pages":"56--65","doi":"10.18653\/v1\/W18-0506","url":"https:\/\/www.aclweb.org\/anthology\/W18-0506","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0507","title":"A Report on the Complex Word Identification Shared Task 2018","authors":["Yimam, Seid Muhie","Biemann, Chris","Malmasi, Shervin","Paetzold, Gustavo","Specia, Lucia","{\\v{S}}tajner, Sanja","Tack, Ana{\\\"\\i}s","Zampieri, Marcos"],"emails":["yimam@informatik.uni-hamburg.de","","","","","","",""],"author_id":["seid-muhie-yimam","chris-biemann","shervin-malmasi","gustavo-paetzold","lucia-specia","sanja-stajner","anais-tack","marcos-zampieri"],"abstract":"We report the findings of the second Complex Word Identification (CWI) shared task organized as part of the BEA workshop co-located with NAACL-HLT{'}2018. The second CWI shared task featured multilingual and multi-genre datasets divided into four tracks: English monolingual, German monolingual, Spanish monolingual, and a multilingual track with a French test set, and two tasks: binary classification and probabilistic classification. A total of 12 teams submitted their results in different task\/track combinations and 11 of them wrote system description papers that are referred to in this report and appear in the BEA workshop proceedings.","pages":"66--78","doi":"10.18653\/v1\/W18-0507","url":"https:\/\/www.aclweb.org\/anthology\/W18-0507","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0508","title":"Towards Single Word Lexical Complexity Prediction","authors":["Alfter, David","Volodina, Elena"],"emails":["david.alfter@gu.se","elena.volodina@gu.se"],"author_id":["david-alfter","elena-volodina"],"abstract":"In this paper we present work-in-progress where we investigate the usefulness of previously created word lists to the task of single-word lexical complexity analysis and prediction of the complexity level for learners of Swedish as a second language. The word lists used map each word to a single CEFR level, and the task consists of predicting CEFR levels for unseen words. In contrast to previous work on word-level lexical complexity, we experiment with topics as additional features and show that linking words to topics significantly increases accuracy of classification.","pages":"79--88","doi":"10.18653\/v1\/W18-0508","url":"https:\/\/www.aclweb.org\/anthology\/W18-0508","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0509","title":"{COAST} - Customizable Online Syllable Enhancement in Texts. A flexible framework for automatically enhancing reading materials","authors":["Holz, Heiko","Weiss, Zarah","Brehm, Oliver","Meurers, Detmar"],"emails":["heiko.holz@uni-tuebingen.de","zarah-leonie.weiss@uni-tuebingen.de","olibrehm@googlemail.com","dm@sfs.uni-tuebingen.de"],"author_id":["heiko-holz","zarah-weiss","oliver-brehm","detmar-meurers"],"abstract":"This paper presents COAST, a web-based application to easily and automatically enhance syllable structure, word stress, and spacing in texts, that was designed in close collaboration with learning therapists to ensure its practical relevance. Such syllable-enhanced texts are commonly used in learning therapy or private tuition to promote the recognition of syllables in order to improve reading and writing skills. In a state of the art solutions for automatic syllable enhancement, we put special emphasis on syllable stress and support specific marking of the primary syllable stress in words. Core features of our tool are i) a highly customizable text enhancement and template functionality, and ii) a novel crowd-sourcing mechanism that we employ to address the issue of data sparsity in language resources. We successfully tested COAST with real-life practitioners in a series of user tests validating the concept of our framework.","pages":"89--100","doi":"10.18653\/v1\/W18-0509","url":"https:\/\/www.aclweb.org\/anthology\/W18-0509","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0510","title":"Annotating picture description task responses for content analysis","authors":["King, Levi","Dickinson, Markus"],"emails":["leviking@indiana.edu","md7@indiana.edu"],"author_id":["levi-king","markus-dickinson"],"abstract":"Given that all users of a language can be creative in their language usage, the overarching goal of this work is to investigate issues of variability and acceptability in written text, for both non-native speakers (NNSs) and native speakers (NSs). We control for meaning by collecting a dataset of picture description task (PDT) responses from a number of NSs and NNSs, and we define and annotate a handful of features pertaining to form and meaning, to capture the multi-dimensional ways in which responses can vary and can be acceptable. By examining the decisions made in this corpus development, we highlight the questions facing anyone working with learner language properties like variability, acceptability and native-likeness. We find reliable inter-annotator agreement, though disagreements point to difficult areas for establishing a link between form and meaning.","pages":"101--109","doi":"10.18653\/v1\/W18-0510","url":"https:\/\/www.aclweb.org\/anthology\/W18-0510","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0511","title":"Annotating Student Talk in Text-based Classroom Discussions","authors":["Lugini, Luca","Litman, Diane","Godley, Amanda","Olshefski, Christopher"],"emails":["lul32@pitt.edu","dlitman@pitt.edu","agodley@pitt.edu","cao48@pitt.edu"],"author_id":["luca-lugini","diane-litman","amanda-godley","christopher-olshefski"],"abstract":"Classroom discussions in English Language Arts have a positive effect on students{'} reading, writing and reasoning skills. Although prior work has largely focused on teacher talk and student-teacher interactions, we focus on three theoretically-motivated aspects of high-quality student talk: argumentation, specificity, and knowledge domain. We introduce an annotation scheme, then show that the scheme can be used to produce reliable annotations and that the annotations are predictive of discussion quality. We also highlight opportunities provided by our scheme for education and natural language processing research.","pages":"110--116","doi":"10.18653\/v1\/W18-0511","url":"https:\/\/www.aclweb.org\/anthology\/W18-0511","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0512","title":"Toward Automatically Measuring Learner Ability from Human-Machine Dialog Interactions using Novel Psychometric Models","authors":["Ramanarayanan, Vikram","LaMar, Michelle"],"emails":["vramanarayanan@ets.org","mlamar@ets.org"],"author_id":["vikram-ramanarayanan","michelle-lamar"],"abstract":"While dialog systems have been widely deployed for computer-assisted language learning (CALL) and formative assessment systems in recent years, relatively limited work has been done with respect to the psychometrics and validity of these technologies in evaluating and providing feedback regarding student learning and conversational ability. This paper formulates a Markov decision process based measurement model, and applies it to text chat data collected from crowdsourced native and non-native English language speakers interacting with an automated dialog agent. We investigate how well the model measures speaker conversational ability, and find that it effectively captures the differences in how native and non-native speakers of English accomplish the dialog task. Such models could have important implications for CALL systems of the future that effectively combine dialog management with measurement of learner conversational ability in real-time.","pages":"117--126","doi":"10.18653\/v1\/W18-0512","url":"https:\/\/www.aclweb.org\/anthology\/W18-0512","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0513","title":"Generating Feedback for {E}nglish Foreign Language Exercises","authors":["Rudzewitz, Bj{\\\"o}rn","Ziai, Ramon","De Kuthy, Kordula","M{\\\"o}ller, Verena","Nuxoll, Florian","Meurers, Detmar"],"emails":["","","","","",""],"author_id":["bjorn-rudzewitz","ramon-ziai","kordula-de-kuthy","verena-moller","florian-nuxoll","detmar-meurers"],"abstract":"While immediate feedback on learner language is often discussed in the Second Language Acquisition literature (e.g., Mackey 2006), few systems used in real-life educational settings provide helpful, metalinguistic feedback to learners. In this paper, we present a novel approach leveraging task information to generate the expected range of well-formed and ill-formed variability in learner answers along with the required diagnosis and feedback. We combine this offline generation approach with an online component that matches the actual student answers against the pre-computed hypotheses. The results obtained for a set of 33 thousand answers of 7th grade German high school students learning English show that the approach successfully covers frequent answer patterns. At the same time, paraphrases and content errors require a more flexible alignment approach, for which we are planning to complement the method with the CoMiC approach successfully used for the analysis of reading comprehension answers (Meurers et al., 2011).","pages":"127--136","doi":"10.18653\/v1\/W18-0513","url":"https:\/\/www.aclweb.org\/anthology\/W18-0513","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0514","title":"{NT}2{L}ex: A {CEFR}-Graded Lexical Resource for {D}utch as a Foreign Language Linked to Open {D}utch {W}ord{N}et","authors":["Tack, Ana{\\\"\\i}s","Fran{\\c{c}}ois, Thomas","Desmet, Piet","Fairon, C{\\'e}drick"],"emails":["anais.tack@uclouvain.be","thomas.francois@uclouvain.be","piet.desmet@kuleuven.be","cedrick.fairon@uclouvain.be"],"author_id":["anais-tack","thomas-francois","piet-desmet","cedrick-fairon"],"abstract":"In this paper, we introduce NT2Lex, a novel lexical resource for Dutch as a foreign language (NT2) which includes frequency distributions of 17,743 words and expressions attested in expert-written textbook texts and readers graded along the scale of the Common European Framework of Reference (CEFR). In essence, the lexicon informs us about what kind of vocabulary should be understood when reading Dutch as a non-native reader at a particular proficiency level. The main novelty of the resource with respect to the previously developed CEFR-graded lexicons concerns the introduction of corpus-based evidence for L2 word sense complexity through the linkage to Open Dutch WordNet (Postma et al., 2016). The resource thus contains, on top of the lemmatised and part-of-speech tagged lexical entries, a total of 11,999 unique word senses and 8,934 distinct synsets.","pages":"137--146","doi":"10.18653\/v1\/W18-0514","url":"https:\/\/www.aclweb.org\/anthology\/W18-0514","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0515","title":"Experiments with Universal {CEFR} Classification","authors":["Vajjala, Sowmya","Rama, Taraka"],"emails":["sowmya@iastate.edu","tarakark@ifi.uio.no"],"author_id":["sowmya-vajjala","taraka-rama"],"abstract":"The Common European Framework of Reference (CEFR) guidelines describe language proficiency of learners on a scale of 6 levels. While the description of CEFR guidelines is generic across languages, the development of automated proficiency classification systems for different languages follow different approaches. In this paper, we explore universal CEFR classification using domain-specific and domain-agnostic, theory-guided as well as data-driven features. We report the results of our preliminary experiments in monolingual, cross-lingual, and multilingual classification with three languages: German, Czech, and Italian. Our results show that both monolingual and multilingual models achieve similar performance, and cross-lingual classification yields lower, but comparable results to monolingual classification.","pages":"147--153","doi":"10.18653\/v1\/W18-0515","url":"https:\/\/www.aclweb.org\/anthology\/W18-0515","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0516","title":"Chengyu Cloze Test","authors":["Jiang, Zhiying","Zhang, Boliang","Huang, Lifu","Ji, Heng"],"emails":["jiangz6@rpi.edu","zhangb8@rpi.edu","huangl7@rpi.edu","jih@rpi.edu"],"author_id":["zhiying-jiang","boliang-zhang","lifu-huang","heng-ji"],"abstract":"We present a neural recommendation model for Chengyu, which is a special type of Chinese idiom. Given a query, which is a sentence with an empty slot where the Chengyu is taken out, our model will recommend the best Chengyu candidate that best fits the slot context. The main challenge lies in that the literal meaning of a Chengyu is usually very different from it{'}s figurative meaning. We propose a new neural approach to leverage the definition of each Chengyu and incorporate it as background knowledge. Experiments on both Chengyu cloze test and coherence checking in college entrance exams show that our system achieves 89.5{\\%} accuracy on cloze test and outperforms human subjects who attended competitive universities in China. We will make all of our data sets and resources publicly available as a new benchmark for research purposes.","pages":"154--158","doi":"10.18653\/v1\/W18-0516","url":"https:\/\/www.aclweb.org\/anthology\/W18-0516","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0517","title":"{L}a{STUS}\/{TALN} at Complex Word Identification ({CWI}) 2018 Shared Task","authors":["AbuRa{'}ed, Ahmed","Saggion, Horacio"],"emails":["ahmed.aburaed@upf.edu","horacio.saggion@upf.edu"],"author_id":["ahmed-aburaed","horacio-saggion"],"abstract":"This paper presents the participation of the LaSTUS\/TALN team in the Complex Word Identification (CWI) Shared Task 2018 in the English monolingual track . The purpose of the task was to determine if a word in a given sentence can be judged as complex or not by a certain target audience. For the English track, task organizers provided a training and a development datasets of 27,299 and 3,328 words respectively together with the sentence in which each word occurs. The words were judged as complex or not by 20 human evaluators; ten of whom are natives. We submitted two systems: one system modeled each word to evaluate as a numeric vector populated with a set of lexical, semantic and contextual features while the other system relies on a word embedding representation and a distance metric. We trained two separate classifiers to automatically decide if each word is complex or not. We submitted six runs, two for each of the three subsets of the English monolingual CWI track.","pages":"159--165","doi":"10.18653\/v1\/W18-0517","url":"https:\/\/www.aclweb.org\/anthology\/W18-0517","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0518","title":"Cross-lingual complex word identification with multitask learning","authors":["Bingel, Joachim","Bjerva, Johannes"],"emails":["bingel@di.ku.dk","bjerva@di.ku.dk"],"author_id":["joachim-bingel","johannes-bjerva"],"abstract":"We approach the 2018 Shared Task on Complex Word Identification by leveraging a cross-lingual multitask learning approach. Our method is highly language agnostic, as evidenced by the ability of our system to generalize across languages, including languages for which we have no training data. In the shared task, this is the case for French, for which our system achieves the best performance. We further provide a qualitative and quantitative analysis of which words pose problems for our system.","pages":"166--174","doi":"10.18653\/v1\/W18-0518","url":"https:\/\/www.aclweb.org\/anthology\/W18-0518","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0519","title":"{U}nibuc{K}ernel: A kernel-based learning method for complex word identification","authors":["Butnaru, Andrei","Ionescu, Radu Tudor"],"emails":["butnaruandreimadalin@gmail.com","raducu.ionescu@gmail.com"],"author_id":["andrei-butnaru","radu-tudor-ionescu"],"abstract":"In this paper, we present a kernel-based learning approach for the 2018 Complex Word Identification (CWI) Shared Task. Our approach is based on combining multiple low-level features, such as character n-grams, with high-level semantic features that are either automatically learned using word embeddings or extracted from a lexical knowledge base, namely WordNet. After feature extraction, we employ a kernel method for the learning phase. The feature matrix is first transformed into a normalized kernel matrix. For the binary classification task (simple versus complex), we employ Support Vector Machines. For the regression task, in which we have to predict the complexity level of a word (a word is more complex if it is labeled as complex by more annotators), we employ v-Support Vector Regression. We applied our approach only on the three English data sets containing documents from Wikipedia, WikiNews and News domains. Our best result during the competition was the third place on the English Wikipedia data set. However, in this paper, we also report better post-competition results.","pages":"175--183","doi":"10.18653\/v1\/W18-0519","url":"https:\/\/www.aclweb.org\/anthology\/W18-0519","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0520","title":"{CAMB} at {CWI} Shared Task 2018: Complex Word Identification with Ensemble-Based Voting","authors":["Gooding, Sian","Kochmar, Ekaterina"],"emails":["shg36@cam.ac.uk","ek358@cam.ac.uk"],"author_id":["sian-gooding","ekaterina-kochmar"],"abstract":"This paper presents the winning systems we submitted to the Complex Word Identification Shared Task 2018. We describe our best performing systems{'} implementations and discuss our key findings from this research. Our best-performing systems achieve an F1 score of 0.8792 on the NEWS, 0.8430 on the WIKINEWS and 0.8115 on the WIKIPEDIA test sets in the monolingual English binary classification track, and a mean absolute error of 0.0558 on the NEWS, 0.0674 on the WIKINEWS and 0.0739 on the WIKIPEDIA test sets in the probabilistic track.","pages":"184--194","doi":"10.18653\/v1\/W18-0520","url":"https:\/\/www.aclweb.org\/anthology\/W18-0520","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0521","title":"Complex Word Identification Based on Frequency in a Learner Corpus","authors":["Kajiwara, Tomoyuki","Komachi, Mamoru"],"emails":["kajiwara@ids.osaka-u.ac.jp","komachi@tmu.ac.jp"],"author_id":["tomoyuki-kajiwara","mamoru-komachi"],"abstract":"We introduce the TMU systems for the Complex Word Identification (CWI) Shared Task 2018. TMU systems use random forest classifiers and regressors whose features are the number of characters, the number of words, and the frequency of target words in various corpora. Our simple systems performed best on 5 tracks out of 12 tracks. Our ablation analysis revealed the usefulness of a learner corpus for CWI task.","pages":"195--199","doi":"10.18653\/v1\/W18-0521","url":"https:\/\/www.aclweb.org\/anthology\/W18-0521","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0522","title":"The Whole is Greater than the Sum of its Parts: Towards the Effectiveness of Voting Ensemble Classifiers for Complex Word Identification","authors":["Wani, Nikhil","Mathias, Sandeep","Gajjam, Jayashree Aanand","Bhattacharyya, Pushpak"],"emails":["nick.nikhilwani@gmail.com","","aanand@iitb.ac.in",""],"author_id":["nikhil-wani","sandeep-mathias","jayashree-aanand-gajjam","pushpak-bhattacharyya"],"abstract":"In this paper, we present an effective system using voting ensemble classifiers to detect contextually complex words for non-native English speakers. To make the final decision, we channel a set of eight calibrated classifiers based on lexical, size and vocabulary features and train our model with annotated datasets collected from a mixture of native and non-native speakers. Thereafter, we test our system on three datasets namely News, WikiNews, and Wikipedia and report competitive results with an F1-Score ranging between 0.777 to 0.855 for each of the datasets. Our system outperforms multiple other models and falls within 0.042 to 0.026 percent of the best-performing model{'}s score in the shared task.","pages":"200--205","doi":"10.18653\/v1\/W18-0522","url":"https:\/\/www.aclweb.org\/anthology\/W18-0522","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0523","title":"Grotoco@{SLAM}: Second Language Acquisition Modeling with Simple Features, Learners and Task-wise Models","authors":["Klerke, Sigrid","Mart{\\'\\i}nez Alonso, H{\\'e}ctor","Plank, Barbara"],"emails":["sigridklerke@gmail.com","hector.martinezalonso@thomsonreuters.com","bplank@gmail.com"],"author_id":["sigrid-klerke","hector-martinez-alonso","barbara-plank"],"abstract":"We present our submission to the 2018 Duolingo Shared Task on Second Language Acquisition Modeling (SLAM). We focus on evaluating a range of features for the task, including user-derived measures, while examining how far we can get with a simple linear classifier. Our analysis reveals that errors differ per exercise format, which motivates our final and best-performing system: a task-wise (per exercise-format) model.","pages":"206--211","doi":"10.18653\/v1\/W18-0523","url":"https:\/\/www.aclweb.org\/anthology\/W18-0523","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0524","title":"Context Based Approach for Second Language Acquisition","authors":["Nayak, Nihal V.","Rao, Arjun R."],"emails":["nihalnayak@gmail.com","mailarjunrao@gmail.com"],"author_id":["nihal-v-nayak","arjun-r-rao"],"abstract":"SLAM 2018 focuses on predicting a student{'}s mistake while using the Duolingo application. In this paper, we describe the system we developed for this shared task. Our system uses a logistic regression model to predict the likelihood of a student making a mistake while answering an exercise on Duolingo in all three language tracks - English\/Spanish (en\/es), Spanish\/English (es\/en) and French\/English (fr\/en). We conduct an ablation study with several features during the development of this system and discover that context based features plays a major role in language acquisition modeling. Our model beats Duolingo{'}s baseline scores in all three language tracks (AUROC scores for en\/es = 0.821, es\/en = 0.790 and fr\/en = 0.812). Our work makes a case for providing favourable textual context for students while learning second language.","pages":"212--216","doi":"10.18653\/v1\/W18-0524","url":"https:\/\/www.aclweb.org\/anthology\/W18-0524","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0525","title":"Second Language Acquisition Modeling: An Ensemble Approach","authors":["Osika, Anton","Nilsson, Susanna","Sydorchuk, Andrii","Sahin, Faruk","Huss, Anders"],"emails":["anton@sanalabs.com","susanna@sanalabs.com","andrii@sanalabs.com","faruk@sanalabs.com","anders@sanalabs.com"],"author_id":["anton-osika","susanna-nilsson","andrii-sydorchuk","faruk-sahin","anders-huss"],"abstract":"Accurate prediction of students{'} knowledge is a fundamental building block of personalized learning systems. Here, we propose an ensemble model to predict student knowledge gaps. Applying our approach to student trace data from the online educational platform Duolingo we achieved highest score on all three datasets in the 2018 Shared Task on Second Language Acquisition Modeling. We describe our model and discuss relevance of the task compared to how it would be setup in a production environment for personalized education.","pages":"217--222","doi":"10.18653\/v1\/W18-0525","url":"https:\/\/www.aclweb.org\/anthology\/W18-0525","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0526","title":"Modeling Second-Language Learning from a Psychological Perspective","authors":["Rich, Alexander","Osborn Popp, Pamela","Halpern, David","Rothe, Anselm","Gureckis, Todd"],"emails":["asr443@nyu.edu","pamop@nyu.edu","david.halpern@nyu.edu","anselm@nyu.edu","todd.gureckis@nyu.edu"],"author_id":["alexander-rich","pamela-osborn-popp","david-halpern","anselm-rothe","todd-gureckis"],"abstract":"Psychological research on learning and memory has tended to emphasize small-scale laboratory studies. However, large datasets of people using educational software provide opportunities to explore these issues from a new perspective. In this paper we describe our approach to the Duolingo Second Language Acquisition Modeling (SLAM) competition which was run in early 2018. We used a well-known class of algorithms (gradient boosted decision trees), with features partially informed by theories from the psychological literature. After detailing our modeling approach and a number of supplementary simulations, we reflect on the degree to which psychological theory aided the model, and the potential for cognitive science and predictive modeling competitions to gain from each other.","pages":"223--230","doi":"10.18653\/v1\/W18-0526","url":"https:\/\/www.aclweb.org\/anthology\/W18-0526","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0527","title":"A Memory-Sensitive Classification Model of Errors in Early Second Language Learning","authors":["Tomoschuk, Brendan","Lovelett, Jarrett"],"emails":["btomosch@ucsd.edu","jlovelet@ucsd.edu"],"author_id":["brendan-tomoschuk","jarrett-lovelett"],"abstract":"In this paper, we explore a variety of linguistic and cognitive features to better understand second language acquisition in early users of the language learning app Duolingo. With these features, we trained a random forest classifier to predict errors in early learners of French, Spanish, and English. Of particular note was our finding that mean and variance in error for each user and token can be a memory efficient replacement for their respective dummy-encoded categorical variables. At test, these models improved over the baseline model with AUROC values of 0.803 for English, 0.823 for French, and 0.829 for Spanish.","pages":"231--239","doi":"10.18653\/v1\/W18-0527","url":"https:\/\/www.aclweb.org\/anthology\/W18-0527","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0528","title":"Annotation and Classification of Sentence-level Revision Improvement","authors":["Afrin, Tazin","Litman, Diane"],"emails":["tazinafrin@cs.pitt.edu","litman@cs.pitt.edu"],"author_id":["tazin-afrin","diane-litman"],"abstract":"Studies of writing revisions rarely focus on revision quality. To address this issue, we introduce a corpus of between-draft revisions of student argumentative essays, annotated as to whether each revision improves essay quality. We demonstrate a potential usage of our annotations by developing a machine learning model to predict revision improvement. With the goal of expanding training data, we also extract revisions from a dataset edited by expert proofreaders. Our results indicate that blending expert and non-expert revisions increases model performance, with expert data particularly important for predicting low-quality revisions.","pages":"240--246","doi":"10.18653\/v1\/W18-0528","url":"https:\/\/www.aclweb.org\/anthology\/W18-0528","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0529","title":"Language Model Based Grammatical Error Correction without Annotated Training Data","authors":["Bryant, Christopher","Briscoe, Ted"],"emails":["cjb255@cl.cam.ac.uk","ejb1@cl.cam.ac.uk"],"author_id":["christopher-bryant","ted-briscoe"],"abstract":"Since the end of the CoNLL-2014 shared task on grammatical error correction (GEC), research into language model (LM) based approaches to GEC has largely stagnated. In this paper, we re-examine LMs in GEC and show that it is entirely possible to build a simple system that not only requires minimal annotated data (∼1000 sentences), but is also fairly competitive with several state-of-the-art systems. This approach should be of particular interest for languages where very little annotated training data exists, although we also hope to use it as a baseline to motivate future research.","pages":"247--253","doi":"10.18653\/v1\/W18-0529","url":"https:\/\/www.aclweb.org\/anthology\/W18-0529","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0530","title":"A Semantic Role-based Approach to Open-Domain Automatic Question Generation","authors":["Flor, Michael","Riordan, Brian"],"emails":["mflor@ets.org","briordan@ets.org"],"author_id":["michael-flor","brian-riordan"],"abstract":"We present a novel rule-based system for automatic generation of factual questions from sentences, using semantic role labeling (SRL) as the main form of text analysis. The system is capable of generating both wh-questions and yes\/no questions from the same semantic analysis. We present an extensive evaluation of the system and compare it to a recent neural network architecture for question generation. The SRL-based system outperforms the neural system in both average quality and variety of generated questions.","pages":"254--263","doi":"10.18653\/v1\/W18-0530","url":"https:\/\/www.aclweb.org\/anthology\/W18-0530","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0531","title":"Automated Content Analysis: A Case Study of Computer Science Student Summaries","authors":["Gao, Yanjun","Davies, Patricia M.","Passonneau, Rebecca J."],"emails":["yug125@cse.psu.edu","avies@wlv.ac.uk","rjp49@cse.psu.edu"],"author_id":["yanjun-gao","patricia-m-davies","rebecca-j-passonneau"],"abstract":"Technology is transforming Higher Education learning and teaching. This paper reports on a project to examine how and why automated content analysis could be used to assess precis writing by university students. We examine the case of one hundred and twenty-two summaries written by computer science freshmen. The texts, which had been hand scored using a teacher-designed rubric, were autoscored using the Natural Language Processing software, PyrEval. Pearson{'}s correlation coefficient and Spearman rank correlation were used to analyze the relationship between the teacher score and the PyrEval score for each summary. Three content models automatically constructed by PyrEval from different sets of human reference summaries led to consistent correlations, showing that the approach is reliable. Also observed was that, in cases where the focus of student assessment centers on formative feedback, categorizing the PyrEval scores by examining the average and standard deviations could lead to novel interpretations of their relationships. It is suggested that this project has implications for the ways in which automated content analysis could be used to help university students improve their summarization skills.","pages":"264--272","doi":"10.18653\/v1\/W18-0531","url":"https:\/\/www.aclweb.org\/anthology\/W18-0531","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0532","title":"Toward Data-Driven Tutorial Question Answering with Deep Learning Conversational Models","authors":["Kulkarni, Mayank","Boyer, Kristy"],"emails":["mayankk91@ufl.edu","keboyer@ufl.edu"],"author_id":["mayank-kulkarni","kristy-boyer"],"abstract":"There has been an increase in popularity of data-driven question answering systems given their recent success. This pa-per explores the possibility of building a tutorial question answering system for Java programming from data sampled from a community-based question answering forum. This paper reports on the creation of a dataset that could support building such a tutorial question answering system and discusses the methodology to create the 106,386 question strong dataset. We investigate how retrieval-based and generative models perform on the given dataset. The work also investigates the usefulness of using hybrid approaches such as combining retrieval-based and generative models. The results indicate that building data-driven tutorial systems using community-based question answering forums holds significant promise.","pages":"273--283","doi":"10.18653\/v1\/W18-0532","url":"https:\/\/www.aclweb.org\/anthology\/W18-0532","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0533","title":"Distractor Generation for Multiple Choice Questions Using Learning to Rank","authors":["Liang, Chen","Yang, Xiao","Dave, Neisarg","Wham, Drew","Pursel, Bart","Giles, C. Lee"],"emails":["cul226@psu.edu","xuy111@psu.edu","nud83@psu.edu","fcw5014@psu.edu","bkp10@psu.edu","giles@ist.psu.edu"],"author_id":["chen-liang","xiao-yang","neisarg-dave","drew-wham","bart-pursel","c-lee-giles"],"abstract":"We investigate how machine learning models, specifically ranking models, can be used to select useful distractors for multiple choice questions. Our proposed models can learn to select distractors that resemble those in actual exam questions, which is different from most existing unsupervised ontology-based and similarity-based methods. We empirically study feature-based and neural net (NN) based ranking models with experiments on the recently released SciQ dataset and our MCQL dataset. Experimental results show that feature-based ensemble learning methods (random forest and LambdaMART) outperform both the NN-based method and unsupervised baselines. These two datasets can also be used as benchmarks for distractor generation.","pages":"284--290","doi":"10.18653\/v1\/W18-0533","url":"https:\/\/www.aclweb.org\/anthology\/W18-0533","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0534","title":"A {P}ortuguese Native Language Identification Dataset","authors":["del R{\\'\\i}o Gayo, Iria","Zampieri, Marcos","Malmasi, Shervin"],"emails":["igayo@letras.ulisboa.pt","",""],"author_id":["iria-del-rio-gayo","marcos-zampieri","shervin-malmasi"],"abstract":"In this paper we present NLI-PT, the first Portuguese dataset compiled for Native Language Identification (NLI), the task of identifying an author{'}s first language based on their second language writing. The dataset includes 1,868 student essays written by learners of European Portuguese, native speakers of the following L1s: Chinese, English, Spanish, German, Russian, French, Japanese, Italian, Dutch, Tetum, Arabic, Polish, Korean, Romanian, and Swedish. NLI-PT includes the original student text and four different types of annotation: POS, fine-grained POS, constituency parses, and dependency parses. NLI-PT can be used not only in NLI but also in research on several topics in the field of Second Language Acquisition and educational NLP. We discuss possible applications of this dataset and present the results obtained for the first lexical baseline system for Portuguese NLI.","pages":"291--296","doi":"10.18653\/v1\/W18-0534","url":"https:\/\/www.aclweb.org\/anthology\/W18-0534","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0535","title":"{O}ne{S}top{E}nglish corpus: A new corpus for automatic readability assessment and text simplification","authors":["Vajjala, Sowmya","Lu{\\v{c}}i{\\'c}, Ivana"],"emails":["sowmya@iastate.edu","ilucic@iastate.edu"],"author_id":["sowmya-vajjala","ivana-lucic"],"abstract":"This paper describes the collection and compilation of the OneStopEnglish corpus of texts written at three reading levels, and demonstrates its usefulness for through two applications - automatic readability assessment and automatic text simplification. The corpus consists of 189 texts, each in three versions (567 in total). The corpus is now freely available under a CC by-SA 4.0 license and we hope that it would foster further research on the topics of readability assessment and text simplification.","pages":"297--304","doi":"10.18653\/v1\/W18-0535","url":"https:\/\/www.aclweb.org\/anthology\/W18-0535","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0536","title":"The Effect of Adding Authorship Knowledge in Automated Text Scoring","authors":["Zhang, Meng","Chen, Xie","Cummins, Ronan","Andersen, {\\O}istein E.","Briscoe, Ted"],"emails":["mz342@cam.ac.uk","2xc257@cam.ac.uk","ummins@gmail.com","oa223@cam.ac.uk","ejb1@cam.ac.uk"],"author_id":["meng-zhang","xie-chen","ronan-cummins","oistein-e-andersen","ted-briscoe"],"abstract":"Some language exams have multiple writing tasks. When a learner writes multiple texts in a language exam, it is not surprising that the quality of these texts tends to be similar, and the existing automated text scoring (ATS) systems do not explicitly model this similarity. In this paper, we suggest that it could be useful to include the other texts written by this learner in the same exam as extra references in an ATS system. We propose various approaches of fusing information from multiple tasks and pass this authorship knowledge into our ATS model on six different datasets. We show that this can positively affect the model performance at a global level.","pages":"305--314","doi":"10.18653\/v1\/W18-0536","url":"https:\/\/www.aclweb.org\/anthology\/W18-0536","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0537","title":"{SB}@{GU} at the Complex Word Identification 2018 Shared Task","authors":["Alfter, David","Pil{\\'a}n, Ildik{\\'o}"],"emails":["david.alfter@gu.se","ildiko.pilan@gu.se"],"author_id":["david-alfter","ildiko-pilan"],"abstract":"In this paper, we describe our experiments for the Shared Task on Complex Word Identification (CWI) 2018 (Yimam et al., 2018), hosted by the 13th Workshop on Innovative Use of NLP for Building Educational Applications (BEA) at NAACL 2018. Our system for English builds on previous work for Swedish concerning the classification of words into proficiency levels. We investigate different features for English and compare their usefulness using feature selection methods. For the German, Spanish and French data we use simple systems based on character n-gram models and show that sometimes simple models achieve comparable results to fully feature-engineered systems.","pages":"315--321","doi":"10.18653\/v1\/W18-0537","url":"https:\/\/www.aclweb.org\/anthology\/W18-0537","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0538","title":"Complex Word Identification: Convolutional Neural Network vs. Feature Engineering","authors":["Aroyehun, Segun Taofeek","Angel, Jason","P{\\'e}rez Alvarez, Daniel Alejandro","Gelbukh, Alexander"],"emails":["aroyehun.segun@gmail.com","ajason08@gmail.com","daperezalvarez@gmail.com",""],"author_id":["segun-taofeek-aroyehun","jason-angel","daniel-alejandro-perez-alvarez","alexander-gelbukh"],"abstract":"We describe the systems of NLP-CIC team that participated in the Complex Word Identification (CWI) 2018 shared task. The shared task aimed to benchmark approaches for identifying complex words in English and other languages from the perspective of non-native speakers. Our goal is to compare two approaches: feature engineering and a deep neural network. Both approaches achieved comparable performance on the English test set. We demonstrated the flexibility of the deep-learning approach by using the same deep neural network setup in the Spanish track. Our systems achieved competitive results: all our systems were within 0.01 of the system with the best macro-F1 score on the test sets except on Wikipedia test set, on which our best system is 0.04 below the best macro-F1 score.","pages":"322--327","doi":"10.18653\/v1\/W18-0538","url":"https:\/\/www.aclweb.org\/anthology\/W18-0538","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0539","title":"Deep Learning Architecture for Complex Word Identification","authors":["De Hertog, Dirk","Tack, Ana{\\\"\\i}s"],"emails":["dirk.dehertog@kuleuven.be","anais.tack@uclouvain.be"],"author_id":["dirk-de-hertog","anais-tack"],"abstract":"We describe a system for the CWI-task that includes information on 5 aspects of the (complex) lexical item, namely distributional information of the item itself, morphological structure, psychological measures, corpus-counts and topical information. We constructed a deep learning architecture that combines those features and apply it to the probabilistic and binary classification task for all English sets and Spanish. We achieved reasonable performance on all sets with best performances seen on the probabilistic task, particularly on the English news set (MAE 0.054 and F1-score of 0.872). An analysis of the results shows that reasonable performance can be achieved with a single architecture without any domain-specific tweaking of the parameter settings and that distributional features capture almost all of the information also found in hand-crafted features.","pages":"328--334","doi":"10.18653\/v1\/W18-0539","url":"https:\/\/www.aclweb.org\/anthology\/W18-0539","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0540","title":"{NILC} at {CWI} 2018: Exploring Feature Engineering and Feature Learning","authors":["Hartmann, Nathan","dos Santos, Leandro Borges"],"emails":["nathansh@icmc.usp.com.br","leandrobs@usp.br"],"author_id":["nathan-hartmann","leandro-borges-dos-santos"],"abstract":"This paper describes the results of NILC team at CWI 2018. We developed solutions following three approaches: (i) a feature engineering method using lexical, n-gram and psycholinguistic features, (ii) a shallow neural network method using only word embeddings, and (iii) a Long Short-Term Memory (LSTM) language model, which is pre-trained on a large text corpus to produce a contextualized word vector. The feature engineering method obtained our best results for the classification task and the LSTM model achieved the best results for the probabilistic classification task. Our results show that deep neural networks are able to perform as well as traditional machine learning methods using manually engineered features for the task of complex word identification in English.","pages":"335--340","doi":"10.18653\/v1\/W18-0540","url":"https:\/\/www.aclweb.org\/anthology\/W18-0540","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0541","title":"Complex Word Identification Using Character n-grams","authors":["Popovi{\\'c}, Maja"],"emails":["maja.popovic@hu-berlin.de"],"author_id":["maja-popovic"],"abstract":"This paper investigates the use of character n-gram frequencies for identifying complex words in English, German and Spanish texts. The approach is based on the assumption that complex words are likely to contain different character sequences than simple words. The multinomial Naive Bayes classifier was used with n-grams of different lengths as features, and the best results were obtained for the combination of 2-grams and 4-grams. This variant was submitted to the Complex Word Identification Shared Task 2018 for all texts and achieved F-scores between 70{\\%} and 83{\\%}. The system was ranked in the middle range for all English texts, as third of fourteen submissions for German, and as tenth of seventeen submissions for Spanish. The method is not very convenient for the cross-language task, achieving only 59{\\%} on the French text.","pages":"341--348","doi":"10.18653\/v1\/W18-0541","url":"https:\/\/www.aclweb.org\/anthology\/W18-0541","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0542","title":"Predicting Second Language Learner Successes and Mistakes by Means of Conjunctive Features","authors":["Bestgen, Yves"],"emails":["yves.bestgen@uclouvain.be"],"author_id":["yves-bestgen"],"abstract":"This paper describes the system developed by the Centre for English Corpus Linguistics for the 2018 Duolingo SLAM challenge. It aimed at predicting the successes and mistakes of second language learners on each of the words that compose the exercises they answered. Its main characteristic is to include conjunctive features, built by combining word ngrams with metadata about the user and the exercise. It achieved a relatively good performance, ranking fifth out of 15 systems. Complementary analyses carried out to gauge the contribution of the different sets of features to the performance confirmed the usefulness of the conjunctive features for the SLAM task.","pages":"349--355","doi":"10.18653\/v1\/W18-0542","url":"https:\/\/www.aclweb.org\/anthology\/W18-0542","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0543","title":"Feature Engineering for Second Language Acquisition Modeling","authors":["Chen, Guanliang","Hauff, Claudia","Houben, Geert-Jan"],"emails":["guanliang.chen@tudelft.nl","c.hauff@tudelft.nl","g.j.p.m.houben@tudelft.nl"],"author_id":["guanliang-chen","claudia-hauff","geert-jan-houben"],"abstract":"Knowledge tracing serves as a keystone in delivering personalized education. However, few works attempted to model students{'} knowledge state in the setting of Second Language Acquisition. The Duolingo Shared Task on Second Language Acquisition Modeling provides students{'} trace data that we extensively analyze and engineer features from for the task of predicting whether a student will correctly solve a vocabulary exercise. Our analyses of students{'} learning traces reveal that factors like exercise format and engagement impact their exercise performance to a large extent. Overall, we extracted 23 different features as input to a Gradient Tree Boosting framework, which resulted in an AUC score of between 0.80 and 0.82 on the official test set.","pages":"356--364","doi":"10.18653\/v1\/W18-0543","url":"https:\/\/www.aclweb.org\/anthology\/W18-0543","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0544","title":"TMU System for SLAM-2018","authors":["Kaneko, Masahiro","Kajiwara, Tomoyuki","Komachi, Mamoru"],"emails":["kaneko-masahiro@ed.tmu.ac.jp","kajiwara@ids.osaka-u.ac.jp","komachi@tmu.ac.jp"],"author_id":["masahiro-kaneko","tomoyuki-kajiwara","mamoru-komachi"],"abstract":"We introduce the TMU systems for the second language acquisition modeling shared task 2018 (Settles et al., 2018). To model learner error patterns, it is necessary to maintain a considerable amount of information regarding the type of exercises learners have been learning in the past and the manner in which they answered them. Tracking an enormous learner{'}s learning history and their correct and mistaken answers is essential to predict the learner{'}s future mistakes. Therefore, we propose a model which tracks the learner{'}s learning history efficiently. Our systems ranked fourth in the English and Spanish subtasks, and fifth in the French subtask.","pages":"365--369","doi":"10.18653\/v1\/W18-0544","url":"https:\/\/www.aclweb.org\/anthology\/W18-0544","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0545","title":"Deep Factorization Machines for Knowledge Tracing","authors":["Vie, Jill-J{\\^e}nn"],"emails":["vie@jill-jenn.net"],"author_id":["jill-jenn-vie"],"abstract":"This paper introduces our solution to the 2018 Duolingo Shared Task on Second Language Acquisition Modeling (SLAM). We used deep factorization machines, a wide and deep learning model of pairwise relationships between users, items, skills, and other entities considered. Our solution (AUC 0.815) hopefully managed to beat the logistic regression baseline (AUC 0.774) but not the top performing model (AUC 0.861) and reveals interesting strategies to build upon item response theory models.","pages":"370--373","doi":"10.18653\/v1\/W18-0545","url":"https:\/\/www.aclweb.org\/anthology\/W18-0545","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0546","title":"{CLUF}: a Neural Model for Second Language Acquisition Modeling","authors":["Xu, Shuyao","Chen, Jin","Qin, Long"],"emails":["xushuy@singsound.com","chenjin@singsound.com","qinlong@singsound.com"],"author_id":["shuyao-xu","jin-chen","long-qin"],"abstract":"Second Language Acquisition Modeling is the task to predict whether a second language learner would respond correctly in future exercises based on their learning history. In this paper, we propose a neural network based system to utilize rich contextual, linguistic and user information. Our neural model consists of a Context encoder, a Linguistic feature encoder, a User information encoder and a Format information encoder (CLUF). Furthermore, a decoder is introduced to combine such encoded features and make final predictions. Our system ranked in first place in the English track and second place in the Spanish and French track with an AUROC score of 0.861, 0.835 and 0.854 respectively.","pages":"374--380","doi":"10.18653\/v1\/W18-0546","url":"https:\/\/www.aclweb.org\/anthology\/W18-0546","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0547","title":"Neural sequence modelling for learner error prediction","authors":["Yuan, Zheng"],"emails":["zheng.yuan@cl.cam.ac.uk"],"author_id":["zheng-yuan"],"abstract":"This paper describes our use of two recurrent neural network sequence models: sequence labelling and sequence-to-sequence models, for the prediction of future learner errors in our submission to the 2018 Duolingo Shared Task on Second Language Acquisition Modeling (SLAM). We show that these two models capture complementary information as combining them improves performance. Furthermore, the same network architecture and group of features can be used directly to build competitive prediction models in all three language tracks, demonstrating that our approach generalises well across languages.","pages":"381--388","doi":"10.18653\/v1\/W18-0547","url":"https:\/\/www.aclweb.org\/anthology\/W18-0547","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0548","title":"Automatic Distractor Suggestion for Multiple-Choice Tests Using Concept Embeddings and Information Retrieval","authors":["Ha, Le An","Yaneva, Victoria"],"emails":["ha.l.a@wlv.ac.uk","v.yaneva@wlv.ac.uk"],"author_id":["le-an-ha","victoria-yaneva"],"abstract":"Developing plausible distractors (wrong answer options) when writing multiple-choice questions has been described as one of the most challenging and time-consuming parts of the item-writing process. In this paper we propose a fully automatic method for generating distractor suggestions for multiple-choice questions used in high-stakes medical exams. The system uses a question stem and the correct answer as an input and produces a list of suggested distractors ranked based on their similarity to the stem and the correct answer. To do this we use a novel approach of combining concept embeddings with information retrieval methods. We frame the evaluation as a prediction task where we aim to {``}predict{''} the human-produced distractors used in large sets of medical questions, i.e. if a distractor generated by our system is good enough it is likely to feature among the list of distractors produced by the human item-writers. The results reveal that combining concept embeddings with information retrieval approaches significantly improves the generation of plausible distractors and enables us to match around 1 in 5 of the human-produced distractors. The approach proposed in this paper is generalisable to all scenarios where the distractors refer to concepts.","pages":"389--398","doi":"10.18653\/v1\/W18-0548","url":"https:\/\/www.aclweb.org\/anthology\/W18-0548","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0549","title":"Co-Attention Based Neural Network for Source-Dependent Essay Scoring","authors":["Zhang, Haoran","Litman, Diane"],"emails":["colinzhang@cs.pitt.edu","litman@cs.pitt.edu"],"author_id":["haoran-zhang","diane-litman"],"abstract":"This paper presents an investigation of using a co-attention based neural network for source-dependent essay scoring. We use a co-attention mechanism to help the model learn the importance of each part of the essay more accurately. Also, this paper shows that the co-attention based neural network model provides reliable score prediction of source-dependent responses. We evaluate our model on two source-dependent response corpora. Results show that our model outperforms the baseline on both corpora. We also show that the attention of the model is similar to the expert opinions with examples.","pages":"399--409","doi":"10.18653\/v1\/W18-0549","url":"https:\/\/www.aclweb.org\/anthology\/W18-0549","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"},{"id":"W18-0550","title":"Cross-Lingual Content Scoring","authors":["Horbach, Andrea","Stennmanns, Sebastian","Zesch, Torsten"],"emails":["andrea.horbach@uni-due.de","sebastian.stennmanns@stud.uni-due.de","torsten.zesch@uni-due.de"],"author_id":["andrea-horbach","sebastian-stennmanns","torsten-zesch"],"abstract":"We investigate the feasibility of cross-lingual content scoring, a scenario where training and test data in an automatic scoring task are from two different languages. Cross-lingual scoring can contribute to educational equality by allowing answers in multiple languages. Training a model in one language and applying it to another language might also help to overcome data sparsity issues by re-using trained models from other languages. As there is no suitable dataset available for this new task, we create a comparable bi-lingual corpus by extending the English ASAP dataset with German answers. Our experiments with cross-lingual scoring based on machine-translating either training or test data show a considerable drop in scoring quality.","pages":"410--419","doi":"10.18653\/v1\/W18-0550","url":"https:\/\/www.aclweb.org\/anthology\/W18-0550","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the Thirteenth Workshop on Innovative Use of {NLP} for Building Educational Applications"}]