[{"id":"W19-2901","title":"The Active-Filler Strategy in a Move-Eager Left-Corner Minimalist Grammar Parser","authors":["Hunter, Tim","Stanojevi{\\'c}, Milo{\\v{s}}","Stabler, Edward"],"emails":["timhunter@ucla.edu","m.stanojevic@ed.ac.uk","stabler@ucla.edu"],"author_id":["tim-hunter","milos-stanojevic","edward-stabler"],"abstract":"Recent psycholinguistic evidence suggests that human parsing of moved elements is {`}active{'}, and perhaps even {`}hyper-active{'}: it seems that a leftward-moved object is related to a verbal position rapidly, perhaps even before the transitivity information associated with the verb is available to the listener. This paper presents a formal, sound and complete parser for Minimalist Grammars whose search space contains branching points that we can identify as the locus of the decision to perform this kind of active gap-finding. This brings formal models of parsing into closer contact with recent psycholinguistic theorizing than was previously possible.","pages":"1--10","doi":"10.18653\/v1\/W19-2901","url":"https:\/\/www.aclweb.org\/anthology\/W19-2901","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2902","title":"Priming vs. Inhibition of Optional Infinitival {``}to{''}","authors":["Melnick, Robin","Wasow, Thomas"],"emails":["",""],"author_id":["robin-melnick","thomas-wasow"],"abstract":"The word {``}to{''} that precedes verbs in English infinitives is optional in at least two environments: in what Wasow et al. (2015) previously called the {``}do-be{''} construction, and in the complement of {``}help{''}, which we explore in the present work. In the {``}do-be{''} construction, Wasow et al. found that a preceding infinitival {``}to{''} increases the use of following optional {``}to{''}, but the use of {``}to{''} in the complement of help is reduced following {``}to help{''}. We examine two hypotheses regarding why the same function word is primed by prior use in one construction and inhibited in another. We then test predictions made by the two hypotheses, finding support for one of them.","pages":"11--19","doi":"10.18653\/v1\/W19-2902","url":"https:\/\/www.aclweb.org\/anthology\/W19-2902","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2903","title":"Simulating {S}panish-{E}nglish Code-Switching: El Modelo Est{\\'a} Generating Code-Switches","authors":["Tsoukala, Chara","Frank, Stefan L.","van den Bosch, Antal","Vald{\\'e}s Kroff, Jorge","Broersma, Mirjam"],"emails":["c.tsoukala@let.ru.nl","s.frank@let.ru.nl","a.vandenbosch@let.ru.nl","jvaldeskroff@ufl.edu","m.broersma@let.ru.nl"],"author_id":["chara-tsoukala","stefan-l-frank","antal-van-den-bosch","jorge-valdes-kroff","mirjam-broersma"],"abstract":"Multilingual speakers are able to switch from one language to the other ({``}code-switch{''}) between or within sentences. Because the underlying cognitive mechanisms are not well understood, in this study we use computational cognitive modeling to shed light on the process of code-switching. We employed the Bilingual Dual-path model, a Recurrent Neural Network of bilingual sentence production (Tsoukala et al., 2017), and simulated sentence production in simultaneous Spanish-English bilinguals. Our first goal was to investigate whether the model would code-switch without being exposed to code-switched training input. The model indeed produced code-switches even without any exposure to such input and the patterns of code-switches are in line with earlier linguistic work (Poplack,1980). The second goal of this study was to investigate an auxiliary phrase asymmetry that exists in Spanish-English code-switched production. Using this cognitive model, we examined a possible cause for this asymmetry. To our knowledge, this is the first computational cognitive model that aims to simulate code-switched sentence production.","pages":"20--29","doi":"10.18653\/v1\/W19-2903","url":"https:\/\/www.aclweb.org\/anthology\/W19-2903","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2904","title":"Surprisal and Interference Effects of Case Markers in {H}indi Word Order","authors":["Ranjan, Sidharth","Agarwal, Sumeet","Rajkumar, Rajakrishnan"],"emails":["sidharth.ranjan@cse.iitd.ac.in","sumeet@iitd.ac.in","rajak@iiserb.ac.in"],"author_id":["sidharth-ranjan","sumeet-agarwal","rajakrishnan-rajkumar"],"abstract":"Based on the Production-Distribution-Comprehension (PDC) account of language processing, we formulate two distinct hypotheses about case marking, word order choices and processing in Hindi. Our first hypothesis is that Hindi tends to optimize for processing efficiency at both lexical and syntactic levels. We quantify the role of case markers in this process. For the task of predicting the reference sentence occurring in a corpus (amidst meaning-equivalent grammatical variants) using a machine learning model, surprisal estimates from an artificial version of the language (i.e., Hindi without any case markers) result in lower prediction accuracy compared to natural Hindi. Our second hypothesis is that Hindi tends to minimize interference due to case markers while ordering preverbal constituents. We show that Hindi tends to avoid placing next to each other constituents whose heads are marked by identical case inflections. Our findings adhere to PDC assumptions and we discuss their implications for language production, learning and universals.","pages":"30--42","doi":"10.18653\/v1\/W19-2904","url":"https:\/\/www.aclweb.org\/anthology\/W19-2904","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2905","title":"Modeling Hierarchical Syntactic Structures in Morphological Processing","authors":["Oseki, Yohei","Yang, Charles","Marantz, Alec"],"emails":["oseki@aoni.waseda.jp","charles.yang@ling.upenn.edu","marantz@nyu.edu"],"author_id":["yohei-oseki","charles-yang","alec-marantz"],"abstract":"Sentences are represented as hierarchical syntactic structures, which have been successfully modeled in sentence processing. In contrast, despite the theoretical agreement on hierarchical syntactic structures within words, words have been argued to be computationally less complex than sentences and implemented by finite-state models as linear strings of morphemes, and even the psychological reality of morphemes has been denied. In this paper, extending the computational models employed in sentence processing to morphological processing, we performed a computational simulation experiment where, given incremental surprisal as a linking hypothesis, five computational models with different representational assumptions were evaluated against human reaction times in visual lexical decision experiments available from the English Lexicon Project (ELP), a {``}shared task{''} in the morphological processing literature. The simulation experiment demonstrated that (i) {``}amorphous{''} models without morpheme units underperformed relative to {``}morphous{''} models, (ii) a computational model with hierarchical syntactic structures, Probabilistic Context-Free Grammar (PCFG), most accurately explained human reaction times, and (iii) this performance was achieved on top of surface frequency effects. These results strongly suggest that morphological processing tracks morphemes incrementally from left to right and parses them into hierarchical syntactic structures, contrary to {``}amorphous{''} and finite-state models of morphological processing.","pages":"43--52","doi":"10.18653\/v1\/W19-2905","url":"https:\/\/www.aclweb.org\/anthology\/W19-2905","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2906","title":"A Modeling Study of the Effects of Surprisal and Entropy in Perceptual Decision Making of an Adaptive Agent","authors":["Cho, Pyeong Whan","Lewis, Richard"],"emails":["pyeongwc@umich.edu","rickl@umich.edu"],"author_id":["pyeong-whan-cho","richard-l-lewis"],"abstract":"Processing difficulty in online language comprehension has been explained in terms of surprisal and entropy reduction. Although both hypotheses have been supported by experimental data, we do not fully understand their relative contributions on processing difficulty. To develop a better understanding, we propose a mechanistic model of perceptual decision making that interacts with a simulated task environment with temporal dynamics. The proposed model collects noisy bottom-up evidence over multiple timesteps, integrates it with its top-down expectation, and makes perceptual decisions, producing processing time data directly without relying on any linking hypothesis. Temporal dynamics in the task environment was determined by a simple finite-state grammar, which was designed to create the situations where the surprisal and entropy reduction hypotheses predict different patterns. After the model was trained to maximize rewards, the model developed an adaptive policy and both surprisal and entropy effects were observed especially in a measure reflecting earlier processing.","pages":"53--61","doi":"10.18653\/v1\/W19-2906","url":"https:\/\/www.aclweb.org\/anthology\/W19-2906","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2907","title":"Modeling Long-Distance Cue Integration in Spoken Word Recognition","authors":["Bushong, Wednesday","Jaeger, T. Florian"],"emails":["wbushong@ur.rochester.edu","fjaeger@ur.rochester.edu"],"author_id":["wednesday-bushong","t-florian-jaeger"],"abstract":"Cues to linguistic categories are distributed across the speech signal. Optimal categorization thus requires that listeners maintain gradient representations of incoming input in order to integrate that information with later cues. There is now evidence that listeners can and do integrate cues that occur far apart in time. Computational models of this integration have however been lacking. We take a first step at addressing this gap by mathematically formalizing four models of how listeners may maintain and use cue information during spoken language understanding and test them on two perception experiments. In one experiment, we find support for rational integration of cues at long distances. In a second, more memory and attention-taxing experiment, we find evidence in favor of a switching model that avoids maintaining detailed representations of cues in memory. These results are a first step in understanding what kinds of mechanisms listeners use for cue integration under different memory and attentional constraints.","pages":"62--70","doi":"10.18653\/v1\/W19-2907","url":"https:\/\/www.aclweb.org\/anthology\/W19-2907","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2908","title":"Toward a Computational Multidimensional Lexical Similarity Measure for Modeling Word Association Tasks in Psycholinguistics","authors":["Gaume, Bruno","Mai Ho-Dac, Lydia","Tanguy, Ludovic","Fabre, C{\\'e}cile","Pierrejean, B{\\'e}n{\\'e}dicte","Hathout, Nabil","Farinas, J{\\'e}r{\\^o}me","Pinquier, Julien","Danet, Lola","P{\\'e}ran, Patrice","De Boissezon, Xavier","Jucla, M{\\'e}lanie"],"emails":["bruno.gaume@univ-tlse2.fr","lydia-mai.ho-dac@univ-tlse2.fr","ludovic.tanguy@univ-tlse2.fr","cecile.fabre@univ-tlse2.fr","benedicte.pierrejean@univ-tlse2.fr","nabil.hathout@univ-tlse2.fr","jerome.farinas@irit.fr","julien.pinquier@irit.fr","lola.danet@inserm.fr","patrice.peran@inserm.fr","deboissezon.xavier@chu-toulouse.fr","melanie.jucla@univ-tlse2.fr"],"author_id":["bruno-gaume","lydia-mai-ho-dac1","ludovic-tanguy","cecile-fabre","benedicte-pierrejean","nabil-hathout","jerome-farinas","julien-pinquier","lola-danet","patrice-peran","xavier-de-boissezon","melanie-jucla"],"abstract":"This paper presents the first results of a multidisciplinary project, the {``}Evolex{''} project, gathering researchers in Psycholinguistics, Neuropsychology, Computer Science, Natural Language Processing and Linguistics. The Evolex project aims at proposing a new data-based inductive method for automatically characterising the relation between pairs of french words collected in psycholinguistics experiments on lexical access. This method takes advantage of several complementary computational measures of semantic similarity. We show that some measures are more correlated than others with the frequency of lexical associations, and that they also differ in the way they capture different semantic relations. This allows us to consider building a multidimensional lexical similarity to automate the classification of lexical associations.","pages":"71--76","doi":"10.18653\/v1\/W19-2908","url":"https:\/\/www.aclweb.org\/anthology\/W19-2908","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2909","title":"Dependency Parsing with your Eyes: Dependency Structure Predicts Eye Regressions During Reading","authors":["Lopopolo, Alessandro","Frank, Stefan L.","van den Bosch, Antal","Willems, Roel"],"emails":["a.lopopolo@let.ru.nl","s.frank@let.ru.nl","a.vandenbosch@let.ru.nl","r.willems@donders.ru.nl"],"author_id":["alessandro-lopopolo","stefan-l-frank","antal-van-den-bosch","roel-willems"],"abstract":"Backward saccades during reading have been hypothesized to be involved in structural reanalysis, or to be related to the level of text difficulty. We test the hypothesis that backward saccades are involved in online syntactic analysis. If this is the case we expect that saccades will coincide, at least partially, with the edges of the relations computed by a dependency parser. In order to test this, we analyzed a large eye-tracking dataset collected while 102 participants read three short narrative texts. Our results show a relation between backward saccades and the syntactic structure of sentences.","pages":"77--85","doi":"10.18653\/v1\/W19-2909","url":"https:\/\/www.aclweb.org\/anthology\/W19-2909","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2910","title":"A Framework for Decoding Event-Related Potentials from Text","authors":["Yan, Shaorong","White, Aaron Steven"],"emails":["syan13@ur.rochester.edu","aaron.white@rochester.edu"],"author_id":["shaorong-yan","aaron-steven-white"],"abstract":"We propose a novel framework for modeling event-related potentials (ERPs) collected during reading that couples pre-trained convolutional decoders with a language model. Using this framework, we compare the abilities of a variety of existing and novel sentence processing models to reconstruct ERPs. We find that modern contextual word embeddings underperform surprisal-based models but that, combined, the two outperform either on its own.","pages":"86--92","doi":"10.18653\/v1\/W19-2910","url":"https:\/\/www.aclweb.org\/anthology\/W19-2910","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2911","title":"Testing a Minimalist Grammar Parser on {I}talian Relative Clause Asymmetries","authors":["De Santo, Aniello"],"emails":["aniello.desanto@stonybrook.edu"],"author_id":["aniello-de-santo"],"abstract":"Stabler{'}s (2013) top-down parser for Minimalist grammars has been used to account for off-line processing preferences across a variety of seemingly unrelated phenomena cross- linguistically, via complexity metrics measuring {``}memory burden{''}. This paper extends the empirical coverage of the model by looking at the processing asymmetries of Italian relative clauses, as I discuss the relevance of these constructions in evaluating plausible structure- driven models of processing difficulty.","pages":"93--104","doi":"10.18653\/v1\/W19-2911","url":"https:\/\/www.aclweb.org\/anthology\/W19-2911","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2912","title":"Quantifiers in a Multimodal World: Hallucinating Vision with Language and Sound","authors":["Testoni, Alberto","Pezzelle, Sandro","Bernardi, Raffaella"],"emails":["alberto.testoni@studenti.unitn.it","s.pezzelle@uva.nl","raffaella.bernardi@unitn.it"],"author_id":["alberto-testoni","sandro-pezzelle","raffaella-bernardi"],"abstract":"Inspired by the literature on multisensory integration, we develop a computational model to ground quantifiers in perception. The model learns to pick, out of nine quantifiers ({`}few{'}, {`}many{'}, {`}all{'}, etc.), the one that is more likely to describe the percent of animals in a visual-auditory input containing both animals and artifacts. We show that relying on concurrent sensory inputs increases model performance on the quantification task. Moreover, we evaluate the model in a situation in which only the auditory modality is given, while the visual one is {`}hallucinanted{'} either from the auditory input itself or from a linguistic caption describing the quantity of entities in the auditory input. This way, the model exploits prior associations between modalities. We show that the model profits from the prior knowledge and outperforms the auditory-only setting.","pages":"105--116","doi":"10.18653\/v1\/W19-2912","url":"https:\/\/www.aclweb.org\/anthology\/W19-2912","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2913","title":"Frequency vs. Association for Constraint Selection in Usage-Based Construction Grammar","authors":["Dunn, Jonathan"],"emails":["jonathan.dunn@canterbury.ac.nz"],"author_id":["jonathan-dunn"],"abstract":"A usage-based Construction Grammar (CxG) posits that slot-constraints generalize from common exemplar constructions. But what is the best model of constraint generalization? This paper evaluates competing frequency-based and association-based models across eight languages using a metric derived from the Minimum Description Length paradigm. The experiments show that association-based models produce better generalizations across all languages by a significant margin.","pages":"117--128","doi":"10.18653\/v1\/W19-2913","url":"https:\/\/www.aclweb.org\/anthology\/W19-2913","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2914","title":"The Development of Abstract Concepts in Children{'}s Early Lexical Networks","authors":["Fourtassi, Abdellah","Scheinfeld, Isaac","Frank, Michael"],"emails":["afourtas@stanford.edu","ischeinfeld@stanford.edu","mcfrank@stanford.edu"],"author_id":["abdellah-fourtassi","isaac-scheinfeld","michael-c-frank"],"abstract":"How do children learn abstract concepts such as animal vs. artifact? Previous research has suggested that such concepts can partly be derived using cues from the language children hear around them. Following this suggestion, we propose a model where we represent the children{'} developing lexicon as an evolving network. The nodes of this network are based on vocabulary knowledge as reported by parents, and the edges between pairs of nodes are based on the probability of their co-occurrence in a corpus of child-directed speech. We found that several abstract categories can be identified as the dense regions in such networks. In addition, our simulations suggest that these categories develop simultaneously, rather than sequentially, thanks to the children{'}s word learning trajectory which favors the exploration of the global conceptual space.","pages":"129--133","doi":"10.18653\/v1\/W19-2914","url":"https:\/\/www.aclweb.org\/anthology\/W19-2914","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2915","title":"Verb-Second Effect on Quantifier Scope Interpretation","authors":["Sayeed, Asad","Lindemann, Matthias","Demberg, Vera"],"emails":["asad.sayeed@gu.se","malinux@t-online.de","vera@coli.uni-saarland.de"],"author_id":["asad-sayeed","matthias-lindemann","vera-demberg"],"abstract":"Sentences like {``}Every child climbed a tree{''} have at least two interpretations depending on the precedence order of the universal quantifier and the indefinite. Previous experimental work explores the role that different mechanisms such as semantic reanalysis and world knowledge may have in enabling each interpretation. This paper discusses a web-based task that uses the verb-second characteristic of German main clauses to estimate the influence of word order variation over world knowledge.","pages":"134--139","doi":"10.18653\/v1\/W19-2915","url":"https:\/\/www.aclweb.org\/anthology\/W19-2915","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2916","title":"Neural Models of the Psychosemantics of {`}Most{'}","authors":["O{'}Sullivan, Lewis","Steinert-Threlkeld, Shane"],"emails":["lewis.osullivan@student.uva.nl","hrelkeld@uva.nl"],"author_id":["lewis-osullivan","shane-steinert-threlkeld"],"abstract":"How are the meanings of linguistic expressions related to their use in concrete cognitive tasks? Visual identification tasks show human speakers can exhibit considerable variation in their understanding, representation and verification of certain quantifiers. This paper initiates an investigation into neural models of these psycho-semantic tasks. We trained two types of network {--} a convolutional neural network (CNN) model and a recurrent model of visual attention (RAM) {--} on the {``}most{''} verification task from Pietroski2009, manipulating the visual scene and novel notions of task duration. Our results qualitatively mirror certain features of human performance (such as sensitivity to the ratio of set sizes, indicating a reliance on approximate number) while differing in interesting ways (such as exhibiting a subtly different pattern for the effect of image type). We conclude by discussing the prospects for using neural models as cognitive models of this and other psychosemantic tasks.","pages":"140--151","doi":"10.18653\/v1\/W19-2916","url":"https:\/\/www.aclweb.org\/anthology\/W19-2916","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2917","title":"The Role of Utterance Boundaries and Word Frequencies for Part-of-speech Learning in {B}razilian {P}ortuguese Through Distributional Analysis","authors":["Feliciano de Faria, Pablo Picasso"],"emails":["pablofaria@iel.unicamp.br"],"author_id":["pablo-picasso-feliciano-de-faria1"],"abstract":"In this study, we address the problem of part-of-speech (or syntactic category) learning during language acquisition through distributional analysis of utterances. A model based on Redington et al.{'}s (1998) distributional learner is used to investigate the informativeness of distributional information in Brazilian Portuguese (BP). The data provided to the learner comes from two publicly available corpora of child directed speech. We present preliminary results from two experiments. The first one investigates the effects of different assumptions about utterance boundaries when presenting the input data to the learner. The second experiment compares the learner{'}s performance when counting contextual words{'} frequencies versus just acknowledging their co-occurrence with a given target word. In general, our results indicate that explicit boundaries are more informative, frequencies are important, and that distributional information is useful to the child as a source of categorial information. These results are in accordance with Redington et al.{'}s findings for English.","pages":"152--159","doi":"10.18653\/v1\/W19-2917","url":"https:\/\/www.aclweb.org\/anthology\/W19-2917","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"},{"id":"W19-2918","title":"Using Grounded Word Representations to Study Theories of Lexical Concepts","authors":["Ebert, Dylan","Pavlick, Ellie"],"emails":["ebert@brown.edu","pavlick@brown.edu"],"author_id":["dylan-ebert","ellie-pavlick"],"abstract":"The fields of cognitive science and philosophy have proposed many different theories for how humans represent {``}concepts{''}. Multiple such theories are compatible with state-of-the-art NLP methods, and could in principle be operationalized using neural networks. We focus on two particularly prominent theories{--}Classical Theory and Prototype Theory{--}in the context of visually-grounded lexical representations. We compare when and how the behavior of models based on these theories differs in terms of categorization and entailment tasks. Our preliminary results suggest that Classical-based representations perform better for entailment and Prototype-based representations perform better for categorization. We discuss plans for additional experiments needed to confirm these initial observations.","pages":"160--169","doi":"10.18653\/v1\/W19-2918","url":"https:\/\/www.aclweb.org\/anthology\/W19-2918","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics"}]