[{"id":"W19-3901","title":"Sequential Neural Networks as Automata","authors":["Merrill, William"],"emails":["william.merrill@yale.edu"],"author_id":["william-merrill"],"abstract":"This work attempts to explain the types of computation that neural networks can perform by relating them to automata. We first define what it means for a real-time network with bounded precision to accept a language. A measure of network memory follows from this definition. We then characterize the classes of languages acceptable by various recurrent networks, attention, and convolutional networks. We find that LSTMs function like counter machines and relate convolutional networks to the subregular hierarchy. Overall, this work attempts to increase our understanding and ability to interpret neural networks through the lens of theory. These theoretical insights help explain neural computation, as well as the relationship between neural networks and natural language grammar.","pages":"1--13","doi":"10.18653\/v1\/W19-3901","url":"https:\/\/www.aclweb.org\/anthology\/W19-3901","publisher":"Association for Computational Linguistics","address":"Florence","year":"2019","month":"August","booktitle":"Proceedings of the Workshop on Deep Learning and Formal Languages: Building Bridges"},{"id":"W19-3902","title":"Grammatical Sequence Prediction for Real-Time Neural Semantic Parsing","authors":["Xiao, Chunyang","Teichmann, Christoph","Arkoudas, Konstantine"],"emails":["cxiao35@bloomberg.net","cteichmann1@bloomberg.net","karkoudas@bloomberg.net"],"author_id":["chunyang-xiao","christoph-teichmann","konstantine-arkoudas"],"abstract":"While sequence-to-sequence (seq2seq) models achieve state-of-the-art performance in many natural language processing tasks, they can be too slow for real-time applications. One performance bottleneck is predicting the most likely next token over a large vocabulary; methods to circumvent this bottleneck are a current research topic. We focus specifically on using seq2seq models for semantic parsing, where we observe that grammars often exist which specify valid formal representations of utterance semantics. By developing a generic approach for restricting the predictions of a seq2seq model to grammatically permissible continuations, we arrive at a widely applicable technique for speeding up semantic parsing. The technique leads to a 74{\\%} speed-up on an in-house dataset with a large vocabulary, compared to the same neural model without grammatical restrictions","pages":"14--23","doi":"10.18653\/v1\/W19-3902","url":"https:\/\/www.aclweb.org\/anthology\/W19-3902","publisher":"Association for Computational Linguistics","address":"Florence","year":"2019","month":"August","booktitle":"Proceedings of the Workshop on Deep Learning and Formal Languages: Building Bridges"},{"id":"W19-3903","title":"Relating {RNN} Layers with the Spectral {WFA} Ranks in Sequence Modelling","authors":["Liza, Farhana Ferdousi","Grzes, Marek"],"emails":["fl207@kent.ac.uk","m.grzes@kent.ac.uk"],"author_id":["farhana-ferdousi-liza","marek-grzes1"],"abstract":"We analyse Recurrent Neural Networks (RNNs) to understand the significance of multiple LSTM layers. We argue that the Weighted Finite-state Automata (WFA) trained using a spectral learning algorithm are helpful to analyse RNNs. Our results suggest that multiple LSTM layers in RNNs help learning distributed hidden states, but have a smaller impact on the ability to learn long-term dependencies. The analysis is based on the empirical results, however relevant theory (whenever possible) was discussed to justify and support our conclusions.","pages":"24--33","doi":"10.18653\/v1\/W19-3903","url":"https:\/\/www.aclweb.org\/anthology\/W19-3903","publisher":"Association for Computational Linguistics","address":"Florence","year":"2019","month":"August","booktitle":"Proceedings of the Workshop on Deep Learning and Formal Languages: Building Bridges"},{"id":"W19-3904","title":"Multi-Element Long Distance Dependencies: Using {SP}k Languages to Explore the Characteristics of Long-Distance Dependencies","authors":["Mahalunkar, Abhijit","Kelleher, John"],"emails":["abhijit.mahalunkar@mydit.ie","john.d.kelleher@dit.ie"],"author_id":["abhijit-mahalunkar","john-kelleher"],"abstract":"In order to successfully model Long Distance Dependencies (LDDs) it is necessary to under-stand the full-range of the characteristics of the LDDs exhibited in a target dataset. In this paper, we use Strictly k-Piecewise languages to generate datasets with various properties. We then compute the characteristics of the LDDs in these datasets using mutual information and analyze the impact of factors such as (i) k, (ii) length of LDDs, (iii) vocabulary size, (iv) forbidden strings, and (v) dataset size. This analysis reveal that the number of interacting elements in a dependency is an important characteristic of LDDs. This leads us to the challenge of modelling multi-element long-distance dependencies. Our results suggest that attention mechanisms in neural networks may aide in modeling datasets with multi-element long-distance dependencies. However, we conclude that there is a need to develop more efficient attention mechanisms to address this issue.","pages":"34--43","doi":"10.18653\/v1\/W19-3904","url":"https:\/\/www.aclweb.org\/anthology\/W19-3904","publisher":"Association for Computational Linguistics","address":"Florence","year":"2019","month":"August","booktitle":"Proceedings of the Workshop on Deep Learning and Formal Languages: Building Bridges"},{"id":"W19-3905","title":"{LSTM} Networks Can Perform Dynamic Counting","authors":["Suzgun, Mirac","Belinkov, Yonatan","Shieber, Stuart","Gehrmann, Sebastian"],"emails":["","","",""],"author_id":["mirac-suzgun","yonatan-belinkov","stuart-m-shieber","sebastian-gehrmann"],"abstract":"In this paper, we systematically assess the ability of standard recurrent networks to perform dynamic counting and to encode hierarchical representations. All the neural models in our experiments are designed to be small-sized networks both to prevent them from memorizing the training sets and to visualize and interpret their behaviour at test time. Our results demonstrate that the Long Short-Term Memory (LSTM) networks can learn to recognize the well-balanced parenthesis language (Dyck-1) and the shuffles of multiple Dyck-1 languages, each defined over different parenthesis-pairs, by emulating simple real-time k-counter machines. To the best of our knowledge, this work is the first study to introduce the shuffle languages to analyze the computational power of neural networks. We also show that a single-layer LSTM with only one hidden unit is practically sufficient for recognizing the Dyck-1 language. However, none of our recurrent networks was able to yield a good performance on the Dyck-2 language learning task, which requires a model to have a stack-like mechanism for recognition.","pages":"44--54","doi":"10.18653\/v1\/W19-3905","url":"https:\/\/www.aclweb.org\/anthology\/W19-3905","publisher":"Association for Computational Linguistics","address":"Florence","year":"2019","month":"August","booktitle":"Proceedings of the Workshop on Deep Learning and Formal Languages: Building Bridges"}]