[{"id":"W19-1801","title":"Adversarial Regularization for Visual Question Answering: Strengths, Shortcomings, and Side Effects","authors":["Grand, Gabriel","Belinkov, Yonatan"],"emails":["ggrand@alumni.harvard.edu","belinkov@seas.harvard.edu"],"author_id":["gabriel-grand","yonatan-belinkov"],"abstract":"Visual question answering (VQA) models have been shown to over-rely on linguistic biases in VQA datasets, answering questions {``}blindly{''} without considering visual context. Adversarial regularization (AdvReg) aims to address this issue via an adversary sub-network that encourages the main model to learn a bias-free representation of the question. In this work, we investigate the strengths and shortcomings of AdvReg with the goal of better understanding how it affects inference in VQA models. Despite achieving a new state-of-the-art on VQA-CP, we find that AdvReg yields several undesirable side-effects, including unstable gradients and sharply reduced performance on in-domain examples. We demonstrate that gradual introduction of regularization during training helps to alleviate, but not completely solve, these issues. Through error analyses, we observe that AdvReg improves generalization to binary questions, but impairs performance on questions with heterogeneous answer distributions. Qualitatively, we also find that regularized models tend to over-rely on visual features, while ignoring important linguistic cues in the question. Our results suggest that AdvReg requires further refinement before it can be considered a viable bias mitigation technique for VQA.","pages":"1--13","doi":"10.18653\/v1\/W19-1801","url":"https:\/\/www.aclweb.org\/anthology\/W19-1801","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Second Workshop on Shortcomings in Vision and Language"},{"id":"W19-1802","title":"Referring to Objects in Videos Using Spatio-Temporal Identifying Descriptions","authors":["Wiriyathammabhum, Peratham","Shrivastava, Abhinav","Morariu, Vlad","Davis, Larry"],"emails":["peratham@cs.umd.edu","abhinav@cs.umd.edu","morariu@umd.edu","lsd@umiacs.umd.edu"],"author_id":["peratham-wiriyathammabhum","abhinav-shrivastava","vlad-morariu","larry-davis"],"abstract":"This paper presents a new task, the grounding of spatio-temporal identifying descriptions in videos. Previous work suggests potential bias in existing datasets and emphasizes the need for a new data creation schema to better model linguistic structure. We introduce a new data collection scheme based on grammatical constraints for surface realization to enable us to investigate the problem of grounding spatio-temporal identifying descriptions in videos. We then propose a two-stream modular attention network that learns and grounds spatio-temporal identifying descriptions based on appearance and motion. We show that motion modules help to ground motion-related words and also help to learn in appearance modules because modular neural networks resolve task interference between modules. Finally, we propose a future challenge and a need for a robust system arising from replacing ground truth visual annotations with automatic video object detector and temporal event localization.","pages":"14--25","doi":"10.18653\/v1\/W19-1802","url":"https:\/\/www.aclweb.org\/anthology\/W19-1802","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Second Workshop on Shortcomings in Vision and Language"},{"id":"W19-1803","title":"A Survey on Biomedical Image Captioning","authors":["Pavlopoulos, John","Kougia, Vasiliki","Androutsopoulos, Ion"],"emails":["ion@aueb.gr","annis@aueb.gr","kouyiav@aueb.gr"],"author_id":["john-pavlopoulos","vasiliki-kougia","ion-androutsopoulos"],"abstract":"Image captioning applied to biomedical images can assist and accelerate the diagnosis process followed by clinicians. This article is the first survey of biomedical image captioning, discussing datasets, evaluation measures, and state of the art methods. Additionally, we suggest two baselines, a weak and a stronger one; the latter outperforms all current state of the art systems on one of the datasets.","pages":"26--36","doi":"10.18653\/v1\/W19-1803","url":"https:\/\/www.aclweb.org\/anthology\/W19-1803","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Second Workshop on Shortcomings in Vision and Language"},{"id":"W19-1804","title":"Revisiting Visual Grounding","authors":["Conser, Erik","Hahn, Kennedy","Watson, Chandler","Mitchell, Melanie"],"emails":["econser@pdx.edu","kehahn@pdx.edu","chandler.watson@stanford.edu","mm@pdx.edu"],"author_id":["erik-conser","kennedy-hahn","chandler-watson","melanie-mitchell"],"abstract":"We revisit a particular visual grounding method: the {``}Image Retrieval Using Scene Graphs{''} (IRSG) system of Johnson et al. Our experiments indicate that the system does not effectively use its learned object-relationship models. We also look closely at the IRSG dataset, as well as the widely used Visual Relationship Dataset (VRD) that is adapted from it. We find that these datasets exhibit bias that allows methods that ignore relationships to perform relatively well. We also describe several other problems with the IRSG dataset, and report on experiments using a subset of the dataset in which the biases and other problems are removed. Our studies contribute to a more general effort: that of better understanding what machine-learning methods that combine language and vision actually learn and what popular datasets actually test.","pages":"37--46","doi":"10.18653\/v1\/W19-1804","url":"https:\/\/www.aclweb.org\/anthology\/W19-1804","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Second Workshop on Shortcomings in Vision and Language"},{"id":"W19-1805","title":"The Steep Road to Happily Ever after: an Analysis of Current Visual Storytelling Models","authors":["Modi, Yatri","Parde, Natalie"],"emails":["ymodi2@uic.edu","parde@uic.edu"],"author_id":["yatri-modi","natalie-parde"],"abstract":"Visual storytelling is an intriguing and complex task that only recently entered the research arena. In this work, we survey relevant work to date, and conduct a thorough error analysis of three very recent approaches to visual storytelling. We categorize and provide examples of common types of errors, and identify key shortcomings in current work. Finally, we make recommendations for addressing these limitations in the future.","pages":"47--57","doi":"10.18653\/v1\/W19-1805","url":"https:\/\/www.aclweb.org\/anthology\/W19-1805","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Second Workshop on Shortcomings in Vision and Language"},{"id":"W19-1806","title":"{``}Caption{''} as a Coherence Relation: Evidence and Implications","authors":["Alikhani, Malihe","Stone, Matthew"],"emails":["malihe.alikhani@rutgers.edu","matthew.stone@rutgers.edu"],"author_id":["malihe-alikhani","matthew-stone"],"abstract":"We study verbs in image{--}text corpora, contrasting \\textit{caption} corpora, where texts are explicitly written to characterize image content, with \\textit{depiction} corpora, where texts and images may stand in more general relations. Captions show a distinctively limited distribution of verbs, with strong preferences for specific tense, aspect, lexical aspect, and semantic field. These limitations, which appear in data elicited by a range of methods, restrict the utility of caption corpora to inform image retrieval, multimodal document generation, and perceptually-grounded semantic models. We suggest that these limitations reflect the discourse constraints in play when subjects write texts to accompany imagery, so we argue that future development of image{--}text corpora should work to increase the diversity of event descriptions, while looking explicitly at the different ways text and imagery can be coherently related.","pages":"58--67","doi":"10.18653\/v1\/W19-1806","url":"https:\/\/www.aclweb.org\/anthology\/W19-1806","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Second Workshop on Shortcomings in Vision and Language"},{"id":"W19-1807","title":"Learning Multilingual Word Embeddings Using Image-Text Data","authors":["Singhal, Karan","Raman, Karthik","ten Cate, Balder"],"emails":["ksinghal@cs.stanford.edu","karthikraman@google.com","balder@google.com"],"author_id":["karan-singhal","karthik-raman","balder-ten-cate"],"abstract":"There has been significant interest recently in learning multilingual word embeddings {--} in which semantically similar words across languages have similar embeddings. State-of-the-art approaches have relied on expensive labeled data, which is unavailable for low-resource languages, or have involved post-hoc unification of monolingual embeddings. In the present paper, we investigate the efficacy of multilingual embeddings learned from weakly-supervised image-text data. In particular, we propose methods for learning multilingual embeddings using image-text data, by enforcing similarity between the representations of the image and that of the text. Our experiments reveal that even without using any expensive labeled data, a bag-of-words-based embedding model trained on image-text data achieves performance comparable to the state-of-the-art on crosslingual semantic similarity tasks.","pages":"68--77","doi":"10.18653\/v1\/W19-1807","url":"https:\/\/www.aclweb.org\/anthology\/W19-1807","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Second Workshop on Shortcomings in Vision and Language"},{"id":"W19-1808","title":"Grounded Word Sense Translation","authors":["Lala, Chiraag","Madhyastha, Pranava","Specia, Lucia"],"emails":["clala1@sheffield.ac.uk","pranava@imperial.ac.uk","l.specia@imperial.ac.uk"],"author_id":["chiraag-lala","pranava-swaroop-madhyastha","lucia-specia"],"abstract":"Recent work on visually grounded language learning has focused on broader applications of grounded representations, such as visual question answering and multimodal machine translation. In this paper we consider grounded word sense translation, i.e. the task of correctly translating an ambiguous source word given the corresponding textual and visual context. Our main objective is to investigate the extent to which images help improve word-level (lexical) translation quality. We do so by first studying the dataset for this task to understand the scope and challenges of the task. We then explore different data settings, image features, and ways of grounding to investigate the gain from using images in each of the combinations. We find that grounding on the image is specially beneficial in weaker unidirectional recurrent translation models. We observe that adding structured image information leads to stronger gains in lexical translation accuracy.","pages":"78--85","doi":"10.18653\/v1\/W19-1808","url":"https:\/\/www.aclweb.org\/anthology\/W19-1808","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Second Workshop on Shortcomings in Vision and Language"}]