[{"id":"W19-3501","title":"Subversive Toxicity Detection using Sentiment Information","authors":["Brassard-Gourdeau, Eloi","Khoury, Richard"],"emails":["eloi.brassard-gourdeau.1@ulaval.ca","richard.khoury@ift.ulaval.ca"],"author_id":["eloi-brassard-gourdeau","richard-khoury"],"abstract":"The presence of toxic content has become a major problem for many online communities. Moderators try to limit this problem by implementing more and more refined comment filters, but toxic users are constantly finding new ways to circumvent them. Our hypothesis is that while modifying toxic content and keywords to fool filters can be easy, hiding sentiment is harder. In this paper, we explore various aspects of sentiment detection and their correlation to toxicity, and use our results to implement a toxicity detection tool. We then test how adding the sentiment information helps detect toxicity in three different real-world datasets, and incorporate subversion to these datasets to simulate a user trying to circumvent the system. Our results show sentiment information has a positive impact on toxicity detection.","pages":"1--10","doi":"10.18653\/v1\/W19-3501","url":"https:\/\/www.aclweb.org\/anthology\/W19-3501","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3502","title":"Exploring Deep Multimodal Fusion of Text and Photo for Hate Speech Classification","authors":["Yang, Fan","Peng, Xiaochang","Ghosh, Gargi","Shilon, Reshef","Ma, Hao","Moore, Eider","Predovic, Goran"],"emails":["flymonkey@fb.com","xiaochang@fb.com","gghosh@fb.com","reshefshilon@fb.com","haom@fb.com","idr@fb.com","predovic@fb.com"],"author_id":["fan-yang","xiaochang-peng","gargi-ghosh","reshef-shilon","hao-ma","eider-moore","goran-predovic"],"abstract":"Interactions among users on social network platforms are usually positive, constructive and insightful. However, sometimes people also get exposed to objectionable content such as hate speech, bullying, and verbal abuse etc. Most social platforms have explicit policy against hate speech because it creates an environment of intimidation and exclusion, and in some cases may promote real-world violence. As users{'} interactions on today{'}s social networks involve multiple modalities, such as texts, images and videos, in this paper we explore the challenge of automatically identifying hate speech with deep multimodal technologies, extending previous research which mostly focuses on the text signal alone. We present a number of fusion approaches to integrate text and photo signals. We show that augmenting text with image embedding information immediately leads to a boost in performance, while applying additional attention fusion methods brings further improvement.","pages":"11--18","doi":"10.18653\/v1\/W19-3502","url":"https:\/\/www.aclweb.org\/anthology\/W19-3502","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3503","title":"Detecting harassment in real-time as conversations develop","authors":["Stoop, Wessel","Kunneman, Florian","van den Bosch, Antal","Miller, Ben"],"emails":["w.stoop@let.ru.nl","f.kunneman@let.ru.nl","antal.van.den.bosch@meertens.knaw.nl","b.j.miller@emory.edu"],"author_id":["wessel-stoop","florian-kunneman","antal-van-den-bosch","ben-miller"],"abstract":"We developed a machine-learning-based method to detect video game players that harass teammates or opponents in chat earlier in the conversation. This real-time technology would allow gaming companies to intervene during games, such as issue warnings or muting or banning a player. In a proof-of-concept experiment on League of Legends data we compute and visualize evaluation metrics for a machine learning classifier as conversations unfold, and observe that the optimal precision and recall of detecting toxic players at each moment in the conversation depends on the confidence threshold of the classifier: the threshold should start low, and increase as the conversation unfolds. How fast this sliding threshold should increase depends on the training set size.","pages":"19--24","doi":"10.18653\/v1\/W19-3503","url":"https:\/\/www.aclweb.org\/anthology\/W19-3503","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3504","title":"Racial Bias in Hate Speech and Abusive Language Detection Datasets","authors":["Davidson, Thomas","Bhattacharya, Debasmita","Weber, Ingmar"],"emails":["trd54@cornell.edu","db758@cornell.edu","iweber@hbku.edu.qa"],"author_id":["thomas-davidson","debasmita-bhattacharya","ingmar-weber"],"abstract":"Technologies for abusive language detection are being developed and applied with little consideration of their potential biases. We examine racial bias in five different sets of Twitter data annotated for hate speech and abusive language. We train classifiers on these datasets and compare the predictions of these classifiers on tweets written in African-American English with those written in Standard American English. The results show evidence of systematic racial bias in all datasets, as classifiers trained on them tend to predict that tweets written in African-American English are abusive at substantially higher rates. If these abusive language detection systems are used in the field they will therefore have a disproportionate negative impact on African-American social media users. Consequently, these systems may discriminate against the groups who are often the targets of the abuse we are trying to detect.","pages":"25--35","doi":"10.18653\/v1\/W19-3504","url":"https:\/\/www.aclweb.org\/anthology\/W19-3504","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3505","title":"Automated Identification of Verbally Abusive Behaviors in Online Discussions","authors":["Joksimovic, Srecko","Baker, Ryan S.","Ocumpaugh, Jaclyn","Andres, Juan Miguel L.","Tot, Ivan","Wang, Elle Yuan","Dawson, Shane"],"emails":["srecko.joksimovic@unisa.edu.au","rybaker@upenn.edu","jlocumpaugh@gmail.com","miglimjapandres@gmail.com","van.tot@va.mod.gov.rs","elle.wang@asu.edu","shane.dawson@unisa.edu.au"],"author_id":["srecko-joksimovic","ryan-s-baker","jaclyn-ocumpaugh","juan-miguel-l-andres","ivan-tot","elle-yuan-wang","shane-dawson"],"abstract":"Discussion forum participation represents one of the crucial factors for learning and often the only way of supporting social interactions in online settings. However, as much as sharing new ideas or asking thoughtful questions contributes learning, verbally abusive behaviors, such as expressing negative emotions in online discussions, could have disproportionate detrimental effects. To provide means for mitigating the potential negative effects on course participation and learning, we developed an automated classifier for identifying communication that show linguistic patterns associated with hostility in online forums. In so doing, we employ several well-established automated text analysis tools and build on the common practices for handling highly imbalanced datasets and reducing the sensitivity to overfitting. Although still in its infancy, our approach shows promising results (ROC AUC .73) towards establishing a robust detector of abusive behaviors. We further provide an overview of the classification (linguistic and contextual) features most indicative of online aggression.","pages":"36--45","doi":"10.18653\/v1\/W19-3505","url":"https:\/\/www.aclweb.org\/anthology\/W19-3505","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3506","title":"Multi-label Hate Speech and Abusive Language Detection in {I}ndonesian Twitter","authors":["Ibrohim, Muhammad Okky","Budi, Indra"],"emails":["okkyibrohim@cs.ui.ac.id","indra@cs.ui.ac.id"],"author_id":["muhammad-okky-ibrohim","indra-budi"],"abstract":"Hate speech and abusive language spreading on social media need to be detected automatically to avoid conflict between citizen. Moreover, hate speech has a target, category, and level that also needs to be detected to help the authority in prioritizing which hate speech must be addressed immediately. This research discusses multi-label text classification for abusive language and hate speech detection including detecting the target, category, and level of hate speech in Indonesian Twitter using machine learning approach with Support Vector Machine (SVM), Naive Bayes (NB), and Random Forest Decision Tree (RFDT) classifier and Binary Relevance (BR), Label Power-set (LP), and Classifier Chains (CC) as the data transformation method. We used several kinds of feature extractions which are term frequency, orthography, and lexicon features. Our experiment results show that in general RFDT classifier using LP as the transformation method gives the best accuracy with fast computational time.","pages":"46--57","doi":"10.18653\/v1\/W19-3506","url":"https:\/\/www.aclweb.org\/anthology\/W19-3506","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3507","title":"The Discourse of Online Content Moderation: Investigating Polarized User Responses to Changes in {R}eddit{'}s Quarantine Policy","authors":["Shen, Qinlan","Rose, Carolyn"],"emails":["qinlans@cs.cmu.edu","cprose@cs.cmu.edu"],"author_id":["qinlan-shen","carolyn-rose"],"abstract":"Recent concerns over abusive behavior on their platforms have pressured social media companies to strengthen their content moderation policies. However, user opinions on these policies have been relatively understudied. In this paper, we present an analysis of user responses to a September 27, 2018 announcement about the quarantine policy on Reddit as a case study of to what extent the discourse on content moderation is polarized by users{'} ideological viewpoint. We introduce a novel partitioning approach for characterizing user polarization based on their distribution of participation across interest subreddits. We then use automated techniques for capturing framing to examine how users with different viewpoints discuss moderation issues, finding that right-leaning users invoked censorship while left-leaning users highlighted inconsistencies on how content policies are applied. Overall, we argue for a more nuanced approach to moderation by highlighting the intersection of behavior and ideology in considering how abusive language is defined and regulated.","pages":"58--69","doi":"10.18653\/v1\/W19-3507","url":"https:\/\/www.aclweb.org\/anthology\/W19-3507","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3508","title":"Pay {``}Attention{''} to your Context when Classifying Abusive Language","authors":["Chakrabarty, Tuhin","Gupta, Kilol","Muresan, Smaranda"],"emails":["tc2896@columbia.edu","kilol.gupta@columbia.edu","smara@columbia.edu"],"author_id":["tuhin-chakrabarty","kilol-gupta","smaranda-muresan"],"abstract":"The goal of any social media platform is to facilitate healthy and meaningful interactions among its users. But more often than not, it has been found that it becomes an avenue for wanton attacks. We propose an experimental study that has three aims: 1) to provide us with a deeper understanding of current data sets that focus on different types of abusive language, which are sometimes overlapping (racism, sexism, hate speech, offensive language, and personal attacks); 2) to investigate what type of attention mechanism (contextual vs. self-attention) is better for abusive language detection using deep learning architectures; and 3) to investigate whether stacked architectures provide an advantage over simple architectures for this task.","pages":"70--79","doi":"10.18653\/v1\/W19-3508","url":"https:\/\/www.aclweb.org\/anthology\/W19-3508","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3509","title":"Challenges and frontiers in abusive content detection","authors":["Vidgen, Bertie","Harris, Alex","Nguyen, Dong","Tromble, Rebekah","Hale, Scott","Margetts, Helen"],"emails":["","","","","",""],"author_id":["bertie-vidgen","alex-harris","dong-nguyen","rebekah-tromble","scott-hale","helen-margetts"],"abstract":"Online abusive content detection is an inherently difficult task. It has received considerable attention from academia, particularly within the computational linguistics community, and performance appears to have improved as the field has matured. However, considerable challenges and unaddressed frontiers remain, spanning technical, social and ethical dimensions. These issues constrain the performance, efficiency and generalizability of abusive content detection systems. In this article we delineate and clarify the main challenges and frontiers in the field, critically evaluate their implications and discuss potential solutions. We also highlight ways in which social scientific insights can advance research. We discuss the lack of support given to researchers working with abusive content and provide guidelines for ethical research.","pages":"80--93","doi":"10.18653\/v1\/W19-3509","url":"https:\/\/www.aclweb.org\/anthology\/W19-3509","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3510","title":"A Hierarchically-Labeled {P}ortuguese Hate Speech Dataset","authors":["Fortuna, Paula","Rocha da Silva, Jo{\\~a}o","Soler-Company, Juan","Wanner, Leo","Nunes, S{\\'e}rgio"],"emails":["paula.fortuna@fe.up.pt","joaorosilva@gmail.com","juan.soler@upf.edu","leo.wanner@upf.edu","sergio.nunes@fe.up.pt"],"author_id":["paula-fortuna","joao-rocha-da-silva","juan-soler-company","leo-wanner","sergio-nunes"],"abstract":"Over the past years, the amount of online offensive speech has been growing steadily. To successfully cope with it, machine learning are applied. However, ML-based techniques require sufficiently large annotated datasets. In the last years, different datasets were published, mainly for English. In this paper, we present a new dataset for Portuguese, which has not been in focus so far. The dataset is composed of 5,668 tweets. For its annotation, we defined two different schemes used by annotators with different levels of expertise. Firstly, non-experts annotated the tweets with binary labels ({`}hate{'} vs. {`}no-hate{'}). Secondly, expert annotators classified the tweets following a fine-grained hierarchical multiple label scheme with 81 hate speech categories in total. The inter-annotator agreement varied from category to category, which reflects the insight that some types of hate speech are more subtle than others and that their detection depends on personal perception. This hierarchical annotation scheme is the main contribution of the presented work, as it facilitates the identification of different types of hate speech and their intersections. To demonstrate the usefulness of our dataset, we carried a baseline classification experiment with pre-trained word embeddings and LSTM on the binary classified data, with a state-of-the-art outcome.","pages":"94--104","doi":"10.18653\/v1\/W19-3510","url":"https:\/\/www.aclweb.org\/anthology\/W19-3510","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3511","title":"A System to Monitor Cyberbullying based on Message Classification and Social Network Analysis","authors":["Menini, Stefano","Moretti, Giovanni","Corazza, Michele","Cabrio, Elena","Tonelli, Sara","Villata, Serena"],"emails":["menini@fbk.eu","moretti@fbk.eu","michele.corazza@inria.fr","elena.cabrio@unice.fr","satonelli@fbk.eu","serena.villata@unice.fr"],"author_id":["stefano-menini","giovanni-moretti","michele-corazza","elena-cabrio","sara-tonelli","serena-villata"],"abstract":"Social media platforms like Twitter and Instagram face a surge in cyberbullying phenomena against young users and need to develop scalable computational methods to limit the negative consequences of this kind of abuse. Despite the number of approaches recently proposed in the Natural Language Processing (NLP) research area for detecting different forms of abusive language, the issue of identifying cyberbullying phenomena at scale is still an unsolved problem. This is because of the need to couple abusive language detection on textual message with network analysis, so that repeated attacks against the same person can be identified. In this paper, we present a system to monitor cyberbullying phenomena by combining message classification and social network analysis. We evaluate the classification module on a data set built on Instagram messages, and we describe the cyberbullying monitoring user interface.","pages":"105--110","doi":"10.18653\/v1\/W19-3511","url":"https:\/\/www.aclweb.org\/anthology\/W19-3511","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3512","title":"L-{HSAB}: A {L}evantine Twitter Dataset for Hate Speech and Abusive Language","authors":["Mulki, Hala","Haddad, Hatem","Bechikh Ali, Chedi","Alshabani, Halima"],"emails":["halamulki@selcuk.edu.tr","atem@gmail.com","chedi.bechikh@gmail.com","halima.alshabani@gmail.com"],"author_id":["hala-mulki","hatem-haddad","chedi-bechikh-ali","halima-alshabani"],"abstract":"Hate speech and abusive language have become a common phenomenon on Arabic social media. Automatic hate speech and abusive detection systems can facilitate the prohibition of toxic textual contents. The complexity, informality and ambiguity of the Arabic dialects hindered the provision of the needed resources for Arabic abusive\/hate speech detection research. In this paper, we introduce the first publicly-available Levantine Hate Speech and Abusive (L-HSAB) Twitter dataset with the objective to be a benchmark dataset for automatic detection of online Levantine toxic contents. We, further, provide a detailed review of the data collection steps and how we design the annotation guidelines such that a reliable dataset annotation is guaranteed. This has been later emphasized through the comprehensive evaluation of the annotations as the annotation agreement metrics of Cohen{'}s Kappa (k) and Krippendorff{'}s alpha (α) indicated the consistency of the annotations.","pages":"111--118","doi":"10.18653\/v1\/W19-3512","url":"https:\/\/www.aclweb.org\/anthology\/W19-3512","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3513","title":"At the Lower End of {L}anguage{---}{E}xploring the Vulgar and Obscene Side of {G}erman","authors":["Eder, Elisabeth","Krieg-Holz, Ulrike","Hahn, Udo"],"emails":["elisabeth.eder@aau.at","ulrike.krieg-holz@aau.at","udo.hahn@uni-jena.de"],"author_id":["elisabeth-eder","ulrike-krieg-holz","udo-hahn"],"abstract":"In this paper, we describe a workflow for the data-driven acquisition and semantic scaling of a lexicon that covers lexical items from the lower end of the German language register{---}terms typically considered as rough, vulgar or obscene. Since the fine semantic representation of grades of obscenity can only inadequately be captured at the categorical level (e.g., obscene vs. non-obscene, or rough vs. vulgar), our main contribution lies in applying best-worst scaling, a rating methodology that has already been shown to be useful for emotional language, to capture the relative strength of obscenity of lexical items. We describe the empirical foundations for bootstrapping such a low-end lexicon for German by starting from manually supplied lexicographic categorizations of a small seed set of rough and vulgar lexical items and automatically enlarging this set by means of distributional semantics. We then determine the degrees of obscenity for the full set of all acquired lexical items by letting crowdworkers comparatively assess their pejorative grade using best-worst scaling. This semi-automatically enriched lexicon already comprises 3,300 lexical items and incorporates 33,000 vulgarity ratings. Using it as a seed lexicon for fully automatic lexical acquisition, we were able to raise its coverage up to slightly more than 11,000 entries.","pages":"119--128","doi":"10.18653\/v1\/W19-3513","url":"https:\/\/www.aclweb.org\/anthology\/W19-3513","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3514","title":"Preemptive Toxic Language Detection in {W}ikipedia Comments Using Thread-Level Context","authors":["Karan, Mladen","{\\v{S}}najder, Jan"],"emails":["mladen.karan@fer.hr","jan.snajder@fer.hr"],"author_id":["mladen-karan","jan-snajder"],"abstract":"We address the task of automatically detecting toxic content in user generated texts. We fo cus on exploring the potential for preemptive moderation, i.e., predicting whether a particular conversation thread will, in the future, incite a toxic comment. Moreover, we perform preliminary investigation of whether a model that jointly considers all comments in a conversation thread outperforms a model that considers only individual comments. Using an existing dataset of conversations among Wikipedia contributors as a starting point, we compile a new large-scale dataset for this task consisting of labeled comments and comments from their conversation threads.","pages":"129--134","doi":"10.18653\/v1\/W19-3514","url":"https:\/\/www.aclweb.org\/anthology\/W19-3514","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3515","title":"Neural Word Decomposition Models for Abusive Language Detection","authors":["Bodapati, Sravan","Gella, Spandana","Bhattacharjee, Kasturi","Al-Onaizan, Yaser"],"emails":["sravanb@amazon.com","sgella@amazon.com","","onaizan@amazon.com"],"author_id":["sravan-bodapati","spandana-gella","kasturi-bhattacharjee","yaser-al-onaizan"],"abstract":"The text we see in social media suffers from lots of undesired characterstics like hatespeech, abusive language, insults etc. The nature of this text is also very different compared to the traditional text we see in news with lots of obfuscated words, intended typos. This poses several robustness challenges to many natural language processing (NLP) techniques developed for traditional text. Many techniques proposed in the recent times such as charecter encoding models, subword models, byte pair encoding to extract subwords can aid in dealing with few of these nuances. In our work, we analyze the effectiveness of each of the above techniques, compare and contrast various word decomposition techniques when used in combination with others. We experiment with recent advances of finetuning pretrained language models, and demonstrate their robustness to domain shift. We also show our approaches achieve state of the art performance on Wikipedia attack, toxicity datasets, and Twitter hatespeech dataset.","pages":"135--145","doi":"10.18653\/v1\/W19-3515","url":"https:\/\/www.aclweb.org\/anthology\/W19-3515","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3516","title":"A Platform Agnostic Dual-Strand Hate Speech Detector","authors":["Meyer, Johannes Skjeggestad","Gamb{\\\"a}ck, Bj{\\\"o}rn"],"emails":["johannes@skmeyer.com","gamback@ntnu.no"],"author_id":["johannes-skjeggestad-meyer","bjorn-gamback"],"abstract":"Hate speech detectors must be applicable across a multitude of services and platforms, and there is hence a need for detection approaches that do not depend on any information specific to a given platform. For instance, the information stored about the text{'}s author may differ between services, and so using such data would reduce a system{'}s general applicability. The paper thus focuses on using exclusively text-based input in the detection, in an optimised architecture combining Convolutional Neural Networks and Long Short-Term Memory-networks. The hate speech detector merges two strands with character n-grams and word embeddings to produce the final classification, and is shown to outperform comparable previous approaches.","pages":"146--156","doi":"10.18653\/v1\/W19-3516","url":"https:\/\/www.aclweb.org\/anthology\/W19-3516","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3517","title":"Detecting Aggression and Toxicity using a Multi Dimension Capsule Network","authors":["Srivastava, Saurabh","Khurana, Prerna"],"emails":["sriv.saurabh@tcs.com","prerna.khurana2@tcs.com"],"author_id":["saurabh-srivastava","prerna-khurana"],"abstract":"In the era of social media, hate speech, trolling and verbal abuse have become a common issue. We present an approach to automatically classify such statements, using a new deep learning architecture. Our model comprises of a Multi Dimension Capsule Network that generates the representation of sentences which we use for classification. We further provide an analysis of our model{'}s interpretation of such statements. We compare the results of our model with state-of-art classification algorithms and demonstrate our model{'}s ability. It also has the capability to handle comments that are written in both Hindi and English, which are provided in the TRAC dataset. We also compare results on Kaggle{'}s Toxic comment classification dataset.","pages":"157--162","doi":"10.18653\/v1\/W19-3517","url":"https:\/\/www.aclweb.org\/anthology\/W19-3517","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3518","title":"An Impossible Dialogue! Nominal Utterances and Populist Rhetoric in an {I}talian Twitter Corpus of Hate Speech against Immigrants","authors":["Comandini, Gloria","Patti, Viviana"],"emails":["gloria.comandini@unitn.it","patti@di.unito.it"],"author_id":["gloria-comandini","viviana-patti"],"abstract":"The paper proposes an investigation on the role of populist themes and rhetoric in an Italian Twitter corpus of hate speech against immigrants. The corpus had been annotated with four new layers of analysis: Nominal Utterances, that can be seen as consistent with populist rhetoric; In-out-group rhetoric, a very common populist strategy to polarize public opinion; Slogan-like nominal utterances, that may convey the call for severe illiberal policies against immigrants; News, to recognize the role of newspapers (headlines or reference to articles) in the Twitter political discourse on immigration featured by hate speech.","pages":"163--171","doi":"10.18653\/v1\/W19-3518","url":"https:\/\/www.aclweb.org\/anthology\/W19-3518","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3519","title":"{``}Condescending, Rude, Assholes{''}: Framing gender and hostility on Stack Overflow","authors":["Brooke, Sian"],"emails":[""],"author_id":["sian-brooke"],"abstract":"The disciplines of Gender Studies and Data Science are incompatible. This is conventional wisdom, supported by how many computational studies simplify gender into an immutable binary categorization that appears crude to the critical social researcher. I argue that the characterization of gender norms is context specific and may prove valuable in constructing useful models. I show how gender can be framed in computational studies as a stylized repetition of acts mediated by a social structure, and not a possessed biological category. By conducting a review of existing work, I show how gender should be explored in multiplicity in computational research through clustering techniques, and layout how this is being achieved in a study in progress on gender hostility on Stack Overflow.","pages":"172--180","doi":"10.18653\/v1\/W19-3519","url":"https:\/\/www.aclweb.org\/anthology\/W19-3519","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"},{"id":"W19-3520","title":"Online aggression from a sociological perspective: An integrative view on determinants and possible countermeasures","authors":["Weingartner, Sebastian","Stahel, Lea"],"emails":["",""],"author_id":["sebastian-weingartner","lea-stahel"],"abstract":"The present paper introduces a theoretical model for explaining aggressive online comments from a sociological perspective. It is innovative as it combines individual, situational, and social-structural determinants of online aggression and tries to theoretically derive their interplay. Moreover, the paper suggests an empirical strategy for testing the model. The main contribution will be to match online commenting data with survey data containing rich background data of non- \/aggressive online commentators.","pages":"181--187","doi":"10.18653\/v1\/W19-3520","url":"https:\/\/www.aclweb.org\/anthology\/W19-3520","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Third Workshop on Abusive Language Online"}]