[{"id":"W19-1401","title":"A Report on the Third {V}ar{D}ial Evaluation Campaign","authors":["Zampieri, Marcos","Malmasi, Shervin","Scherrer, Yves","Samard{\\v{z}}i{\\'c}, Tanja","Tyers, Francis","Silfverberg, Miikka","Klyueva, Natalia","Pan, Tung-Le","Huang, Chu-Ren","Ionescu, Radu Tudor","Butnaru, Andrei M.","Jauhiainen, Tommi"],"emails":["m.zampieri@wlv.ac.uk","","","","","","","","","","",""],"author_id":["marcos-zampieri","shervin-malmasi","yves-scherrer","tanja-samardzic","francis-tyers","miikka-silfverberg","natalia-klyueva","tung-le-pan","chu-ren-huang","radu-tudor-ionescu","andrei-butnaru","tommi-jauhiainen"],"abstract":"In this paper, we present the findings of the Third VarDial Evaluation Campaign organized as part of the sixth edition of the workshop on Natural Language Processing (NLP) for Similar Languages, Varieties and Dialects (VarDial), co-located with NAACL 2019. This year, the campaign included five shared tasks, including one task re-run {--} German Dialect Identification (GDI) {--} and four new tasks {--} Cross-lingual Morphological Analysis (CMA), Discriminating between Mainland and Taiwan variation of Mandarin Chinese (DMT), Moldavian vs. Romanian Cross-dialect Topic identification (MRC), and Cuneiform Language Identification (CLI). A total of 22 teams submitted runs across the five shared tasks. After the end of the competition, we received 14 system description papers, which are published in the VarDial workshop proceedings and referred to in this report.","pages":"1--16","doi":"10.18653\/v1\/W19-1401","url":"https:\/\/www.aclweb.org\/anthology\/W19-1401","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1402","title":"Improving Cuneiform Language Identification with {BERT}","authors":["Bernier-Colborne, Gabriel","Goutte, Cyril","L{\\'e}ger, Serge"],"emails":["","","eger@nrc-cnrc.gc.ca"],"author_id":["gabriel-bernier-colborne","cyril-goutte","serge-leger"],"abstract":"We describe the systems developed by the National Research Council Canada for the Cuneiform Language Identification (CLI) shared task at the 2019 VarDial evaluation campaign. We compare a state-of-the-art baseline relying on character n-grams and a traditional statistical classifier, a voting ensemble of classifiers, and a deep learning approach using a Transformer network. We describe how these systems were trained, and analyze the impact of some preprocessing and model estimation decisions. The deep neural network achieved 77{\\%} accuracy on the test data, which turned out to be the best performance at the CLI evaluation, establishing a new state-of-the-art for cuneiform language identification.","pages":"17--25","doi":"10.18653\/v1\/W19-1402","url":"https:\/\/www.aclweb.org\/anthology\/W19-1402","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1403","title":"Joint Approach to Deromanization of Code-mixed Texts","authors":["Riyadh, Rashed Rubby","Kondrak, Grzegorz"],"emails":["riyadh@ualberta.ca","gkondrak@ualberta.ca"],"author_id":["rashed-rubby-riyadh","grzegorz-kondrak"],"abstract":"The conversion of romanized texts back to the native scripts is a challenging task because of the inconsistent romanization conventions and non-standard language use. This problem is compounded by code-mixing, i.e., using words from more than one language within the same discourse. In this paper, we propose a novel approach for handling these two problems together in a single system. Our approach combines three components: language identification, back-transliteration, and sequence prediction. The results of our experiments on Bengali and Hindi datasets establish the state of the art for the task of deromanization of code-mixed texts.","pages":"26--34","doi":"10.18653\/v1\/W19-1403","url":"https:\/\/www.aclweb.org\/anthology\/W19-1403","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1404","title":"Char-{RNN} for Word Stress Detection in East {S}lavic Languages","authors":["Chernyak, Ekaterina","Ponomareva, Maria","Milintsevich, Kirill"],"emails":["echernyak@hse.ru","maria.ponomareva@abbyy.com","kirill.milintsevich@ut.ee"],"author_id":["ekaterina-chernyak","maria-ponomareva","kirill-milintsevich"],"abstract":"We explore how well a sequence labeling approach, namely, recurrent neural network, is suited for the task of resource-poor and POS tagging free word stress detection in the Russian, Ukranian, Belarusian languages. We present new datasets, annotated with the word stress, for the three languages and compare several RNN models trained on three languages and explore possible applications of the transfer learning for the task. We show that it is possible to train a model in a cross-lingual setting and that using additional languages improves the quality of the results.","pages":"35--41","doi":"10.18653\/v1\/W19-1404","url":"https:\/\/www.aclweb.org\/anthology\/W19-1404","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1405","title":"Modeling Global Syntactic Variation in {E}nglish Using Dialect Classification","authors":["Dunn, Jonathan"],"emails":["jonathan.dunn@canterbury.ac.nz"],"author_id":["jonathan-dunn"],"abstract":"This paper evaluates global-scale dialect identification for 14 national varieties of English on both web-crawled data and Twitter data. The paper makes three main contributions: (i) introducing data-driven language mapping as a method for selecting the inventory of national varieties to include in the task; (ii) producing a large and dynamic set of syntactic features using grammar induction rather than focusing on a few hand-selected features such as function words; and (iii) comparing models across both web corpora and social media corpora in order to measure the robustness of syntactic variation across registers.","pages":"42--53","doi":"10.18653\/v1\/W19-1405","url":"https:\/\/www.aclweb.org\/anthology\/W19-1405","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1406","title":"Language Discrimination and Transfer Learning for Similar Languages: Experiments with Feature Combinations and Adaptation","authors":["Wu, Nianheng","DeMattos, Eric","So, Kwok Him","Chen, Pin-zhen","{\\c{C}}{\\\"o}ltekin, {\\c{C}}a{\\u{g}}r{\\i}"],"emails":["nianheng.wu@student.uni-tuebingen.de","eric.demattos@student.uni-tuebingen.de","kwok-him.so@student.uni-tuebingen.de","pinzhen.chen@student.uni-tuebingen.de","ccoltekin@sfs.uni-tuebingen.de"],"author_id":["nianheng-wu","eric-demattos","kwok-him-so","pin-zhen-chen","cagri-coltekin"],"abstract":"This paper describes the work done by team tearsofjoy participating in the VarDial 2019 Evaluation Campaign. We developed two systems based on Support Vector Machines: SVM with a flat combination of features and SVM ensembles. We participated in all language\/dialect identification tasks, as well as the Moldavian vs. Romanian cross-dialect topic identification (MRC) task. Our team achieved first place in German Dialect identification (GDI) and MRC subtasks 2 and 3, second place in the simplified variant of Discriminating between Mainland and Taiwan variation of Mandarin Chinese (DMT) as well as Cuneiform Language Identification (CLI), and third and fifth place in DMT traditional and MRC subtask 1 respectively. In most cases, the SVM with a flat combination of features performed better than SVM ensembles. Besides describing the systems and the results obtained by them, we provide a tentative comparison between the feature combination methods, and present additional experiments with a method of adaptation to the test set, which may indicate potential pitfalls with some of the data sets.","pages":"54--63","doi":"10.18653\/v1\/W19-1406","url":"https:\/\/www.aclweb.org\/anthology\/W19-1406","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1407","title":"Variation between Different Discourse Types: Literate vs. Oral","authors":["Ortmann, Katrin","Dipper, Stefanie"],"emails":["ortmann@linguistics.rub.de","dipper@linguistics.rub.de"],"author_id":["katrin-ortmann","stefanie-dipper"],"abstract":"This paper deals with the automatic identification of literate and oral discourse in German texts. A range of linguistic features is selected and their role in distinguishing between literate- and oral-oriented registers is investigated, using a decision-tree classifier. It turns out that all of the investigated features are related in some way to oral conceptuality. Especially simple measures of complexity (average sentence and word length) are prominent indicators of oral and literate discourse. In addition, features of reference and deixis (realized by different types of pronouns) also prove to be very useful in determining the degree of orality of different registers.","pages":"64--79","doi":"10.18653\/v1\/W19-1407","url":"https:\/\/www.aclweb.org\/anthology\/W19-1407","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1408","title":"Neural Machine Translation between {M}yanmar ({B}urmese) and Rakhine (Arakanese)","authors":["Myint Oo, Thazin","Kyaw Thu, Ye","Mar Soe, Khin"],"emails":["thazinmyintoo@ucsy.edu.mm","ka2pluskha2@gmail.com","khinmarsoe@ucsy.edu.mm"],"author_id":["thazin-myint-oo1","ye-kyaw-thu1","khin-mar-soe1"],"abstract":"This work explores neural machine translation between Myanmar (Burmese) and Rakhine (Arakanese). Rakhine is a language closely related to Myanmar, often considered a dialect. We implemented three prominent neural machine translation (NMT) systems: recurrent neural networks (RNN), transformer, and convolutional neural networks (CNN). The systems were evaluated on a Myanmar-Rakhine parallel text corpus developed by us. In addition, two types of word segmentation schemes for word embeddings were studied: Word-BPE and Syllable-BPE segmentation. Our experimental results clearly show that the highest quality NMT and statistical machine translation (SMT) performances are obtained with Syllable-BPE segmentation for both types of translations. If we focus on NMT, we find that the transformer with Word-BPE segmentation outperforms CNN and RNN for both Myanmar-Rakhine and Rakhine-Myanmar translation. However, CNN with Syllable-BPE segmentation obtains a higher score than the RNN and transformer.","pages":"80--88","doi":"10.18653\/v1\/W19-1408","url":"https:\/\/www.aclweb.org\/anthology\/W19-1408","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1409","title":"Language and Dialect Identification of Cuneiform Texts","authors":["Jauhiainen, Tommi","Jauhiainen, Heidi","Alstola, Tero","Lind{\\'e}n, Krister"],"emails":["tommi.jauhiainen@helsinki.fi","heidi.jauhiainen@helsinki.fi","tero.alstola@helsinki.fi","krister.linden@helsinki.fi"],"author_id":["tommi-jauhiainen","heidi-jauhiainen","tero-alstola","krister-linden"],"abstract":"This article introduces a corpus of cuneiform texts from which the dataset for the use of the Cuneiform Language Identification (CLI) 2019 shared task was derived as well as some preliminary language identification experiments conducted using that corpus. We also describe the CLI dataset and how it was derived from the corpus. In addition, we provide some baseline language identification results using the CLI dataset. To the best of our knowledge, the experiments detailed here represent the first time that automatic language identification methods have been used on cuneiform data.","pages":"89--98","doi":"10.18653\/v1\/W19-1409","url":"https:\/\/www.aclweb.org\/anthology\/W19-1409","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1410","title":"Leveraging Pretrained Word Embeddings for Part-of-Speech Tagging of Code Switching Data","authors":["AlGhamdi, Fahad","Diab, Mona"],"emails":["mtdiab@gwu.edu","fghamdi@gwu.edu"],"author_id":["fahad-alghamdi","mona-diab"],"abstract":"Linguistic Code Switching (CS) is a phenomenon that occurs when multilingual speakers alternate between two or more languages\/dialects within a single conversation. Processing CS data is especially challenging in intra-sentential data given state-of-the-art monolingual NLP technologies since such technologies are geared toward the processing of one language at a time. In this paper, we address the problem of Part-of-Speech tagging (POS) in the context of linguistic code switching (CS). We explore leveraging multiple neural network architectures to measure the impact of different pre-trained embeddings methods on POS tagging CS data. We investigate the landscape in four CS language pairs, Spanish-English, Hindi-English, Modern Standard Arabic- Egyptian Arabic dialect (MSA-EGY), and Modern Standard Arabic- Levantine Arabic dialect (MSA-LEV). Our results show that multilingual embedding (e.g., MSA-EGY and MSA-LEV) helps closely related languages (EGY\/LEV) but adds noise to the languages that are distant (SPA\/HIN). Finally, we show that our proposed models outperform state-of-the-art CS taggers for MSA-EGY language pair.","pages":"99--109","doi":"10.18653\/v1\/W19-1410","url":"https:\/\/www.aclweb.org\/anthology\/W19-1410","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1411","title":"Toward a deep dialectological representation of {I}ndo-{A}ryan","authors":["Cathcart, Chundra"],"emails":["chundra.cathcart@uzh.ch"],"author_id":["chundra-cathcart"],"abstract":"This paper presents a new approach to disentangling inter-dialectal and intra-dialectal relationships within one such group, the Indo-Aryan subgroup of Indo-European. We draw upon admixture models and deep generative models to tease apart historic language contact and language-specific behavior in the overall patterns of sound change displayed by Indo-Aryan languages. We show that a {``}deep{''} model of Indo-Aryan dialectology sheds some light on questions regarding inter-relationships among the Indo-Aryan languages, and performs better than a {``}shallow{''} model in terms of certain qualities of the posterior distribution (e.g., entropy of posterior distributions), and outline future pathways for model development.","pages":"110--119","doi":"10.18653\/v1\/W19-1411","url":"https:\/\/www.aclweb.org\/anthology\/W19-1411","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1412","title":"Naive {B}ayes and {B}i{LSTM} Ensemble for Discriminating between Mainland and Taiwan Variation of {M}andarin {C}hinese","authors":["Yang, Li","Xiang, Yang"],"emails":["li.yang@tongji.edu.cn","shxiangyang@tongji.edu.cn"],"author_id":["li-yang","yang-xiang"],"abstract":"Automatic dialect identification is a more challengingctask than language identification, as it requires the ability to discriminate between varieties of one language. In this paper, we propose an ensemble based system, which combines traditional machine learning models trained on bag of n-gram fetures, with deep learning models trained on word embeddings, to solve the Discriminating between Mainland and Taiwan Variation of Mandarin Chinese (DMT) shared task at VarDial 2019. Our experiments show that a character bigram-trigram combination based Naive Bayes is a very strong model for identifying varieties of Mandarin Chinense. Through further ensemble of Navie Bayes and BiLSTM, our system (team: itsalexyang) achived an macro-averaged F1 score of 0.8530 and 0.8687 in two tracks.","pages":"120--127","doi":"10.18653\/v1\/W19-1412","url":"https:\/\/www.aclweb.org\/anthology\/W19-1412","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1413","title":"{BAM}: A combination of deep and shallow models for {G}erman Dialect Identification.","authors":["Butnaru, Andrei M."],"emails":["butnaruandreimadalin@gmail.com"],"author_id":["andrei-butnaru"],"abstract":"*This is a submission for the Third VarDial Evaluation Campaign* In this paper, we present a machine learning approach for the German Dialect Identification (GDI) Closed Shared Task of the DSL 2019 Challenge. The proposed approach combines deep and shallow models, by applying a voting scheme on the outputs resulted from a Character-level Convolutional Neural Networks (Char-CNN), a Long Short-Term Memory (LSTM) network, and a model based on String Kernels. The first model used is the Char-CNN model that merges multiple convolutions computed with kernels of different sizes. The second model is the LSTM network which applies a global max pooling over the returned sequences over time. Both models pass the activation maps to two fully-connected layers. The final model is based on String Kernels, computed on character p-grams extracted from speech transcripts. The model combines two blended kernel functions, one is the presence bits kernel, and the other is the intersection kernel. The empirical results obtained in the shared task prove that the approach can achieve good results. The system proposed in this paper obtained the fourth place with a macro-F1 score of 62.55{\\%}","pages":"128--137","doi":"10.18653\/v1\/W19-1413","url":"https:\/\/www.aclweb.org\/anthology\/W19-1413","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1414","title":"The {R}2{I}{\\_}{LIS} Team Proposes Majority Vote for {V}ar{D}ial{'}s {MRC} Task","authors":["Chifu, Adrian-Gabriel"],"emails":["adrian.chifu@univ-amu.fr"],"author_id":["adrian-gabriel-chifu"],"abstract":"This article presents the model that generated the runs submitted by the R2I{\\_}LIS team to the VarDial2019 evaluation campaign, more particularly, to the binary classification by dialect sub-task of the Moldavian vs. Romanian Cross-dialect Topic identification (MRC) task. The team proposed a majority vote-based model, between five supervised machine learning models, trained on forty manually-crafted features. One of the three submitted runs was ranked second at the binary classification sub-task, with a performance of 0.7963, in terms of macro-F1 measure. The other two runs were ranked third and fourth, respectively.","pages":"138--143","doi":"10.18653\/v1\/W19-1414","url":"https:\/\/www.aclweb.org\/anthology\/W19-1414","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1415","title":"Initial Experiments In Cross-Lingual Morphological Analysis Using Morpheme Segmentation","authors":["Mikhailov, Vladislav","Tosi, Lorenzo","Khorosheva, Anastasia","Serikov, Oleg"],"emails":["vnmikhaylov@edu.hse.ru","ltosi@edu.hse.ru","aakhorosheva@edu.hse.ru","oaserikov@edu.hse.ru"],"author_id":["vladislav-mikhailov","lorenzo-tosi","anastasia-khorosheva","oleg-serikov"],"abstract":"The paper describes initial experiments in data-driven cross-lingual morphological analysis of open-category words using a combination of unsupervised morpheme segmentation, annotation projection and an LSTM encoder-decoder model with attention. Our algorithm provides lemmatisation and morphological analysis generation for previously unseen low-resource language surface forms with only annotated data on the related languages given. Despite the inherently lossy annotation projection, we achieved the best lemmatisation F1-score in the VarDial 2019 Shared Task on Cross-Lingual Morphological Analysis for both Karachay-Balkar (Turkic languages, agglutinative morphology) and Sardinian (Romance languages, fusional morphology).","pages":"144--152","doi":"10.18653\/v1\/W19-1415","url":"https:\/\/www.aclweb.org\/anthology\/W19-1415","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1416","title":"Neural and Linear Pipeline Approaches to Cross-lingual Morphological Analysis","authors":["{\\c{C}}{\\\"o}ltekin, {\\c{C}}a{\\u{g}}r{\\i}","Barnes, Jeremy"],"emails":["ccoltekin@sfs.uni-tuebingen.de","jeremycb@ifi.uio.no"],"author_id":["cagri-coltekin","jeremy-barnes"],"abstract":"This paper describes T{\\\"u}bingen-Oslo team{'}s participation in the cross-lingual morphological analysis task in the VarDial 2019 evaluation campaign. We participated in the shared task with a standard neural network model. Our model achieved analysis F1-scores of 31.48 and 23.67 on test languages Karachay-Balkar (Turkic) and Sardinian (Romance) respectively. The scores are comparable to the scores obtained by the other participants in both language families, and the analysis score on the Romance data set was also the best result obtained in the shared task. Besides describing the system used in our shared task participation, we describe another, simpler, model based on linear classifiers, and present further analyses using both models. Our analyses, besides revealing some of the difficult cases, also confirm that the usefulness of a source language in this task is highly correlated with the similarity of source and target languages.","pages":"153--164","doi":"10.18653\/v1\/W19-1416","url":"https:\/\/www.aclweb.org\/anthology\/W19-1416","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1417","title":"Ensemble Methods to Distinguish Mainland and Taiwan {C}hinese","authors":["Hu, Hai","Li, Wen","Zhou, He","Tian, Zuoyu","Zhang, Yiwen","Zou, Liang"],"emails":["huhai@iu.edu","wl9@iu.edu","hzh1@iu.edu","zuoytian@iu.edu","yiwezhan@iu.edu","lz1904@nyu.edu"],"author_id":["hai-hu","wen-li","he-zhou","zuoyu-tian","yiwen-zhang","liang-zou"],"abstract":"This paper describes the IUCL system at VarDial 2019 evaluation campaign for the task of discriminating between Mainland and Taiwan variation of mandarin Chinese. We first build several base classifiers, including a Naive Bayes classifier with word n-gram as features, SVMs with both character and syntactic features, and neural networks with pre-trained character\/word embeddings. Then we adopt ensemble methods to combine output from base classifiers to make final predictions. Our ensemble models achieve the highest F1 score (0.893) in simplified Chinese track and the second highest (0.901) in traditional Chinese track. Our results demonstrate the effectiveness and robustness of the ensemble methods.","pages":"165--171","doi":"10.18653\/v1\/W19-1417","url":"https:\/\/www.aclweb.org\/anthology\/W19-1417","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1418","title":"{SC}-{UPB} at the {V}ar{D}ial 2019 Evaluation Campaign: Moldavian vs. {R}omanian Cross-Dialect Topic Identification","authors":["Onose, Cristian","Cercel, Dumitru-Clementin","Trausan-Matu, Stefan"],"emails":["onose.cristian@gmail.com","clementin.cercel@gmail.com","stefan.trausan@cs.pub.ro"],"author_id":["cristian-onose","dumitru-clementin-cercel","stefan-trausan-matu"],"abstract":"This paper describes our models for the Moldavian vs. Romanian Cross-Topic Identification (MRC) evaluation campaign, part of the VarDial 2019 workshop. We focus on the three subtasks for MRC: binary classification between the Moldavian (MD) and the Romanian (RO) dialects and two cross-dialect multi-class classification between six news topics, MD to RO and RO to MD. We propose several deep learning models based on long short-term memory cells, Bidirectional Gated Recurrent Unit (BiGRU) and Hierarchical Attention Networks (HAN). We also employ three word embedding models to represent the text as a low dimensional vector. Our official submission includes two runs of the BiGRU and HAN models for each of the three subtasks. The best submitted model obtained the following macro-averaged F1 scores: 0.708 for subtask 1, 0.481 for subtask 2 and 0.480 for the last one. Due to a read error caused by the quoting behaviour over the test file, our final submissions contained a smaller number of items than expected. More than 50{\\%} of the submission files were corrupted. Thus, we also present the results obtained with the corrected labels for which the HAN model achieves the following results: 0.930 for subtask 1, 0.590 for subtask 2 and 0.687 for the third one.","pages":"172--177","doi":"10.18653\/v1\/W19-1418","url":"https:\/\/www.aclweb.org\/anthology\/W19-1418","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1419","title":"Discriminating between {M}andarin {C}hinese and Swiss-{G}erman varieties using adaptive language models","authors":["Jauhiainen, Tommi","Lind{\\'e}n, Krister","Jauhiainen, Heidi"],"emails":["tommi.jauhiainen@helsinki.fi","krister.linden@helsinki.fi","heidi.jauhiainen@helsinki.fi"],"author_id":["tommi-jauhiainen","krister-linden","heidi-jauhiainen"],"abstract":"This paper describes the language identification systems used by the SUKI team in the Discriminating between the Mainland and Taiwan variation of Mandarin Chinese (DMT) and the German Dialect Identification (GDI) shared tasks which were held as part of the third VarDial Evaluation Campaign. The DMT shared task included two separate tracks, one for the simplified Chinese script and one for the traditional Chinese script. We submitted three runs on both tracks of the DMT task as well as on the GDI task. We won the traditional Chinese track using Naive Bayes with language model adaptation, came second on GDI with an adaptive version of the HeLI 2.0 method, and third on the simplified Chinese track using again the adaptive Naive Bayes.","pages":"178--187","doi":"10.18653\/v1\/W19-1419","url":"https:\/\/www.aclweb.org\/anthology\/W19-1419","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1420","title":"Investigating Machine Learning Methods for Language and Dialect Identification of Cuneiform Texts","authors":["Doostmohammadi, Ehsan","Nassajian, Minoo"],"emails":["e.doostm72@student.sharif.edu","m.nassajian2016@student.sharif.edu"],"author_id":["ehsan-doostmohammadi","minoo-nassajian"],"abstract":"Identification of the languages written using cuneiform symbols is a difficult task due to the lack of resources and the problem of tokenization. The Cuneiform Language Identification task in VarDial 2019 addresses the problem of identifying seven languages and dialects written in cuneiform; Sumerian and six dialects of Akkadian language: Old Babylonian, Middle Babylonian Peripheral, Standard Babylonian, Neo-Babylonian, Late Babylonian, and Neo-Assyrian. This paper describes the approaches taken by SharifCL team to this problem in VarDial 2019. The best result belongs to an ensemble of Support Vector Machines and a naive Bayes classifier, both working on character-level features, with macro-averaged F1-score of 72.10{\\%}.","pages":"188--193","doi":"10.18653\/v1\/W19-1420","url":"https:\/\/www.aclweb.org\/anthology\/W19-1420","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1421","title":"{T}wist{B}ytes - Identification of Cuneiform Languages and {G}erman Dialects at {V}ar{D}ial 2019","authors":["Benites, Fernando","von D{\\\"a}niken, Pius","Cieliebak, Mark"],"emails":["benf@zhaw.ch","vode@zhaw.ch","mc@spinningbytes.com"],"author_id":["fernando-benites","pius-von-daniken","mark-cieliebak"],"abstract":"We describe our approaches for the German Dialect Identification (GDI) and the Cuneiform Language Identification (CLI) tasks at the VarDial Evaluation Campaign 2019. The goal was to identify dialects of Swiss German in GDI and Sumerian and Akkadian in CLI. In GDI, the system should distinguish four dialects from the German-speaking part of Switzerland. Our system for GDI achieved third place out of 6 teams, with a macro averaged F-1 of 74.6{\\%}. In CLI, the system should distinguish seven languages written in cuneiform script. Our system achieved third place out of 8 teams, with a macro averaged F-1 of 74.7{\\%}.","pages":"194--201","doi":"10.18653\/v1\/W19-1421","url":"https:\/\/www.aclweb.org\/anthology\/W19-1421","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1422","title":"{DT}eam @ {V}ar{D}ial 2019: Ensemble based on skip-gram and triplet loss neural networks for Moldavian vs. {R}omanian cross-dialect topic identification","authors":["Tudoreanu, Diana"],"emails":["dianatudoreanu@gmail.com"],"author_id":["diana-tudoreanu"],"abstract":"This paper presents the solution proposed by DTeam in the VarDial 2019 Evaluation Campaign for the Moldavian vs. Romanian cross-topic identification task. The solution proposed is a Support Vector Machines (SVM) ensemble composed of a two character-level neural networks. The first network is a skip-gram classification model formed of an embedding layer, three convolutional layers and two fully-connected layers. The second network has a similar architecture, but is trained using the triplet loss function.","pages":"202--208","doi":"10.18653\/v1\/W19-1422","url":"https:\/\/www.aclweb.org\/anthology\/W19-1422","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1423","title":"Experiments in Cuneiform Language Identification","authors":["Paetzold, Gustavo Henrique","Zampieri, Marcos"],"emails":["ghpaetzold@utfpr.edu.br",""],"author_id":["gustavo-paetzold","marcos-zampieri"],"abstract":"This paper presents methods to discriminate between languages and dialects written in Cuneiform script, one of the first writing systems in the world. We report the results obtained by the PZ team in the Cuneiform Language Identification (CLI) shared task organized within the scope of the VarDial Evaluation Campaign 2019. The task included two languages, Sumerian and Akkadian. The latter is divided into six dialects: Old Babylonian, Middle Babylonian peripheral, Standard Babylonian, Neo Babylonian, Late Babylonian, and Neo Assyrian. We approach the task using a meta-classifier trained on various SVM models and we show the effectiveness of the system for this task. Our submission achieved 0.738 F1 score in discriminating between the seven languages and dialects and it was ranked fourth in the competition among eight teams.","pages":"209--213","doi":"10.18653\/v1\/W19-1423","url":"https:\/\/www.aclweb.org\/anthology\/W19-1423","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1424","title":"Comparing Pipelined and Integrated Approaches to Dialectal {A}rabic Neural Machine Translation","authors":["Shapiro, Pamela","Duh, Kevin"],"emails":["pshapiro@jhu.edu","kevinduh@cs.jhu.edu"],"author_id":["pamela-shapiro","kevin-duh"],"abstract":"When translating diglossic languages such as Arabic, situations may arise where we would like to translate a text but do not know which dialect it is. A traditional approach to this problem is to design dialect identification systems and dialect-specific machine translation systems. However, under the recent paradigm of neural machine translation, shared multi-dialectal systems have become a natural alternative. Here we explore under which conditions it is beneficial to perform dialect identification for Arabic neural machine translation versus using a general system for all dialects.","pages":"214--222","doi":"10.18653\/v1\/W19-1424","url":"https:\/\/www.aclweb.org\/anthology\/W19-1424","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"},{"id":"W19-1425","title":"Cross-lingual Annotation Projection Is Effective for Neural Part-of-Speech Tagging","authors":["Huck, Matthias","Dutka, Diana","Fraser, Alexander"],"emails":["mhuck@cis.lmu.de","diana.dutka@gmail.com","fraser@cis.lmu.de"],"author_id":["matthias-huck","diana-dutka","alexander-fraser"],"abstract":"We tackle the important task of part-of-speech tagging using a neural model in the zero-resource scenario, where we have no access to gold-standard POS training data. We compare this scenario with the low-resource scenario, where we have access to a small amount of gold-standard POS training data. Our experiments focus on Ukrainian as a representative of under-resourced languages. Russian is highly related to Ukrainian, so we exploit gold-standard Russian POS tags. We consider four techniques to perform Ukrainian POS tagging: zero-shot tagging and cross-lingual annotation projection (for the zero-resource scenario), and compare these with self-training and multilingual learning (for the low-resource scenario). We find that cross-lingual annotation projection works particularly well in the zero-resource scenario.","pages":"223--233","doi":"10.18653\/v1\/W19-1425","url":"https:\/\/www.aclweb.org\/anthology\/W19-1425","publisher":"Association for Computational Linguistics","address":"TOBEFILLED-Ann Arbor, Michigan","year":"2019","month":"June","booktitle":"Proceedings of the Sixth Workshop on {NLP} for Similar Languages, Varieties and Dialects"}]