[{"id":"W19-4701","title":"From Insanely Jealous to Insanely Delicious: Computational Models for the Semantic Bleaching of {E}nglish Intensifiers","authors":["Luo, Yiwei","Jurafsky, Dan","Levin, Beth"],"emails":["yiweil@stanford.edu","jurafsky@stanford.edu","bclevin@stanford.edu"],"author_id":["yiwei-luo","dan-jurafsky","beth-levin"],"abstract":"We introduce novel computational models for modeling semantic bleaching, a widespread category of change in which words become more abstract or lose elements of meaning, like the development of {``}arrive{''} from its earlier meaning {`}become at shore.{'} We validate our methods on a widespread case of bleaching in English: de-adjectival adverbs that originate as manner adverbs (as in {``}awfully behaved{''}) and later become intensifying adverbs (as in {``}awfully nice{''}). Our methods formally quantify three reflexes of bleaching: decreasing similarity to the source meaning (e.g., {``}awful{''}), increasing similarity to a fully bleached prototype (e.g., {``}very{''}), and increasing productivity (e.g., the breadth of adjectives that an adverb modifies). We also test a new causal model and find evidence that bleaching is initially triggered in contexts such as {``}conspicuously evident{''} and {``}insanely jealous{''}, where an adverb premodifies a semantically similar adjective. These contexts provide a form of {``}bridging context{''} (Evans and Wilkins, 2000) that allow a manner adverb to be reinterpreted as an intensifying adverb similar to {``}very{''}.","pages":"1--13","doi":"10.18653\/v1\/W19-4701","url":"https:\/\/www.aclweb.org\/anthology\/W19-4701","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4702","title":"Computational Analysis of the Historical Changes in Poetry and Prose","authors":["Gopidi, Amitha","Alam, Aniket"],"emails":["amitha.g@research.iiit.ac.in","aniket.alam@iiit.ac.in"],"author_id":["amitha-gopidi","aniket-alam"],"abstract":"The esoteric definitions of poetry are insufficient in enveloping the changes in poetry that the age of mechanical reproduction has witnessed with the widespread proliferation of the use of digital media and artificial intelligence. They are also insufficient in distinguishing between prose and poetry, as the content of both prose and poetry can be poetic. Using quotes as prose considering their poetic, context-free and celebrated nature, stylistic differences between poetry and prose are delved into. Novel features in grammar and meter are justified as distinguishing features. Datasets of popular prose and poetry spanning across 1870-1920 and 1970-2019 have been created, and multiple experiments have been conducted to prove that prose and poetry in the latter period are more alike than they were in the former. The accuracy of classification of poetry and prose of 1970-2019 is significantly lesser than that of 1870-1920, thereby proving the convergence of poetry and prose in 1970-2019.","pages":"14--22","doi":"10.18653\/v1\/W19-4702","url":"https:\/\/www.aclweb.org\/anthology\/W19-4702","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4703","title":"Studying Semantic Chain Shifts with {W}ord2{V}ec: {FOOD}{\\textgreater}{MEAT}{\\textgreater}{FLESH}","authors":["Zimmermann, Richard"],"emails":["richard.zimmermann@unige.ch"],"author_id":["richard-zimmermann"],"abstract":"Word2Vec models are used to study the semantic chain shift FOOD{\\textgreater}MEAT{\\textgreater}FLESH in the history of English, c. 1425-1925. The development stretches out over a long time, starting before 1500, and may possibly be continuing to this day. The semantic changes likely proceeded as a push chain.","pages":"23--28","doi":"10.18653\/v1\/W19-4703","url":"https:\/\/www.aclweb.org\/anthology\/W19-4703","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4704","title":"Evaluation of Semantic Change of Harm-Related Concepts in Psychology","authors":["Vylomova, Ekaterina","Murphy, Sean","Haslam, Nicholas"],"emails":["vylomovae@unimelb.edu.au","seanchrismurphy@gmail.com","nhaslam@unimelb.edu.au"],"author_id":["ekaterina-vylomova","sean-murphy","nicholas-haslam"],"abstract":"The paper focuses on diachronic evaluation of semantic changes of harm-related concepts in psychology. More specifically, we investigate a hypothesis that certain concepts such as {``}addiction{''}, {``}bullying{''}, {``}harassment{''}, {``}prejudice{''}, and {``}trauma{''} became broader during the last four decades. We evaluate semantic changes using two models: an LSA-based model from Sagi et al. (2009) and a diachronic adaptation of word2vec from Hamilton et al. (2016), that are trained on a large corpus of journal abstracts covering the period of 1980{--} 2019. Several concepts showed evidence of broadening. {``}Addiction{''} moved from physiological dependency on a substance to include psychological dependency on gaming and the Internet. Similarly, {``}harassment{''} and {``}trauma{''} shifted towards more psychological meanings. On the other hand, {``}bullying{''} has transformed into a more victim-related concept and expanded to new areas such as workplaces.","pages":"29--34","doi":"10.18653\/v1\/W19-4704","url":"https:\/\/www.aclweb.org\/anthology\/W19-4704","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4705","title":"Contextualized Diachronic Word Representations","authors":["Jawahar, Ganesh","Seddah, Djam{\\'e}"],"emails":["ganesh.jawahar@inria.fr","djam{\\'e}.seddah@inria.fr"],"author_id":["ganesh-jawahar","djame-seddah"],"abstract":"Diachronic word embeddings play a key role in capturing interesting patterns about how language evolves over time. Most of the existing work focuses on studying corpora spanning across several decades, which is understandably still not a possibility when working on social media-based user-generated content. In this work, we address the problem of studying semantic changes in a large Twitter corpus collected over five years, a much shorter period than what is usually the norm in diachronic studies. We devise a novel attentional model, based on Bernoulli word embeddings, that are conditioned on contextual extra-linguistic (social) features such as network, spatial and socio-economic variables, which are associated with Twitter users, as well as topic-based features. We posit that these social features provide an inductive bias that helps our model to overcome the narrow time-span regime problem. Our extensive experiments reveal that our proposed model is able to capture subtle semantic shifts without being biased towards frequency cues and also works well when certain contextual features are absent. Our model fits the data better than current state-of-the-art dynamic word embedding models and therefore is a promising tool to study diachronic semantic changes over small time periods.","pages":"35--47","doi":"10.18653\/v1\/W19-4705","url":"https:\/\/www.aclweb.org\/anthology\/W19-4705","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4706","title":"Semantic Change and Semantic Stability: Variation is Key","authors":["Bowern, Claire"],"emails":["claire.bowern@yale.edu"],"author_id":["claire-bowern"],"abstract":"I survey some recent approaches to studying change in the lexicon, particularly change in meaning across phylogenies. I briefly sketch an evolutionary approach to language change and point out some issues in recent approaches to studying semantic change that rely on temporally stratified word embeddings. I draw illustrations from lexical cognate models in Pama-Nyungan to identify meaning classes most appropriate for lexical phylogenetic inference, particularly highlighting the importance of variation in studying change over time.","pages":"48--55","doi":"10.18653\/v1\/W19-4706","url":"https:\/\/www.aclweb.org\/anthology\/W19-4706","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4707","title":"{GASC}: Genre-Aware Semantic Change for Ancient {G}reek","authors":["Perrone, Valerio","Palma, Marco","Hengchen, Simon","Vatri, Alessandro","Smith, Jim Q.","McGillivray, Barbara"],"emails":["vperrone@amazon.com","m.palma@warwick.ac.uk","simon.hengchen@helsinki.fi","avatri@turing.ac.uk","j.q.smith@warwick.ac.uk","bmcgillivray@turing.ac.uk"],"author_id":["valerio-perrone","marco-palma","simon-hengchen","alessandro-vatri","jim-q-smith","barbara-mcgillivray"],"abstract":"Word meaning changes over time, depending on linguistic and extra-linguistic factors. Associating a word{'}s correct meaning in its historical context is a central challenge in diachronic research, and is relevant to a range of NLP tasks, including information retrieval and semantic search in historical texts. Bayesian models for semantic change have emerged as a powerful tool to address this challenge, providing explicit and interpretable representations of semantic change phenomena. However, while corpora typically come with rich metadata, existing models are limited by their inability to exploit contextual information (such as text genre) beyond the document time-stamp. This is particularly critical in the case of ancient languages, where lack of data and long diachronic span make it harder to draw a clear distinction between polysemy (the fact that a word has several senses) and semantic change (the process of acquiring, losing, or changing senses), and current systems perform poorly on these languages. We develop GASC, a dynamic semantic change model that leverages categorical metadata about the texts{'} genre to boost inference and uncover the evolution of meanings in Ancient Greek corpora. In a new evaluation framework, our model achieves improved predictive performance compared to the state of the art.","pages":"56--66","doi":"10.18653\/v1\/W19-4707","url":"https:\/\/www.aclweb.org\/anthology\/W19-4707","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4708","title":"Modeling Markedness with a Split-and-Merger Model of Sound Change","authors":["Ceolin, Andrea","Sayeed, Ollie"],"emails":["ceolin@sas.upenn.edu","sayeedo@sas.upenn.edu"],"author_id":["andrea-ceolin","ollie-sayeed"],"abstract":"The concept of {`}markedness{'} has been influential in phonology for almost a century. Theoretical phonology has found it useful to describe some segments as more {`}marked{'} than others, referring to a cluster of language-internal and -external properties (Jakobson 1968, Haspelmath 2006). We argue, using a simple mathematical model based on Evolutionary Phonology (Blevins 2004), that markedness is an epiphenomenon of phonetically grounded sound change.","pages":"67--70","doi":"10.18653\/v1\/W19-4708","url":"https:\/\/www.aclweb.org\/anthology\/W19-4708","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4709","title":"A Method to Automatically Identify Diachronic Variation in Collocations.","authors":["Garcia, Marcos","Garc{\\'\\i}a Salido, Marcos"],"emails":["marcos.garcia.gonzalez@udc.gal","marcos.garcias@udc.gal"],"author_id":["marcos-garcia","marcos-garcia-salido"],"abstract":"This paper introduces a novel method to track collocational variations in diachronic corpora that can identify several changes undergone by these phraseological combinations and to propose alternative solutions found in later periods. The strategy consists of extracting syntactically-related candidates of collocations and ranking them using statistical association measures. Then, starting from the first period of the corpus, the system tracks each combination over time, verifying different types of historical variation such as the loss of one or both lemmas, the disappearance of the collocation, or its diachronic frequency trend. Using a distributional semantics strategy, it also proposes other linguistic structures which convey similar meanings to those extinct collocations. A case study on historical corpora of Portuguese and Spanish shows that the system speeds up and facilitates the finding of some diachronic changes and phraseological shifts that are harder to identify without using automated methods.","pages":"71--80","doi":"10.18653\/v1\/W19-4709","url":"https:\/\/www.aclweb.org\/anthology\/W19-4709","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4710","title":"Written on Leaves or in Stones?: Computational Evidence for the Era of Authorship of Old {T}hai Prose","authors":["Rutherford, Attapol","Thanyawong, Santhawat"],"emails":["attapol.t@chula.ac.th","santhawat.t@gmail.com"],"author_id":["attapol-rutherford","santhawat-thanyawong"],"abstract":"We aim to provide computational evidence for the era of authorship of two important old Thai texts: Traiphumikatha and Pumratchatham. The era of authorship of these two books is still an ongoing debate among Thai literature scholars. Analysis of old Thai texts present a challenge for standard natural language processing techniques, due to the lack of corpora necessary for building old Thai word and syllable segmentation. We propose an accurate and interpretable model to classify each segment as one of the three eras of authorship (Sukhothai, Ayuddhya, or Rattanakosin) without sophisticated linguistic preprocessing. Contrary to previous hypotheses, our model suggests that both books were written during the Sukhothai era. Moreover, the second half of the Pumratchtham is uncharacteristic of the Sukhothai era, which may have confounded literary scholars in the past. Further, our model reveals that the most indicative linguistic changes stem from unidirectional grammaticalized words and polyfunctional words, which show up as most dominant features in the model.","pages":"81--85","doi":"10.18653\/v1\/W19-4710","url":"https:\/\/www.aclweb.org\/anthology\/W19-4710","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4711","title":"Identifying Temporal Trends Based on Perplexity and Clustering: Are We Looking at Language Change?","authors":["Boldsen, Sidsel","Agirrezabal, Manex","Paggio, Patrizia"],"emails":["sbol@hum.ku.dk","manex.aguirrezabal@hum.ku.dk","paggio@hum.ku.dk"],"author_id":["sidsel-boldsen","manex-agirrezabal","patrizia-paggio"],"abstract":"In this work we propose a data-driven methodology for identifying temporal trends in a corpus of medieval charters. We have used perplexities derived from RNNs as a distance measure between documents and then, performed clustering on those distances. We argue that perplexities calculated by such language models are representative of temporal trends. The clusters produced using the K-Means algorithm give an insight of the differences in language in different time periods at least partly due to language change. We suggest that the temporal distribution of the individual clusters might provide a more nuanced picture of temporal trends compared to discrete bins, thus providing better results when used in a classification task.","pages":"86--91","doi":"10.18653\/v1\/W19-4711","url":"https:\/\/www.aclweb.org\/anthology\/W19-4711","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4712","title":"Using Word Embeddings to Examine Gender Bias in {D}utch Newspapers, 1950-1990","authors":["Wevers, Melvin"],"emails":["melvin.wevers@dh.huc.knaw.nl"],"author_id":["melvin-wevers"],"abstract":"Contemporary debates on filter bubbles and polarization in public and social media raise the question to what extent news media of the past exhibited biases. This paper specifically examines bias related to gender in six Dutch national newspapers between 1950 and 1990. We measure bias related to gender by comparing local changes in word embedding models trained on newspapers with divergent ideological backgrounds. We demonstrate clear differences in gender bias and changes within and between newspapers over time. In relation to themes such as sexuality and leisure, we see the bias moving toward women, whereas, generally, the bias shifts in the direction of men, despite growing female employment number and feminist movements. Even though Dutch society became less stratified ideologically (depillarization), we found an increasing divergence in gender bias between religious and social-democratic on the one hand and liberal newspapers on the other. Methodologically, this paper illustrates how word embeddings can be used to examine historical language change. Future work will investigate how fine-tuning deep contextualized embedding models, such as ELMO, might be used for similar tasks with greater contextual information.","pages":"92--97","doi":"10.18653\/v1\/W19-4712","url":"https:\/\/www.aclweb.org\/anthology\/W19-4712","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4713","title":"Predicting Historical Phonetic Features using Deep Neural Networks: A Case Study of the Phonetic System of Proto-{I}ndo-{E}uropean","authors":["Hartmann, Frederik"],"emails":["frederik.hartmann@uni-konstanz.de"],"author_id":["frederik-hartmann"],"abstract":"Traditional historical linguistics lacks the possibility to empirically assess its assumptions regarding the phonetic systems of past languages and language stages since most current methods rely on comparative tools to gain insights into phonetic features of sounds in proto- or ancestor languages. The paper at hand presents a computational method based on deep neural networks to predict phonetic features of historical sounds where the exact quality is unknown and to test the overall coherence of reconstructed historical phonetic features. The method utilizes the principles of coarticulation, local predictability and statistical phonological constraints to predict phonetic features by the features of their immediate phonetic environment. The validity of this method will be assessed using New High German phonetic data and its specific application to diachronic linguistics will be demonstrated in a case study of the phonetic system Proto-Indo-European.","pages":"98--108","doi":"10.18653\/v1\/W19-4713","url":"https:\/\/www.aclweb.org\/anthology\/W19-4713","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4714","title":"{P}ar{H}ist{V}is: Visualization of Parallel Multilingual Historical Data","authors":["Kalouli, Aikaterini-Lida","Kehlbeck, Rebecca","Sevastjanova, Rita","Kaiser, Katharina","Kaiser, Georg A.","Butt, Miriam"],"emails":["aikaterini-lida.kalouli@uni-konstanz.de","rebecca.kehlbeck@uni-konstanz.de","rita.sevastjanova@uni-konstanz.de","katharina.kaiser@uni-konstanz.de","georg.kaiser@uni-konstanz.de","miriam.butt@uni-konstanz.de"],"author_id":["aikaterini-lida-kalouli","rebecca-kehlbeck","rita-sevastjanova","katharina-kaiser","georg-a-kaiser","miriam-butt"],"abstract":"The study of language change through parallel corpora can be advantageous for the analysis of complex interactions between time, text domain and language. Often, those advantages cannot be fully exploited due to the sparse but high-dimensional nature of such historical data. To tackle this challenge, we introduce ParHistVis: a novel, free, easy-to-use, interactive visualization tool for parallel, multilingual, diachronic and synchronic linguistic data. We illustrate the suitability of the components of the tool based on a use case of word order change in Romance wh-interrogatives.","pages":"109--114","doi":"10.18653\/v1\/W19-4714","url":"https:\/\/www.aclweb.org\/anthology\/W19-4714","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4715","title":"Tracing Antisemitic Language Through Diachronic Embedding Projections: France 1789-1914","authors":["Tripodi, Rocco","Warglien, Massimo","Levis Sullam, Simon","Paci, Deborah"],"emails":["rocco.tripodi@unive.it","warglien@unive.it","levissmn@unive.it","deborah.paci@unive.it"],"author_id":["rocco-tripodi","massimo-warglien","simon-levis-sullam","deborah-paci"],"abstract":"We investigate some aspects of the history of antisemitism in France, one of the cradles of modern antisemitism, using diachronic word embeddings. We constructed a large corpus of French books and periodicals issues that contain a keyword related to Jews and performed a diachronic word embedding over the 1789-1914 period. We studied the changes over time in the semantic spaces of 4 target words and performed embedding projections over 6 streams of antisemitic discourse. This allowed us to track the evolution of antisemitic bias in the religious, economic, socio-politic, racial, ethic and conspiratorial domains. Projections show a trend of growing antisemitism, especially in the years starting in the mid-80s and culminating in the Dreyfus affair. Our analysis also allows us to highlight the peculiar adverse bias towards Judaism in the broader context of other religions.","pages":"115--125","doi":"10.18653\/v1\/W19-4715","url":"https:\/\/www.aclweb.org\/anthology\/W19-4715","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4716","title":"{D}ia{HC}lust: an Iterative Hierarchical Clustering Approach for Identifying Stages in Language Change","authors":["Sch{\\\"a}tzle, Christin","Booth, Hannah"],"emails":["christin.schaetzle@uni-konstanz.de","hannah.booth@ugent.be"],"author_id":["christin-schatzle","hannah-booth"],"abstract":"Language change is often assessed against a set of pre-determined time periods in order to be able to trace its diachronic trajectory. This is problematic, since a pre-determined periodization might obscure significant developments and lead to false assumptions about the data. Moreover, these time periods can be based on factors which are either arbitrary or non-linguistic, e.g., dividing the corpus data into equidistant stages or taking into account language-external events. Addressing this problem, in this paper we present a data-driven approach to periodization: {`}DiaHClust{'}. DiaHClust is based on iterative hierarchical clustering and offers a multi-layered perspective on change from text-level to broader time periods. We demonstrate the usefulness of DiaHClust via a case study investigating syntactic change in Icelandic, modelling the syntactic system of the language in terms of vectors of syntactic change.","pages":"126--135","doi":"10.18653\/v1\/W19-4716","url":"https:\/\/www.aclweb.org\/anthology\/W19-4716","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4717","title":"Treat the Word As a Whole or Look Inside? Subword Embeddings Model Language Change and Typology","authors":["Xu, Yang","Zhang, Jiasheng","Reitter, David"],"emails":["yxu4@sdsu.edu","jpz5181@ist.psu.edu","reitter@google.com"],"author_id":["yang-xu","jiasheng-zhang","david-reitter"],"abstract":"We use a variant of word embedding model that incorporates subword information to characterize the degree of compositionality in lexical semantics. Our models reveal some interesting yet contrastive patterns of long-term change in multiple languages: Indo-European languages put more weight on subword units in newer words, while conversely Chinese puts less weights on the subwords, but more weight on the word as a whole. Our method provides novel evidence and methodology that enriches existing theories in evolutionary linguistics. The resulting word vectors also has decent performance in NLP-related tasks.","pages":"136--145","doi":"10.18653\/v1\/W19-4717","url":"https:\/\/www.aclweb.org\/anthology\/W19-4717","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4718","title":"Times Are Changing: Investigating the Pace of Language Change in Diachronic Word Embeddings","authors":["Brandl, Stephanie","Lassner, David"],"emails":["stephanie.brandl@tu-berlin.de","lassner@tu-berlin.de"],"author_id":["stephanie-brandl","david-lassner"],"abstract":"We propose Word Embedding Networks, a novel method that is able to learn word embeddings of individual data slices while simultaneously aligning and ordering them without feeding temporal information a priori to the model. This gives us the opportunity to analyse the dynamics in word embeddings on a large scale in a purely data-driven manner. In experiments on two different newspaper corpora, the New York Times (English) and die Zeit (German), we were able to show that time actually determines the dynamics of semantic change. However, there is by no means a uniform evolution, but instead times of faster and times of slower change.","pages":"146--150","doi":"10.18653\/v1\/W19-4718","url":"https:\/\/www.aclweb.org\/anthology\/W19-4718","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4719","title":"The Rationality of Semantic Change","authors":["Korat, Omer"],"emails":["omerk@stanford.edu"],"author_id":["omer-korat"],"abstract":"This study investigates the mutual effects over time of semantically related function words on each other{'}s distribution over syntactic environments. Words that can have the same meaning are observed to have opposite trends of change in frequency across different syntactic structures which correspond to the shared meaning. This phenomenon is demonstrated to have a rational basis: it increases communicative efficiency by prioritizing words differently in the environments on which they compete.","pages":"151--160","doi":"10.18653\/v1\/W19-4719","url":"https:\/\/www.aclweb.org\/anthology\/W19-4719","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4720","title":"Studying Laws of Semantic Divergence across Languages using Cognate Sets","authors":["Uban, Ana","Ciobanu, Alina Maria","Dinu, Liviu P."],"emails":["ana.uban@gmail.com","alina.ciobanu@my.fmi.unibuc.ro","liviu.p.dinu@gmail.com"],"author_id":["ana-uban","alina-maria-ciobanu","liviu-p-dinu"],"abstract":"Semantic divergence in related languages is a key concern of historical linguistics. Intra-lingual semantic shift has been previously studied in computational linguistics, but this can only provide a limited picture of the evolution of word meanings, which often develop in a multilingual environment. In this paper we investigate semantic change across languages by measuring the semantic distance of cognate words in multiple languages. By comparing current meanings of cognates in different languages, we hope to uncover information about their previous meanings, and about how they diverged in their respective languages from their common original etymon. We further study the properties of their semantic divergence, by analyzing how the features of words such as frequency and polysemy are related to the divergence in their meaning, and thus make the first steps towards formulating laws of cross-lingual semantic change.","pages":"161--166","doi":"10.18653\/v1\/W19-4720","url":"https:\/\/www.aclweb.org\/anthology\/W19-4720","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4721","title":"Detecting Syntactic Change Using a Neural Part-of-Speech Tagger","authors":["Merrill, William","Stark, Gigi","Frank, Robert"],"emails":["william.merrill@yale.edu","gigi.stark@yale.edu","robert.frank@yale.edu"],"author_id":["william-merrill","gigi-stark","robert-frank"],"abstract":"We train a diachronic long short-term memory (LSTM) part-of-speech tagger on a large corpus of American English from the 19th, 20th, and 21st centuries. We analyze the tagger{'}s ability to implicitly learn temporal structure between years, and the extent to which this knowledge can be transferred to date new sentences. The learned year embeddings show a strong linear correlation between their first principal component and time. We show that temporal information encoded in the model can be used to predict novel sentences{'} years of composition relatively well. Comparisons to a feedforward baseline suggest that the temporal change learned by the LSTM is syntactic rather than purely lexical. Thus, our results suggest that our tagger is implicitly learning to model syntactic change in American English over the course of the 19th, 20th, and early 21st centuries.","pages":"167--174","doi":"10.18653\/v1\/W19-4721","url":"https:\/\/www.aclweb.org\/anthology\/W19-4721","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4722","title":"Grammar and Meaning: Analysing the Topology of Diachronic Word Embeddings","authors":["Bizzoni, Yuri","Degaetano-Ortlieb, Stefania","Menzel, Katrin","Krielke, Pauline","Teich, Elke"],"emails":["yuri.bizzoni@uni-saarland.de","e.teich@mx.uni-saarland.de","k.menzel@mx.uni-saarland.de","mariepauline.krielke@uni-saarland.de","s.degaetano@mx.uni-saarland.de"],"author_id":["yuri-bizzoni","stefania-degaetano-ortlieb","katrin-menzel","pauline-krielke","elke-teich"],"abstract":"The paper showcases the application of word embeddings to change in language use in the domain of science, focusing on the Late Modern English period (17-19th century). Historically, this is the period in which many registers of English developed, including the language of science. Our overarching interest is the linguistic development of scientific writing to a distinctive (group of) register(s). A register is marked not only by the choice of lexical words (discourse domain) but crucially by grammatical choices which indicate style. The focus of the paper is on the latter, tracing words with primarily grammatical functions (function words and some selected, poly-functional word forms) diachronically. To this end, we combine diachronic word embeddings with appropriate visualization and exploratory techniques such as clustering and relative entropy for meaningful aggregation of data and diachronic comparison.","pages":"175--185","doi":"10.18653\/v1\/W19-4722","url":"https:\/\/www.aclweb.org\/anthology\/W19-4722","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4723","title":"Spatio-Temporal Prediction of Dialectal Variant Usage","authors":["Jeszenszky, P{\\'e}ter","Siriaraya, Panote","Stoeckle, Philipp","Jatowt, Adam"],"emails":["pjeszenszky@gmail.com","spanote@gmail.com","philipp.stoeckle@oeaw.ac.at","adam@dl.kuis.kyoto-u.ac.jp"],"author_id":["peter-jeszenszky","panote-siriaraya","philipp-stoeckle","adam-jatowt"],"abstract":"The distribution of most dialectal variants have not only spatial but also temporal patterns. Based on the {`}apparent time hypothesis{'}, much of dialect change is happening through younger speakers accepting innovations. Thus, synchronic diversity can be interpreted diachronically. With the assumption of the {`}contact effect{'}, i.e. contact possibility (contact and isolation) between speaker communities being responsible for language change, and the apparent time hypothesis, we aim to predict the usage of dialectal variants. In this paper we model the contact possibility based on two of the most important factors in sociolinguistics to be affecting language change: age and distance. The first steps of the approach involve modeling contact possibility using a logistic predictor, taking the age of respondents into account. We test the \\textit{global}, and the \\textit{local} role of age for variation where the local level means spatial subsets around each survey site, chosen based on $k$ nearest neighbors. The prediction approach is tested on Swiss German syntactic survey data, featuring multiple respondents from different age cohorts at survey sites. The results show the relative success of the logistic prediction approach and the limitations of the method, therefore further proposals are made to develop the methodology.","pages":"186--195","doi":"10.18653\/v1\/W19-4723","url":"https:\/\/www.aclweb.org\/anthology\/W19-4723","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4724","title":"One-to-X Analogical Reasoning on Word Embeddings: a Case for Diachronic Armed Conflict Prediction from News Texts","authors":["Kutuzov, Andrey","Velldal, Erik","{\\O}vrelid, Lilja"],"emails":["andreku@ifi.uio.no","erikve@ifi.uio.no","liljao@ifi.uio.no"],"author_id":["andrey-kutuzov","erik-velldal","lilja-ovrelid"],"abstract":"We extend the well-known word analogy task to a one-to-X formulation, including one-to-none cases, when no correct answer exists. The task is cast as a relation discovery problem and applied to historical armed conflicts datasets, attempting to predict new relations of type {`}location:armed-group{'} based on data about past events. As the source of semantic information, we use diachronic word embedding models trained on English news texts. A simple technique to improve diachronic performance in such task is demonstrated, using a threshold based on a function of cosine distance to decrease the number of false positives; this approach is shown to be beneficial on two different corpora. Finally, we publish a ready-to-use test set for one-to-X analogy evaluation on historical armed conflicts data.","pages":"196--201","doi":"10.18653\/v1\/W19-4724","url":"https:\/\/www.aclweb.org\/anthology\/W19-4724","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4725","title":"Measuring Diachronic Evolution of Evaluative Adjectives with Word Embeddings: the Case for {E}nglish, {N}orwegian, and {R}ussian","authors":["Rodina, Julia","Bakshandaeva, Daria","Fomin, Vadim","Kutuzov, Andrey","Touileb, Samia","Velldal, Erik"],"emails":["julia.rodina97@gmail.com","dbakshandaeva@gmail.com","wadimiusz@gmail.com","andreku@ifi.uio.no","samiat@ifi.uio.no","erikve@ifi.uio.no"],"author_id":["julia-rodina","daria-bakshandaeva","vadim-fomin","andrey-kutuzov","samia-touileb","erik-velldal"],"abstract":"We measure the intensity of diachronic semantic shifts in adjectives in English, Norwegian and Russian across 5 decades. This is done in order to test the hypothesis that evaluative adjectives are more prone to temporal semantic change. To this end, 6 different methods of quantifying semantic change are used. Frequency-controlled experimental results show that, depending on the particular method, evaluative adjectives either do not differ from other types of adjectives in terms of semantic change or appear to actually be less prone to shifting (particularly, to {`}jitter{'}-type shifting). Thus, in spite of many well-known examples of semantically changing evaluative adjectives (like {`}terrific{'} or {`}incredible{'}), it seems that such cases are not specific to this particular type of words.","pages":"202--209","doi":"10.18653\/v1\/W19-4725","url":"https:\/\/www.aclweb.org\/anthology\/W19-4725","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4726","title":"Semantic Change in the Language of {UK} Parliamentary Debates","authors":["Abercrombie, Gavin","Batista-Navarro, Riza"],"emails":["gavin.abercrombie@postgrad.manchester.ac.uk","riza.batista@manchester.ac.uk"],"author_id":["gavin-abercrombie","riza-theresa-batista-navarro"],"abstract":"We investigate changes in the meanings of words used in the UK Parliament across two different epochs. We use word embeddings to explore changes in the distribution of words of interest and uncover words that appear to have undergone semantic transformation in the intervening period, and explore different ways of obtaining target words for this purpose. We find that semantic changes are generally in line with those found in other corpora, and little evidence that parliamentary language is more static than general English. It also seems that words with senses that have been recorded in the dictionary as having fallen into disuse do not undergo semantic changes in this domain.","pages":"210--215","doi":"10.18653\/v1\/W19-4726","url":"https:\/\/www.aclweb.org\/anthology\/W19-4726","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4727","title":"Semantic Change and Emerging Tropes In a Large Corpus of New High {G}erman Poetry","authors":["Haider, Thomas","Eger, Steffen"],"emails":["thomas.haider@ae.mpg.de","eger@aiphes.tu-darmstadt.de"],"author_id":["thomas-haider","steffen-eger"],"abstract":"Due to its semantic succinctness and novelty of expression, poetry is a great test-bed for semantic change analysis. However, so far there is a scarcity of large diachronic corpora. Here, we provide a large corpus of German poetry which consists of about 75k poems with more than 11 million tokens, with poems ranging from the 16th to early 20th century. We then track semantic change in this corpus by investigating the rise of tropes ({`}love is magic{'}) over time and detecting change points of meaning, which we find to occur particularly within the German Romantic period. Additionally, through self-similarity, we reconstruct literary periods and find evidence that the law of linear semantic change also applies to poetry.","pages":"216--222","doi":"10.18653\/v1\/W19-4727","url":"https:\/\/www.aclweb.org\/anthology\/W19-4727","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4728","title":"Conceptual Change and Distributional Semantic Models: an Exploratory Study on Pitfalls and Possibilities","authors":["Sommerauer, Pia","Fokkens, Antske"],"emails":["pia.sommerauer@vu.nl","antske.fokkens@vu.nl"],"author_id":["pia-sommerauer","antske-fokkens"],"abstract":"Studying conceptual change using embedding models has become increasingly popular in the Digital Humanities community while critical observations about them have received less attention. This paper investigates what the impact of known pitfalls can be on the conclusions drawn in a digital humanities study through the use case of {``}Racism{''}. In addition, we suggest an approach for modeling a complex concept in terms of words and relations representative of the conceptual system. Our results show that different models created from the same data yield different results, but also indicate that using different model architectures, comparing different corpora and comparing to control words and relations can help to identify which results are solid and which may be due to artefact. We propose guidelines to conduct similar studies, but also note that more work is needed to fully understand how we can distinguish artefacts from actual conceptual changes.","pages":"223--233","doi":"10.18653\/v1\/W19-4728","url":"https:\/\/www.aclweb.org\/anthology\/W19-4728","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4729","title":"Measuring the Compositionality of Noun-Noun Compounds over Time","authors":["Dhar, Prajit","Pagel, Janis","van der Plas, Lonneke"],"emails":["dharp@liacs.leidenuniv.nl","pageljs@ims.uni-stuttgart.de","lonneke.vanderplas@um.edu.mt"],"author_id":["prajit-dhar","janis-pagel","lonneke-van-der-plas"],"abstract":"We present work in progress on the temporal progression of compositionality in noun-noun compounds. Previous work has proposed computational methods for determining the compositionality of compounds. These methods try to automatically determine how transparent the meaning of the compound as a whole is with respect to the meaning of its parts. We hypothesize that such a property might change over time. We use the time-stamped Google Books corpus for our diachronic investigations, and first examine whether the vector-based semantic spaces extracted from this corpus are able to predict compositionality ratings, despite their inherent limitations. We find that using temporal information helps predicting the ratings, although correlation with the ratings is lower than reported for other corpora. Finally, we show changes in compositionality over time for a selection of compounds.","pages":"234--239","doi":"10.18653\/v1\/W19-4729","url":"https:\/\/www.aclweb.org\/anthology\/W19-4729","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4730","title":"Towards Automatic Variant Analysis of Ancient Devotional Texts","authors":["Hazem, Amir","Daille, B{\\'e}atrice","Stutzmann, Dominique","Currie, Jacob","Jacquin, Christine"],"emails":["amir.hazem@ls2n.fr","beatrice.daille@ls2n.fr","dominique.stutzmann@irht.cnrs.fr","jacob.currie@irht.cnrs.fr","christine.jacquin@ls2n.fr"],"author_id":["amir-hazem","beatrice-daille","dominique-stutzmann","jacob-currie","christine-jacquin"],"abstract":"We address in this paper the issue of text reuse in liturgical manuscripts of the middle ages. More specifically, we study variant readings of the Obsecro Te prayer, part of the devotional Books of Hours often used by Christians as guidance for their daily prayers. We aim at automatically extracting and categorising pairs of words and expressions that exhibit variant relations. For this purpose, we adopt a linguistic classification that allows to better characterize the variants than edit operations. Then, we study the evolution of Obsecro Te texts from a temporal and geographical axis. Finally, we contrast several unsupervised state-of-the-art approaches for the automatic extraction of Obsecro Te variants. Based on the manual observation of 772 Obsecro Te copies which show more than 21,000 variants, we show that the proposed methodology is helpful for an automatic study of variants and may serve as basis to analyze and to depict useful information from devotional texts.","pages":"240--249","doi":"10.18653\/v1\/W19-4730","url":"https:\/\/www.aclweb.org\/anthology\/W19-4730","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4731","title":"Understanding the Evolution of Circular Economy through Language Change","authors":["Mahanty, Sampriti","Boons, Frank","Handl, Julia","Theresa Batista-Navarro, Riza"],"emails":["","","",""],"author_id":["sampriti-mahanty","frank-boons","julia-handl","riza-theresa-batista-navarro1"],"abstract":"In this study, we propose to focus on understanding the evolution of a specific scientific concept{---}that of Circular Economy (CE){---}by analysing how the language used in academic discussions has changed semantically. It is worth noting that the meaning and central theme of this concept has remained the same; however, we hypothesise that it has undergone semantic change by way of additional layers being added to the concept. We have shown that semantic change in language is a reflection of shifts in scientific ideas, which in turn help explain the evolution of a concept. Focusing on the CE concept, our analysis demonstrated that the change over time in the language used in academic discussions of CE is indicative of the way in which the concept evolved and expanded.","pages":"250--253","doi":"10.18653\/v1\/W19-4731","url":"https:\/\/www.aclweb.org\/anthology\/W19-4731","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4732","title":"{G}aussian Process Models of Sound Change in {I}ndo-{A}ryan Dialectology","authors":["Cathcart, Chundra"],"emails":["chundra.cathcart@uzh.ch"],"author_id":["chundra-cathcart"],"abstract":"This paper proposes a Gaussian Process model of sound change targeted toward questions in Indo-Aryan dialectology. Gaussian Processes (GPs) provide a flexible means of expressing covariance between outcomes, and can be extended to a wide variety of probability distributions. We find that GP models fare better in terms of some key posterior predictive checks than models that do not express covariance between sound changes, and outline directions for future work.","pages":"254--264","doi":"10.18653\/v1\/W19-4732","url":"https:\/\/www.aclweb.org\/anthology\/W19-4732","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4733","title":"Modeling a Historical Variety of a Low-Resource Language: {L}anguage Contact Effects in the Verbal Cluster of {E}arly-{M}odern {F}risian","authors":["Bloem, Jelke","Versloot, Arjen","Weerman, Fred"],"emails":["j.bloem@uva.nl","a.p.versloot@uva.nl","f.p.weerman@uva.nl"],"author_id":["jelke-bloem","arjen-versloot","fred-weerman"],"abstract":"Certain phenomena of interest to linguists mainly occur in low-resource languages, such as contact-induced language change. We show that it is possible to study contact-induced language change computationally in a historical variety of a low-resource language, Early-Modern Frisian, by creating a model using features that were established to be relevant in a closely related language, modern Dutch. This allows us to test two hypotheses on two types of language contact that may have taken place between Frisian and Dutch during this time. Our model shows that Frisian verb cluster word orders are associated with different context features than Dutch verb orders, supporting the {`}learned borrowing{'} hypothesis.","pages":"265--271","doi":"10.18653\/v1\/W19-4733","url":"https:\/\/www.aclweb.org\/anthology\/W19-4733","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"},{"id":"W19-4734","title":"Visualizing Linguistic Change as Dimension Interactions","authors":["Sch{\\\"a}tzle, Christin","Dennig, Frederik L.","Blumenschein, Michael","Keim, Daniel A.","Butt, Miriam"],"emails":["christin.sch{\\\"a}tzle@uni-konstanz.de","frederik.dennig@uni-konstanz.de","michael.blumenschein@uni-konstanz.de","daniel.keim@uni-konstanz.de","miriam.butt@uni-konstanz.de"],"author_id":["christin-schatzle","frederik-l-dennig","michael-blumenschein","daniel-keim","miriam-butt"],"abstract":"Historical change typically is the result of complex interactions between several linguistic factors. Identifying the relevant factors and understanding how they interact across the temporal dimension is the core remit of historical linguistics. With respect to corpus work, this entails a separate annotation, extraction and painstaking pair-wise comparison of the relevant bits of information. This paper presents a significant extension of HistoBankVis, a multilayer visualization system which allows a fast and interactive exploration of complex linguistic data. Linguistic factors can be understood as data dimensions which show complex interrelationships. We model these relationships with the Parallel Sets technique. We demonstrate the powerful potential of this technique by applying the system to understanding the interaction of case, grammatical relations and word order in the history of Icelandic.","pages":"272--278","doi":"10.18653\/v1\/W19-4734","url":"https:\/\/www.aclweb.org\/anthology\/W19-4734","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 1st International Workshop on Computational Approaches to Historical Language Change"}]