[{"id":"W19-4501","title":"Segmentation of Argumentative Texts with Contextualised Word Representations","authors":["Petasis, Georgios"],"emails":["petasis@iit.demokritos.gr"],"author_id":["georgios-petasis"],"abstract":"The segmentation of argumentative units is an important subtask of argument mining, which is frequently addressed at a coarse granularity, usually assuming argumentative units to be no smaller than sentences. Approaches focusing at the clause-level granularity, typically address the task as sequence labeling at the token level, aiming to classify whether a token begins, is inside, or is outside of an argumentative unit. Most approaches exploit highly engineered, manually constructed features, and algorithms typically used in sequential tagging {--} such as Conditional Random Fields, while more recent approaches try to exploit manually constructed features in the context of deep neural networks. In this context, we examined to what extend recent advances in sequential labelling allow to reduce the need for highly sophisticated, manually constructed features, and whether limiting features to embeddings, pre-trained on large corpora is a promising approach. Evaluation results suggest the examined models and approaches can exhibit comparable performance, minimising the need for feature engineering.","pages":"1--10","doi":"10.18653\/v1\/W19-4501","url":"https:\/\/www.aclweb.org\/anthology\/W19-4501","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4502","title":"A Cascade Model for Proposition Extraction in Argumentation","authors":["Jo, Yohan","Visser, Jacky","Reed, Chris","Hovy, Eduard"],"emails":["yohanj@cs.cmu.edu","j.visser@dundee.ac.uk","c.a.reed@dundee.ac.uk","hovy@cmu.edu"],"author_id":["yohan-jo","jacky-visser","chris-reed","eduard-hovy"],"abstract":"We present a model to tackle a fundamental but understudied problem in computational argumentation: proposition extraction. Propositions are the basic units of an argument and the primary building blocks of most argument mining systems. However, they are usually substituted by argumentative discourse units obtained via surface-level text segmentation, which may yield text segments that lack semantic information necessary for subsequent argument mining processes. In contrast, our cascade model aims to extract complete propositions by handling anaphora resolution, text segmentation, reported speech, questions, imperatives, missing subjects, and revision. We formulate each task as a computational problem and test various models using a corpus of the 2016 U.S. presidential debates. We show promising performance for some tasks and discuss main challenges in proposition extraction.","pages":"11--24","doi":"10.18653\/v1\/W19-4502","url":"https:\/\/www.aclweb.org\/anthology\/W19-4502","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4503","title":"Dissecting Content and Context in Argumentative Relation Analysis","authors":["Opitz, Juri","Frank, Anette"],"emails":["opitz@cl.uni-heidelberg.de","frank@cl.uni-heidelberg.de"],"author_id":["juri-opitz","anette-frank"],"abstract":"When assessing relations between argumentative units (e.g., support or attack), computational systems often exploit disclosing indicators or markers that are not part of elementary argumentative units (EAUs) themselves, but are gained from their context (position in paragraph, preceding tokens, etc.). We show that this dependency is much stronger than previously assumed. In fact, we show that by completely masking the EAU text spans and only feeding information from their context, a competitive system may function even better. We argue that an argument analysis system that relies more on discourse context than the argument{'}s content is unsafe, since it can easily be tricked. To alleviate this issue, we separate argumentative units from their context such that the system is forced to model and rely on an EAU{'}s content. We show that the resulting classification system is more robust, and argue that such models are better suited for predicting argumentative relations across documents.","pages":"25--34","doi":"10.18653\/v1\/W19-4503","url":"https:\/\/www.aclweb.org\/anthology\/W19-4503","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4504","title":"Aligning Discourse and Argumentation Structures using Subtrees and Redescription Mining","authors":["Huber, Laurine","Toussaint, Yannick","Roze, Charlotte","Dargnat, Mathilde","Braud, Chlo{\\'e}"],"emails":["laurine.huber@loria.fr","yannick.toussaint@loria.fr","charlotte.roze@loria.fr","mathilde.dargnat@univ-lorraine.fr","chlo{\\'e}.braud@loria.fr"],"author_id":["laurine-huber","yannick-toussaint","charlotte-roze","mathilde-dargnat","chloe-braud"],"abstract":"In this paper, we investigate similarities between discourse and argumentation structures by aligning subtrees in a corpus containing both annotations. Contrary to previous works, we focus on comparing sub-structures and not only relations matches. Using data mining techniques, we show that discourse and argumentation most often align well, and the double annotation allows to derive a mapping between structures. Moreover, this approach enables the study of similarities between discourse structures and differences in their expressive power.","pages":"35--40","doi":"10.18653\/v1\/W19-4504","url":"https:\/\/www.aclweb.org\/anthology\/W19-4504","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4505","title":"Transferring Knowledge from Discourse to Arguments: A Case Study with Scientific Abstracts","authors":["Accuosto, Pablo","Saggion, Horacio"],"emails":["pablo.accuosto@upf.edu","horacio.saggion@upf.edu"],"author_id":["pablo-accuosto","horacio-saggion"],"abstract":"In this work we propose to leverage resources available with discourse-level annotations to facilitate the identification of argumentative components and relations in scientific texts, which has been recognized as a particularly challenging task. In particular, we implement and evaluate a transfer learning approach in which contextualized representations learned from discourse parsing tasks are used as input of argument mining models. As a pilot application, we explore the feasibility of using automatically identified argumentative components and relations to predict the acceptance of papers in computer science venues. In order to conduct our experiments, we propose an annotation scheme for argumentative units and relations and use it to enrich an existing corpus with an argumentation layer.","pages":"41--51","doi":"10.18653\/v1\/W19-4505","url":"https:\/\/www.aclweb.org\/anthology\/W19-4505","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4506","title":"The {S}wedish {P}oli{G}raph: A Semantic Graph for Argument Mining of {S}wedish Parliamentary Data","authors":["Eide, Stian R{\\o}dven"],"emails":["stian.rodven.eide@svenska.gu.se"],"author_id":["stian-rodven-eide1"],"abstract":"As part of a larger project on argument mining of Swedish parliamentary data, we have created a semantic graph that, together with named entity recognition and resolution (NER), should make it easier to establish connections between arguments in a given debate. The graph is essentially a semantic database that keeps track of Members of Parliament (MPs), in particular their presence in the parliament and activity in debates, but also party affiliation and participation in commissions. The hope is that the Swedish PoliGraph will enable us to perform named entity resolution on debates in the Swedish parliament with a high accuracy, with the aim of determining to whom an argument is directed.","pages":"52--57","doi":"10.18653\/v1\/W19-4506","url":"https:\/\/www.aclweb.org\/anthology\/W19-4506","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4507","title":"Towards Effective Rebuttal: Listening Comprehension Using Corpus-Wide Claim Mining","authors":["Lavee, Tamar","Orbach, Matan","Kotlerman, Lili","Kantor, Yoav","Gretz, Shai","Dankin, Lena","Jacovi, Michal","Bilu, Yonatan","Aharonov, Ranit","Slonim, Noam"],"emails":["","","","","","","","","",""],"author_id":["tamar-lavee","matan-orbach","lili-kotlerman","yoav-kantor","shai-gretz","lena-dankin","michal-jacovi","yonatan-bilu","ranit-aharonov","noam-slonim"],"abstract":"Engaging in a live debate requires, among other things, the ability to effectively rebut arguments claimed by your opponent. In particular, this requires identifying these arguments. Here, we suggest doing so by automatically mining claims from a corpus of news articles containing billions of sentences, and searching for them in a given speech. This raises the question of whether such claims indeed correspond to those made in spoken speeches. To this end, we collected a large dataset of 400 speeches in English discussing 200 controversial topics, mined claims for each topic, and asked annotators to identify the mined claims mentioned in each speech. Results show that in the vast majority of speeches debaters indeed make use of such claims. In addition, we present several baselines for the automatic detection of mined claims in speeches, forming the basis for future work. All collected data is freely available for research.","pages":"58--66","doi":"10.18653\/v1\/W19-4507","url":"https:\/\/www.aclweb.org\/anthology\/W19-4507","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4508","title":"Lexicon Guided Attentive Neural Network Model for Argument Mining","authors":["Lin, Jian-Fu","Huang, Kuo Yu","Huang, Hen-Hsen","Chen, Hsin-Hsi"],"emails":["cflin@nlg.csie.ntu.edu.tw","kyhuang@nlg.csie.ntu.edu.tw","hhhuang@nccu.edu.tw","hhchen@ntu.edu.tw"],"author_id":["jian-fu-lin","kuo-yu-huang","hen-hsen-huang","hsin-hsi-chen"],"abstract":"Identification of argumentative components is an important stage of argument mining. Lexicon information is reported as one of the most frequently used features in the argument mining research. In this paper, we propose a methodology to integrate lexicon information into a neural network model by attention mechanism. We conduct experiments on the UKP dataset, which is collected from heterogeneous sources and contains several text types, e.g., microblog, Wikipedia, and news. We explore lexicons from various application scenarios such as sentiment analysis and emotion detection. We also compare the experimental results of leveraging different lexicons.","pages":"67--73","doi":"10.18653\/v1\/W19-4508","url":"https:\/\/www.aclweb.org\/anthology\/W19-4508","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4509","title":"Is It Worth the Attention? A Comparative Evaluation of Attention Layers for Argument Unit Segmentation","authors":["Splieth{\\\"o}ver, Maximilian","Klaff, Jonas","Heuer, Hendrik"],"emails":["mspl@uni-bremen.de","joklaff@uni-bremen.de","hheuer@uni-bremen.de"],"author_id":["maximilian-spliethover","jonas-klaff","hendrik-heuer"],"abstract":"Attention mechanisms have seen some success for natural language processing downstream tasks in recent years and generated new state-of-the-art results. A thorough evaluation of the attention mechanism for the task of Argumentation Mining is missing. With this paper, we report a comparative evaluation of attention layers in combination with a bidirectional long short-term memory network, which is the current state-of-the-art approach for the unit segmentation task. We also compare sentence-level contextualized word embeddings to pre-generated ones. Our findings suggest that for this task, the additional attention layer does not improve the performance. In most cases, contextualized embeddings do also not show an improvement on the score achieved by pre-defined embeddings.","pages":"74--82","doi":"10.18653\/v1\/W19-4509","url":"https:\/\/www.aclweb.org\/anthology\/W19-4509","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4510","title":"Argument Component Classification by Relation Identification by Neural Network and {T}ext{R}ank","authors":["Deguchi, Mamoru","Yamaguchi, Kazunori"],"emails":["deguchi-mamoru@graco.c.u-tokyo.ac.jp","yamaguch@graco.c.u-tokyo.ac.jp"],"author_id":["mamoru-deguchi","kazunori-yamaguchi"],"abstract":"In recent years, argumentation mining, which automatically extracts the structure of argumentation from unstructured documents such as essays and debates, is gaining attention. For argumentation mining applications, argument-component classification is an important subtask. The existing methods can be classified into supervised methods and unsupervised methods. Supervised document classification performs classification using a single sentence without relying on the whole document. On the other hand, unsupervised document classification has the advantage of being able to use the whole document, but accuracy of these methods is not so high. In this paper, we propose a method for argument-component classification that combines relation identification by neural networks and TextRank to integrate relation informations (i.e. the strength of the relation). This method can use argumentation-specific knowledge by employing a supervised learning on a corpus while maintaining the advantage of using the whole document. Experiments on two corpora, one consisting of student essay and the other of Wikipedia articles, show the effectiveness of this method.","pages":"83--91","doi":"10.18653\/v1\/W19-4510","url":"https:\/\/www.aclweb.org\/anthology\/W19-4510","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4511","title":"Argumentative Evidences Classification and Argument Scheme Detection Using Tree Kernels","authors":["Liga, Davide"],"emails":["davide.liga2@unibo.it"],"author_id":["davide-liga"],"abstract":"The purpose of this study is to deploy a novel methodology for classifying different argumentative support (supporting evidences) in arguments, without considering the context. The proposed methodology is based on the idea that the use of Tree Kernel algorithms can be a good way to discriminate between different types of argumentative stances without the need of highly engineered features. This can be useful in different Argumentation Mining sub-tasks. This work provides an example of classifier built using a Tree Kernel method, which can discriminate between different kinds of argumentative support with a high accuracy. The ability to distinguish different kinds of support is, in fact, a key step toward Argument Scheme classification.","pages":"92--97","doi":"10.18653\/v1\/W19-4511","url":"https:\/\/www.aclweb.org\/anthology\/W19-4511","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4512","title":"The Utility of Discourse Parsing Features for Predicting Argumentation Structure","authors":["Hewett, Freya","Prakash Rane, Roshan","Harlacher, Nina","Stede, Manfred"],"emails":["hewett@uni-potsdam.de","rane@uni-potsdam.de","harlacher@uni-potsdam.de","stede@uni-potsdam.de"],"author_id":["freya-hewett","roshan-prakash-rane","nina-harlacher","manfred-stede"],"abstract":"Research on argumentation mining from text has frequently discussed relationships to discourse parsing, but few empirical results are available so far. One corpus that has been annotated in parallel for argumentation structure and for discourse structure (RST, SDRT) are the {`}argumentative microtexts{'} (Peldszus and Stede, 2016a). While results on perusing the gold RST annotations for predicting argumentation have been published (Peldszus and Stede, 2016b), the step to automatic discourse parsing has not yet been taken. In this paper, we run various discourse parsers (RST, PDTB) on the corpus, compare their results to the gold annotations (for RST) and then assess the contribution of automatically-derived discourse features for argumentation parsing. After reproducing the state-of-the-art Evidence Graph model from Afantenos et al. (2018) for the microtexts, we find that PDTB features can indeed improve its performance.","pages":"98--103","doi":"10.18653\/v1\/W19-4512","url":"https:\/\/www.aclweb.org\/anthology\/W19-4512","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4513","title":"Detecting Argumentative Discourse Acts with Linguistic Alignment","authors":["Niven, Timothy","Kao, Hung-Yu"],"emails":["tim.niven.public@gmail.com","hykao@mail.ncku.edu.tw"],"author_id":["timothy-niven","hung-yu-kao"],"abstract":"We report the results of preliminary investigations into the relationship between linguistic alignment and dialogical argumentation at the level of discourse acts. We annotated a proof of concept dataset with illocutions and transitions at the comment level based on Inference Anchoring Theory. We estimated linguistic alignment across discourse acts and found significant variation. Alignment features calculated at the dyad level are found to be useful for detecting a range of argumentative discourse acts.","pages":"104--112","doi":"10.18653\/v1\/W19-4513","url":"https:\/\/www.aclweb.org\/anthology\/W19-4513","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4514","title":"Annotation of Rhetorical Moves in Biochemistry Articles","authors":["Alliheedi, Mohammed","Mercer, Robert E.","Cohen, Robin"],"emails":["mallihee@uwaterloo.ca","mercer@csd.uwo.ca","rcohen@uwaterloo.ca"],"author_id":["mohammed-alliheedi","robert-e-mercer","robin-cohen"],"abstract":"This paper focuses on the real world application of scientific writing and on determining rhetorical moves, an important step in establishing the argument structure of biomedical articles. Using the observation that the structure of scholarly writing in laboratory-based experimental sciences closely follows laboratory procedures, we examine most closely the Methods section of the texts and adopt an approach of identifying rhetorical moves that are procedure-oriented. We also propose a verb-centric frame semantics with an effective set of semantic roles in order to support the analysis. These components are designed to support a computational model that extends a promising proposal of appropriate rhetorical moves for this domain, but one which is merely descriptive. Our work also contributes to the understanding of argument-related annotation schemes. In particular, we conduct a detailed study with human annotators to confirm that our selection of semantic roles is effective in determining the underlying rhetorical structure of existing biomedical articles in an extensive dataset. The annotated dataset that we produce provides the important knowledge needed for our ultimate goal of analyzing biochemistry articles.","pages":"113--123","doi":"10.18653\/v1\/W19-4514","url":"https:\/\/www.aclweb.org\/anthology\/W19-4514","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4515","title":"Evaluation of Scientific Elements for Text Similarity in Biomedical Publications","authors":["Neves, Mariana","Butzke, Daniel","Grune, Barbara"],"emails":["mariana.lara-neves@bfr.bund.de","",""],"author_id":["mariana-neves","daniel-butzke","barbara-grune"],"abstract":"Rhetorical elements from scientific publications provide a more structured view of the document and allow algorithms to focus on particular parts of the text. We surveyed the literature for previously proposed schemes for rhetorical elements and present an overview of its current state of the art. We also searched for available tools using these schemes and applied four tools for our particular task of ranking biomedical abstracts based on text similarity. Comparison of the tools with two strong baselines shows that the predictions provided by the ArguminSci tool can support our use case of mining alternative methods for animal experiments.","pages":"124--135","doi":"10.18653\/v1\/W19-4515","url":"https:\/\/www.aclweb.org\/anthology\/W19-4515","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4516","title":"Categorizing Comparative Sentences","authors":["Panchenko, Alexander","Bondarenko, Alexander","Franzek, Mirco","Hagen, Matthias","Biemann, Chris"],"emails":["","","","",""],"author_id":["alexander-panchenko","alexander-bondarenko","mirco-franzek","matthias-hagen","chris-biemann"],"abstract":"We tackle the tasks of automatically identifying comparative sentences and categorizing the intended preference (e.g., {``}Python has better NLP libraries than MATLAB{''} $\\rightarrow$ Python, better, MATLAB). To this end, we manually annotate 7,199 sentences for 217 distinct target item pairs from several domains (27{\\%} of the sentences contain an oriented comparison in the sense of {``}better{''} or {``}worse{''}). A gradient boosting model based on pre-trained sentence embeddings reaches an F1 score of 85{\\%} in our experimental evaluation. The model can be used to extract comparative sentences for pro\/con argumentation in comparative \/ argument search engines or debating technologies.","pages":"136--145","doi":"10.18653\/v1\/W19-4516","url":"https:\/\/www.aclweb.org\/anthology\/W19-4516","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4517","title":"Ranking Passages for Argument Convincingness","authors":["Potash, Peter","Ferguson, Adam","Hazen, Timothy J."],"emails":["pepotash@microsoft.com","adfergus@microsoft.com","tihazen@microsoft.com"],"author_id":["peter-potash","adam-ferguson","timothy-j-hazen"],"abstract":"In data ranking applications, pairwise annotation is often more consistent than cardinal annotation for learning ranking models. We examine this in a case study on ranking text passages for argument convincingness. Our task is to choose text passages that provide the highest-quality, most-convincing arguments for opposing sides of a topic. Using data from a deployed system within the Bing search engine, we construct a pairwise-labeled dataset for argument convincingness that is substantially more comprehensive in topical coverage compared to existing public resources. We detail the process of extracting topical passages for queries submitted to a search engine, creating annotated sets of passages aligned to different stances on a topic, and assessing argument convincingness of passages using pairwise annotation. Using a state-of-the-art convincingness model, we evaluate several methods for using pairwise-annotated data examples to train models for ranking passages. Our results show pairwise training outperforms training that regresses to a target score for each passage. Our results also show a simple {`}win-rate{'} score is a better regression target than the previously proposed page-rank target. Lastly, addressing the need to filter noisy crowd-sourced annotations when constructing a dataset, we show that filtering for transitivity within pairwise annotations is more effective than filtering based on annotation confidence measures for individual examples.","pages":"146--155","doi":"10.18653\/v1\/W19-4517","url":"https:\/\/www.aclweb.org\/anthology\/W19-4517","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4518","title":"Gradual Argumentation Evaluation for Stance Aggregation in Automated Fake News Detection","authors":["Kotonya, Neema","Toni, Francesca"],"emails":["n.kotonya18@imperial.ac.uk","f.toni@imperial.ac.uk"],"author_id":["neema-kotonya","francesca-toni"],"abstract":"Stance detection plays a pivot role in fake news detection. The task involves determining the point of view or stance {--} for or against {--} a text takes towards a claim. One very important stage in employing stance detection for fake news detection is the aggregation of multiple stance labels from different text sources in order to compute a prediction for the veracity of a claim. Typically, aggregation is treated as a credibility-weighted average of stance predictions. In this work, we take the novel approach of applying, for aggregation, a gradual argumentation semantics to bipolar argumentation frameworks mined using stance detection. Our empirical evaluation shows that our method results in more accurate veracity predictions.","pages":"156--166","doi":"10.18653\/v1\/W19-4518","url":"https:\/\/www.aclweb.org\/anthology\/W19-4518","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4519","title":"Persuasion of the Undecided: Language vs. the Listener","authors":["Longpre, Liane","Durmus, Esin","Cardie, Claire"],"emails":["lfl42@cornell.edu","ed459@cornell.edu","cardie@cs.cornell.edu"],"author_id":["liane-longpre","esin-durmus","claire-cardie"],"abstract":"This paper examines the factors that govern persuasion for a priori UNDECIDED versus DECIDED audience members in the context of on-line debates. We separately study two types of influences: linguistic factors {---} features of the language of the debate itself; and audience factors {---} features of an audience member encoding demographic information, prior beliefs, and debate platform behavior. In a study of users of a popular debate platform, we find first that different combinations of linguistic features are critical for predicting persuasion outcomes for UNDECIDED versus DECIDED members of the audience. We additionally find that audience factors have more influence on predicting the side (PRO\/CON) that persuaded UNDECIDED users than for DECIDED users that flip their stance to the opposing side. Our results emphasize the importance of considering the undecided and decided audiences separately when studying linguistic factors of persuasion.","pages":"167--176","doi":"10.18653\/v1\/W19-4519","url":"https:\/\/www.aclweb.org\/anthology\/W19-4519","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"},{"id":"W19-4520","title":"Towards Assessing Argumentation Annotation - A First Step","authors":["Lindahl, Anna","Borin, Lars","Rouces, Jacobo"],"emails":["anna.lindahl@svenska.gu.se","lars.borin@svenska.gu.se","jacobo.rouces@svenska.gu.se"],"author_id":["anna-lindahl","lars-borin","jacobo-rouces"],"abstract":"This paper presents a first attempt at using Walton{'}s argumentation schemes for annotating arguments in Swedish political text and assessing the feasibility of using this particular set of schemes with two linguistically trained annotators. The texts are not pre-annotated with argumentation structure beforehand. The results show that the annotators differ both in number of annotated arguments and selection of the conclusion and premises which make up the arguments. They also differ in their labeling of the schemes, but grouping the schemes increases their agreement. The outcome from this will be used to develop guidelines for future annotations.","pages":"177--186","doi":"10.18653\/v1\/W19-4520","url":"https:\/\/www.aclweb.org\/anthology\/W19-4520","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 6th Workshop on Argument Mining"}]