[{"id":"D17-2001","title":"The {NLTK} {F}rame{N}et {API}: Designing for Discoverability with a Rich Linguistic Resource","authors":["Schneider, Nathan","Wooters, Chuck"],"emails":["nathan.schneider@georgetown.edu","wooters@semanticmachines.com"],"author_id":["nathan-schneider","chuck-wooters"],"abstract":"A new Python API, integrated within the NLTK suite, offers access to the FrameNet 1.7 lexical database. The lexicon (structured in terms of frames) as well as annotated sentences can be processed programatically, or browsed with human-readable displays via the interactive Python prompt.","pages":"1--6","doi":"10.18653\/v1\/D17-2001","url":"https:\/\/www.aclweb.org\/anthology\/D17-2001","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2002","title":"{A}rgotario: Computational Argumentation Meets Serious Games","authors":["Habernal, Ivan","Hannemann, Raffael","Pollak, Christian","Klamm, Christopher","Pauli, Patrick","Gurevych, Iryna"],"emails":["","","","","",""],"author_id":["ivan-habernal","raffael-hannemann","christian-pollak","christopher-klamm","patrick-pauli","iryna-gurevych"],"abstract":"An important skill in critical thinking and argumentation is the ability to spot and recognize fallacies. Fallacious arguments, omnipresent in argumentative discourse, can be deceptive, manipulative, or simply leading to {`}wrong moves{'} in a discussion. Despite their importance, argumentation scholars and NLP researchers with focus on argumentation quality have not yet investigated fallacies empirically. The nonexistence of resources dealing with fallacious argumentation calls for scalable approaches to data acquisition and annotation, for which the serious games methodology offers an appealing, yet unexplored, alternative. We present Argotario, a serious game that deals with fallacies in everyday argumentation. Argotario is a multilingual, open-source, platform-independent application with strong educational aspects, accessible at \\url{www.argotario.net}.","pages":"7--12","doi":"10.18653\/v1\/D17-2002","url":"https:\/\/www.aclweb.org\/anthology\/D17-2002","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2003","title":"An Analysis and Visualization Tool for Case Study Learning of Linguistic Concepts","authors":["Ovesdotter Alm, Cecilia","Meyers, Benjamin","Prud{'}hommeaux, Emily"],"emails":["coagla@rit.edu","bsm9339@rit.edu","emilypx@rit.edu"],"author_id":["cecilia-ovesdotter-alm","benjamin-s-meyers","emily-prudhommeaux"],"abstract":"We present an educational tool that integrates computational linguistics resources for use in non-technical undergraduate language science courses. By using the tool in conjunction with evidence-driven pedagogical case studies, we strive to provide opportunities for students to gain an understanding of linguistic concepts and analysis through the lens of realistic problems in feasible ways. Case studies tend to be used in legal, business, and health education contexts, but less in the teaching and learning of linguistics. The approach introduced also has potential to encourage students across training backgrounds to continue on to computational language analysis coursework.","pages":"13--18","doi":"10.18653\/v1\/D17-2003","url":"https:\/\/www.aclweb.org\/anthology\/D17-2003","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2004","title":"{G}raph{D}oc{E}xplore: A Framework for the Experimental Comparison of Graph-based Document Exploration Techniques","authors":["Falke, Tobias","Gurevych, Iryna"],"emails":["",""],"author_id":["tobias-falke","iryna-gurevych"],"abstract":"Graphs have long been proposed as a tool to browse and navigate in a collection of documents in order to support exploratory search. Many techniques to automatically extract different types of graphs, showing for example entities or concepts and different relationships between them, have been suggested. While experimental evidence that they are indeed helpful exists for some of them, it is largely unknown which type of graph is most helpful for a specific exploratory task. However, carrying out experimental comparisons with human subjects is challenging and time-consuming. Towards this end, we present the \\textit{GraphDocExplore} framework. It provides an intuitive web interface for graph-based document exploration that is optimized for experimental user studies. Through a generic graph interface, different methods to extract graphs from text can be plugged into the system. Hence, they can be compared at minimal implementation effort in an environment that ensures controlled comparisons. The system is publicly available under an open-source license.","pages":"19--24","doi":"10.18653\/v1\/D17-2004","url":"https:\/\/www.aclweb.org\/anthology\/D17-2004","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2005","title":"{SGNMT} {--} A Flexible {NMT} Decoding Platform for Quick Prototyping of New Models and Search Strategies","authors":["Stahlberg, Felix","Hasler, Eva","Saunders, Danielle","Byrne, Bill"],"emails":["","","",""],"author_id":["felix-stahlberg","eva-hasler","danielle-saunders","bill-byrne"],"abstract":"This paper introduces SGNMT, our experimental platform for machine translation research. SGNMT provides a generic interface to neural and symbolic scoring modules (predictors) with left-to-right semantic such as translation models like NMT, language models, translation lattices, n-best lists or other kinds of scores and constraints. Predictors can be combined with other predictors to form complex decoding tasks. SGNMT implements a number of search strategies for traversing the space spanned by the predictors which are appropriate for different predictor constellations. Adding new predictors or decoding strategies is particularly easy, making it a very efficient tool for prototyping new research ideas. SGNMT is actively being used by students in the MPhil program in Machine Learning, Speech and Language Technology at the University of Cambridge for course work and theses, as well as for most of the research work in our group.","pages":"25--30","doi":"10.18653\/v1\/D17-2005","url":"https:\/\/www.aclweb.org\/anthology\/D17-2005","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2006","title":"{S}tru{AP}: A Tool for Bundling Linguistic Trees through Structure-based Abstract Pattern","authors":["Yanai, Kohsuke","Sato, Misa","Yanase, Toshihiko","Kurotsuchi, Kenzo","Koreeda, Yuta","Niwa, Yoshiki"],"emails":["","","","","",""],"author_id":["kohsuke-yanai","misa-sato","toshihiko-yanase","kenzo-kurotsuchi","yuta-koreeda","yoshiki-niwa"],"abstract":"We present a tool for developing tree structure patterns that makes it easy to define the relations among textual phrases and create a search index for these newly defined relations. By using the proposed tool, users develop tree structure patterns through abstracting syntax trees. The tool features (1) intuitive pattern syntax, (2) unique functions such as recursive call of patterns and use of lexicon dictionaries, and (3) whole workflow support for relation development and validation. We report the current implementation of the tool and its effectiveness.","pages":"31--36","doi":"10.18653\/v1\/D17-2006","url":"https:\/\/www.aclweb.org\/anthology\/D17-2006","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2007","title":"{K}now{Y}our{N}yms? A Game of Semantic Relationships","authors":["Mechanic, Ross","Fulgoni, Dean","Cutler, Hannah","Rajana, Sneha","Liu, Zheyuan","Jackson, Bradley","Cocos, Anne","Callison-Burch, Chris","Apidianaki, Marianna"],"emails":["","","","","","","acocos@seas.upenn.edu","ccb@seas.upenn.edu","marapi@seas.upenn.edu"],"author_id":["ross-mechanic","dean-fulgoni","hannah-cutler","sneha-rajana","zheyuan-liu","bradley-jackson","anne-cocos","chris-callison-burch","marianna-apidianaki"],"abstract":"Semantic relation knowledge is crucial for natural language understanding. We introduce {``}KnowYourNyms?{''}, a web-based game for learning semantic relations. While providing users with an engaging experience, the application collects large amounts of data that can be used to improve semantic relation classifiers. The data also broadly informs us of how people perceive the relationships between words, providing useful insights for research in psychology and linguistics.","pages":"37--42","doi":"10.18653\/v1\/D17-2007","url":"https:\/\/www.aclweb.org\/anthology\/D17-2007","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2008","title":"The Projector: An Interactive Annotation Projection Visualization Tool","authors":["Akbik, Alan","Vollgraf, Roland"],"emails":["","roland.vollgraf@zalando.de"],"author_id":["alan-akbik","roland-vollgraf"],"abstract":"Previous works proposed annotation projection in parallel corpora to inexpensively generate treebanks or propbanks for new languages. In this approach, linguistic annotation is automatically transferred from a resource-rich source language (SL) to translations in a target language (TL). However, annotation projection may be adversely affected by translational divergences between specific language pairs. For this reason, previous work often required careful qualitative analysis of projectability of specific annotation in order to define strategies to address quality and coverage issues. In this demonstration, we present THE PROJECTOR, an interactive GUI designed to assist researchers in such analysis: it allows users to execute and visually inspect annotation projection in a range of different settings. We give an overview of the GUI, discuss use cases and illustrate how the tool can facilitate discussions with the research community.","pages":"43--48","doi":"10.18653\/v1\/D17-2008","url":"https:\/\/www.aclweb.org\/anthology\/D17-2008","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2009","title":"Interactive Visualization for Linguistic Structure","authors":["Sarnat, Aaron","Joshi, Vidur","Petrescu-Prahova, Cristian","Herrasti, Alvaro","Stilson, Brandon","Hopkins, Mark"],"emails":["","","","","",""],"author_id":["aaron-sarnat","vidur-joshi","cristian-petrescu-prahova","alvaro-herrasti","brandon-stilson","mark-hopkins"],"abstract":"We provide a visualization library and web interface for interactively exploring a parse tree or a forest of parses. The library is not tied to any particular linguistic representation, but provides a general-purpose API for the interactive exploration of hierarchical linguistic structure. To facilitate rapid understanding of a complex structure, the API offers several important features, including expand\/collapse functionality, positional and color cues, explicit visual support for sequential structure, and dynamic highlighting to convey node-to-text correspondence.","pages":"49--54","doi":"10.18653\/v1\/D17-2009","url":"https:\/\/www.aclweb.org\/anthology\/D17-2009","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2010","title":"{DLATK}: Differential Language Analysis {T}ool{K}it","authors":["Schwartz, H. Andrew","Giorgi, Salvatore","Sap, Maarten","Crutchley, Patrick","Ungar, Lyle","Eichstaedt, Johannes"],"emails":["has@cs.stonybrook.edu","sgiorgi@sas.upenn.edu","","","",""],"author_id":["h-andrew-schwartz","salvatore-giorgi","maarten-sap","patrick-crutchley","lyle-ungar","johannes-eichstaedt"],"abstract":"We present Differential Language Analysis Toolkit (DLATK), an open-source python package and command-line tool developed for conducting social-scientific language analyses. While DLATK provides standard NLP pipeline steps such as tokenization or SVM-classification, its novel strengths lie in analyses useful for psychological, health, and social science: (1) incorporation of extra-linguistic structured information, (2) specified levels and units of analysis (e.g. document, user, community), (3) statistical metrics for continuous outcomes, and (4) robust, proven, and accurate pipelines for social-scientific prediction problems. DLATK integrates multiple popular packages (SKLearn, Mallet), enables interactive usage (Jupyter Notebooks), and generally follows object oriented principles to make it easy to tie in additional libraries or storage technologies.","pages":"55--60","doi":"10.18653\/v1\/D17-2010","url":"https:\/\/www.aclweb.org\/anthology\/D17-2010","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2011","title":"{QUINT}: Interpretable Question Answering over Knowledge Bases","authors":["Abujabal, Abdalghani","Saha Roy, Rishiraj","Yahya, Mohamed","Weikum, Gerhard"],"emails":["abujabal@mpi-inf.mpg.de","rishiraj@mpi-inf.mpg.de","myahya6@bloomberg.net","weikum@mpi-inf.mpg.de"],"author_id":["abdalghani-abujabal","rishiraj-saha-roy","mohamed-yahya","gerhard-weikum"],"abstract":"We present QUINT, a live system for question answering over knowledge bases. QUINT automatically learns role-aligned utterance-query templates from user questions paired with their answers. When QUINT answers a question, it visualizes the complete derivation sequence from the natural language utterance to the final answer. The derivation provides an explanation of how the syntactic structure of the question was used to derive the structure of a SPARQL query, and how the phrases in the question were used to instantiate different parts of the query. When an answer seems unsatisfactory, the derivation provides valuable insights towards reformulating the question.","pages":"61--66","doi":"10.18653\/v1\/D17-2011","url":"https:\/\/www.aclweb.org\/anthology\/D17-2011","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2012","title":"Function Assistant: A Tool for {NL} Querying of {API}s","authors":["Richardson, Kyle","Kuhn, Jonas"],"emails":["kyle@ims.uni-stuttgart.de",""],"author_id":["kyle-richardson","jonas-kuhn"],"abstract":"In this paper, we describe Function Assistant, a lightweight Python-based toolkit for querying and exploring source code repositories using natural language. The toolkit is designed to help end-users of a target API quickly find information about functions through high-level natural language queries, or descriptions. For a given text query and background API, the tool finds candidate functions by performing a translation from the text to known representations in the API using the semantic parsing approach of (Richardson and Kuhn, 2017). Translations are automatically learned from example text-code pairs in example APIs. The toolkit includes features for building translation pipelines and query engines for arbitrary source code projects. To explore this last feature, we perform new experiments on 27 well-known Python projects hosted on Github.","pages":"67--72","doi":"10.18653\/v1\/D17-2012","url":"https:\/\/www.aclweb.org\/anthology\/D17-2012","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2013","title":"{M}ood{S}wipe: A Soft Keyboard that Suggests {M}essage{B}ased on User-Specified Emotions","authors":["Huang, Chieh-Yang","Labetoulle, Tristan","Huang, Ting-Hao","Chen, Yi-Pei","Chen, Hung-Chen","Srivastava, Vallari","Ku, Lun-Wei"],"emails":["contact@tristan-labetoulle.com","appleternity@iis.sinica.edu.tw","tinghaoh@cs.cmu.edu","ypc82@iis.sinica.edu.tw","hankchen@iis.sinica.edu.tw","vallari357@gmail.com","lwku@iis.sinica.edu.tw"],"author_id":["chieh-yang-huang","tristan-labetoulle","ting-hao-huang","yi-pei-chen","hung-chen-chen","vallari-srivastava","lun-wei-ku"],"abstract":"We present MoodSwipe, a soft keyboard that suggests text messages given the user-specified emotions utilizing the real dialog data. The aim of MoodSwipe is to create a convenient user interface to enjoy the technology of emotion classification and text suggestion, and at the same time to collect labeled data automatically for developing more advanced technologies. While users select the MoodSwipe keyboard, they can type as usual but sense the emotion conveyed by their text and receive suggestions for their message as a benefit. In MoodSwipe, the detected emotions serve as the medium for suggested texts, where viewing the latter is the incentive to correcting the former. We conduct several experiments to show the superiority of the emotion classification models trained on the dialog data, and further to verify good emotion cues are important context for text suggestion.","pages":"73--78","doi":"10.18653\/v1\/D17-2013","url":"https:\/\/www.aclweb.org\/anthology\/D17-2013","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2014","title":"{P}arl{AI}: A Dialog Research Software Platform","authors":["Miller, Alexander","Feng, Will","Batra, Dhruv","Bordes, Antoine","Fisch, Adam","Lu, Jiasen","Parikh, Devi","Weston, Jason"],"emails":["","","","","","","",""],"author_id":["alexander-miller","will-feng","dhruv-batra","antoine-bordes","adam-fisch","jiasen-lu","devi-parikh","jason-weston"],"abstract":"We introduce ParlAI (pronounced {``}par-lay{''}), an open-source software platform for dialog research implemented in Python, available at \\url{http:\/\/parl.ai}. Its goal is to provide a unified framework for sharing, training and testing dialog models; integration of Amazon Mechanical Turk for data collection, human evaluation, and online\/reinforcement learning; and a repository of machine learning models for comparing with others{'} models, and improving upon existing architectures. Over 20 tasks are supported in the first release, including popular datasets such as SQuAD, bAbI tasks, MCTest, WikiQA, QACNN, QADailyMail, CBT, bAbI Dialog, Ubuntu, OpenSubtitles and VQA. Several models are integrated, including neural models such as memory networks, seq2seq and attentive LSTMs.","pages":"79--84","doi":"10.18653\/v1\/D17-2014","url":"https:\/\/www.aclweb.org\/anthology\/D17-2014","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2015","title":"{H}eidel{P}lace: An Extensible Framework for Geoparsing","authors":["Richter, Ludwig","Gei{\\ss}, Johanna","Spitz, Andreas","Gertz, Michael"],"emails":["ludwig.richter@posteo.de","geiss@informatik.uni-heidelberg.de","spitz@informatik.uni-heidelberg.de","gertz@informatik.uni-heidelberg.de"],"author_id":["ludwig-richter","johanna-geiss","andreas-spitz","michael-gertz"],"abstract":"Geographic information extraction from textual data sources, called geoparsing, is a key task in text processing and central to subsequent spatial analysis approaches. Several geoparsers are available that support this task, each with its own (often limited or specialized) gazetteer and its own approaches to toponym detection and resolution. In this demonstration paper, we present HeidelPlace, an extensible framework in support of geoparsing. Key features of HeidelPlace include a generic gazetteer model that supports the integration of place information from different knowledge bases, and a pipeline approach that enables an effective combination of diverse modules tailored to specific geoparsing tasks. This makes HeidelPlace a valuable tool for testing and evaluating different gazetteer sources and geoparsing methods. In the demonstration, we show how to set up a geoparsing workflow with HeidelPlace and how it can be used to compare and consolidate the output of different geoparsing approaches.","pages":"85--90","doi":"10.18653\/v1\/D17-2015","url":"https:\/\/www.aclweb.org\/anthology\/D17-2015","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2016","title":"Unsupervised, Knowledge-Free, and Interpretable Word Sense Disambiguation","authors":["Panchenko, Alexander","Marten, Fide","Ruppert, Eugen","Faralli, Stefano","Ustalov, Dmitry","Ponzetto, Simone Paolo","Biemann, Chris"],"emails":["panchenko@informatik.uni-hamburg.de","marten@informatik.uni-hamburg.de","ruppert@informatik.uni-hamburg.de","stefano@informatik.uni-mannheim.de","dmitry.ustalov@urfu.ru","simone@informatik.uni-mannheim.de","biemann@informatik.uni-hamburg.de"],"author_id":["alexander-panchenko","fide-marten","eugen-ruppert","stefano-faralli","dmitry-ustalov","simone-paolo-ponzetto","chris-biemann"],"abstract":"Interpretability of a predictive model is a powerful feature that gains the trust of users in the correctness of the predictions. In word sense disambiguation (WSD), knowledge-based systems tend to be much more interpretable than knowledge-free counterparts as they rely on the wealth of manually-encoded elements representing word senses, such as hypernyms, usage examples, and images. We present a WSD system that bridges the gap between these two so far disconnected groups of methods. Namely, our system, providing access to several state-of-the-art WSD models, aims to be interpretable as a knowledge-based system while it remains completely unsupervised and knowledge-free. The presented tool features a Web interface for all-word disambiguation of texts that makes the sense predictions human readable by providing interpretable word sense inventories, sense representations, and disambiguation results. We provide a public API, enabling seamless integration.","pages":"91--96","doi":"10.18653\/v1\/D17-2016","url":"https:\/\/www.aclweb.org\/anthology\/D17-2016","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2017","title":"{N}euro{NER}: an easy-to-use program for named-entity recognition based on neural networks","authors":["Dernoncourt, Franck","Lee, Ji Young","Szolovits, Peter"],"emails":["francky@mit.edu","jjylee@mit.edu","psz@mit.edu"],"author_id":["franck-dernoncourt","ji-young-lee","peter-szolovits"],"abstract":"Named-entity recognition (NER) aims at identifying entities of interest in a text. Artificial neural networks (ANNs) have recently been shown to outperform existing NER systems. However, ANNs remain challenging to use for non-expert users. In this paper, we present NeuroNER, an easy-to-use named-entity recognition tool based on ANNs. Users can annotate entities using a graphical web-based user interface (BRAT): the annotations are then used to train an ANN, which in turn predict entities{'} locations and categories in new texts. NeuroNER makes this annotation-training-prediction flow smooth and accessible to anyone.","pages":"97--102","doi":"10.18653\/v1\/D17-2017","url":"https:\/\/www.aclweb.org\/anthology\/D17-2017","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2018","title":"{S}up{WSD}: A Flexible Toolkit for Supervised Word Sense Disambiguation","authors":["Papandrea, Simone","Raganato, Alessandro","Delli Bovi, Claudio"],"emails":["papandrea.simone@gmail.com","raganato@di.uniroma1.it","dellibovi@di.uniroma1.it"],"author_id":["simone-papandrea","alessandro-raganato","claudio-delli-bovi"],"abstract":"In this demonstration we present SupWSD, a Java API for supervised Word Sense Disambiguation (WSD). This toolkit includes the implementation of a state-of-the-art supervised WSD system, together with a Natural Language Processing pipeline for preprocessing and feature extraction. Our aim is to provide an easy-to-use tool for the research community, designed to be modular, fast and scalable for training and testing on large datasets. The source code of SupWSD is available at \\url{http:\/\/github.com\/SI3P\/SupWSD}.","pages":"103--108","doi":"10.18653\/v1\/D17-2018","url":"https:\/\/www.aclweb.org\/anthology\/D17-2018","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2019","title":"Interactive Abstractive Summarization for Event News Tweets","authors":["Shapira, Ori","Ronen, Hadar","Adler, Meni","Amsterdamer, Yael","Bar-Ilan, Judit","Dagan, Ido"],"emails":["obspp18@gmail.com","hadarg@gmail.com","meni.adler@gmail.com","yael.amsterdamer@biu.ac.il","judit.bar-ilan@biu.ac.il","dagan@cs.biu.ac.il"],"author_id":["ori-shapira","hadar-ronen","meni-adler","yael-amsterdamer","judit-bar-ilan","ido-dagan"],"abstract":"We present a novel interactive summarization system that is based on abstractive summarization, derived from a recent consolidated knowledge representation for multiple texts. We incorporate a couple of interaction mechanisms, providing a bullet-style summary while allowing to attain the most important information first and interactively drill down to more specific details. A usability study of our implementation, for event news tweets, suggests the utility of our approach for text exploration.","pages":"109--114","doi":"10.18653\/v1\/D17-2019","url":"https:\/\/www.aclweb.org\/anthology\/D17-2019","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2020","title":"{L}ang{P}ro: Natural Language Theorem Prover","authors":["Abzianidze, Lasha"],"emails":["bzianidze@rug.nl"],"author_id":["lasha-abzianidze"],"abstract":"LangPro is an automated theorem prover for natural language. Given a set of premises and a hypothesis, it is able to prove semantic relations between them. The prover is based on a version of analytic tableau method specially designed for natural logic. The proof procedure operates on logical forms that preserve linguistic expressions to a large extent. {\\%}This property makes the logical forms easily obtainable from syntactic trees. {\\%}, in particular, Combinatory Categorial Grammar derivation trees. The nature of proofs is deductive and transparent. On the FraCaS and SICK textual entailment datasets, the prover achieves high results comparable to state-of-the-art.","pages":"115--120","doi":"10.18653\/v1\/D17-2020","url":"https:\/\/www.aclweb.org\/anthology\/D17-2020","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"},{"id":"D17-2021","title":"Interactive Visualization and Manipulation of Attention-based Neural Machine Translation","authors":["Lee, Jaesong","Shin, Joong-Hwi","Kim, Jun-Seok"],"emails":["jaesong.lee@navercorp.com","joonghwi.shin@navercorp.com","jun.seok@navercorp.com"],"author_id":["jaesong-lee","joong-hwi-shin","jun-seok-kim"],"abstract":"While neural machine translation (NMT) provides high-quality translation, it is still hard to interpret and analyze its behavior. We present an interactive interface for visualizing and intervening behavior of NMT, specifically concentrating on the behavior of beam search mechanism and attention component. The tool (1) visualizes search tree and attention and (2) provides interface to adjust search tree and attention weight (manually or automatically) at real-time. We show the tool gives various methods to understand NMT.","pages":"121--126","doi":"10.18653\/v1\/D17-2021","url":"https:\/\/www.aclweb.org\/anthology\/D17-2021","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing: System Demonstrations"}]