[{"id":"I17-2001","title":"{CKY}-based Convolutional Attention for Neural Machine Translation","authors":["Watanabe, Taiki","Tamura, Akihiro","Ninomiya, Takashi"],"emails":["t_watanabe@ai.cs","",""],"author_id":["taiki-watanabe","akihiro-tamura","takashi-ninomiya"],"abstract":"This paper proposes a new attention mechanism for neural machine translation (NMT) based on convolutional neural networks (CNNs), which is inspired by the CKY algorithm. The proposed attention represents every possible combination of source words (e.g., phrases and structures) through CNNs, which imitates the CKY table in the algorithm. NMT, incorporating the proposed attention, decodes a target sentence on the basis of the attention scores of the hidden states of CNNs. The proposed attention enables NMT to capture alignments from underlying structures of a source sentence without sentence parsing. The evaluations on the Asian Scientific Paper Excerpt Corpus (ASPEC) English-Japanese translation task show that the proposed attention gains 0.66 points in BLEU.","pages":"1--6","url":"https:\/\/www.aclweb.org\/anthology\/I17-2001","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2002","title":"Supervised Attention for Sequence-to-Sequence Constituency Parsing","authors":["Kamigaito, Hidetaka","Hayashi, Katsuhiko","Hirao, Tsutomu","Takamura, Hiroya","Okumura, Manabu","Nagata, Masaaki"],"emails":["kamigaito.hidetaka@lab.ntt.co.jp","","","","",""],"author_id":["hidetaka-kamigaito","katsuhiko-hayashi","tsutomu-hirao","hiroya-takamura","manabu-okumura","masaaki-nagata"],"abstract":"The sequence-to-sequence (Seq2Seq) model has been successfully applied to machine translation (MT). Recently, MT performances were improved by incorporating supervised attention into the model. In this paper, we introduce supervised attention to constituency parsing that can be regarded as another translation task. Evaluation results on the PTB corpus showed that the bracketing F-measure was improved by supervised attention.","pages":"7--12","url":"https:\/\/www.aclweb.org\/anthology\/I17-2002","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2003","title":"Transferring Semantic Roles Using Translation and Syntactic Information","authors":["Aminian, Maryam","Rasooli, Mohammad Sadegh","Diab, Mona"],"emails":["aminian@gwu.edu","2rasooli@cs.columbia.edu","mtdiab@gwu.edu"],"author_id":["maryam-aminian","mohammad-sadegh-rasooli","mona-diab"],"abstract":"Our paper addresses the problem of annotation projection for semantic role labeling for resource-poor languages using supervised annotations from a resource-rich language through parallel data. We propose a transfer method that employs information from source and target syntactic dependencies as well as word alignment density to improve the quality of an iterative bootstrapping method. Our experiments yield a 3.5 absolute labeled F-score improvement over a standard annotation projection method.","pages":"13--19","url":"https:\/\/www.aclweb.org\/anthology\/I17-2003","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2004","title":"Neural Lattice Search for Domain Adaptation in Machine Translation","authors":["Khayrallah, Huda","Kumar, Gaurav","Duh, Kevin","Post, Matt","Koehn, Philipp"],"emails":["huda@cs.jhu.edu","gkumar@cs.jhu.edu","kevinduh@cs.jhu.edu","post@cs.jhu.edu","phi@cs.jhu.edu"],"author_id":["huda-khayrallah","gaurav-kumar","kevin-duh","matt-post","philipp-koehn"],"abstract":"Domain adaptation is a major challenge for neural machine translation (NMT). Given unknown words or new domains, NMT systems tend to generate fluent translations at the expense of adequacy. We present a stack-based lattice search algorithm for NMT and show that constraining its search space with lattices generated by phrase-based machine translation (PBMT) improves robustness. We report consistent BLEU score gains across four diverse domain adaptation tasks involving medical, IT, Koran, or subtitles texts.","pages":"20--25","url":"https:\/\/www.aclweb.org\/anthology\/I17-2004","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2005","title":"Analyzing Well-Formedness of Syllables in {J}apanese Sign Language","authors":["Yawata, Satoshi","Miwa, Makoto","Sasaki, Yutaka","Hara, Daisuke"],"emails":["yawata@nsk.com","makoto-miwa@toyota-ti.ac.jp","yutaka.sasaki@toyota-ti.ac.jp","daisuke.hara@toyota-ti.ac.jp"],"author_id":["satoshi-yawata","makoto-miwa","yutaka-sasaki","daisuke-hara"],"abstract":"This paper tackles a problem of analyzing the well-formedness of syllables in Japanese Sign Language (JSL). We formulate the problem as a classification problem that classifies syllables into well-formed or ill-formed. We build a data set that contains hand-coded syllables and their well-formedness. We define a fine-grained feature set based on the hand-coded syllables and train a logistic regression classifier on labeled syllables, expecting to find the discriminative features from the trained classifier. We also perform pseudo active learning to investigate the applicability of active learning in analyzing syllables. In the experiments, the best classifier with our combinatorial features achieved the accuracy of 87.0{\\%}. The pseudo active learning is also shown to be effective showing that it could reduce about 84{\\%} of training instances to achieve the accuracy of 82.0{\\%} when compared to the model without active learning.","pages":"26--30","url":"https:\/\/www.aclweb.org\/anthology\/I17-2005","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2006","title":"Towards Lower Bounds on Number of Dimensions for Word Embeddings","authors":["Patel, Kevin","Bhattacharyya, Pushpak"],"emails":["kevin.patel@cse.iitb.ac.in","pb@cse.iitb.ac.in"],"author_id":["kevin-patel","pushpak-bhattacharyya"],"abstract":"Word embeddings are a relatively new addition to the modern NLP researcher{'}s toolkit. However, unlike other tools, word embeddings are used in a black box manner. There are very few studies regarding various hyperparameters. One such hyperparameter is the dimension of word embeddings. They are rather decided based on a rule of thumb: in the range 50 to 300. In this paper, we show that the dimension should instead be chosen based on corpus statistics. More specifically, we show that the number of pairwise equidistant words of the corpus vocabulary (as defined by some distance\/similarity metric) gives a lower bound on the the number of dimensions , and going below this bound results in degradation of quality of learned word embeddings. Through our evaluations on standard word embedding evaluation tasks, we show that for dimensions higher than or equal to the bound, we get better results as compared to the ones below it.","pages":"31--36","url":"https:\/\/www.aclweb.org\/anthology\/I17-2006","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2007","title":"Sequence to Sequence Learning for Event Prediction","authors":["Nguyen, Dai Quoc","Nguyen, Dat Quoc","Chu, Cuong Xuan","Thater, Stefan","Pinkal, Manfred"],"emails":["dat.nguyen@mq.edu.au","daiquocn@coli.uni-saarland.de","cxchu@mpi-inf.mpg.de","stth@coli.uni-saarland.de","pinkal@coli.uni-saarland.de"],"author_id":["dat-quoc-nguyen","dai-quoc-nguyen","cuong-xuan-chu","stefan-thater","manfred-pinkal"],"abstract":"This paper presents an approach to the task of predicting an event description from a preceding sentence in a text. Our approach explores sequence-to-sequence learning using a bidirectional multi-layer recurrent neural network. Our approach substantially outperforms previous work in terms of the BLEU score on two datasets derived from WikiHow and DeScript respectively. Since the BLEU score is not easy to interpret as a measure of event prediction, we complement our study with a second evaluation that exploits the rich linguistic annotation of gold paraphrase sets of events.","pages":"37--42","url":"https:\/\/www.aclweb.org\/anthology\/I17-2007","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2008","title":"Input-to-Output Gate to Improve {RNN} Language Models","authors":["Takase, Sho","Suzuki, Jun","Nagata, Masaaki"],"emails":["takase.sho@lab.ntt.co.jp","suzuki.jun@lab.ntt.co.jp","nagata.masaaki@lab.ntt.co.jp"],"author_id":["sho-takase","jun-suzuki","masaaki-nagata"],"abstract":"This paper proposes a reinforcing method that refines the output layers of existing Recurrent Neural Network (RNN) language models. We refer to our proposed method as Input-to-Output Gate (IOG). IOG has an extremely simple structure, and thus, can be easily combined with any RNN language models. Our experiments on the Penn Treebank and WikiText-2 datasets demonstrate that IOG consistently boosts the performance of several different types of current topline RNN language models.","pages":"43--48","url":"https:\/\/www.aclweb.org\/anthology\/I17-2008","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2009","title":"Counterfactual Language Model Adaptation for Suggesting Phrases","authors":["Arnold, Kenneth","Chang, Kai-Wei","Kalai, Adam"],"emails":["","",""],"author_id":["kenneth-arnold","kai-wei-chang","adam-kalai"],"abstract":"Mobile devices use language models to suggest words and phrases for use in text entry. Traditional language models are based on contextual word frequency in a static corpus of text. However, certain types of phrases, when offered to writers as suggestions, may be systematically chosen more often than their frequency would predict. In this paper, we propose the task of generating suggestions that writers accept, a related but distinct task to making accurate predictions. Although this task is fundamentally interactive, we propose a counterfactual setting that permits offline training and evaluation. We find that even a simple language model can capture text characteristics that improve acceptability.","pages":"49--54","url":"https:\/\/www.aclweb.org\/anthology\/I17-2009","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2010","title":"Deep Automated Multi-task Learning","authors":["Liang, Davis","Shu, Yan"],"emails":["d1liang@ucsd.edu","yashu@ucsd.edu"],"author_id":["davis-liang","yan-shu"],"abstract":"Multi-task learning (MTL) has recently contributed to learning better representations in service of various NLP tasks. MTL aims at improving the performance of a primary task by jointly training on a secondary task. This paper introduces automated tasks, which exploit the sequential nature of the input data, as secondary tasks in an MTL model. We explore next word prediction, next character prediction, and missing word completion as potential automated tasks. Our results show that training on a primary task in parallel with a secondary automated task improves both the convergence speed and accuracy for the primary task. We suggest two methods for augmenting an existing network with automated tasks and establish better performance in topic prediction, sentiment analysis, and hashtag recommendation. Finally, we show that the MTL models can perform well on datasets that are small and colloquial by nature.","pages":"55--60","url":"https:\/\/www.aclweb.org\/anthology\/I17-2010","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2011","title":"Post-Processing Techniques for Improving Predictions of Multilabel Learning Approaches","authors":["Soni, Akshay","Pappu, Aasish","Ni, Jerry Chia-mau","Chevalier, Troy"],"emails":["akshaysoni@oath.com","aasishkp@oath.com","jerryni@oath.com","troyc@oath.com"],"author_id":["akshay-soni","aasish-pappu","jerry-chia-mau-ni","troy-chevalier"],"abstract":"In Multilabel Learning (MLL) each training instance is associated with a set of labels and the task is to learn a function that maps an unseen instance to its corresponding label set. In this paper, we present a suite of {--} MLL algorithm independent {--} post-processing techniques that utilize the conditional and directional label-dependences in order to make the predictions from any MLL approach more coherent and precise. We solve constraint optimization problem over the output produced by any MLL approach and the result is a refined version of the input predicted label set. Using proposed techniques, we show absolute improvement of 3{\\%} on English News and 10{\\%} on Chinese E-commerce datasets for P@K metric.","pages":"61--66","url":"https:\/\/www.aclweb.org\/anthology\/I17-2011","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2012","title":"Learning Kernels over Strings using {G}aussian Processes","authors":["Beck, Daniel","Cohn, Trevor"],"emails":["d.beck@unimelb.edu.au","t.cohn@unimelb.edu.au"],"author_id":["daniel-beck","trevor-cohn"],"abstract":"Non-contiguous word sequences are widely known to be important in modelling natural language. However they not explicitly encoded in common text representations. In this work we propose a model for text processing using string kernels, capable of flexibly representing non-contiguous sequences. Specifically, we derive a vectorised version of the string kernel algorithm and their gradients, allowing efficient hyperparameter optimisation as part of a Gaussian Process framework. Experiments on synthetic data and text regression for emotion analysis show the promise of this technique.","pages":"67--73","url":"https:\/\/www.aclweb.org\/anthology\/I17-2012","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2013","title":"Substring Frequency Features for Segmentation of {J}apanese Katakana Words with Unlabeled Corpora","authors":["Fujinuma, Yoshinari","Grissom II, Alvin"],"emails":["ujinuma@colorado.edu","agrissom@ursinus.edu"],"author_id":["yoshinari-fujinuma","alvin-grissom-ii"],"abstract":"Word segmentation is crucial in natural language processing tasks for unsegmented languages. In Japanese, many out-of-vocabulary words appear in the phonetic syllabary katakana, making segmentation more difficult due to the lack of clues found in mixed script settings. In this paper, we propose a straightforward approach based on a variant of tf-idf and apply it to the problem of word segmentation in Japanese. Even though our method uses only an unlabeled corpus, experimental results show that it achieves performance comparable to existing methods that use manually labeled corpora. Furthermore, it improves performance of simple word segmentation models trained on a manually labeled corpus.","pages":"74--79","url":"https:\/\/www.aclweb.org\/anthology\/I17-2013","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2014","title":"{MONPA}: Multi-objective Named-entity and Part-of-speech Annotator for {C}hinese using Recurrent Neural Network","authors":["Hsieh, Yu-Lun","Chang, Yung-Chun","Huang, Yi-Jie","Yeh, Shu-Hao","Chen, Chun-Hung","Hsu, Wen-Lian"],"emails":["morphe@iis.sinica.edu.tw","changyc@tmu.edu.tw","","","chen@iis.sinica.edu.tw","hsu@iis.sinica.edu.tw"],"author_id":["yu-lun-hsieh","yung-chun-chang","yi-jie-huang","shu-hao-yeh","chun-hung-chen","wen-lian-hsu"],"abstract":"Part-of-speech (POS) tagging and named entity recognition (NER) are crucial steps in natural language processing. In addition, the difficulty of word segmentation places additional burden on those who intend to deal with languages such as Chinese, and pipelined systems often suffer from error propagation. This work proposes an end-to-end model using character-based recurrent neural network (RNN) to jointly accomplish segmentation, POS tagging and NER of a Chinese sentence. Experiments on previous word segmentation and NER datasets show that a single model with the proposed architecture is comparable to those trained specifically for each task, and outperforms freely-available softwares. Moreover, we provide a web-based interface for the public to easily access this resource.","pages":"80--85","url":"https:\/\/www.aclweb.org\/anthology\/I17-2014","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2015","title":"Recall is the Proper Evaluation Metric for Word Segmentation","authors":["Shao, Yan","Hardmeier, Christian","Nivre, Joakim"],"emails":["yan.shao@lingfil.uu.se","christian.hardmeier@lingfil.uu.se","joakim.nivre@lingfil.uu.se"],"author_id":["yan-shao","christian-hardmeier","joakim-nivre"],"abstract":"We extensively analyse the correlations and drawbacks of conventionally employed evaluation metrics for word segmentation. Unlike in standard information retrieval, precision favours under-splitting systems and therefore can be misleading in word segmentation. Overall, based on both theoretical and experimental analysis, we propose that precision should be excluded from the standard evaluation metrics and that the evaluation score obtained by using only recall is sufficient and better correlated with the performance of word segmentation systems.","pages":"86--90","url":"https:\/\/www.aclweb.org\/anthology\/I17-2015","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2016","title":"Low-Resource Named Entity Recognition with Cross-lingual, Character-Level Neural Conditional Random Fields","authors":["Cotterell, Ryan","Duh, Kevin"],"emails":["ryan.cotterell@jhu.edu",""],"author_id":["ryan-cotterell","kevin-duh"],"abstract":"Low-resource named entity recognition is still an open problem in NLP. Most state-of-the-art systems require tens of thousands of annotated sentences in order to obtain high performance. However, for most of the world{'}s languages it is unfeasible to obtain such annotation. In this paper, we present a transfer learning scheme, whereby we train character-level neural CRFs to predict named entities for both high-resource languages and low-resource languages jointly. Learning character representations for multiple related languages allows knowledge transfer from the high-resource languages to the low-resource ones, improving F1 by up to 9.8 points.","pages":"91--96","url":"https:\/\/www.aclweb.org\/anthology\/I17-2016","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2017","title":"Segment-Level Neural Conditional Random Fields for Named Entity Recognition","authors":["Sato, Motoki","Shindo, Hiroyuki","Yamada, Ikuya","Matsumoto, Yuji"],"emails":["sato.motoki.sa7@is.naist.jp","shindo@is.naist.jp","ikuya@ousia.jp","matsu@is.naist.jp"],"author_id":["motoki-sano","hiroyuki-shindo","ikuya-yamada","yuji-matsumoto"],"abstract":"We present Segment-level Neural CRF, which combines neural networks with a linear chain CRF for segment-level sequence modeling tasks such as named entity recognition (NER) and syntactic chunking. Our segment-level CRF can consider higher-order label dependencies compared with conventional word-level CRF. Since it is difficult to consider all possible variable length segments, our method uses segment lattice constructed from the word-level tagging model to reduce the search space. Performing experiments on NER and chunking, we demonstrate that our method outperforms conventional word-level CRF with neural networks.","pages":"97--102","url":"https:\/\/www.aclweb.org\/anthology\/I17-2017","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2018","title":"Integrating Vision and Language Datasets to Measure Word Concreteness","authors":["Kehat, Gitit","Pustejovsky, James"],"emails":["gititkeh@brandeis.edu","jamesp@brandeis.edu"],"author_id":["gitit-kehat","james-pustejovsky"],"abstract":"We present and take advantage of the inherent visualizability properties of words in visual corpora (the textual components of vision-language datasets) to compute concreteness scores for words. Our simple method does not require hand-annotated concreteness score lists for training, and yields state-of-the-art results when evaluated against concreteness scores lists and previously derived scores, as well as when used for metaphor detection.","pages":"103--108","url":"https:\/\/www.aclweb.org\/anthology\/I17-2018","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2019","title":"Semantic Features Based on Word Alignments for Estimating Quality of Text Simplification","authors":["Kajiwara, Tomoyuki","Fujita, Atsushi"],"emails":["kajiwara-tomoyuki@ed.tmu.ac.jp","atsushi.fujita@nict.go.jp"],"author_id":["tomoyuki-kajiwara","atsushi-fujita"],"abstract":"This paper examines the usefulness of semantic features based on word alignments for estimating the quality of text simplification. Specifically, we introduce seven types of alignment-based features computed on the basis of word embeddings and paraphrase lexicons. Through an empirical experiment using the QATS dataset, we confirm that we can achieve the state-of-the-art performance only with these features.","pages":"109--115","url":"https:\/\/www.aclweb.org\/anthology\/I17-2019","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2020","title":"Injecting Word Embeddings with Another Language{'}s Resource : An Application of Bilingual Embeddings","authors":["Pandey, Prakhar","Pudi, Vikram","Shrivastava, Manish"],"emails":["prakhar.pandey@research.iiit.ac.in","vikram@.iiit.ac.in","manish.shrivastava@.iiit.ac.in"],"author_id":["prakhar-pandey","vikram-pudi","manish-shrivastava"],"abstract":"Word embeddings learned from text corpus can be improved by injecting knowledge from external resources, while at the same time also specializing them for similarity or relatedness. These knowledge resources (like WordNet, Paraphrase Database) may not exist for all languages. In this work we introduce a method to inject word embeddings of a language with knowledge resource of another language by leveraging bilingual embeddings. First we improve word embeddings of German, Italian, French and Spanish using resources of English and test them on variety of word similarity tasks. Then we demonstrate the utility of our method by creating improved embeddings for Urdu and Telugu languages using Hindi WordNet, beating the previously established baseline for Urdu.","pages":"116--121","url":"https:\/\/www.aclweb.org\/anthology\/I17-2020","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2021","title":"Improving Black-box Speech Recognition using Semantic Parsing","authors":["Corona, Rodolfo","Thomason, Jesse","Mooney, Raymond"],"emails":["rcorona@cs.utexas.edu","jesse@cs.utexas.edu","mooney@cs.utexas.edu"],"author_id":["rodolfo-corona","jesse-thomason","raymond-mooney"],"abstract":"Speech is a natural channel for human-computer interaction in robotics and consumer applications. Natural language understanding pipelines that start with speech can have trouble recovering from speech recognition errors. Black-box automatic speech recognition (ASR) systems, built for general purpose use, are unable to take advantage of in-domain language models that could otherwise ameliorate these errors. In this work, we present a method for re-ranking black-box ASR hypotheses using an in-domain language model and semantic parser trained for a particular task. Our re-ranking method significantly improves both transcription accuracy and semantic understanding over a state-of-the-art ASR{'}s vanilla output.","pages":"122--127","url":"https:\/\/www.aclweb.org\/anthology\/I17-2021","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2022","title":"Revisiting the Design Issues of Local Models for {J}apanese Predicate-Argument Structure Analysis","authors":["Matsubayashi, Yuichiroh","Inui, Kentaro"],"emails":["y-matsu@ecei.tohoku.ac.jp","inui@ecei.tohoku.ac.jp"],"author_id":["yuichiroh-matsubayashi","kentaro-inui"],"abstract":"The research trend in Japanese predicate-argument structure (PAS) analysis is shifting from pointwise prediction models with local features to global models designed to search for globally optimal solutions. However, the existing global models tend to employ only relatively simple local features; therefore, the overall performance gains are rather limited. The importance of designing a local model is demonstrated in this study by showing that the performance of a sophisticated local model can be considerably improved with recent feature embedding methods and a feature combination learning based on a neural network, outperforming the state-of-the-art global models in F1 on a common benchmark dataset.","pages":"128--133","url":"https:\/\/www.aclweb.org\/anthology\/I17-2022","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2023","title":"Natural Language Informs the Interpretation of Iconic Gestures: A Computational Approach","authors":["Han, Ting","Hough, Julian","Schlangen, David"],"emails":["ting.han@uni-bielefeld.de","julian.hough@uni-bielefeld.de","david.schlangen@uni-bielefeld.de"],"author_id":["ting-han","julian-hough","david-schlangen"],"abstract":"When giving descriptions, speakers often signify object shape or size with hand gestures. Such so-called {`}iconic{'} gestures represent their meaning through their relevance to referents in the verbal content, rather than having a conventional form. The gesture form on its own is often ambiguous, and the aspect of the referent that it highlights is constrained by what the language makes salient. We show how the verbal content guides gesture interpretation through a computational model that frames the task as a multi-label classification task that maps multimodal utterances to semantic categories, using annotated human-human data.","pages":"134--139","url":"https:\/\/www.aclweb.org\/anthology\/I17-2023","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2024","title":"Modelling Representation Noise in Emotion Analysis using {G}aussian Processes","authors":["Beck, Daniel"],"emails":["d.beck@unimelb.edu.au"],"author_id":["daniel-beck"],"abstract":"Emotion Analysis is the task of modelling latent emotions present in natural language. Labelled datasets for this task are scarce so learning good input text representations is not trivial. Using averaged word embeddings is a simple way to leverage unlabelled corpora to build text representations but this approach can be prone to noise either coming from the embedding themselves or the averaging procedure. In this paper we propose a model for Emotion Analysis using Gaussian Processes and kernels that are better suitable for functions that exhibit noisy behaviour. Empirical evaluations in a emotion prediction task show that our model outperforms commonly used baselines for regression.","pages":"140--145","url":"https:\/\/www.aclweb.org\/anthology\/I17-2024","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2025","title":"Are Manually Prepared Affective Lexicons Really Useful for Sentiment Analysis","authors":["Li, Minglei","Lu, Qin","Long, Yunfei"],"emails":["csmli@comp.polyu.edu.hk","csqinlu@comp.polyu.edu.hk","csylong@comp.polyu.edu.hk"],"author_id":["minglei-li","qin-lu","yunfei-long"],"abstract":"In this paper, we investigate the effectiveness of different affective lexicons through sentiment analysis of phrases. We examine how phrases can be represented through manually prepared lexicons, extended lexicons using computational methods, or word embedding. Comparative studies clearly show that word embedding using unsupervised distributional method outperforms manually prepared lexicons no matter what affective models are used in the lexicons. Our conclusion is that although different affective lexicons are cognitively backed by theories, they do not show any advantage over the automatically obtained word embedding.","pages":"146--150","url":"https:\/\/www.aclweb.org\/anthology\/I17-2025","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2026","title":"{MTNA}: A Neural Multi-task Model for Aspect Category Classification and Aspect Term Extraction On Restaurant Reviews","authors":["Xue, Wei","Zhou, Wubai","Li, Tao","Wang, Qing"],"emails":["wxue004@cs.fiu.edu","wzhou005@cs.fiu.edu","taoli@cs.fiu.edu","qwang028@cs.fiu.edu"],"author_id":["wei-xue","wubai-zhou","tao-li","qing-wang"],"abstract":"Online reviews are valuable resources not only for consumers to make decisions before purchase, but also for providers to get feedbacks for their services or commodities. In Aspect Based Sentiment Analysis (ABSA), it is critical to identify aspect categories and extract aspect terms from the sentences of user-generated reviews. However, the two tasks are often treated independently, even though they are closely related. Intuitively, the learned knowledge of one task should inform the other learning task. In this paper, we propose a multi-task learning model based on neural networks to solve them together. We demonstrate the improved performance of our multi-task learning model over the models trained separately on three public dataset released by SemEval workshops.","pages":"151--156","url":"https:\/\/www.aclweb.org\/anthology\/I17-2026","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2027","title":"Can Discourse Relations be Identified Incrementally?","authors":["Yung, Frances","Noji, Hiroshi","Matsumoto, Yuji"],"emails":["frances@coli.uni-saarland.de","noji@is.naist.jp","matsu@is.naist.jp"],"author_id":["frances-yung","hiroshi-noji","yuji-matsumoto"],"abstract":"Humans process language word by word and construct partial linguistic structures on the fly before the end of the sentence is perceived. Inspired by this cognitive ability, incremental algorithms for natural language processing tasks have been proposed and demonstrated promising performance. For discourse relation (DR) parsing, however, it is not yet clear to what extent humans can recognize DRs incrementally, because the latent {`}nodes{'} of discourse structure can span clauses and sentences. To answer this question, this work investigates incrementality in discourse processing based on a corpus annotated with DR signals. We find that DRs are dominantly signaled at the boundary between the two constituent discourse units. The findings complement existing psycholinguistic theories on expectation in discourse processing and provide direction for incremental discourse parsing.","pages":"157--162","url":"https:\/\/www.aclweb.org\/anthology\/I17-2027","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2028","title":"Speaker Role Contextual Modeling for Language Understanding and Dialogue Policy Learning","authors":["Chi, Ta-Chung","Chen, Po-Chun","Su, Shang-Yu","Chen, Yun-Nung"],"emails":["b02902019@ntu.edu.tw","y.v.chen@ieee.org","r06922028@ntu.edu.tw","r05921117@ntu.edu.tw"],"author_id":["ta-chung-chi","po-chun-chen","shang-yu-su","yun-nung-chen"],"abstract":"Language understanding (LU) and dialogue policy learning are two essential components in conversational systems. Human-human dialogues are not well-controlled and often random and unpredictable due to their own goals and speaking habits. This paper proposes a role-based contextual model to consider different speaker roles independently based on the various speaking patterns in the multi-turn dialogues. The experiments on the benchmark dataset show that the proposed role-based model successfully learns role-specific behavioral patterns for contextual encoding and then significantly improves language understanding and dialogue policy learning tasks.","pages":"163--168","url":"https:\/\/www.aclweb.org\/anthology\/I17-2028","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2029","title":"Diversifying Neural Conversation Model with Maximal Marginal Relevance","authors":["Song, Yiping","Tian, Zhiliang","Zhao, Dongyan","Zhang, Ming","Yan, Rui"],"emails":["cs@pku.edu.cn","tianzhilianghit@gmail.com","","","ruiyan@pku.edu.cn"],"author_id":["yiping-song","zhiliang-tian","dongyan-zhao","ming-zhang","rui-yan"],"abstract":"Neural conversation systems, typically using sequence-to-sequence (seq2seq) models, are showing promising progress recently. However, traditional seq2seq suffer from a severe weakness: during beam search decoding, they tend to rank universal replies at the top of the candidate list, resulting in the lack of diversity among candidate replies. Maximum Marginal Relevance (MMR) is a ranking algorithm that has been widely used for subset selection. In this paper, we propose the MMR-BS decoding method, which incorporates MMR into the beam search (BS) process of seq2seq. The MMR-BS method improves the diversity of generated replies without sacrificing their high relevance with the user-issued query. Experiments show that our proposed model achieves the best performance among other comparison methods.","pages":"169--174","url":"https:\/\/www.aclweb.org\/anthology\/I17-2029","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2030","title":"Dialog for Language to Code","authors":["Chaurasia, Shobhit","Mooney, Raymond J."],"emails":["shobhit@utexas.edu","mooney@cs.utexas.edu"],"author_id":["shobhit-chaurasia","raymond-mooney"],"abstract":"Generating computer code from natural language descriptions has been a long-standing problem. Prior work in this domain has restricted itself to generating code in one shot from a single description. To overcome this limitation, we propose a system that can engage users in a dialog to clarify their intent until it has all the information to produce correct code. To evaluate the efficacy of dialog in code generation, we focus on synthesizing conditional statements in the form of IFTTT recipes.","pages":"175--180","url":"https:\/\/www.aclweb.org\/anthology\/I17-2030","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2031","title":"Using Analytic Scoring Rubrics in the Automatic Assessment of College-Level Summary Writing Tasks in {L}2","authors":["Sladoljev-Agejev, Tamara","{\\v{S}}najder, Jan"],"emails":["tagejev@efzg.hr","jan.snajder@fer.hr"],"author_id":["tamara-sladoljev-agejev","jan-snajder"],"abstract":"Assessing summaries is a demanding, yet useful task which provides valuable information on language competence, especially for second language learners. We consider automated scoring of college-level summary writing task in English as a second language (EL2). We adopt the Reading-for-Understanding (RU) cognitive framework, extended with the Reading-to-Write (RW) element, and use analytic scoring with six rubrics covering content and writing quality. We show that regression models with reference-based and linguistic features considerably outperform the baselines across all the rubrics. Moreover, we find interesting correlations between summary features and analytic rubrics, revealing the links between the RU and RW constructs.","pages":"181--186","url":"https:\/\/www.aclweb.org\/anthology\/I17-2031","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2032","title":"A Statistical Framework for Product Description Generation","authors":["Wang, Jinpeng","Hou, Yutai","Liu, Jing","Cao, Yunbo","Lin, Chin-Yew"],"emails":["jinpwa@microsoft.com","ythou@ir.hit.edu.cn","liudani@microsoft.com","yunbocao@tencent.com","cyl@microsoft.com"],"author_id":["jinpeng-wang","yutai-hou","jing-liu","yunbo-cao","chin-yew-lin"],"abstract":"We present in this paper a statistical framework that generates accurate and fluent product description from product attributes. Specifically, after extracting templates and learning writing knowledge from attribute-description parallel data, we use the learned knowledge to decide what to say and how to say for product description generation. To evaluate accuracy and fluency for the generated descriptions, in addition to BLEU and Recall, we propose to measure what to say (in terms of attribute coverage) and to measure how to say (by attribute-specified generation) separately. Experimental results show that our framework is effective.","pages":"187--192","url":"https:\/\/www.aclweb.org\/anthology\/I17-2032","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2033","title":"Automatic Text Summarization Using Reinforcement Learning with Embedding Features","authors":["Lee, Gyoung Ho","Lee, Kong Joo"],"emails":["gyholee@gmail.com","kjoolee@cnu.ac.kr"],"author_id":["gyoung-ho-lee","kong-joo-lee"],"abstract":"An automatic text summarization system can automatically generate a short and brief summary that contains a main concept of an original document. In this work, we explore the advantages of simple embedding features in Reinforcement leaning approach to automatic text summarization tasks. In addition, we propose a novel deep learning network for estimating Q-values used in Reinforcement learning. We evaluate our model by using ROUGE scores with DUC 2001, 2002, Wikipedia, ACL-ARC data. Evaluation results show that our model is competitive with the previous models.","pages":"193--197","url":"https:\/\/www.aclweb.org\/anthology\/I17-2033","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2034","title":"{SSAS}: Semantic Similarity for Abstractive Summarization","authors":["Vadapalli, Raghuram","J Kurisinkel, Litton","Gupta, Manish","Varma, Vasudeva"],"emails":["raghuram.vadapalli@research.iiit.ac.in","litton.jkurisinkel@research.iiit.ac.in","manish.gupta@iiit.ac.in","vv@iiit.ac.in"],"author_id":["raghuram-vadapalli","litton-j-kurisinkel","manish-gupta","vasudeva-varma"],"abstract":"Ideally a metric evaluating an abstract system summary should represent the extent to which the system-generated summary approximates the semantic inference conceived by the reader using a human-written reference summary. Most of the previous approaches relied upon word or syntactic sub-sequence overlap to evaluate system-generated summaries. Such metrics cannot evaluate the summary at semantic inference level. Through this work we introduce the metric of Semantic Similarity for Abstractive Summarization (SSAS), which leverages natural language inference and paraphrasing techniques to frame a novel approach to evaluate system summaries at semantic inference level. SSAS is based upon a weighted composition of quantities representing the level of agreement, contradiction, independence, paraphrasing, and optionally ROUGE score between a system-generated and a human-written summary.","pages":"198--203","url":"https:\/\/www.aclweb.org\/anthology\/I17-2034","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2035","title":"Taking into account Inter-sentence Similarity for Update Summarization","authors":["Mnasri, Ma{\\^a}li","de Chalendar, Ga{\\\"e}l","Ferret, Olivier"],"emails":["maali.mnasri@cea.fr","gael.de-chalendar@cea.fr","olivier.ferret@cea.fr"],"author_id":["maali-mnasri","gael-de-chalendar","olivier-ferret"],"abstract":"Following Gillick and Favre (2009), a lot of work about extractive summarization has modeled this task by associating two contrary constraints: one aims at maximizing the coverage of the summary with respect to its information content while the other represents its size limit. In this context, the notion of redundancy is only implicitly taken into account. In this article, we extend the framework defined by Gillick and Favre (2009) by examining how and to what extent integrating semantic sentence similarity into an update summarization system can improve its results. We show more precisely the impact of this strategy through evaluations performed on DUC 2007 and TAC 2008 and 2009 datasets.","pages":"204--209","url":"https:\/\/www.aclweb.org\/anthology\/I17-2035","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2036","title":"Hyperspherical Query Likelihood Models with Word Embeddings","authors":["Masumura, Ryo","Asami, Taichi","Masataki, Hirokazu","Sadamitsu, Kugatsu","Nishida, Kyosuke","Higashinaka, Ryuichiro"],"emails":["","","","k.sadamitsu.ic@future.co.jp","nishida.kyosuke@lab.ntt.co.jp","higashinaka.ryuichiro@lab.ntt.co.jp"],"author_id":["ryo-masumura","taichi-asami","hirokazu-masataki","kugatsu-sadamitsu","kyosuke-nishida","ryuichiro-higashinaka"],"abstract":"This paper presents an initial study on hyperspherical query likelihood models (QLMs) for information retrieval (IR). Our motivation is to naturally utilize pre-trained word embeddings for probabilistic IR. To this end, key idea is to directly leverage the word embeddings as random variables for directional probabilistic models based on von Mises-Fisher distributions which are familiar to cosine distances. The proposed method enables us to theoretically take semantic similarities between document and target queries into consideration without introducing heuristic expansion techniques. In addition, this paper reveals relationships between hyperspherical QLMs and conventional QLMs. Experiments show document retrieval evaluation results in which a hyperspherical QLM is compared to conventional QLMs and document distance metrics using word or document embeddings.","pages":"210--216","url":"https:\/\/www.aclweb.org\/anthology\/I17-2036","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2037","title":"Dual Constrained Question Embeddings with Relational Knowledge Bases for Simple Question Answering","authors":["Kulkarni, Kaustubh","Togashi, Riku","Maeda, Hideyuki","Fujita, Sumio"],"emails":["kkulkarn@yahoo-corp.jp","rtogashi@yahoo-corp.jp","hidmaeda@yahoo-corp.jp","sufujita@yahoo-corp.jp"],"author_id":["kaustubh-kulkarni","riku-togashi","hideyuki-maeda","sumio-fujita"],"abstract":"Embedding based approaches are shown to be effective for solving simple Question Answering (QA) problems in recent works. The major drawback of current approaches is that they look only at the similarity (constraint) between a question and a head, relation pair. Due to the absence of tail (answer) in the questions, these models often require paraphrase datasets to obtain adequate embeddings. In this paper, we propose a dual constraint model which exploits the embeddings obtained by Trans* family of algorithms to solve the simple QA problem without using any additional resources such as paraphrase datasets. The results obtained prove that the embeddings learned using dual constraints are better than those with single constraint models having similar architecture.","pages":"217--221","url":"https:\/\/www.aclweb.org\/anthology\/I17-2037","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2038","title":"Efficiency-aware Answering of Compositional Questions using Answer Type Prediction","authors":["Ziegler, David","Abujabal, Abdalghani","Saha Roy, Rishiraj","Weikum, Gerhard"],"emails":["daziegler@mpi-inf.mpg.de","abujabal@mpi-inf.mpg.de","rishiraj@mpi-inf.mpg.de","weikum@mpi-inf.mpg.de"],"author_id":["david-ziegler","abdalghani-abujabal","rishiraj-saha-roy","gerhard-weikum"],"abstract":"This paper investigates the problem of answering compositional factoid questions over knowledge bases (KB) under efficiency constraints. The method, called TIPI, (i) decomposes compositional questions, (ii) predicts answer types for individual sub-questions, (iii) reasons over the compatibility of joint types, and finally, (iv) formulates compositional SPARQL queries respecting type constraints. TIPI{'}s answer type predictor is trained using distant supervision, and exploits lexical, syntactic and embedding-based features to compute context- and hierarchy-aware candidate answer types for an input question. Experiments on a recent benchmark show that TIPI results in state-of-the-art performance under the real-world assumption that only a single SPARQL query can be executed over the KB, and substantial reduction in the number of queries in the more general case.","pages":"222--227","url":"https:\/\/www.aclweb.org\/anthology\/I17-2038","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2039","title":"High Recall Open {IE} for Relation Discovery","authors":["Elsahar, Hady","Gravier, Christophe","Laforest, Frederique"],"emails":["hady.elsahar@univ-st-etienne.fr","christophe.gravier@univ-st-etienne.fr","frederique.laforest@univ-st-etienne.fr"],"author_id":["hady-elsahar","christophe-gravier","frederique-laforest"],"abstract":"Relation Discovery discovers predicates (relation types) from a text corpus relying on the co-occurrence of two named entities in the same sentence. This is a very narrowing constraint: it represents only a small fraction of all relation mentions in practice. In this paper we propose a high recall approach for Open IE, which enables covering up to 16 times more sentences in a large corpus. Comparison against OpenIE systems shows that our proposed approach achieves 28{\\%} improvement over the highest recall OpenIE system and 6{\\%} improvement in precision than the same system.","pages":"228--233","url":"https:\/\/www.aclweb.org\/anthology\/I17-2039","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2040","title":"Using Context Events in Neural Network Models for Event Temporal Status Identification","authors":["Dai, Zeyu","Yao, Wenlin","Huang, Ruihong"],"emails":["jzdaizeyu@tamu.edu","wenlinyao@tamu.edu","huangrh@tamu.edu"],"author_id":["zeyu-dai","wenlin-yao","ruihong-huang"],"abstract":"Focusing on the task of identifying event temporal status, we find that events directly or indirectly governing the target event in a dependency tree are most important contexts. Therefore, we extract dependency chains containing context events and use them as input in neural network models, which consistently outperform previous models using local context words as input. Visualization verifies that the dependency chain representation can effectively capture the context events which are closely related to the target event and play key roles in predicting event temporal status.","pages":"234--239","url":"https:\/\/www.aclweb.org\/anthology\/I17-2040","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2041","title":"Identifying Protein-protein Interactions in Biomedical Literature using Recurrent Neural Networks with Long Short-Term Memory","authors":["Hsieh, Yu-Lun","Chang, Yung-Chun","Chang, Nai-Wen","Hsu, Wen-Lian"],"emails":["morphe@iis.sinica.edu.tw","changyc@tmu.edu.tw","nwchang@iis.sinica.edu.tw","hsu@iis.sinica.edu.tw"],"author_id":["yu-lun-hsieh","yung-chun-chang","nai-wen-chang","wen-lian-hsu"],"abstract":"In this paper, we propose a recurrent neural network model for identifying protein-protein interactions in biomedical literature. Experiments on two largest public benchmark datasets, AIMed and BioInfer, demonstrate that our approach significantly surpasses state-of-the-art methods with relative improvements of 10{\\%} and 18{\\%}, respectively. Cross-corpus evaluation also demonstrate that the proposed model remains robust despite using different training data. These results suggest that RNN can effectively capture semantic relationships among proteins as well as generalizes over different corpora, without any feature engineering.","pages":"240--245","url":"https:\/\/www.aclweb.org\/anthology\/I17-2041","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2042","title":"Identifying Empathetic Messages in Online Health Communities","authors":["Khanpour, Hamed","Caragea, Cornelia","Biyani, Prakhar"],"emails":["amedkhanpour@my.unt.edu","ccaragea@k-state.edu","pxb5080@yahoo-inc.com"],"author_id":["hamed-khanpour","cornelia-caragea","prakhar-biyani"],"abstract":"Empathy captures one{'}s ability to correlate with and understand others{'} emotional states and experiences. Messages with empathetic content are considered as one of the main advantages for joining online health communities due to their potential to improve people{'}s moods. Unfortunately, to this date, no computational studies exist that automatically identify empathetic messages in online health communities. We propose a combination of Convolutional Neural Networks (CNN) and Long Short Term Memory (LSTM) networks, and show that the proposed model outperforms each individual model (CNN and LSTM) as well as several baselines.","pages":"246--251","url":"https:\/\/www.aclweb.org\/anthology\/I17-2042","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2043","title":"Fake News Detection Through Multi-Perspective Speaker Profiles","authors":["Long, Yunfei","Lu, Qin","Xiang, Rong","Li, Minglei","Huang, Chu-Ren"],"emails":["csylong@comp.polyu.edu.hk","csluqin@comp.polyu.edu.hk","iang@amd.com","csmli@comp.polyu.edu.hk","churen.huang@polyu.edu.hk"],"author_id":["yunfei-long","qin-lu","rong-xiang","minglei-li","chu-ren-huang"],"abstract":"Automatic fake news detection is an important, yet very challenging topic. Traditional methods using lexical features have only very limited success. This paper proposes a novel method to incorporate speaker profiles into an attention based LSTM model for fake news detection. Speaker profiles contribute to the model in two ways. One is to include them in the attention model. The other includes them as additional input data. By adding speaker profiles such as party affiliation, speaker title, location and credit history, our model outperforms the state-of-the-art method by 14.5{\\%} in accuracy using a benchmark fake news detection dataset. This proves that speaker profiles provide valuable information to validate the credibility of news articles.","pages":"252--256","url":"https:\/\/www.aclweb.org\/anthology\/I17-2043","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2044","title":"Improving Neural Text Normalization with Data Augmentation at Character- and Morphological Levels","authors":["Saito, Itsumi","Suzuki, Jun","Nishida, Kyosuke","Sadamitsu, Kugatsu","Kobashikawa, Satoshi","Masumura, Ryo","Matsumoto, Yuji","Tomita, Junji"],"emails":["saito.itsumi@lab.ntt.co.jp","suzuki.jun@lab.ntt.co.jp","nishida.kyosuke@lab.ntt.co.jp","k.sadamitsu.ic@future.co.jp","kobashikawa.satoshi@lab.ntt.co.jp","masumura.ryo@lab.ntt.co.jp","matsu@is.naist.jp","tomita.junji@lab.ntt.co.jp"],"author_id":["itsumi-saito","jun-suzuki","kyosuke-nishida","kugatsu-sadamitsu","satoshi-kobashikawa","ryo-masumura","yuji-matsumoto","junji-tomita"],"abstract":"In this study, we investigated the effectiveness of augmented data for encoder-decoder-based neural normalization models. Attention based encoder-decoder models are greatly effective in generating many natural languages. {\\%} such as machine translation or machine summarization. In general, we have to prepare for a large amount of training data to train an encoder-decoder model. Unlike machine translation, there are few training data for text-normalization tasks. In this paper, we propose two methods for generating augmented data. The experimental results with Japanese dialect normalization indicate that our methods are effective for an encoder-decoder model and achieve higher BLEU score than that of baselines. We also investigated the oracle performance and revealed that there is sufficient room for improving an encoder-decoder model.","pages":"257--262","url":"https:\/\/www.aclweb.org\/anthology\/I17-2044","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2045","title":"Using Social Networks to Improve Language Variety Identification with Neural Networks","authors":["Miura, Yasuhide","Taniguchi, Tomoki","Taniguchi, Motoki","Misawa, Shotaro","Ohkuma, Tomoko"],"emails":["yasuhide.miura@fujixerox.co.jp","taniguchi.tomoki@fujixerox.co.jp","motoki.taniguchi@fujixerox.co.jp","misawa.shotaro@fujixerox.co.jp","ohkuma.tomoko@fujixerox.co.jp"],"author_id":["yasuhide-miura","tomoki-taniguchi","motoki-taniguchi","shotaro-misawa","tomoko-ohkuma"],"abstract":"We propose a hierarchical neural network model for language variety identification that integrates information from a social network. Recently, language variety identification has enjoyed heightened popularity as an advanced task of language identification. The proposed model uses additional texts from a social network to improve language variety identification from two perspectives. First, they are used to introduce the effects of homophily. Secondly, they are used as expanded training data for shared layers of the proposed model. By introducing information from social networks, the model improved its accuracy by 1.67-5.56. Compared to state-of-the-art baselines, these improved performances are better in English and comparable in Spanish. Furthermore, we analyzed the cases of Portuguese and Arabic when the model showed weak performances, and found that the effect of homophily is likely to be weak due to sparsity and noises compared to languages with the strong performances.","pages":"263--270","url":"https:\/\/www.aclweb.org\/anthology\/I17-2045","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2046","title":"Boosting Neural Machine Translation","authors":["Zhang, Dakun","Kim, Jungi","Crego, Josep","Senellart, Jean"],"emails":["dakun.zhang@systrangroup.com","jungi.kim@systrangroup.com","josep.crego@systrangroup.com","jean.senellart@systrangroup.com"],"author_id":["dakun-zhang","jungi-kim","josep-m-crego","jean-senellart"],"abstract":"Training efficiency is one of the main problems for Neural Machine Translation (NMT). Deep networks need for very large data as well as many training iterations to achieve state-of-the-art performance. This results in very high computation cost, slowing down research and industrialisation. In this paper, we propose to alleviate this problem with several training methods based on data boosting and bootstrap with no modifications to the neural network. It imitates the learning process of humans, which typically spend more time when learning {``}difficult{''} concepts than easier ones. We experiment on an English-French translation task showing accuracy improvements of up to 1.63 BLEU while saving 20{\\%} of training time.","pages":"271--276","url":"https:\/\/www.aclweb.org\/anthology\/I17-2046","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2047","title":"Improving {J}apanese-to-{E}nglish Neural Machine Translation by Voice Prediction","authors":["Yamagishi, Hayahide","Kanouchi, Shin","Sato, Takayuki","Komachi, Mamoru"],"emails":["","","",""],"author_id":["hayahide-yamagishi","shin-kanouchi","takayuki-sato","mamoru-komachi"],"abstract":"This study reports an attempt to predict the voice of reference using the information from the input sentences or previous input\/output sentences. Our previous study presented a voice controlling method to generate sentences for neural machine translation, wherein it was demonstrated that the BLEU score improved when the voice of generated sentence was controlled relative to that of the reference. However, it is impractical to use the reference information because we cannot discern the voice of the correct translation in advance. Thus, this study presents a voice prediction method for generated sentences for neural machine translation. While evaluating on Japanese-to-English translation, we obtain a 0.70-improvement in the BLEU using the predicted voice.","pages":"277--282","url":"https:\/\/www.aclweb.org\/anthology\/I17-2047","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2048","title":"Utilizing Lexical Similarity between Related, Low-resource Languages for Pivot-based {SMT}","authors":["Kunchukuttan, Anoop","Shah, Maulik","Prakash, Pradyot","Bhattacharyya, Pushpak"],"emails":["anoopk@cse.iitb.ac.in","maulik.shah@cse.iitb.ac.in","pradyot@cse.iitb.ac.in","pb@cse.iitb.ac.in"],"author_id":["anoop-kunchukuttan","maulik-shah","pradyot-prakash","pushpak-bhattacharyya"],"abstract":"We investigate pivot-based translation between related languages in a low resource, phrase-based SMT setting. We show that a subword-level pivot-based SMT model using a related pivot language is substantially better than word and morpheme-level pivot models. It is also highly competitive with the best direct translation model, which is encouraging as no direct source-target training corpus is used. We also show that combining multiple related language pivot models can rival a direct translation model. Thus, the use of subwords as translation units coupled with multiple related pivot languages can compensate for the lack of a direct parallel corpus.","pages":"283--289","url":"https:\/\/www.aclweb.org\/anthology\/I17-2048","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2049","title":"Key-value Attention Mechanism for Neural Machine Translation","authors":["Mino, Hideya","Utiyama, Masao","Sumita, Eiichiro","Tokunaga, Takenobu"],"emails":["mino.h-gq@nhk.or.jp","mutiyama@nict.go.jp","eiichiro.sumita@nict.go.jp","take@c.titech.ac.jp"],"author_id":["hideya-mino","masao-utiyama","eiichiro-sumita","takenobu-tokunaga"],"abstract":"In this paper, we propose a neural machine translation (NMT) with a key-value attention mechanism on the source-side encoder. The key-value attention mechanism separates the source-side content vector into two types of memory known as the key and the value. The key is used for calculating the attention distribution, and the value is used for encoding the context representation. Experiments on three different tasks indicate that our model outperforms an NMT model with a conventional attention mechanism. Furthermore, we perform experiments with a conventional NMT framework, in which a part of the initial value of a weight matrix is set to zero so that the matrix is as the same initial-state as the key-value attention mechanism. As a result, we obtain comparable results with the key-value attention mechanism without changing the network structure.","pages":"290--295","url":"https:\/\/www.aclweb.org\/anthology\/I17-2049","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2050","title":"Transfer Learning across Low-Resource, Related Languages for Neural Machine Translation","authors":["Nguyen, Toan Q.","Chiang, David"],"emails":["tnguye28@nd.edu","dchiang@nd.edu"],"author_id":["toan-q-nguyen","david-chiang"],"abstract":"We present a simple method to improve neural translation of a low-resource language pair using parallel data from a related, also low-resource, language pair. The method is based on the transfer method of Zoph et al., but whereas their method ignores any source vocabulary overlap, ours exploits it. First, we split words using Byte Pair Encoding (BPE) to increase vocabulary overlap. Then, we train a model on the first language pair and transfer its parameters, including its source word embeddings, to another model and continue training on the second language pair. Our experiments show that transfer learning helps word-based translation only slightly, but when used on top of a much stronger BPE baseline, it yields larger improvements of up to 4.3 BLEU.","pages":"296--301","url":"https:\/\/www.aclweb.org\/anthology\/I17-2050","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2051","title":"Concept Equalization to Guide Correct Training of Neural Machine Translation","authors":["Kim, Kangil","Shin, Jong-Hun","Na, Seung-Hoon","Jung, SangKeun"],"emails":["","","",""],"author_id":["kangil-kim","jong-hun-shin","seung-hoon-na","sangkeun-jung"],"abstract":"Neural machine translation decoders are usually conditional language models to sequentially generate words for target sentences. This approach is limited to find the best word composition and requires help of explicit methods as beam search. To help learning correct compositional mechanisms in NMTs, we propose concept equalization using direct mapping distributed representations of source and target sentences. In a translation experiment from English to French, the concept equalization significantly improved translation quality by 3.00 BLEU points compared to a state-of-the-art NMT model.","pages":"302--307","url":"https:\/\/www.aclweb.org\/anthology\/I17-2051","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2052","title":"{P}ub{M}ed 200k {RCT}: a Dataset for Sequential Sentence Classification in Medical Abstracts","authors":["Dernoncourt, Franck","Lee, Ji Young"],"emails":["dernonco@adobe.com","jjylee@mit.edu"],"author_id":["franck-dernoncourt","ji-young-lee"],"abstract":"We present PubMed 200k RCT, a new dataset based on PubMed for sequential sentence classification. The dataset consists of approximately 200,000 abstracts of randomized controlled trials, totaling 2.3 million sentences. Each sentence of each abstract is labeled with their role in the abstract using one of the following classes: background, objective, method, result, or conclusion. The purpose of releasing this dataset is twofold. First, the majority of datasets for sequential short-text classification (i.e., classification of short texts that appear in sequences) are small: we hope that releasing a new large dataset will help develop more accurate algorithms for this task. Second, from an application perspective, researchers need better tools to efficiently skim through the literature. Automatically classifying each sentence in an abstract would help researchers read abstracts more efficiently, especially in fields where abstracts may be long, such as the medical field.","pages":"308--313","url":"https:\/\/www.aclweb.org\/anthology\/I17-2052","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2053","title":"A Parallel Corpus of Python Functions and Documentation Strings for Automated Code Documentation and Code Generation","authors":["Miceli Barone, Antonio Valerio","Sennrich, Rico"],"emails":["amiceli@inf.ed.ac.uk","rico.sennrich@ed.ac.uk"],"author_id":["antonio-valerio-miceli-barone","rico-sennrich"],"abstract":"Automated documentation of programming source code and automated code generation from natural language are challenging tasks of both practical and scientific interest. Progress in these areas has been limited by the low availability of parallel corpora of code and natural language descriptions, which tend to be small and constrained to specific domains. In this work we introduce a large and diverse parallel corpus of a hundred thousands Python functions with their documentation strings ({``}docstrings{''}) generated by scraping open source repositories on GitHub. We describe baseline results for the code documentation and code generation tasks obtained by neural machine translation. We also experiment with data augmentation techniques to further increase the amount of training data. We release our datasets and processing scripts in order to stimulate research in these areas.","pages":"314--319","url":"https:\/\/www.aclweb.org\/anthology\/I17-2053","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2054","title":"Building Large {C}hinese Corpus for Spoken Dialogue Research in Specific Domains","authors":["Li, Changliang","Wang, Xiuying"],"emails":["changliang.li@ia.ac.cn","xiuying.wang@ia.ac.cn"],"author_id":["changliang-li","xiuying-wang"],"abstract":"Corpus is a valuable resource for information retrieval and data-driven natural language processing systems,especially for spoken dialogue research in specific domains. However,there is little non-English corpora, particular for ones in Chinese. Spoken by the nation with the largest population in the world, Chinese become increasingly prevalent and popular among millions of people worldwide. In this paper, we build a large-scale and high-quality Chinese corpus, called CSDC (Chinese Spoken Dialogue Corpus). It contains five domains and more than 140 thousand dialogues in all. Each sentence in this corpus is annotated with slot information additionally compared to other corpora. To our best knowledge, this is the largest Chinese spoken dialogue corpus, as well as the first one with slot information. With this corpus, we proposed a method and did a well-designed experiment. The indicative result is reported at last.","pages":"320--324","url":"https:\/\/www.aclweb.org\/anthology\/I17-2054","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2055","title":"Identifying Speakers and Listeners of Quoted Speech in Literary Works","authors":["Yeung, Chak Yan","Lee, John"],"emails":["chak.yeung@my.cityu.edu.hk","jsylee@cityu.edu.hk"],"author_id":["chak-yan-yeung","john-lee"],"abstract":"We present the first study that evaluates both speaker and listener identification for direct speech in literary texts. Our approach consists of two steps: identification of speakers and listeners near the quotes, and dialogue chain segmentation. Evaluation results show that this approach outperforms a rule-based approach that is state-of-the-art on a corpus of literary texts.","pages":"325--329","url":"https:\/\/www.aclweb.org\/anthology\/I17-2055","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2056","title":"Language-Independent Prediction of Psycholinguistic Properties of Words","authors":["Ehara, Yo"],"emails":["y-ehara@aist.go.jp"],"author_id":["yo-ehara"],"abstract":"The psycholinguistic properties of words, namely, word familiarity, age of acquisition, concreteness, and imagery, have been reported to be effective for educational natural language-processing tasks. Previous studies on predicting the values of these properties rely on language-dependent features. This paper is the first to propose a practical language-independent method for predicting such values by using only a large raw corpus in a language. Through experiments, our method successfully predicted the values of these properties in two languages. The results for English were competitive with the reported accuracy achieved using features specific to English.","pages":"330--336","url":"https:\/\/www.aclweb.org\/anthology\/I17-2056","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2057","title":"Correlation Analysis of Chronic Obstructive Pulmonary Disease ({COPD}) and its Biomarkers Using the Word Embeddings","authors":["Yoon, Byeong-Hun","Kim, Yu-Seop"],"emails":["yqudgns1222@gmail.com","yskim01@hallym.ac.kr"],"author_id":["byeong-hun-yoon","yu-seop-kim"],"abstract":"It is very costly and time consuming to find new biomarkers for specific diseases in clinical laboratories. In this study, to find new biomarkers most closely related to Chronic Obstructive Pulmonary Disease (COPD), which is widely known as respiratory disease, biomarkers known to be associated with respiratory diseases and COPD itself were converted into word embedding. And their similarities were measured. We used Word2Vec, Canonical Correlation Analysis (CCA), and Global Vector (GloVe) for word embedding. In order to replace the clinical evaluation, the titles and abstracts of papers retrieved from Google Scholars were analyzed and quantified to estimate the performance of the word em-bedding models.","pages":"337--342","url":"https:\/\/www.aclweb.org\/anthology\/I17-2057","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2058","title":"Reference-based Metrics can be Replaced with Reference-less Metrics in Evaluating Grammatical Error Correction Systems","authors":["Asano, Hiroki","Mizumoto, Tomoya","Inui, Kentaro"],"emails":["asano@ecei.tohoku.ac.jp","tomoya.mizumoto@riken.jp","inui@ecei.tohoku.ac.jp"],"author_id":["hiroki-asano","tomoya-mizumoto","kentaro-inui"],"abstract":"In grammatical error correction (GEC), automatically evaluating system outputs requires gold-standard references, which must be created manually and thus tend to be both expensive and limited in coverage. To address this problem, a reference-less approach has recently emerged; however, previous reference-less metrics that only consider the criterion of grammaticality, have not worked as well as reference-based metrics. This study explores the potential of extending a prior grammaticality-based method to establish a reference-less evaluation method for GEC systems. Further, we empirically show that a reference-less metric that combines fluency and meaning preservation with grammaticality provides a better estimate of manual scores than that of commonly used reference-based metrics. To our knowledge, this is the first study that provides empirical evidence that a reference-less metric can replace reference-based metrics in evaluating GEC systems.","pages":"343--348","url":"https:\/\/www.aclweb.org\/anthology\/I17-2058","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2059","title":"{CVB}ed: Structuring {CV}s using{W}ord Embeddings","authors":["Garg, Shweta","Singh, Sudhanshu S","Mishra, Abhijit","Dey, Kuntal"],"emails":["bt2k14@dtu.ac.in","sudsing3@in.ibm.com","abhijimi@in.ibm.com","kuntadey@in.ibm.com"],"author_id":["shweta-garg","sudhanshu-s-singh","abhijit-mishra","kuntal-dey"],"abstract":"Automatic analysis of curriculum vitae (CVs) of applicants is of tremendous importance in recruitment scenarios. The semi-structuredness of CVs, however, makes CV processing a challenging task. We propose a solution towards transforming CVs to follow a unified structure, thereby, paving ways for smoother CV analysis. The problem of restructuring is posed as a section relabeling problem, where each section of a given CV gets reassigned to a predefined label. Our relabeling method relies on semantic relatedness computed between section header, content and labels, based on phrase-embeddings learned from a large pool of CVs. We follow different heuristics to measure semantic relatedness. Our best heuristic achieves an F-score of 93.17{\\%} on a test dataset with gold-standard labels obtained using manual annotation.","pages":"349--354","url":"https:\/\/www.aclweb.org\/anthology\/I17-2059","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2060","title":"Leveraging Diverse Lexical Chains to Construct Essays for {C}hinese College Entrance Examination","authors":["Li, Liunian","Wan, Xiaojun","Yao, Jin-ge","Yan, Siming"],"emails":["liliunian@pku.edu.cn","wanxiaojun@pku.edu.cn","yaojinge@pku.edu.cn","dantes@pku.edu.cn"],"author_id":["liunian-li","xiaojun-wan","jin-ge-yao","siming-yan"],"abstract":"In this work we study the challenging task of automatically constructing essays for Chinese college entrance examination where the topic is specified in advance. We explore a sentence extraction framework based on diversified lexical chains to capture coherence and richness. Experimental analysis shows the effectiveness of our approach and reveals the importance of information richness in essay writing.","pages":"355--360","url":"https:\/\/www.aclweb.org\/anthology\/I17-2060","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2061","title":"Draw and Tell: Multimodal Descriptions Outperform Verbal- or Sketch-Only Descriptions in an Image Retrieval Task","authors":["Han, Ting","Schlangen, David"],"emails":["ting.han@uni-bielefeld.de","david.schlangen@uni-bielefeld.de"],"author_id":["ting-han","david-schlangen"],"abstract":"While language conveys meaning largely symbolically, actual communication acts typically contain iconic elements as well: People gesture while they speak, or may even draw sketches while explaining something. Image retrieval prima facie seems like a task that could profit from combined symbolic and iconic reference, but it is typically set up to work either from language only, or via (iconic) sketches with no verbal contribution. Using a model of grounded language semantics and a model of sketch-to-image mapping, we show that adding even very reduced iconic information to a verbal image description improves recall. Verbal descriptions paired with fully detailed sketches still perform better than these sketches alone. We see these results as supporting the assumption that natural user interfaces should respond to multimodal input, where possible, rather than just language alone.","pages":"361--365","url":"https:\/\/www.aclweb.org\/anthology\/I17-2061","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2062","title":"Grammatical Error Correction with Neural Reinforcement Learning","authors":["Sakaguchi, Keisuke","Post, Matt","Van Durme, Benjamin"],"emails":["keisuke@cs.jhu.edu","post@cs.jhu.edu","vandurme@cs.jhu.edu"],"author_id":["keisuke-sakaguchi","matt-post","benjamin-van-durme"],"abstract":"We propose a neural encoder-decoder model with reinforcement learning (NRL) for grammatical error correction (GEC). Unlike conventional maximum likelihood estimation (MLE), the model directly optimizes towards an objective that considers a sentence-level, task-specific evaluation metric, avoiding the exposure bias issue in MLE. We demonstrate that NRL outperforms MLE both in human and automated evaluation metrics, achieving the state-of-the-art on a fluency-oriented GEC corpus.","pages":"366--372","url":"https:\/\/www.aclweb.org\/anthology\/I17-2062","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2063","title":"Coreference Resolution on Math Problem Text in {J}apanese","authors":["Ito, Takumi","Matsuzaki, Takuya","Sato, Satoshi"],"emails":["i@nuee.nagoya-u.ac.jp","matuzaki@nuee.nagoya-u.ac.jp","ssato@nuee.nagoya-u.ac.jp"],"author_id":["takumi-ito","takuya-matsuzaki","satoshi-sato"],"abstract":"This paper describes a coreference resolution system for math problem text. Case frame dictionaries and a math taxonomy are utilized for supplying domain knowledge. The system deals with various anaphoric phenomena beyond well-studied entity coreferences.","pages":"373--377","url":"https:\/\/www.aclweb.org\/anthology\/I17-2063","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2064","title":"Utilizing Visual Forms of {J}apanese Characters for Neural Review Classification","authors":["Toyama, Yota","Miwa, Makoto","Sasaki, Yutaka"],"emails":["sd16423@toyota-ti.ac.jp","miwa-makoto@toyota-ti.ac.jp","yutaka.sasaki@toyota-ti.ac.jp"],"author_id":["yota-toyama","makoto-miwa","yutaka-sasaki"],"abstract":"We propose a novel method that exploits visual information of ideograms and logograms in analyzing Japanese review documents. Our method first converts font images of Japanese characters into character embeddings using convolutional neural networks. It then constructs document embeddings from the character embeddings based on Hierarchical Attention Networks, which represent the documents based on attention mechanisms from a character level to a sentence level. The document embeddings are finally used to predict the labels of documents. Our method provides a way to exploit visual features of characters in languages with ideograms and logograms. In the experiments, our method achieved an accuracy comparable to a character embedding-based model while our method has much fewer parameters since it does not need to keep embeddings of thousands of characters.","pages":"378--382","url":"https:\/\/www.aclweb.org\/anthology\/I17-2064","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2065","title":"A Multi-task Learning Approach to Adapting Bilingual Word Embeddings for Cross-lingual Named Entity Recognition","authors":["Wang, Dingquan","Peng, Nanyun","Duh, Kevin"],"emails":["wdd@cs.jhu.edu","npeng@isi.edu","kevinduh@cs.jhu.edu"],"author_id":["dingquan-wang","nanyun-peng","kevin-duh"],"abstract":"We show how to adapt bilingual word embeddings (BWE{'}s) to bootstrap a cross-lingual name-entity recognition (NER) system in a language with no labeled data. We assume a setting where we are given a comparable corpus with NER labels for the source language only; our goal is to build a NER model for the target language. The proposed multi-task model jointly trains bilingual word embeddings while optimizing a NER objective. This creates word embeddings that are both shared between languages and fine-tuned for the NER task.","pages":"383--388","url":"https:\/\/www.aclweb.org\/anthology\/I17-2065","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2066","title":"Investigating the Effect of Conveying Understanding Results in Chat-Oriented Dialogue Systems","authors":["Mitsuda, Koh","Higashinaka, Ryuichiro","Tomita, Junji"],"emails":["mitsuda.ko@lab.ntt.co.jp","higashinaka.ryuichiro@lab.ntt.co.jp","tomita.junji@lab.ntt.co.jp"],"author_id":["koh-mitsuda","ryuichiro-higashinaka","junji-tomita"],"abstract":"In dialogue systems, conveying understanding results of user utterances is important because it enables users to feel understood by the system. However, it is not clear what types of understanding results should be conveyed to users; some utterances may be offensive and some may be too commonsensical. In this paper, we explored the effect of conveying understanding results of user utterances in a chat-oriented dialogue system by an experiment using human subjects. As a result, we found that only certain types of understanding results, such as those related to a user{'}s permanent state, are effective to improve user satisfaction. This paper clarifies the types of understanding results that can be safely uttered by a system.","pages":"389--394","url":"https:\/\/www.aclweb.org\/anthology\/I17-2066","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2067","title":"Extracting and Understanding Contrastive Opinion through Topic Relevant Sentences","authors":["Ibeke, Ebuka","Lin, Chenghua","Wyner, Adam","Barawi, Mohamad Hardyman"],"emails":["e.e.ibeke@abdn.ac.uk","chenghua.lin@abdn.ac.uk","azwyner@abdn.ac.uk","r01mhbb@abdn.ac.uk"],"author_id":["ebuka-ibeke","chenghua-lin","adam-wyner","mohamad-hardyman-barawi"],"abstract":"Contrastive opinion mining is essential in identifying, extracting and organising opinions from user generated texts. Most existing studies separate input data into respective collections. In addition, the relationships between the topics extracted and the sentences in the corpus which express the topics are opaque, hindering our understanding of the opinions expressed in the corpus. We propose a novel unified latent variable model (contraLDA) which addresses the above matters. Experimental results show the effectiveness of our model in mining contrasted opinions, outperforming our baselines.","pages":"395--400","url":"https:\/\/www.aclweb.org\/anthology\/I17-2067","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2068","title":"{CWIG}3{G}2 - Complex Word Identification Task across Three Text Genres and Two User Groups","authors":["Yimam, Seid Muhie","{\\v{S}}tajner, Sanja","Riedl, Martin","Biemann, Chris"],"emails":["yimam@informatik.uni-hamburg.de","sanja@informatik.uni-mannheim.de","riedl@informatik.uni-hamburg.de","biemann@informatik.uni-hamburg.de"],"author_id":["seid-muhie-yimam","sanja-stajner","martin-riedl","chris-biemann"],"abstract":"Complex word identification (CWI) is an important task in text accessibility. However, due to the scarcity of CWI datasets, previous studies have only addressed this problem on Wikipedia sentences and have solely taken into account the needs of non-native English speakers. We collect a new CWI dataset (CWIG3G2) covering three text genres News, WikiNews, and Wikipedia) annotated by both native and non-native English speakers. Unlike previous datasets, we cover single words, as well as complex phrases, and present them for judgment in a paragraph context. We present the first study on cross-genre and cross-group CWI, showing measurable influences in native language and genre types.","pages":"401--407","url":"https:\/\/www.aclweb.org\/anthology\/I17-2068","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2069","title":"Generating Stylistically Consistent Dialog Responses with Transfer Learning","authors":["Akama, Reina","Inada, Kazuaki","Inoue, Naoya","Kobayashi, Sosuke","Inui, Kentaro"],"emails":["1reina.a@ecei.tohoku.ac.jp","2kazuaki.inada@ecei.tohoku.ac.jp","3naoya-i@ecei.tohoku.ac.jp","4sosk@preferred.jp","5inui@ecei.tohoku.ac.jp"],"author_id":["reina-akama","kazuaki-inada","naoya-inoue","sosuke-kobayashi","kentaro-inui"],"abstract":"We propose a novel, data-driven, and stylistically consistent dialog response generation system. To create a user-friendly system, it is crucial to make generated responses not only appropriate but also stylistically consistent. For leaning both the properties effectively, our proposed framework has two training stages inspired by transfer learning. First, we train the model to generate appropriate responses, and then we ensure that the responses have a specific style. Experimental results demonstrate that the proposed method produces stylistically consistent responses while maintaining the appropriateness of the responses learned in a general domain.","pages":"408--412","url":"https:\/\/www.aclweb.org\/anthology\/I17-2069","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2070","title":"Learning to Explain Non-Standard {E}nglish Words and Phrases","authors":["Ni, Ke","Wang, William Yang"],"emails":["",""],"author_id":["ke-ni","william-yang-wang"],"abstract":"We describe a data-driven approach for automatically explaining new, non-standard English expressions in a given sentence, building on a large dataset that includes 15 years of crowdsourced examples from UrbanDictionary.com. Unlike prior studies that focus on matching keywords from a slang dictionary, we investigate the possibility of learning a neural sequence-to-sequence model that generates explanations of unseen non-standard English expressions given context. We propose a dual encoder approach{---}a word-level encoder learns the representation of context, and a second character-level encoder to learn the hidden representation of the target non-standard expression. Our model can produce reasonable definitions of new non-standard English expressions given their context with certain confidence.","pages":"413--417","url":"https:\/\/www.aclweb.org\/anthology\/I17-2070","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2071","title":"Towards Abstractive Multi-Document Summarization Using Submodular Function-Based Framework, Sentence Compression and Merging","authors":["Chali, Yllias","Tanvee, Moin","Nayeem, Mir Tafseer"],"emails":["chali@cs.uleth.ca","tanvee@uleth.ca","mir.nayeem@uleth.ca"],"author_id":["yllias-chali","moin-tanvee","mir-tafseer-nayeem"],"abstract":"We propose a submodular function-based summarization system which integrates three important measures namely importance, coverage, and non-redundancy to detect the important sentences for the summary. We design monotone and submodular functions which allow us to apply an efficient and scalable greedy algorithm to obtain informative and well-covered summaries. In addition, we integrate two abstraction-based methods namely sentence compression and merging for generating an abstractive sentence set. We design our summarization models for both generic and query-focused summarization. Experimental results on DUC-2004 and DUC-2007 datasets show that our generic and query-focused summarizers have outperformed the state-of-the-art summarization systems in terms of ROUGE-1 and ROUGE-2 recall and F-measure.","pages":"418--424","url":"https:\/\/www.aclweb.org\/anthology\/I17-2071","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2072","title":"Domain Adaptation for Relation Extraction with Domain Adversarial Neural Network","authors":["Fu, Lisheng","Nguyen, Thien Huu","Min, Bonan","Grishman, Ralph"],"emails":["lisheng@cs.nyu.edu","thien@cs.uoregon.edu","bonan.min@raytheon.com","grishman@cs.nyu.edu"],"author_id":["lisheng-fu","thien-huu-nguyen","bonan-min","ralph-grishman"],"abstract":"Relations are expressed in many domains such as newswire, weblogs and phone conversations. Trained on a source domain, a relation extractor{'}s performance degrades when applied to target domains other than the source. A common yet labor-intensive method for domain adaptation is to construct a target-domain-specific labeled dataset for adapting the extractor. In response, we present an unsupervised domain adaptation method which only requires labels from the source domain. Our method is a joint model consisting of a CNN-based relation classifier and a domain-adversarial classifier. The two components are optimized jointly to learn a domain-independent representation for prediction on the target domain. Our model outperforms the state-of-the-art on all three test domains of ACE 2005.","pages":"425--429","url":"https:\/\/www.aclweb.org\/anthology\/I17-2072","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2073","title":"Lexical Simplification with the Deep Structured Similarity Model","authors":["Pereira, Lis","Liu, Xiaodong","Lee, John"],"emails":["kanash@wni.com","xiaodl@microsoft.com","jsylee@cityu.edu.hk"],"author_id":["lis-pereira","xiaodong-liu","john-lee"],"abstract":"We explore the application of a Deep Structured Similarity Model (DSSM) to ranking in lexical simplification. Our results show that the DSSM can effectively capture fine-grained features to perform semantic matching when ranking substitution candidates, outperforming the state-of-the-art on two standard datasets used for the task.","pages":"430--435","url":"https:\/\/www.aclweb.org\/anthology\/I17-2073","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2074","title":"Proofread Sentence Generation as Multi-Task Learning with Editing Operation Prediction","authors":["Hitomi, Yuta","Tamori, Hideaki","Okazaki, Naoaki","Inui, Kentaro"],"emails":["hitomi-y1@asahi.com","tamori-h@asahi.com","okazaki@c.titech.ac.jp","inui@ecei.tohoku.ac.jp"],"author_id":["yuta-hitomi","hideaki-tamori","naoaki-okazaki","kentaro-inui"],"abstract":"This paper explores the idea of robot editors, automated proofreaders that enable journalists to improve the quality of their articles. We propose a novel neural model of multi-task learning that both generates proofread sentences and predicts the editing operations required to rewrite the source sentences and create the proofread ones. The model is trained using logs of the revisions made professional editors revising draft newspaper articles written by journalists. Experiments demonstrate the effectiveness of our multi-task learning approach and the potential value of using revision logs for this task.","pages":"436--441","url":"https:\/\/www.aclweb.org\/anthology\/I17-2074","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2075","title":"An Exploration of Data Augmentation and {RNN} Architectures for Question Ranking in Community Question Answering","authors":["Chen, Charles","Bunescu, Razvan"],"emails":["lc971015@ohio.edu","bunescu@ohio.edu"],"author_id":["charles-chen-jr","razvan-bunescu"],"abstract":"The automation of tasks in community question answering (cQA) is dominated by machine learning approaches, whose performance is often limited by the number of training examples. Starting from a neural sequence learning approach with attention, we explore the impact of two data augmentation techniques on question ranking performance: a method that swaps reference questions with their paraphrases, and training on examples automatically selected from external datasets. Both methods are shown to lead to substantial gains in accuracy over a strong baseline. Further improvements are obtained by changing the model architecture to mirror the structure seen in the data.","pages":"442--447","url":"https:\/\/www.aclweb.org\/anthology\/I17-2075","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"},{"id":"I17-2076","title":"Deriving Consensus for Multi-Parallel Corpora: an {E}nglish {B}ible Study","authors":["Xia, Patrick","Yarowsky, David"],"emails":["paxia@jhu.edu","yarowsky@jhu.edu"],"author_id":["patrick-xia","david-yarowsky"],"abstract":"What can you do with multiple noisy versions of the same text? We present a method which generates a single consensus between multi-parallel corpora. By maximizing a function of linguistic features between word pairs, we jointly learn a single corpus-wide multiway alignment: a consensus between 27 versions of the English Bible. We additionally produce English paraphrases, word-level distributions of tags, and consensus dependency parses. Our method is language independent and applicable to any multi-parallel corpora. Given the Bible{'}s unique role as alignable bitext for over 800 of the world{'}s languages, this consensus alignment and resulting resources offer value for multilingual annotation projection, and also shed potential insights into the Bible itself.","pages":"448--453","url":"https:\/\/www.aclweb.org\/anthology\/I17-2076","publisher":"Asian Federation of Natural Language Processing","address":"Taipei, Taiwan","year":"2017","month":"November","booktitle":"Proceedings of the Eighth International Joint Conference on Natural Language Processing (Volume 2: Short Papers)"}]