[{"id":"W16-4701","title":"Analyzing Impact, Trend, and Diffusion of Knowledge associated with Neoplasms Research","authors":["Song, Min"],"emails":["min.song@yonsei.ac.kr"],"author_id":["min-song"],"abstract":"Cancer (a.k.a neoplasms in a broader sense) is one of the leading causes of death worldwide and its incidence is expected to exacerbate. To respond to the critical need from the society, there have been rigorous attempts for the cancer research community to develop treatment for cancer. Accordingly, we observe a surge in the sheer volume of research products and outcomes in relation to neoplasms. In this talk, we introduce the notion of entitymetrics to provide a new lens for understanding the impact, trend, and diffusion of knowledge associated with neoplasms research. To this end, we collected over two million records from PubMed, the most popular search engine in the medical domain. Coupled with text mining techniques including named entity recognition, sentence boundary detection, string approximate matching, entitymetrics enables us to analyze knowledge diffusion, impact, and trend at various knowledge entity units, such as bio-entity, organization, and country. At the end of the talk, the future applications and possible directions of entitymetrics will be discussed.","pages":"1","url":"https:\/\/www.aclweb.org\/anthology\/W16-4701","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4702","title":"Local-Global Vectors to Improve Unigram Terminology Extraction","authors":["Amjadian, Ehsan","Inkpen, Diana","Paribakht, Tahereh","Faez, Farahnaz"],"emails":["ehsan.amjadian@carleotn.ca","diana@site.uottawa.ca","sima.paribakht@uottawa.ca","ffaez@uwo.ca"],"author_id":["ehsan-amjadian","diana-inkpen","tahereh-paribakht","farahnaz-faez"],"abstract":"The present paper explores a novel method that integrates efficient distributed representations with terminology extraction. We show that the information from a small number of observed instances can be combined with local and global word embeddings to remarkably improve the term extraction results on unigram terms. To do so we pass the terms extracted by other tools to a filter made of the local-global embeddings and a classifier which in turn decides whether or not a term candidate is a term. The filter can also be used as a hub to merge different term extraction tools into a single higher-performing system. We compare filters that use the skip-gram architecture and filters that employ the CBOW architecture for the task at hand.","pages":"2--11","url":"https:\/\/www.aclweb.org\/anthology\/W16-4702","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4703","title":"Recognition of non-domain phrases in automatically extracted lists of terms","authors":["Mykowiecka, Agnieszka","Marciniak, Malgorzata","Rychlik, Piotr"],"emails":["agn@ipipan.waw.pl","mm@ipipan.waw.pl","rychlik@ipipan.waw.pl"],"author_id":["agnieszka-mykowiecka","malgorzata-marciniak","piotr-rychlik"],"abstract":"In the paper, we address the problem of recognition of non-domain phrases in terminology lists obtained with an automatic term extraction tool. We focus on identification of multi-word phrases that are general terms and discourse function expressions. We tested several methods based on domain corpora comparison and a method based on contexts of phrases identified in a large corpus of general language. We compared the results of the methods to manual annotation. The results show that the task is quite hard as the inter-annotator agreement is low. Several tested methods achieved similar overall results, although the phrase ordering varied between methods. The most successful method with the precision about 0.75 at the half of the tested list was the context based method using a modified contextual diversity coefficient.","pages":"12--20","url":"https:\/\/www.aclweb.org\/anthology\/W16-4703","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4704","title":"Contextual term equivalent search using domain-driven disambiguation","authors":["Barri{\\`e}re, Caroline","M{\\'e}nard, Pierre Andr{\\'e}","Azoulay, Daphn{\\'e}e"],"emails":["barrieca@crim.ca","menardpa@crim.ca","daphnee.azoulay@umontreal.ca"],"author_id":["caroline-barriere","pierre-andre-menard","daphnee-azoulay"],"abstract":"This article presents a domain-driven algorithm for the task of term sense disambiguation (TSD). TSD aims at automatically choosing which term record from a term bank best represents the meaning of a term occurring in a particular context. In a translation environment, finding the contextually appropriate term record is necessary to access the proper equivalent to be used in the target language text. The term bank TERMIUM Plus, recently published as an open access repository, is chosen as a domain-rich resource for testing our TSD algorithm, using English and French as source and target languages. We devise an experiment using over 1300 English terms found in scientific articles, and show that our domain-driven TSD algorithm is able to bring the best term record, and therefore the best French equivalent, at the average rank of 1.69 compared to a baseline random rank of 3.51.","pages":"21--29","url":"https:\/\/www.aclweb.org\/anthology\/W16-4704","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4705","title":"A Method of Augmenting Bilingual Terminology by Taking Advantage of the Conceptual Systematicity of Terminologies","authors":["Iwai, Miki","Takeuchi, Koichi","Kageura, Kyo","Ishibashi, Kazuya"],"emails":["mikii@g.ecc.u-tokyo.ac.jp","koichi@cl.cs.okayama-u.ac.jp","kyo@p.u-tokyo.ac.jp","ploi5t2g@cl.cs.okayama-u.ac.jp"],"author_id":["miki-iwai","koichi-takeuchi","kyo-kageura","kazuya-ishibashi"],"abstract":"In this paper, we propose a method of augmenting existing bilingual terminologies. Our method belongs to a {``}generate and validate{''} framework rather than extraction from corpora. Although many studies have proposed methods to find term translations or to augment terminology within a {``}generate and validate{''} framework, few has taken full advantage of the systematic nature of terminologies. A terminology of a domain represents the conceptual system of the domain fairly systematically, and we contend that making use of the systematicity fully will greatly contribute to the effective augmentation of terminologies. This paper proposes and evaluates a novel method to generate bilingual term candidates by using existing terminologies and delving into their systematicity. Experiments have shown that our method can generate much better term candidate pairs than the existing method and give improved performance for terminology augmentation.","pages":"30--40","url":"https:\/\/www.aclweb.org\/anthology\/W16-4705","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4706","title":"Acquisition of semantic relations between terms: how far can we get with standard {NLP} tools?","authors":["Roesiger, Ina","Bettinger, Julia","Sch{\\\"a}fer, Johannes","Dorna, Michael","Heid, Ulrich"],"emails":["roesigia@ims.uni-stuttgart.de","bettinja@ims.uni-stuttgart.de","schaefjs@ims.uni-stuttgart.de","michael.dorna@de.bosch.com","heid@uni-hildesheim.de"],"author_id":["ina-roesiger","julia-bettinger","johannes-schafer","michael-dorna","ulrich-heid"],"abstract":"The extraction of data exemplifying relations between terms can make use, at least to a large extent, of techniques that are similar to those used in standard hybrid term candidate extraction, namely basic corpus analysis tools (e.g. tagging, lemmatization, parsing), as well as morphological analysis of complex words (compounds and derived items). In this article, we discuss the use of such techniques for the extraction of raw material for a description of relations between terms, and we provide internal evaluation data for the devices developed. We claim that user-generated content is a rich source of term variation through paraphrasing and reformulation, and that these provide relational data at the same time as term variants. Germanic languages with their rich word formation morphology may be particularly good candidates for the approach advocated here.","pages":"41--51","url":"https:\/\/www.aclweb.org\/anthology\/W16-4706","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4707","title":"Evaluation of distributional semantic models: a holistic approach","authors":["Bernier-Colborne, Gabriel","Drouin, Patrick"],"emails":["gabriel.bernier-colborne@umontreal.ca","patrick.drouin@umontreal.ca"],"author_id":["gabriel-bernier-colborne","patrick-drouin"],"abstract":"We investigate how both model-related factors and application-related factors affect the accuracy of distributional semantic models (DSMs) in the context of specialized lexicography, and how these factors interact. This holistic approach to the evaluation of DSMs provides valuable guidelines for the use of these models and insight into the kind of semantic information they capture.","pages":"52--61","url":"https:\/\/www.aclweb.org\/anthology\/W16-4707","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4708","title":"A Study on the Interplay Between the Corpus Size and Parameters of a Distributional Model for Term Classification","authors":["QasemiZadeh, Behrang"],"emails":["zadeh@phil.hhu.de"],"author_id":["behrang-qasemizadeh"],"abstract":"We propose and evaluate a method for identifying co-hyponym lexical units in a terminological resource. The principles of term recognition and distributional semantics are combined to extract terms from a similar category of concept. Given a set of candidate terms, random projections are employed to represent them as low-dimensional vectors. These vectors are derived automatically from the frequency of the co-occurrences of the candidate terms and words that appear within windows of text in their proximity (context-windows). In a $k$-nearest neighbours framework, these vectors are classified using a small set of manually annotated terms which exemplify concept categories. We then investigate the interplay between the size of the corpus that is used for collecting the co-occurrences and a number of factors that play roles in the performance of the proposed method: the configuration of context-windows for collecting co-occurrences, the selection of neighbourhood size ($k$), and the choice of similarity metric.","pages":"62--72","url":"https:\/\/www.aclweb.org\/anthology\/W16-4708","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4709","title":"Pattern-based Word Sketches for the Extraction of Semantic Relations","authors":["Le{\\'o}n-Ara{\\'u}z, Pilar","San Mart{\\'\\i}n, Antonio","Faber, Pamela"],"emails":["pleon@ugr.es","antonio.sanmartin@nuim.ie","pfaber@ugr.es"],"author_id":["pilar-leon-arauz","antonio-san-martin","pamela-faber"],"abstract":"Despite advances in computer technology, terminologists still tend to rely on manual work to extract all the semantic information that they need for the description of specialized concepts. In this paper we propose the creation of new word sketches in Sketch Engine for the extraction of semantic relations. Following a pattern-based approach, new sketch grammars are devel-oped in order to extract some of the most common semantic relations used in the field of ter-minology: generic-specific, part-whole, location, cause and function.","pages":"73--82","url":"https:\/\/www.aclweb.org\/anthology\/W16-4709","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4710","title":"Constructing and Evaluating Controlled Bilingual Terminologies","authors":["Miyata, Rei","Kageura, Kyo"],"emails":["rei@p.u-tokyo.ac.jp","kyo@p.u-tokyo.ac.jp"],"author_id":["rei-miyata","kyo-kageura"],"abstract":"This paper presents the construction and evaluation of Japanese and English controlled bilingual terminologies that are particularly intended for controlled authoring and machine translation with special reference to the Japanese municipal domain. Our terminologies are constructed by extracting terms from municipal website texts, and the term variations are controlled by defining preferred and proscribed terms for both the source Japanese and the target English. To assess the coverage of the terms\/concepts in the municipal domain and validate the quality of the control, we employ a quantitative extrapolation method that estimates the potential vocabulary size. Using Large-Number-of-Rare-Event (LNRE) modelling, we compare two parameters: (1) uncontrolled and controlled and (2) Japanese and English. The results show that our terminologies currently cover about 45{--}65{\\%} of the terms and 50{--}65{\\%} of the concepts in the municipal domain, and are well controlled. The detailed analysis of growth patterns of terminologies also provides insight into the extent to which we can enlarge the terminologies within the realistic range.","pages":"83--93","url":"https:\/\/www.aclweb.org\/anthology\/W16-4710","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4711","title":"Providing and Analyzing {NLP} Terms for our Community","authors":["Francopoulo, Gil","Mariani, Joseph","Paroubek, Patrick","Vernier, Fr{\\'e}d{\\'e}ric"],"emails":["gil.francopoulo@wanadoo.fr","mariani@limsi.fr","pap@limsi.fr","ernier@limsi.fr"],"author_id":["gil-francopoulo","joseph-mariani","patrick-paroubek","frederic-vernier"],"abstract":"By its own nature, the Natural Language Processing (NLP) community is a priori the best equipped to study the evolution of its own publications, but works in this direction are rare and only recently have we seen a few attempts at charting the field. In this paper, we use the algorithms, resources, standards, tools and common practices of the NLP field to build a list of terms characteristic of ongoing research, by mining a large corpus of scientific publications, aiming at the largest possible exhaustivity and covering the largest possible time span. Study of the evolution of this term list through time reveals interesting insights on the dynamics of field and the availability of the term database and of the corpus (for a large part) make possible many further comparative studies in addition to providing a test field for a new graphic interface designed to perform visual time analytics of large sized thesauri.","pages":"94--103","url":"https:\/\/www.aclweb.org\/anthology\/W16-4711","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4712","title":"Evaluating a dictionary of human phenotype terms focusing on rare diseases","authors":["Kocbek, Simon","Fujiwara, Toyofumi","Kim, Jin-Dong","Takagi, Toshihisa","Groza, Tudor"],"emails":["skocbek@gmail.com","fujiwara@dbcls.rois.ac.jp","jdkim@dbcls.rois.ac.jp","tt@bs.s.u-tokyo.ac.jp","t.groza@garvan.org.au"],"author_id":["simon-kocbek","toyofumi-fujiwara","jin-dong-kim","toshihisa-takagi","tudor-groza"],"abstract":"Annotating medical text such as clinical notes with human phenotype descriptors is an important task that can, for example, assist in building patient profiles. To automatically annotate text one usually needs a dictionary of predefined terms. However, do to the variety of human expressiveness, current state-of-the art phenotype concept recognizers and automatic annotators struggle with specific domain issues and challenges. In this paper we present results of an-notating gold standard corpus with a dictionary containing lexical variants for the Human Phenotype Ontology terms. The main purpose of the dictionary is to improve the recall of phenotype concept recognition systems. We compare the method with four other approaches and present results.","pages":"104--109","url":"https:\/\/www.aclweb.org\/anthology\/W16-4712","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4713","title":"A semi automatic annotation approach for ontological and terminological knowledge acquisition","authors":["Sadoun, Driss"],"emails":["driss.sadoun@u-paris10.fr"],"author_id":["driss-sadoun"],"abstract":"We propose a semi-automatic method for the acquisition of specialised ontological and terminological knowledge. An ontology and a terminology are automatically built from domain experts{'} annotations. The ontology formalizes the common and shared conceptual vocabulary of those experts. Its associated terminology defines a glossary linking annotated terms to their semantic categories. These two resources evolve incrementally and are used for an automatic annotation of a new corpus at each iteration. The annotated corpus concerns the evaluation of French higher education and science institutions.","pages":"110--120","url":"https:\/\/www.aclweb.org\/anthology\/W16-4713","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"},{"id":"W16-4714","title":"Understanding Medical free text: A Terminology driven approach","authors":["Krishna, Santosh Sai","Hans, Manoj"],"emails":["gsk.krishna@gmail.com","manojhans1989@gmail.com"],"author_id":["santosh-sai-krishna","manoj-hans"],"abstract":"With many hospitals digitalizing clinical records it has opened opportunities for researchers in NLP, Machine Learning to apply techniques for extracting meaning and make actionable insights. There has been previous attempts in mapping free text to medical nomenclature like UMLS, SNOMED. However, in this paper, we had analyzed diagnosis in clinical reports using ICD10 to achieve a lightweight, real-time predictions by introducing concepts like WordInfo, root word identification. We were able to achieve 68.3{\\%} accuracy over clinical records collected from qualified clinicians. Our study would further help the healthcare institutes in organizing their clinical reports based on ICD10 mappings and derive numerous insights to achieve operational efficiency and better medical care.","pages":"121--125","url":"https:\/\/www.aclweb.org\/anthology\/W16-4714","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the 5th International Workshop on Computational Terminology (Computerm2016)"}]