[{"id":"W16-4801","title":"Discriminating between Similar Languages and {A}rabic Dialect Identification: A Report on the Third {DSL} Shared Task","authors":["Malmasi, Shervin","Zampieri, Marcos","Ljube{\\v{s}}i{\\'c}, Nikola","Nakov, Preslav","Ali, Ahmed","Tiedemann, J{\\\"o}rg"],"emails":["","","","","",""],"author_id":["shervin-malmasi","marcos-zampieri","nikola-ljubesic","preslav-nakov","ahmed-ali","jorg-tiedemann"],"abstract":"We present the results of the third edition of the Discriminating between Similar Languages (DSL) shared task, which was organized as part of the VarDial{'}2016 workshop at COLING{'}2016. The challenge offered two subtasks: subtask 1 focused on the identification of very similar languages and language varieties in newswire texts, whereas subtask 2 dealt with Arabic dialect identification in speech transcripts. A total of 37 teams registered to participate in the task, 24 teams submitted test results, and 20 teams also wrote system description papers. High-order character n-grams were the most successful feature, and the best classification approaches included traditional supervised learning methods such as SVM, logistic regression, and language models, while deep learning approaches did not perform very well.","pages":"1--14","url":"https:\/\/www.aclweb.org\/anthology\/W16-4801","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4802","title":"Discriminating Similar Languages with Linear {SVM}s and Neural Networks","authors":["{\\c{C}}{\\\"o}ltekin, {\\c{C}}a{\\u{g}}r{\\i}","Rama, Taraka"],"emails":["ccoltekin@sfs.uni-tuebingen.de","taraka-rama.kasicheyanula@uni-tuebingen.de"],"author_id":["cagri-coltekin","taraka-rama"],"abstract":"This paper describes the systems we experimented with for participating in the discriminating between similar languages (DSL) shared task 2016. We submitted results of a single system based on support vector machines (SVM) with linear kernel and using character ngram features, which obtained the first rank at the closed training track for test set A. Besides the linear SVM, we also report additional experiments with a number of deep learning architectures. Despite our intuition that non-linear deep learning methods should be advantageous, linear models seems to fare better in this task, at least with the amount of data and the amount of effort we spent on tuning these models.","pages":"15--24","url":"https:\/\/www.aclweb.org\/anthology\/W16-4802","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4803","title":"{LSTM} Autoencoders for Dialect Analysis","authors":["Rama, Taraka","{\\c{C}}{\\\"o}ltekin, {\\c{C}}a{\\u{g}}r{\\i}"],"emails":["taraka-rama.kasicheyanula@uni-tuebingen.de","ccoltekin@sfs.uni-tuebingen.de"],"author_id":["taraka-rama","cagri-coltekin"],"abstract":"Computational approaches for dialectometry employed Levenshtein distance to compute an aggregate similarity between two dialects belonging to a single language group. In this paper, we apply a sequence-to-sequence autoencoder to learn a deep representation for words that can be used for meaningful comparison across dialects. In contrast to the alignment-based methods, our method does not require explicit alignments. We apply our architectures to three different datasets and show that the learned representations indicate highly similar results with the analyses based on Levenshtein distance and capture the traditional dialectal differences shown by dialectologists.","pages":"25--32","url":"https:\/\/www.aclweb.org\/anthology\/W16-4803","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4804","title":"The {GW}\/{LT}3 {V}ar{D}ial 2016 Shared Task System for Dialects and Similar Languages Detection","authors":["Zirikly, Ayah","Desmet, Bart","Diab, Mona"],"emails":["ayaz@gwu.edu","bart.desmet@ugent.be","mtdiab@gwu.edu"],"author_id":["ayah-zirikly","bart-desmet","mona-diab"],"abstract":"This paper describes the GW\/LT3 contribution to the 2016 VarDial shared task on the identification of similar languages (task 1) and Arabic dialects (task 2). For both tasks, we experimented with Logistic Regression and Neural Network classifiers in isolation. Additionally, we implemented a cascaded classifier that consists of coarse and fine-grained classifiers (task 1) and a classifier ensemble with majority voting for task 2. The submitted systems obtained state-of-the art performance and ranked first for the evaluation on social media data (test sets B1 and B2 for task 1), with a maximum weighted F1 score of 91.94{\\%}.","pages":"33--41","url":"https:\/\/www.aclweb.org\/anthology\/W16-4804","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4805","title":"Processing Dialectal {A}rabic: Exploiting Variability and Similarity to Overcome Challenges and Discover Opportunities","authors":["Diab, Mona"],"emails":["mtdiab@email.gwu.edu"],"author_id":["mona-diab"],"abstract":"We recently witnessed an exponential growth in dialectal Arabic usage in both textual data and speech recordings especially in social media. Processing such media is of great utility for all kinds of applications ranging from information extraction to social media analytics for political and commercial purposes to building decision support systems. Compared to other languages, Arabic, especially the informal variety, poses a significant challenge to natural language processing algorithms since it comprises multiple dialects, linguistic code switching, and a lack of standardized orthographies, to top its relatively complex morphology. Inherently, the problem of processing Arabic in the context of social media is the problem of how to handle resource poor languages. In this talk I will go over some of our insights to some of these problems and show how there is a silver lining where we can generalize some of our solutions to other low resource language contexts.","pages":"42","url":"https:\/\/www.aclweb.org\/anthology\/W16-4805","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4806","title":"Language Related Issues for Machine Translation between Closely Related South {S}lavic Languages","authors":["Popovi{\\'c}, Maja","Ar{\\v{c}}an, Mihael","Klubi{\\v{c}}ka, Filip"],"emails":["maja.popovic@hu-berlin.de","mihael.arcan@insight-centre.org","fklubick@ffzg.hr"],"author_id":["maja-popovic","mihael-arcan","filip-klubicka"],"abstract":"Machine translation between closely related languages is less challenging and exibits a smaller number of translation errors than translation between distant languages, but there are still obstacles which should be addressed in order to improve such systems. This work explores the obstacles for machine translation systems between closely related South Slavic languages, namely Croatian, Serbian and Slovenian. Statistical systems for all language pairs and translation directions are trained using parallel texts from different domains, however mainly on spoken language i.e. subtitles. For translation between Serbian and Croatian, a rule-based system is also explored. It is shown that for all language pairs and translation systems, the main obstacles are differences between structural properties.","pages":"43--52","url":"https:\/\/www.aclweb.org\/anthology\/W16-4806","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4807","title":"{R}omanized {B}erber and {R}omanized {A}rabic Automatic Language Identification Using Machine Learning","authors":["Adouane, Wafia","Semmar, Nasredine","Johansson, Richard"],"emails":["wafia.gu@gmail.com","nasredine.semmar@cea.fr","richard.johansson@gu.se"],"author_id":["wafia-adouane","nasredine-semmar","richard-johansson"],"abstract":"The identification of the language of text\/speech input is the first step to be able to properly do any language-dependent natural language processing. The task is called Automatic Language Identification (ALI). Being a well-studied field since early 1960{'}s, various methods have been applied to many standard languages. The ALI standard methods require datasets for training and use character\/word-based n-gram models. However, social media and new technologies have contributed to the rise of informal and minority languages on the Web. The state-of-the-art automatic language identifiers fail to properly identify many of them. Romanized Arabic (RA) and Romanized Berber (RB) are cases of these informal languages which are under-resourced. The goal of this paper is twofold: detect RA and RB, at a document level, as separate languages and distinguish between them as they coexist in North Africa. We consider the task as a classification problem and use supervised machine learning to solve it. For both languages, character-based 5-grams combined with additional lexicons score the best, F-score of 99.75{\\%} and 97.77{\\%} for RB and RA respectively.","pages":"53--61","url":"https:\/\/www.aclweb.org\/anthology\/W16-4807","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4808","title":"How Many Languages Can a Language Model Model?","authors":["{\\\"O}stling, Robert"],"emails":["robert.ostling@helsinki.fi"],"author_id":["robert-ostling"],"abstract":"One of the purposes of the VarDial workshop series is to encourage research into NLP methods that treat human languages as a continuum, by designing models that exploit the similarities between languages and variants. In my work, I am using a continuous vector representation of languages that allows modeling and exploring the language continuum in a very direct way. The basic tool for this is a character-based recurrent neural network language model conditioned on language vectors whose values are learned during training. By feeding the model Bible translations in a thousand languages, not only does the learned vector space capture language similarity, but by interpolating between the learned vectors it is possible to generate text in unattested intermediate forms between the training languages.","pages":"62","url":"https:\/\/www.aclweb.org\/anthology\/W16-4808","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4809","title":"Automatic Detection of {A}rabicized {B}erber and {A}rabic Varieties","authors":["Adouane, Wafia","Semmar, Nasredine","Johansson, Richard","Bobicev, Victoria"],"emails":["wafia.gu@gmail.com","nasredine.semmar@cea.fr","richard.johansson@gu.se","vika@rol.md"],"author_id":["wafia-adouane","nasredine-semmar","richard-johansson","victoria-bobicev"],"abstract":"Automatic Language Identification (ALI) is the detection of the natural language of an input text by a machine. It is the first necessary step to do any language-dependent natural language processing task. Various methods have been successfully applied to a wide range of languages, and the state-of-the-art automatic language identifiers are mainly based on character n-gram models trained on huge corpora. However, there are many languages which are not yet automatically processed, for instance minority and informal languages. Many of these languages are only spoken and do not exist in a written format. Social media platforms and new technologies have facilitated the emergence of written format for these spoken languages based on pronunciation. The latter are not well represented on the Web, commonly referred to as under-resourced languages, and the current available ALI tools fail to properly recognize them. In this paper, we revisit the problem of ALI with the focus on Arabicized Berber and dialectal Arabic short texts. We introduce new resources and evaluate the existing methods. The results show that machine learning models combined with lexicons are well suited for detecting Arabicized Berber and different Arabic varieties and distinguishing between them, giving a macro-average F-score of 92.94{\\%}.","pages":"63--72","url":"https:\/\/www.aclweb.org\/anthology\/W16-4809","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4810","title":"Automatic Verification and Augmentation of Multilingual Lexicons","authors":["Aminian, Maryam","Al-Badrashiny, Mohamed","Diab, Mona"],"emails":["aminian@gwu.edu","badrashiny@gwu.edu","mtdiab@gwu.edu"],"author_id":["maryam-aminian","mohamed-al-badrashiny","mona-diab"],"abstract":"We present an approach for automatic verification and augmentation of multilingual lexica. We exploit existing parallel and monolingual corpora to extract multilingual correspondents via tri-angulation. We demonstrate the efficacy of our approach on two publicly available resources: Tharwa, a three-way lexicon comprising Dialectal Arabic, Modern Standard Arabic and English lemmas among other information (Diab et al., 2014); and BabelNet, a multilingual thesaurus comprising over 276 languages including Arabic variant entries (Navigli and Ponzetto, 2012). Our automated approach yields an F1-score of 71.71{\\%} in generating correct multilingual correspondents against gold Tharwa, and 54.46{\\%} against gold BabelNet without any human intervention.","pages":"73--81","url":"https:\/\/www.aclweb.org\/anthology\/W16-4810","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4811","title":"Faster Decoding for Subword Level Phrase-based {SMT} between Related Languages","authors":["Kunchukuttan, Anoop","Bhattacharyya, Pushpak"],"emails":["anoopk@cse.iitb.ac.in","pb@cse.iitb.ac.in"],"author_id":["anoop-kunchukuttan","pushpak-bhattacharyya"],"abstract":"A common and effective way to train translation systems between related languages is to consider sub-word level basic units. However, this increases the length of the sentences resulting in increased decoding time. The increase in length is also impacted by the specific choice of data format for representing the sentences as subwords. In a phrase-based SMT framework, we investigate different choices of decoder parameters as well as data format and their impact on decoding time and translation accuracy. We suggest best options for these settings that significantly improve decoding time with little impact on the translation accuracy.","pages":"82--88","url":"https:\/\/www.aclweb.org\/anthology\/W16-4811","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4812","title":"Subdialectal Differences in {S}orani {K}urdish","authors":["Malmasi, Shervin"],"emails":["shervin.malmasi@mq.edu.au"],"author_id":["shervin-malmasi"],"abstract":"In this study we apply classification methods for detecting subdialectal differences in Sorani Kurdish texts produced in different regions, namely Iran and Iraq. As Sorani is a low-resource language, no corpus including texts from different regions was readily available. To this end, we identified data sources that could be leveraged for this task to create a dataset of 200,000 sentences. Using surface features, we attempted to classify Sorani subdialects, showing that sentences from news sources in Iraq and Iran are distinguishable with 96{\\%} accuracy. This is the first preliminary study for a dialect that has not been widely studied in computational linguistics, evidencing the possible existence of distinct subdialects.","pages":"89--96","url":"https:\/\/www.aclweb.org\/anthology\/W16-4812","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4813","title":"Enlarging Scarce In-domain {E}nglish-{C}roatian Corpus for {SMT} of {MOOC}s Using {S}erbian","authors":["Popovi{\\'c}, Maja","Cholakov, Kostadin","Kordoni, Valia","Ljube{\\v{s}}i{\\'c}, Nikola"],"emails":["maja.popovi{\\'c}@ijs.si","kostadin.cholakov@ijs.si","valia.kordoni@ijs.si","nikola.ljubesic@ijs.si"],"author_id":["maja-popovic","kostadin-cholakov","valia-kordoni","nikola-ljubesic"],"abstract":"Massive Open Online Courses have been growing rapidly in size and impact. Yet the language barrier constitutes a major growth impediment in reaching out all people and educating all citizens. A vast majority of educational material is available only in English, and state-of-the-art machine translation systems still have not been tailored for this peculiar genre. In addition, a mere collection of appropriate in-domain training material is a challenging task. In this work, we investigate statistical machine translation of lecture subtitles from English into Croatian, which is morphologically rich and generally weakly supported, especially for the educational domain. We show that results comparable with publicly available systems trained on much larger data can be achieved if a small in-domain training set is used in combination with additional in-domain corpus originating from the closely related Serbian language.","pages":"97--105","url":"https:\/\/www.aclweb.org\/anthology\/W16-4813","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4814","title":"{A}rabic Dialect Identification in Speech Transcripts","authors":["Malmasi, Shervin","Zampieri, Marcos"],"emails":["shervin.malmasi@mq.edu.au","marcos.zampieri@uni-koeln.de"],"author_id":["shervin-malmasi","marcos-zampieri"],"abstract":"In this paper we describe a system developed to identify a set of four regional Arabic dialects (Egyptian, Gulf, Levantine, North African) and Modern Standard Arabic (MSA) in a transcribed speech corpus. We competed under the team name MAZA in the Arabic Dialect Identification sub-task of the 2016 Discriminating between Similar Languages (DSL) shared task. Our system achieved an F1-score of 0.51 in the closed training track, ranking first among the 18 teams that participated in the sub-task. Our system utilizes a classifier ensemble with a set of linear models as base classifiers. We experimented with three different ensemble fusion strategies, with the mean probability approach providing the best performance.","pages":"106--113","url":"https:\/\/www.aclweb.org\/anthology\/W16-4814","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4815","title":"{DSL} Shared Task 2016: Perfect Is The Enemy of Good Language Discrimination Through Expectation{--}Maximization and Chunk-based Language Model","authors":["Herman, Ond{\\v{r}}ej","Suchomel, V{\\'\\i}t","Baisa, V{\\'\\i}t","Rychl{\\'y}, Pavel"],"emails":["xherman1@fi.muni.cz","xsuchom2@fi.muni.cz","xbaisa@fi.muni.cz","pary@fi.muni.cz"],"author_id":["ondrej-herman","vit-suchomel","vit-baisa","pavel-rychly"],"abstract":"In this paper we investigate two approaches to discrimination of similar languages: Expectation{--}maximization algorithm for estimating conditional probability P(word|language) and byte level language models similar to compression-based language modelling methods. The accuracy of these methods reached respectively 86.6{\\%} and 88.3{\\%} on set A of the DSL Shared task 2016 competition.","pages":"114--118","url":"https:\/\/www.aclweb.org\/anthology\/W16-4815","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4816","title":"Byte-based Language Identification with Deep Convolutional Networks","authors":["Bjerva, Johannes"],"emails":["j.bjerva@rug.nl"],"author_id":["johannes-bjerva"],"abstract":"We report on our system for the shared task on discriminating between similar languages (DSL 2016). The system uses only byte representations in a deep residual network (ResNet). The system, named ResIdent, is trained only on the data released with the task (closed training). We obtain 84.88{\\%} accuracy on subtask A, 68.80{\\%} accuracy on subtask B1, and 69.80{\\%} accuracy on subtask B2. A large difference in accuracy on development data can be observed with relatively minor changes in our network{'}s architecture and hyperparameters. We therefore expect fine-tuning of these parameters to yield higher accuracies.","pages":"119--125","url":"https:\/\/www.aclweb.org\/anthology\/W16-4816","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4817","title":"Classifying {ASR} Transcriptions According to {A}rabic Dialect","authors":["Hanani, Abualsoud","Qaroush, Aziz","Taylor, Stephen"],"emails":["ahanani@birzeit.edu","qaroush@birzeit.edu","staylor@fitchburgstate.edu"],"author_id":["abualsoud-hanani","aziz-qaroush","stephen-taylor"],"abstract":"We describe several systems for identifying short samples of Arabic dialects. The systems were prepared for the shared task of the 2016 DSL Workshop. Our best system, an SVM using character tri-gram features, achieved an accuracy on the test data for the task of 0.4279, compared to a baseline of 0.20 for chance guesses or 0.2279 if we had always chosen the same most frequent class in the test set. This compares with the results of the team with the best weighted F1 score, which was an accuracy of 0.5117. The team entries seem to fall into cohorts, with all the teams in a cohort within a standard-deviation of each other, and our three entries are in the third cohort, which is about seven standard deviations from the top.","pages":"126--134","url":"https:\/\/www.aclweb.org\/anthology\/W16-4817","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4818","title":"{U}nibuc{K}ernel: An Approach for {A}rabic Dialect Identification Based on Multiple String Kernels","authors":["Ionescu, Radu Tudor","Popescu, Marius"],"emails":["raducu.ionescu@gmail.com","popescunmarius@gmail.com"],"author_id":["radu-tudor-ionescu","marius-popescu"],"abstract":"The most common approach in text mining classification tasks is to rely on features like words, part-of-speech tags, stems, or some other high-level linguistic features. Unlike the common approach, we present a method that uses only character p-grams (also known as n-grams) as features for the Arabic Dialect Identification (ADI) Closed Shared Task of the DSL 2016 Challenge. The proposed approach combines several string kernels using multiple kernel learning. In the learning stage, we try both Kernel Discriminant Analysis (KDA) and Kernel Ridge Regression (KRR), and we choose KDA as it gives better results in a 10-fold cross-validation carried out on the training set. Our approach is shallow and simple, but the empirical results obtained in the ADI Shared Task prove that it achieves very good results. Indeed, we ranked on the second place with an accuracy of 50.91{\\%} and a weighted F1 score of 51.31{\\%}. We also present improved results in this paper, which we obtained after the competition ended. Simply by adding more regularization into our model to make it more suitable for test data that comes from a different distribution than training data, we obtain an accuracy of 51.82{\\%} and a weighted F1 score of 52.18{\\%}. Furthermore, the proposed approach has an important advantage in that it is language independent and linguistic theory neutral, as it does not require any NLP tools.","pages":"135--144","url":"https:\/\/www.aclweb.org\/anthology\/W16-4818","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4819","title":"A Character-level Convolutional Neural Network for Distinguishing Similar Languages and Dialects","authors":["Belinkov, Yonatan","Glass, James"],"emails":["belinkov@mit.edu","glass@mit.edu"],"author_id":["yonatan-belinkov","james-glass"],"abstract":"Discriminating between closely-related language varieties is considered a challenging and important task. This paper describes our submission to the DSL 2016 shared-task, which included two sub-tasks: one on discriminating similar languages and one on identifying Arabic dialects. We developed a character-level neural network for this task. Given a sequence of characters, our model embeds each character in vector space, runs the sequence through multiple convolutions with different filter widths, and pools the convolutional representations to obtain a hidden vector representation of the text that is used for predicting the language or dialect. We primarily focused on the Arabic dialect identification task and obtained an F1 score of 0.4834, ranking 6th out of 18 participants. We also analyze errors made by our system on the Arabic data in some detail, and point to challenges such an approach is faced with.","pages":"145--152","url":"https:\/\/www.aclweb.org\/anthology\/W16-4819","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4820","title":"{H}e{LI}, a Word-Based Backoff Method for Language Identification","authors":["Jauhiainen, Tommi","Lind{\\'e}n, Krister","Jauhiainen, Heidi"],"emails":["elsinki@helsinki.fi","elsinki@helsinki.fi","elsinki@helsinki.fi"],"author_id":["tommi-jauhiainen","krister-linden","heidi-jauhiainen"],"abstract":"In this paper we describe the Helsinki language identification method, HeLI, and the resources we created for and used in the 3rd edition of the Discriminating between Similar Languages (DSL) shared task, which was organized as part of the VarDial 2016 workshop. The shared task comprised of a total of 8 tracks, of which we participated in 7. The shared task had a record number of participants, with 17 teams providing results for the closed track of the test set A. Our system reached the 2nd position in 4 tracks (A closed and open, B1 open and B2 open) and in this paper we are focusing on the methods and data used for those tracks. We describe our word-based backoff method in mathematical notation. We also describe how we selected the corpus we used in the open tracks.","pages":"153--162","url":"https:\/\/www.aclweb.org\/anthology\/W16-4820","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4821","title":"{ASIREM} Participation at the Discriminating Similar Languages Shared Task 2016","authors":["Adouane, Wafia","Semmar, Nasredine","Johansson, Richard"],"emails":["wafia.gu@gmail.com","nasredine.semmar@cea.fr","richard.johansson@gu.se"],"author_id":["wafia-adouane","nasredine-semmar","richard-johansson"],"abstract":"This paper presents the system built by ASIREM team for the Discriminating between Similar Languages (DSL) Shared task 2016. It describes the system which uses character-based and word-based n-grams separately. ASIREM participated in both sub-tasks (sub-task 1 and sub-task 2) and in both open and closed tracks. For the sub-task 1 which deals with Discriminating between similar languages and national language varieties, the system achieved an accuracy of 87.79{\\%} on the closed track, ending up ninth (the best results being 89.38{\\%}). In sub-task 2, which deals with Arabic dialect identification, the system achieved its best performance using character-based n-grams (49.67{\\%} accuracy), ranking fourth in the closed track (the best result being 51.16{\\%}), and an accuracy of 53.18{\\%}, ranking first in the open track.","pages":"163--169","url":"https:\/\/www.aclweb.org\/anthology\/W16-4821","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4822","title":"Comparing Two Basic Methods for Discriminating Between Similar Languages and Varieties","authors":["Gamallo, Pablo","Alegria, I{\\~n}aki","Pichel, Jos{\\'e} Ramom","Agirrezabal, Manex"],"emails":["pablo.gamallo@usc.es","i.alegria@ehu.eus","joseramompichel@imaxin.com","manex.aguirrezabal@ehu.eus"],"author_id":["pablo-gamallo","inaki-alegria","jose-ramom-pichel-campos","manex-agirrezabal"],"abstract":"This article describes the systems submitted by the Citius{\\_}Ixa{\\_}Imaxin team to the Discriminating Similar Languages Shared Task 2016. The systems are based on two different strategies: classification with ranked dictionaries and Naive Bayes classifiers. The results of the evaluation show that ranking dictionaries are more sound and stable across different domains while basic bayesian models perform reasonably well on in-domain datasets, but their performance drops when they are applied on out-of-domain texts.","pages":"170--177","url":"https:\/\/www.aclweb.org\/anthology\/W16-4822","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4823","title":"Advances in Ngram-based Discrimination of Similar Languages","authors":["Goutte, Cyril","L{\\'e}ger, Serge"],"emails":["outte@gmail.com","eger@nrc.ca"],"author_id":["cyril-goutte","serge-leger"],"abstract":"We describe the systems entered by the National Research Council in the 2016 shared task on discriminating similar languages. Like previous years, we relied on character ngram features, and a mixture of discriminative and generative statistical classifiers. We mostly investigated the influence of the amount of data on the performance, in the open task, and compared the two-stage approach (predicting language\/group, then variant) to a flat approach. Results suggest that ngrams are still state-of-the-art for language and variant identification, and that additional data has a small but decisive impact.","pages":"178--184","url":"https:\/\/www.aclweb.org\/anthology\/W16-4823","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4824","title":"Discrimination between Similar Languages, Varieties and Dialects using {CNN}- and {LSTM}-based Deep Neural Networks","authors":["Guggilla, Chinnappa"],"emails":["chinna.guggilla@gmail.com"],"author_id":["chinnappa-guggilla"],"abstract":"In this paper, we describe a system (CGLI) for discriminating similar languages, varieties and dialects using convolutional neural networks (CNNs) and long short-term memory (LSTM) neural networks. We have participated in the Arabic dialect identification sub-task of DSL 2016 shared task for distinguishing different Arabic language texts under closed submission track. Our proposed approach is language independent and works for discriminating any given set of languages, varieties, and dialects. We have obtained 43.29{\\%} weighted-F1 accuracy in this sub-task using CNN approach using default network parameters.","pages":"185--194","url":"https:\/\/www.aclweb.org\/anthology\/W16-4824","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4825","title":"Language and Dialect Discrimination Using Compression-Inspired Language Models","authors":["McNamee, Paul"],"emails":["mcnamee@jhu.edu"],"author_id":["paul-mcnamee"],"abstract":"The DSL 2016 shared task continued previous evaluations from 2014 and 2015 that facilitated the study of automated language and dialect identification. This paper describes results for this year{'}s shared task and from several related experiments conducted at the Johns Hopkins University Human Language Technology Center of Excellence (JHU HLTCOE). Previously the HLTCOE has explored the use of compression-inspired language modeling for language and dialect identification, using news, Wikipedia, blog post, and Twitter corpora. The technique we have relied upon is based on prediction by partial matching (PPM), a state of the art text compression technique. Due to the close relationship between adaptive compression and language modeling, such compression techniques can also be applied to multi-way text classification problems, and previous studies have examined tasks such as authorship attribution, email spam detection, and topical classification. We applied our approach to the multi-class decision that considered each dialect or language as a possibility for the given shared task input line. Results for test-set A were in accord with our expectations, however results for test-sets B and C appear to be markedly worse. We had not anticipated the inclusion of multiple communications in differing languages in test-set B (social media) input lines, and had not expected the test-set C (dialectal Arabic) data to be represented phonetically instead of in native orthography.","pages":"195--203","url":"https:\/\/www.aclweb.org\/anthology\/W16-4825","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4826","title":"{A}rabic Language {WEKA}-Based Dialect Classifier for {A}rabic Automatic Speech Recognition Transcripts","authors":["Alshutayri, Areej","Atwell, Eric","Alosaimy, Abdulrahman","Dickins, James","Ingleby, Michael","Watson, Janet"],"emails":["ml14aooa@leeds.ac.uk","twell@leeds.ac.uk","scama@leeds.ac.uk","ickins@leeds.ac.uk","inglebymeltham@binternet.com","atson@leeds.ac.uk"],"author_id":["areej-alshutayri","eric-atwell","abdulrahman-alosaimy","james-dickins","michael-ingleby","janet-watson"],"abstract":"This paper describes an Arabic dialect identification system which we developed for the Discriminating Similar Languages (DSL) 2016 shared task. We classified Arabic dialects by using Waikato Environment for Knowledge Analysis (WEKA) data analytic tool which contains many alternative filters and classifiers for machine learning. We experimented with several classifiers and the best accuracy was achieved using the Sequential Minimal Optimization (SMO) algorithm for training and testing process set to three different feature-sets for each testing process. Our approach achieved an accuracy equal to 42.85{\\%} which is considerably worse in comparison to the evaluation scores on the training set of 80-90{\\%} and with training set {``}60:40{''} percentage split which achieved accuracy around 50{\\%}. We observed that Buckwalter transcripts from the Saarland Automatic Speech Recognition (ASR) system are given without short vowels, though the Buckwalter system has notation for these. We elaborate such observations, describe our methods and analyse the training dataset.","pages":"204--211","url":"https:\/\/www.aclweb.org\/anthology\/W16-4826","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4827","title":"An Unsupervised Morphological Criterion for Discriminating Similar Languages","authors":["Barbaresi, Adrien"],"emails":["adrien.barbaresi@oeaw.ac.at"],"author_id":["adrien-barbaresi"],"abstract":"In this study conducted on the occasion of the Discriminating between Similar Languages shared task, I introduce an additional decision factor focusing on the token and subtoken level. The motivation behind this submission is to test whether a morphologically-informed criterion can add linguistically relevant information to global categorization and thus improve performance. The contributions of this paper are (1) a description of the unsupervised, low-resource method; (2) an evaluation and analysis of its raw performance; and (3) an assessment of its impact within a model comprising common indicators used in language identification. I present and discuss the systems used in the task A, a 12-way language identification task comprising varieties of five main language groups. Additionally I introduce a new off-the-shelf Naive Bayes classifier using a contrastive word and subword n-gram model ({``}Bayesline{''}) which outperforms the best submissions.","pages":"212--220","url":"https:\/\/www.aclweb.org\/anthology\/W16-4827","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4828","title":"{QCRI} @ {DSL} 2016: Spoken {A}rabic Dialect Identification Using Textual Features","authors":["Eldesouki, Mohamed","Dalvi, Fahim","Sajjad, Hassan","Darwish, Kareem"],"emails":["mohamohamed@qf.org.qa","faimaduddin@qf.org.qa","hsajjad@qf.org.qa","kdarwish@qf.org.qa"],"author_id":["mohamed-eldesouki","fahim-dalvi","hassan-sajjad","kareem-darwish"],"abstract":"The paper describes the QCRI submissions to the task of automatic Arabic dialect classification into 5 Arabic variants, namely Egyptian, Gulf, Levantine, North-African, and Modern Standard Arabic (MSA). The training data is relatively small and is automatically generated from an ASR system. To avoid over-fitting on such small data, we carefully selected and designed the features to capture the morphological essence of the different dialects. We submitted four runs to the Arabic sub-task. For all runs, we used a combined feature vector of character bi-grams, tri-grams, 4-grams, and 5-grams. We tried several machine-learning algorithms, namely Logistic Regression, Naive Bayes, Neural Networks, and Support Vector Machines (SVM) with linear and string kernels. However, our submitted runs used SVM with a linear kernel. In the closed submission, we got the best accuracy of 0.5136 and the third best weighted F1 score, with a difference less than 0.002 from the highest score.","pages":"221--226","url":"https:\/\/www.aclweb.org\/anthology\/W16-4828","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4829","title":"Tuning {B}ayes Baseline for Dialect Detection","authors":["Franco-Penya, Hector-Hugo","Mamani Sanchez, Liliana"],"emails":["francoph@tcd.ie","mamanisl@tcd.ie"],"author_id":["hector-hugo-franco-penya","liliana-mamani-sanchez"],"abstract":"This paper describes an analysis of our submissions to the Dialect Detection Shared Task 2016. We proposed three different systems that involved simplistic features, to name: a Naive-bayes system, a Support Vector Machines-based system and a Tree Kernel-based system. These systems underperform when compared to other submissions in this shared task, since the best one achieved an accuracy of {\\textasciitilde}0.834.","pages":"227--234","url":"https:\/\/www.aclweb.org\/anthology\/W16-4829","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4830","title":"Vanilla Classifiers for Distinguishing between Similar Languages","authors":["Nisioi, Sergiu","Ciobanu, Alina Maria","Dinu, Liviu P."],"emails":["sergiu.nisioi@gmail.com","alina.ciobanu@my.fmi.unibuc.ro","ldinu@fmi.unibuc.ro"],"author_id":["sergiu-nisioi","alina-maria-ciobanu","liviu-p-dinu"],"abstract":"In this paper we describe the submission of the UniBuc-NLP team for the Discriminating between Similar Languages Shared Task, DSL 2016. We present and analyze the results we obtained in the closed track of sub-task 1 (Similar languages and language varieties) and sub-task 2 (Arabic dialects). For sub-task 1 we used a logistic regression classifier with tf-idf feature weighting and for sub-task 2 a character-based string kernel with an SVM classifier. Our results show that good accuracy scores can be obtained with limited feature and model engineering. While certain limitations are to be acknowledged, our approach worked surprisingly well for out-of-domain, social media data, with 0.898 accuracy (3rd place) for dataset B1 and 0.838 accuracy (4th place) for dataset B2.","pages":"235--242","url":"https:\/\/www.aclweb.org\/anthology\/W16-4830","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"},{"id":"W16-4831","title":"N-gram and Neural Language Models for Discriminating Similar Languages","authors":["Cianflone, Andre","Kosseim, Leila"],"emails":["cianfl@encs.concordia.ca","kosseim@encs.concordia.ca"],"author_id":["andre-cianflone","leila-kosseim"],"abstract":"This paper describes our submission to the 2016 Discriminating Similar Languages (DSL) Shared Task. We participated in the closed Sub-task 1 with two separate machine learning techniques. The first approach is a character based Convolution Neural Network with an LSTM layer (CLSTM), which achieved an accuracy of 78.45{\\%} with minimal tuning. The second approach is a character-based n-gram model of size 7. It achieved an accuracy of 88.45{\\%} which is close to the accuracy of 89.38{\\%} achieved by the best submission.","pages":"243--250","url":"https:\/\/www.aclweb.org\/anthology\/W16-4831","publisher":"The COLING 2016 Organizing Committee","address":"Osaka, Japan","year":"2016","month":"December","booktitle":"Proceedings of the Third Workshop on {NLP} for Similar Languages, Varieties and Dialects ({V}ar{D}ial3)"}]