[{"id":"W17-4501","title":"Video Highlights Detection and Summarization with Lag-Calibration based on Concept-Emotion Mapping of Crowdsourced Time-Sync Comments","authors":["Ping, Qing","Chen, Chaomei"],"emails":["qp27@drexel.edu","cc345@drexel.edu"],"author_id":["qing-ping","chaomei-chen"],"abstract":"With the prevalence of video sharing, there are increasing demands for automatic video digestion such as highlight detection. Recently, platforms with crowdsourced time-sync video comments have emerged worldwide, providing a good opportunity for highlight detection. However, this task is non-trivial: (1) time-sync comments often lag behind their corresponding shot; (2) time-sync comments are semantically sparse and noisy; (3) to determine which shots are highlights is highly subjective. The present paper aims to tackle these challenges by proposing a framework that (1) uses concept-mapped lexical-chains for lag-calibration; (2) models video highlights based on comment intensity and combination of emotion and concept concentration of each shot; (3) summarize each detected highlight using improved SumBasic with emotion and concept mapping. Experiments on large real-world datasets show that our highlight detection method and summarization method both outperform other benchmarks with considerable margins.","pages":"1--11","doi":"10.18653\/v1\/W17-4501","url":"https:\/\/www.aclweb.org\/anthology\/W17-4501","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4502","title":"Multimedia Summary Generation from Online Conversations: Current Approaches and Future Directions","authors":["Hoque, Enamul","Carenini, Giuseppe"],"emails":["enamul@cs.ubc.ca","carenini@cs.ubc.ca"],"author_id":["enamul-hoque","giuseppe-carenini"],"abstract":"With the proliferation of Web-based social media, asynchronous conversations have become very common for supporting online communication and collaboration. Yet the increasing volume and complexity of conversational data often make it very difficult to get insights about the discussions. We consider combining textual summary with visual representation of conversational data as a promising way of supporting the user in exploring conversations. In this paper, we report our current work on developing visual interfaces that present multimedia summary combining text and visualization for online conversations and how our solutions have been tailored for a variety of domain problems. We then discuss the key challenges and opportunities for future work in this research space.","pages":"12--19","doi":"10.18653\/v1\/W17-4502","url":"https:\/\/www.aclweb.org\/anthology\/W17-4502","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4503","title":"Low-Resource Neural Headline Generation","authors":["Tilk, Ottokar","Alum{\\\"a}e, Tanel"],"emails":["ottokar.tilk@ttu.ee","tanel.alumae@ttu.ee"],"author_id":["ottokar-tilk","tanel-alumae"],"abstract":"Recent neural headline generation models have shown great results, but are generally trained on very large datasets. We focus our efforts on improving headline quality on smaller datasets by the means of pretraining. We propose new methods that enable pre-training all the parameters of the model and utilize all available text, resulting in improvements by up to 32.4{\\%} relative in perplexity and 2.84 points in ROUGE.","pages":"20--26","doi":"10.18653\/v1\/W17-4503","url":"https:\/\/www.aclweb.org\/anthology\/W17-4503","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4504","title":"Towards Improving Abstractive Summarization via Entailment Generation","authors":["Pasunuru, Ramakanth","Guo, Han","Bansal, Mohit"],"emails":["ram@cs.unc.edu","hanguo@unc.edu","mbansal@cs.unc.edu"],"author_id":["ramakanth-pasunuru","han-guo","mohit-bansal"],"abstract":"Abstractive summarization, the task of rewriting and compressing a document into a short summary, has achieved considerable success with neural sequence-to-sequence models. However, these models can still benefit from stronger natural language inference skills, since a correct summary is logically entailed by the input document, i.e., it should not contain any contradictory or unrelated information. We incorporate such knowledge into an abstractive summarization model via multi-task learning, where we share its decoder parameters with those of an entailment generation model. We achieve promising initial improvements based on multiple metrics and datasets (including a test-only setting). The domain mismatch between the entailment (captions) and summarization (news) datasets suggests that the model is learning some domain-agnostic inference skills.","pages":"27--32","doi":"10.18653\/v1\/W17-4504","url":"https:\/\/www.aclweb.org\/anthology\/W17-4504","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4505","title":"Coarse-to-Fine Attention Models for Document Summarization","authors":["Ling, Jeffrey","Rush, Alexander"],"emails":["",""],"author_id":["jeffrey-ling","alexander-m-rush"],"abstract":"Sequence-to-sequence models with attention have been successful for a variety of NLP problems, but their speed does not scale well for tasks with long source sequences such as document summarization. We propose a novel coarse-to-fine attention model that hierarchically reads a document, using coarse attention to select top-level chunks of text and fine attention to read the words of the chosen chunks. While the computation for training standard attention models scales linearly with source sequence length, our method scales with the number of top-level chunks and can handle much longer sequences. Empirically, we find that while coarse-to-fine attention models lag behind state-of-the-art baselines, our method achieves the desired behavior of sparsely attending to subsets of the document for generation.","pages":"33--42","doi":"10.18653\/v1\/W17-4505","url":"https:\/\/www.aclweb.org\/anthology\/W17-4505","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4506","title":"Automatic Community Creation for Abstractive Spoken Conversations Summarization","authors":["Singla, Karan","Stepanov, Evgeny","Bayer, Ali Orkan","Carenini, Giuseppe","Riccardi, Giuseppe"],"emails":["singlak@usc.edu","evgeny.stepanov@unitn.it","aliorkan.bayer@unitn.it","carenini@cs.ubc.ca","giuseppe.riccardi@unitn.it"],"author_id":["karan-singla","evgeny-stepanov","ali-orkan-bayer","giuseppe-carenini","giuseppe-riccardi"],"abstract":"Summarization of spoken conversations is a challenging task, since it requires deep understanding of dialogs. Abstractive summarization techniques rely on linking the summary sentences to sets of original conversation sentences, i.e. communities. Unfortunately, such linking information is rarely available or requires trained annotators. We propose and experiment automatic community creation using cosine similarity on different levels of representation: raw text, WordNet SynSet IDs, and word embeddings. We show that the abstractive summarization systems with automatic communities significantly outperform previously published results on both English and Italian corpora.","pages":"43--47","doi":"10.18653\/v1\/W17-4506","url":"https:\/\/www.aclweb.org\/anthology\/W17-4506","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4507","title":"Combining Graph Degeneracy and Submodularity for Unsupervised Extractive Summarization","authors":["Tixier, Antoine","Meladianos, Polykarpos","Vazirgiannis, Michalis"],"emails":["","",""],"author_id":["antoine-tixier","polykarpos-meladianos","michalis-vazirgiannis"],"abstract":"We present a fully unsupervised, extractive text summarization system that leverages a submodularity framework introduced by past research. The framework allows summaries to be generated in a greedy way while preserving near-optimal performance guarantees. Our main contribution is the novel coverage reward term of the objective function optimized by the greedy algorithm. This component builds on the graph-of-words representation of text and the k-core decomposition algorithm to assign meaningful scores to words. We evaluate our approach on the AMI and ICSI meeting speech corpora, and on the DUC2001 news corpus. We reach state-of-the-art performance on all datasets. Results indicate that our method is particularly well-suited to the meeting domain.","pages":"48--58","doi":"10.18653\/v1\/W17-4507","url":"https:\/\/www.aclweb.org\/anthology\/W17-4507","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4508","title":"{TL};{DR}: Mining {R}eddit to Learn Automatic Summarization","authors":["V{\\\"o}lske, Michael","Potthast, Martin","Syed, Shahbaz","Stein, Benno"],"emails":["","","",""],"author_id":["michael-volske","martin-potthast","shahbaz-syed","benno-stein"],"abstract":"Recent advances in automatic text summarization have used deep neural networks to generate high-quality abstractive summaries, but the performance of these models strongly depends on large amounts of suitable training data. We propose a new method for mining social media for author-provided summaries, taking advantage of the common practice of appending a {``}TL;DR{''} to long posts. A case study using a large Reddit crawl yields the Webis-TLDR-17 dataset, complementing existing corpora primarily from the news genre. Our technique is likely applicable to other social media sites and general web crawls.","pages":"59--63","doi":"10.18653\/v1\/W17-4508","url":"https:\/\/www.aclweb.org\/anthology\/W17-4508","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4509","title":"Topic Model Stability for Hierarchical Summarization","authors":["Miller, John","McCoy, Kathleen"],"emails":["millerje@udel.edu","mccoy@udel.edu"],"author_id":["john-miller","kathleen-f-mccoy"],"abstract":"We envisioned responsive generic hierarchical text summarization with summaries organized by section and paragraph based on hierarchical structure topic models. But we had to be sure that topic models were stable for the sampled corpora. To that end we developed a methodology for aligning multiple hierarchical structure topic models run over the same corpus under similar conditions, calculating a representative centroid model, and reporting stability of the centroid model. We ran stability experiments for standard corpora and a development corpus of Global Warming articles. We found flat and hierarchical structures of two levels plus the root offer stable centroid models, but hierarchical structures of three levels plus the root didn{'}t seem stable enough for use in hierarchical summarization.","pages":"64--73","doi":"10.18653\/v1\/W17-4509","url":"https:\/\/www.aclweb.org\/anthology\/W17-4509","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4510","title":"Learning to Score System Summaries for Better Content Selection Evaluation.","authors":["Peyrard, Maxime","Botschen, Teresa","Gurevych, Iryna"],"emails":["","",""],"author_id":["maxime-peyrard","teresa-botschen","iryna-gurevych"],"abstract":"The evaluation of summaries is a challenging but crucial task of the summarization field. In this work, we propose to learn an automatic scoring metric based on the human judgements available as part of classical summarization datasets like TAC-2008 and TAC-2009. Any existing automatic scoring metrics can be included as features, the model learns the combination exhibiting the best correlation with human judgments. The reliability of the new metric is tested in a further manual evaluation where we ask humans to evaluate summaries covering the whole scoring spectrum of the metric. We release the trained metric as an open-source tool.","pages":"74--84","doi":"10.18653\/v1\/W17-4510","url":"https:\/\/www.aclweb.org\/anthology\/W17-4510","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4511","title":"Revisiting the Centroid-based Method: A Strong Baseline for Multi-Document Summarization","authors":["Gholipour Ghalandari, Demian"],"emails":["demian@aylien.com"],"author_id":["demian-gholipour-ghalandari"],"abstract":"The centroid-based model for extractive document summarization is a simple and fast baseline that ranks sentences based on their similarity to a centroid vector. In this paper, we apply this ranking to possible summaries instead of sentences and use a simple greedy algorithm to find the best summary. Furthermore, we show possibilities to scale up to larger input document collections by selecting a small number of sentences from each document prior to constructing the summary. Experiments were done on the DUC2004 dataset for multi-document summarization. We observe a higher performance over the original model, on par with more complex state-of-the-art methods.","pages":"85--90","doi":"10.18653\/v1\/W17-4511","url":"https:\/\/www.aclweb.org\/anthology\/W17-4511","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4512","title":"Reader-Aware Multi-Document Summarization: An Enhanced Model and The First Dataset","authors":["Li, Piji","Bing, Lidong","Lam, Wai"],"emails":["pjli@se.cuhk.edu.hk","lyndonbing@tencent.com","wlam@se.cuhk.edu.hk"],"author_id":["piji-li","lidong-bing","wai-lam"],"abstract":"We investigate the problem of reader-aware multi-document summarization (RA-MDS) and introduce a new dataset for this problem. To tackle RA-MDS, we extend a variational auto-encodes (VAEs) based MDS framework by jointly considering news documents and reader comments. To conduct evaluation for summarization performance, we prepare a new dataset. We describe the methods for data collection, aspect annotation, and summary writing as well as scrutinizing by experts. Experimental results show that reader comments can improve the summarization performance, which also demonstrates the usefulness of the proposed dataset.","pages":"91--99","doi":"10.18653\/v1\/W17-4512","url":"https:\/\/www.aclweb.org\/anthology\/W17-4512","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"},{"id":"W17-4513","title":"A Pilot Study of Domain Adaptation Effect for Neural Abstractive Summarization","authors":["Hua, Xinyu","Wang, Lu"],"emails":["hua.x@husky.neu.edu","luwang@ccs.neu.edu"],"author_id":["xinyu-hua","lu-wang"],"abstract":"We study the problem of domain adaptation for neural abstractive summarization. We make initial efforts in investigating what information can be transferred to a new domain. Experimental results on news stories and opinion articles indicate that neural summarization model benefits from pre-training based on extractive summaries. We also find that the combination of in-domain and out-of-domain setup yields better summaries when in-domain data is insufficient. Further analysis shows that, the model is capable to select salient content even trained on out-of-domain data, but requires in-domain data to capture the style for a target domain.","pages":"100--106","doi":"10.18653\/v1\/W17-4513","url":"https:\/\/www.aclweb.org\/anthology\/W17-4513","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on New Frontiers in Summarization"}]