[{"id":"W17-2501","title":"Users and Data: The Two Neglected Children of Bilingual Natural Language Processing Research","authors":["Langlais, Phillippe"],"emails":["felipe@iro.umontreal.ca"],"author_id":["philippe-langlais"],"abstract":"Despite numerous studies devoted to mining parallel material from bilingual data, we have yet to see the resulting technologies wholeheartedly adopted by professional translators and terminologists alike. I argue that this state of affairs is mainly due to two factors: the emphasis published authors put on models (even though data is as important), and the conspicuous lack of concern for actual end-users.","pages":"1--5","doi":"10.18653\/v1\/W17-2501","url":"https:\/\/www.aclweb.org\/anthology\/W17-2501","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2502","title":"Deep Investigation of Cross-Language Plagiarism Detection Methods","authors":["Ferrero, J{\\'e}r{\\'e}my","Besacier, Laurent","Schwab, Didier","Agn{\\`e}s, Fr{\\'e}d{\\'e}ric"],"emails":["jeremy.ferrero@imag.fr","laurent.besacier@imag.fr","didier.schwab@imag.fr","frederic@compilatio.net"],"author_id":["jeremy-ferrero","laurent-besacier","didier-schwab","frederic-agnes"],"abstract":"This paper is a deep investigation of cross-language plagiarism detection methods on a new recently introduced open dataset, which contains parallel and comparable collections of documents with multiple characteristics (different genres, languages and sizes of texts). We investigate cross-language plagiarism detection methods for 6 language pairs on 2 granularities of text units in order to draw robust conclusions on the best methods while deeply analyzing correlations across document styles and languages.","pages":"6--15","doi":"10.18653\/v1\/W17-2502","url":"https:\/\/www.aclweb.org\/anthology\/W17-2502","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2503","title":"Sentence Alignment using Unfolding Recursive Autoencoders","authors":["Grover, Jeenu","Mitra, Pabitra"],"emails":["groverjeenu@gmail.com","pabitra@cse.iitkgp.ernet.in"],"author_id":["jeenu-grover","pabitra-mitra"],"abstract":"In this paper, we propose a novel two step algorithm for sentence alignment in monolingual corpora using Unfolding Recursive Autoencoders. First, we use unfolding recursive auto-encoders (RAE) to learn feature vectors for phrases in syntactical tree of the sentence. To compare two sentences we use a similarity matrix which has dimensions proportional to the size of the two sentences. Since the similarity matrix generated to compare two sentences has varying dimension due to different sentence lengths, a dynamic pooling layer is used to map it to a matrix of fixed dimension. The resulting matrix is used to calculate the similarity scores between the two sentences. The second step of the algorithm captures the contexts in which the sentences occur in the document by using a dynamic programming algorithm for global alignment.","pages":"16--20","doi":"10.18653\/v1\/W17-2503","url":"https:\/\/www.aclweb.org\/anthology\/W17-2503","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2504","title":"Acquisition of Translation Lexicons for Historically Unwritten Languages via Bridging Loanwords","authors":["Bloodgood, Michael","Strauss, Benjamin"],"emails":["mbloodgood@tcnj.edu","strauss.105@osu.edu"],"author_id":["michael-bloodgood","benjamin-strauss"],"abstract":"With the advent of informal electronic communications such as social media, colloquial languages that were historically unwritten are being written for the first time in heavily code-switched environments. We present a method for inducing portions of translation lexicons through the use of expert knowledge in these settings where there are approximately zero resources available other than a language informant, potentially not even large amounts of monolingual data. We investigate inducing a Moroccan Darija-English translation lexicon via French loanwords bridging into English and find that a useful lexicon is induced for human-assisted translation and statistical machine translation.","pages":"21--25","doi":"10.18653\/v1\/W17-2504","url":"https:\/\/www.aclweb.org\/anthology\/W17-2504","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2505","title":"Toward a Comparable Corpus of {L}atvian, {R}ussian and {E}nglish Tweets","authors":["Milajevs, Dmitrijs"],"emails":["dmitrijs.milajevs@nist.gov"],"author_id":["dmitrijs-milajevs"],"abstract":"Twitter has become a rich source for linguistic data. Here, a possibility of building a trilingual Latvian-Russian-English corpus of tweets from Riga, Latvia is investigated. Such a corpus, once constructed, might be of great use for multiple purposes including training machine translation models, examining cross-lingual phenomena and studying the population of Riga. This pilot study shows that it is feasible to build such a resource by collecting and analysing a pilot corpus, which is made publicly available and can be used to construct a large comparable corpus.","pages":"26--30","doi":"10.18653\/v1\/W17-2505","url":"https:\/\/www.aclweb.org\/anthology\/W17-2505","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2506","title":"Automatic Extraction of Parallel Speech Corpora from Dubbed Movies","authors":["{\\\"O}ktem, Alp","Farr{\\'u}s, Mireia","Wanner, Leo"],"emails":["","",""],"author_id":["alp-oktem","mireia-farrus","leo-wanner"],"abstract":"This paper presents a methodology to extract parallel speech corpora based on any language pair from dubbed movies, together with an application framework in which some corresponding prosodic parameters are extracted. The obtained parallel corpora are especially suitable for speech-to-speech translation applications when a prosody transfer between source and target languages is desired.","pages":"31--35","doi":"10.18653\/v1\/W17-2506","url":"https:\/\/www.aclweb.org\/anthology\/W17-2506","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2507","title":"A parallel collection of clinical trials in {P}ortuguese and {E}nglish","authors":["Neves, Mariana"],"emails":["mariana.neves@hpi.de"],"author_id":["mariana-neves"],"abstract":"Parallel collections of documents are crucial resources for training and evaluating machine translation (MT) systems. Even though large collections are available for certain domains and language pairs, these are still scarce in the biomedical domain. We developed a parallel corpus of clinical trials in Portuguese and English. The documents are derived from the Brazilian Clinical Trials Registry and the corpus currently contains a total of 1188 documents. In this paper, we describe the corpus construction and discuss the quality of the translation and the sentence alignment that we obtained.","pages":"36--40","doi":"10.18653\/v1\/W17-2507","url":"https:\/\/www.aclweb.org\/anthology\/W17-2507","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2508","title":"Weighted Set-Theoretic Alignment of Comparable Sentences","authors":["Azpeitia, Andoni","Etchegoyhen, Thierry","Mart{\\'\\i}nez Garcia, Eva"],"emails":["aazpeitia@vicomtech.org","tetchegoyhen@vicomtech.org","emartinez@vicomtech.org"],"author_id":["andoni-azpeitia","thierry-etchegoyhen","eva-martinez-garcia"],"abstract":"This article presents the STACCw system for the BUCC 2017 shared task on parallel sentence extraction from comparable corpora. The original STACC approach, based on set-theoretic operations over bags of words, had been previously shown to be efficient and portable across domains and alignment scenarios. Wedescribe an extension of this approach with a new weighting scheme and show that it provides significant improvements on the datasets provided for the shared task.","pages":"41--45","doi":"10.18653\/v1\/W17-2508","url":"https:\/\/www.aclweb.org\/anthology\/W17-2508","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2509","title":"{BUCC} 2017 Shared Task: a First Attempt Toward a Deep Learning Framework for Identifying Parallel Sentences in Comparable Corpora","authors":["Gr{\\'e}goire, Francis","Langlais, Philippe"],"emails":["gregoifr@iro.umontreal.ca","felipe@iro.umontreal.ca"],"author_id":["francis-gregoire","philippe-langlais"],"abstract":"This paper describes our participation in BUCC 2017 shared task: identifying parallel sentences in comparable corpora. Our goal is to leverage continuous vector representations and distributional semantics with a minimal use of external preprocessing and postprocessing tools. We report experiments that were conducted after transmitting our results.","pages":"46--50","doi":"10.18653\/v1\/W17-2509","url":"https:\/\/www.aclweb.org\/anthology\/W17-2509","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2510","title":"z{NLP}: Identifying Parallel Sentences in {C}hinese-{E}nglish Comparable Corpora","authors":["Zhang, Zheng","Zweigenbaum, Pierre"],"emails":["zheng.zhang@limsi.fr","pz@limsi.fr"],"author_id":["zheng-zhang","pierre-zweigenbaum"],"abstract":"This paper describes the zNLP system for the BUCC 2017 shared task. Our system identifies parallel sentence pairs in Chinese-English comparable corpora by translating word-by-word Chinese sentences into English, using the search engine Solr to select near-parallel sentences and then by using an SVM classifier to identify true parallel sentences from the previous results. It obtains an F1-score of 45{\\%} (resp. 32{\\%}) on the test (training) set.","pages":"51--55","doi":"10.18653\/v1\/W17-2510","url":"https:\/\/www.aclweb.org\/anthology\/W17-2510","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2511","title":"{BUCC}2017: A Hybrid Approach for Identifying Parallel Sentences in Comparable Corpora","authors":["Mahata, Sainik","Das, Dipankar","Bandyopadhyay, Sivaji"],"emails":["sainik.mahata@gmail.com","ddas@cse.jdvu.ac.in","sbandyopadhyay@cse.jdvu.ac.in"],"author_id":["sainik-mahata","dipankar-das","sivaji-bandyopadhyay"],"abstract":"A Statistical Machine Translation (SMT) system is always trained using large parallel corpus to produce effective translation. Not only is the corpus scarce, it also involves a lot of manual labor and cost. Parallel corpus can be prepared by employing comparable corpora where a pair of corpora is in two different languages pointing to the same domain. In the present work, we try to build a parallel corpus for French-English language pair from a given comparable corpus. The data and the problem set are provided as part of the shared task organized by BUCC 2017. We have proposed a system that first translates the sentences by heavily relying on Moses and then group the sentences based on sentence length similarity. Finally, the one to one sentence selection was done based on Cosine Similarity algorithm.","pages":"56--59","doi":"10.18653\/v1\/W17-2511","url":"https:\/\/www.aclweb.org\/anthology\/W17-2511","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"},{"id":"W17-2512","title":"Overview of the Second {BUCC} Shared Task: Spotting Parallel Sentences in Comparable Corpora","authors":["Zweigenbaum, Pierre","Sharoff, Serge","Rapp, Reinhard"],"emails":["pz@limsi.fr","s.sharoff@leeds.ac.uk","reinhardrapp@gmx.de"],"author_id":["pierre-zweigenbaum","serge-sharoff","reinhard-rapp"],"abstract":"This paper presents the BUCC 2017 shared task on parallel sentence extraction from comparable corpora. It recalls the design of the datasets, presents their final construction and statistics and the methods used to evaluate system results. 13 runs were submitted to the shared task by 4 teams, covering three of the four proposed language pairs: French-English (7 runs), German-English (3 runs), and Chinese-English (3 runs). The best F-scores as measured against the gold standard were 0.84 (German-English), 0.80 (French-English), and 0.43 (Chinese-English). Because of the design of the dataset, in which not all gold parallel sentence pairs are known, these are only minimum values. We examined manually a small sample of the false negative sentence pairs for the most precise French-English runs and estimated the number of parallel sentence pairs not yet in the provided gold standard. Adding them to the gold standard leads to revised estimates for the French-English F-scores of at most +1.5pt. This suggests that the BUCC 2017 datasets provide a reasonable approximate evaluation of the parallel sentence spotting task.","pages":"60--67","doi":"10.18653\/v1\/W17-2512","url":"https:\/\/www.aclweb.org\/anthology\/W17-2512","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 10th Workshop on Building and Using Comparable Corpora"}]