[{"id":"W17-4301","title":"Dependency Parsing with Dilated Iterated Graph {CNN}s","authors":["Strubell, Emma","McCallum, Andrew"],"emails":["strubell@cs.umass.edu","mccallum@cs.umass.edu"],"author_id":["emma-strubell","andrew-mccallum"],"abstract":"Dependency parses are an effective way to inject linguistic knowledge into many downstream tasks, and many practitioners wish to efficiently parse sentences at scale. Recent advances in GPU hardware have enabled neural networks to achieve significant gains over the previous best models, these models still fail to leverage GPUs{'} capability for massive parallelism due to their requirement of sequential processing of the sentence. In response, we propose Dilated Iterated Graph Convolutional Neural Networks (DIG-CNNs) for graph-based dependency parsing, a graph convolutional architecture that allows for efficient end-to-end GPU parsing. In experiments on the English Penn TreeBank benchmark, we show that DIG-CNNs perform on par with some of the best neural network parsers.","pages":"1--6","doi":"10.18653\/v1\/W17-4301","url":"https:\/\/www.aclweb.org\/anthology\/W17-4301","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2nd Workshop on Structured Prediction for Natural Language Processing"},{"id":"W17-4302","title":"Entity Identification as Multitasking","authors":["Stratos, Karl"],"emails":["stratos@ttic.edu"],"author_id":["karl-stratos"],"abstract":"Standard approaches in entity identification hard-code boundary detection and type prediction into labels and perform Viterbi. This has two disadvantages: 1. the runtime complexity grows quadratically in the number of types, and 2. there is no natural segment-level representation. In this paper, we propose a neural architecture that addresses these disadvantages. We frame the problem as multitasking, separating boundary detection and type prediction but optimizing them jointly. Despite its simplicity, this architecture performs competitively with fully structured models such as BiLSTM-CRFs while scaling linearly in the number of types. Furthermore, by construction, the model induces type-disambiguating embeddings of predicted mentions.","pages":"7--11","doi":"10.18653\/v1\/W17-4302","url":"https:\/\/www.aclweb.org\/anthology\/W17-4302","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2nd Workshop on Structured Prediction for Natural Language Processing"},{"id":"W17-4303","title":"Towards Neural Machine Translation with Latent Tree Attention","authors":["Bradbury, James","Socher, Richard"],"emails":["james.bradbury@salesforce.com","rsocher@salesforce.com"],"author_id":["james-bradbury","richard-socher"],"abstract":"Building models that take advantage of the hierarchical structure of language without a priori annotation is a longstanding goal in natural language processing. We introduce such a model for the task of machine translation, pairing a recurrent neural network grammar encoder with a novel attentional RNNG decoder and applying policy gradient reinforcement learning to induce unsupervised tree structures on both the source and target. When trained on character-level datasets with no explicit segmentation or parse annotation, the model learns a plausible segmentation and shallow parse, obtaining performance close to an attentional baseline.","pages":"12--16","doi":"10.18653\/v1\/W17-4303","url":"https:\/\/www.aclweb.org\/anthology\/W17-4303","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2nd Workshop on Structured Prediction for Natural Language Processing"},{"id":"W17-4304","title":"Structured Prediction via Learning to Search under Bandit Feedback","authors":["Sharaf, Amr","Daum{\\'e} III, Hal"],"emails":["amr@cs.umd.edu","hal@cs.umd.edu"],"author_id":["amr-sharaf","hal-daume-iii"],"abstract":"We present an algorithm for structured prediction under online bandit feedback. The learner repeatedly predicts a sequence of actions, generating a structured output. It then observes feedback for that output and no others. We consider two cases: a pure bandit setting in which it only observes a loss, and more fine-grained feedback in which it observes a loss for every action. We find that the fine-grained feedback is necessary for strong empirical performance, because it allows for a robust variance-reduction strategy. We empirically compare a number of different algorithms and exploration methods and show the efficacy of BLS on sequence labeling and dependency parsing tasks.","pages":"17--26","doi":"10.18653\/v1\/W17-4304","url":"https:\/\/www.aclweb.org\/anthology\/W17-4304","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2nd Workshop on Structured Prediction for Natural Language Processing"},{"id":"W17-4305","title":"Syntax Aware {LSTM} model for Semantic Role Labeling","authors":["Qian, Feng","Sha, Lei","Chang, Baobao","Liu, Lu-chen","Zhang, Ming"],"emails":["","","cs@pku.edu.cn","",""],"author_id":["feng-qian","lei-sha","baobao-chang","lu-chen-liu","ming-zhang"],"abstract":"In Semantic Role Labeling (SRL) task, the tree structured dependency relation is rich in syntax information, but it is not well handled by existing models. In this paper, we propose Syntax Aware Long Short Time Memory (SA-LSTM). The structure of SA-LSTM changes according to dependency structure of each sentence, so that SA-LSTM can model the whole tree structure of dependency relation in an architecture engineering way. Experiments demonstrate that on Chinese Proposition Bank (CPB) 1.0, SA-LSTM improves F1 by 2.06{\\%} than ordinary bi-LSTM with feature engineered dependency relation information, and gives state-of-the-art F1 of 79.92{\\%}. On English CoNLL 2005 dataset, SA-LSTM brings improvement (2.1{\\%}) to bi-LSTM model and also brings slight improvement (0.3{\\%}) when added to the state-of-the-art model.","pages":"27--32","doi":"10.18653\/v1\/W17-4305","url":"https:\/\/www.aclweb.org\/anthology\/W17-4305","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2nd Workshop on Structured Prediction for Natural Language Processing"},{"id":"W17-4306","title":"Spatial Language Understanding with Multimodal Graphs using Declarative Learning based Programming","authors":["Kordjamshidi, Parisa","Rahgooy, Taher","Manzoor, Umar"],"emails":["pkordjam@tulane.edu","trahgooy@tulane.edu","umanzoor@tulane.edu"],"author_id":["parisa-kordjamshidi","taher-rahgooy","umar-manzoor"],"abstract":"This work is on a previously formalized semantic evaluation task of spatial role labeling (SpRL) that aims at extraction of formal spatial meaning from text. Here, we report the results of initial efforts towards exploiting visual information in the form of images to help spatial language understanding. We discuss the way of designing new models in the framework of declarative learning-based programming (DeLBP). The DeLBP framework facilitates combining modalities and representing various data in a unified graph. The learning and inference models exploit the structure of the unified graph as well as the global first order domain constraints beyond the data to predict the semantics which forms a structured meaning representation of the spatial context. Continuous representations are used to relate the various elements of the graph originating from different modalities. We improved over the state-of-the-art results on SpRL.","pages":"33--43","doi":"10.18653\/v1\/W17-4306","url":"https:\/\/www.aclweb.org\/anthology\/W17-4306","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2nd Workshop on Structured Prediction for Natural Language Processing"},{"id":"W17-4307","title":"Boosting Information Extraction Systems with Character-level Neural Networks and Free Noisy Supervision","authors":["Meerkamp, Philipp","Zhou, Zhengyi"],"emails":["pmeerkamp@bloomberg.net","zzhou@research.att.com"],"author_id":["philipp-meerkamp","zhengyi-zhou"],"abstract":"We present an architecture to boost the precision of existing information extraction systems. This is achieved by augmenting the existing parser, which may be constraint-based or hybrid statistical, with a character-level neural network. Our architecture combines the ability of constraint-based or hybrid extraction systems to easily incorporate domain knowledge with the ability of deep neural networks to leverage large amounts of data to learn complex features. The network is trained using a measure of consistency between extracted data and existing databases as a form of cheap, noisy supervision. Our architecture does not require large scale manual annotation or a system rewrite. It has led to large precision improvements over an existing, highly-tuned production information extraction system used at Bloomberg LP for financial language text.","pages":"44--51","doi":"10.18653\/v1\/W17-4307","url":"https:\/\/www.aclweb.org\/anthology\/W17-4307","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2nd Workshop on Structured Prediction for Natural Language Processing"},{"id":"W17-4308","title":"Piecewise Latent Variables for Neural Variational Text Processing","authors":["Serban, Iulian Vlad","Ororbia II, Alexander","Pineau, Joelle","Courville, Aaron"],"emails":["","","",""],"author_id":["iulian-vlad-serban","alexander-ororbia-ii","joelle-pineau","aaron-courville"],"abstract":"Advances in neural variational inference have facilitated the learning of powerful directed graphical models with continuous latent variables, such as variational autoencoders. The hope is that such models will learn to represent rich, multi-modal latent factors in real-world data, such as natural language text. However, current models often assume simplistic priors on the latent variables - such as the uni-modal Gaussian distribution - which are incapable of representing complex latent factors efficiently. To overcome this restriction, we propose the simple, but highly flexible, piecewise constant distribution. This distribution has the capacity to represent an exponential number of modes of a latent target distribution, while remaining mathematically tractable. Our results demonstrate that incorporating this new latent distribution into different models yields substantial improvements in natural language processing tasks such as document modeling and natural language generation for dialogue.","pages":"52--62","doi":"10.18653\/v1\/W17-4308","url":"https:\/\/www.aclweb.org\/anthology\/W17-4308","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the 2nd Workshop on Structured Prediction for Natural Language Processing"}]