[{"id":"W17-3101","title":"A Cross-modal Review of Indicators for Depression Detection Systems","authors":["Morales, Michelle","Scherer, Stefan","Levitan, Rivka"],"emails":["mmorales@gradcenter.cuny.edu","scherer@ict.usc.edu","levitan@sci.brooklyn.cuny.edu"],"author_id":["michelle-morales","stefan-scherer","rivka-levitan"],"abstract":"Automatic detection of depression has attracted increasing attention from researchers in psychology, computer science, linguistics, and related disciplines. As a result, promising depression detection systems have been reported. This paper surveys these efforts by presenting the first cross-modal review of depression detection systems and discusses best practices and most promising approaches to this task.","pages":"1--12","doi":"10.18653\/v1\/W17-3101","url":"https:\/\/www.aclweb.org\/anthology\/W17-3101","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3102","title":"In your wildest dreams: the language and psychological features of dreams","authors":["Niederhoffer, Kate","Schler, Jonathan","Crutchley, Patrick","Loveys, Kate","Coppersmith, Glen"],"emails":["kate@circadialabs.com","schlerj@cs.biu.ac.il","patrick@qntfy.com","kate@qntfy.com","glen@qntfy.com"],"author_id":["kate-niederhoffer","jonathan-schler","patrick-crutchley","kate-loveys","glen-coppersmith"],"abstract":"In this paper, we provide the first quantified exploration of the structure of the language of dreams, their linguistic style and emotional content. We present a collection of digital dream logs as a viable corpus for the growing study of mental health through the lens of language, complementary to the work done examining more traditional social media. This paper is largely exploratory in nature to lay the groundwork for subsequent research in mental health, rather than optimizing a particular text classification task.","pages":"13--25","doi":"10.18653\/v1\/W17-3102","url":"https:\/\/www.aclweb.org\/anthology\/W17-3102","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3103","title":"A Corpus Analysis of Social Connections and Social Isolation in Adolescents Suffering from Depressive Disorders","authors":["Guo, Jia-Wen","Mowery, Danielle L","Lai, Djin","Sward, Katherine","Conway, Mike"],"emails":["","","","",""],"author_id":["jia-wen-guo","danielle-l-mowery","djin-lai","katherine-sward","mike-conway"],"abstract":"Social connection and social isolation are associated with depressive symptoms, particularly in adolescents and young adults, but how these concepts are documented in clinical notes is unknown. This pilot study aimed to identify the topics relevant to social connection and isolation by analyzing 145 clinical notes from patients with depression diagnosis. We found that providers, including physicians, nurses, social workers, and psychologists, document descriptions of both social connection and social isolation.","pages":"26--31","doi":"10.18653\/v1\/W17-3103","url":"https:\/\/www.aclweb.org\/anthology\/W17-3103","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3104","title":"Monitoring Tweets for Depression to Detect At-risk Users","authors":["Jamil, Zunaira","Inkpen, Diana","Buddhitha, Prasadith","White, Kenton"],"emails":["zjami096@uottawa.ca","diana.inkpen@uottawa.ca","pkiri056@uottawa.ca","kenton.white@advancedsymbolics.com"],"author_id":["zunaira-jamil","diana-inkpen","prasadith-buddhitha","kenton-white"],"abstract":"We propose an automated system that can identify at-risk users from their public social media activity, more specifically, from Twitter. The data that we collected is from the {\\#}BellLetsTalk campaign, which is a wide-reaching, multi-year program designed to break the silence around mental illness and support mental health across Canada. To achieve our goal, we trained a user-level classifier that can detect at-risk users that achieves a reasonable precision and recall. We also trained a tweet-level classifier that predicts if a tweet indicates depression. This task was much more difficult due to the imbalanced data. In the dataset that we labeled, we came across 5{\\%} depression tweets and 95{\\%} non-depression tweets. To handle this class imbalance, we used undersampling methods. The resulting classifier had high recall, but low precision. Therefore, we only use this classifier to compute the estimated percentage of depressed tweets and to add this value as a feature for the user-level classifier.","pages":"32--40","doi":"10.18653\/v1\/W17-3104","url":"https:\/\/www.aclweb.org\/anthology\/W17-3104","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3105","title":"Investigating Patient Attitudes Towards the use of Social Media Data to Augment Depression Diagnosis and Treatment: a Qualitative Study","authors":["Mikal, Jude","Hurst, Samantha","Conway, Mike"],"emails":["jpmikal@umn.edu","shurst@ucsd.edu","mike.conway@utah.edu"],"author_id":["jude-mikal","samantha-hurst","mike-conway"],"abstract":"In this paper, we use qualitative research methods to investigate the attitudes of social media users towards the (opt-in) integration of social media data with routine mental health care and diagnosis. Our investigation was based on secondary analysis of a series of five focus groups with Twitter users, including three groups consisting of participants with a self-reported history of depression, and two groups consisting of participants without a self reported history of depression. Our results indicate that, overall, research participants were enthusiastic about the possibility of using social media (in conjunction with automated Natural Language Processing algorithms) for mood tracking under the supervision of a mental health practitioner. However, for at least some participants, there was skepticism related to how well social media represents the mental health of users, and hence its usefulness in the clinical context.","pages":"41--47","doi":"10.18653\/v1\/W17-3105","url":"https:\/\/www.aclweb.org\/anthology\/W17-3105","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3106","title":"Natural-language Interactive Narratives in Imaginal Exposure Therapy for Obsessive-Compulsive Disorder","authors":["Roemmele, Melissa","Mardo, Paola","Gordon, Andrew"],"emails":["roemmele@ict.usc.edu","paolamardo@gmail.com","gordon@ict.usc.edu"],"author_id":["melissa-roemmele","paola-mardo","andrew-gordon"],"abstract":"Obsessive-compulsive disorder (OCD) is an anxiety-based disorder that affects around 2.5{\\%} of the population. A common treatment for OCD is exposure therapy, where the patient repeatedly confronts a feared experience, which has the long-term effect of decreasing their anxiety. Some exposures consist of reading and writing stories about an imagined anxiety-provoking scenario. In this paper, we present a technology that enables patients to interactively contribute to exposure stories by supplying natural language input (typed or spoken) that advances a scenario. This interactivity could potentially increase the patient{'}s sense of immersion in an exposure and contribute to its success. We introduce the NLP task behind processing inputs to predict new events in the scenario, and describe our initial approach. We then illustrate the future possibility of this work with an example of an exposure scenario authored with our application.","pages":"48--57","doi":"10.18653\/v1\/W17-3106","url":"https:\/\/www.aclweb.org\/anthology\/W17-3106","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3107","title":"Detecting Anxiety through {R}eddit","authors":["Shen, Judy Hanwen","Rudzicz, Frank"],"emails":["judyhanwen.shen@mail.utoronto.ca","frank@spoclab.com"],"author_id":["judy-hanwen-shen","frank-rudzicz"],"abstract":"Previous investigations into detecting mental illnesses through social media have predominately focused on detecting depression through Twitter corpora. In this paper, we study anxiety disorders through personal narratives collected through the popular social media website, Reddit. We build a substantial data set of typical and anxiety-related posts, and we apply N-gram language modeling, vector embeddings, topic analysis, and emotional norms to generate features that accurately classify posts related to binary levels of anxiety. We achieve an accuracy of 91{\\%} with vector-space word embeddings, and an accuracy of 98{\\%} when combined with lexicon-based features.","pages":"58--65","doi":"10.18653\/v1\/W17-3107","url":"https:\/\/www.aclweb.org\/anthology\/W17-3107","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3108","title":"Detecting and Explaining Crisis","authors":["Kshirsagar, Rohan","Morris, Robert","Bowman, Samuel"],"emails":["rob@itskoko.com","rmk2161@columbia.edu","bowman@nyu.edu"],"author_id":["rohan-kshirsagar","robert-w-morris","samuel-bowman"],"abstract":"Individuals on social media may reveal themselves to be in various states of crisis (e.g. suicide, self-harm, abuse, or eating disorders). Detecting crisis from social media text automatically and accurately can have profound consequences. However, detecting a general state of crisis without explaining why has limited applications. An explanation in this context is a coherent, concise subset of the text that rationalizes the crisis detection. We explore several methods to detect and explain crisis using a combination of neural and non-neural techniques. We evaluate these techniques on a unique data set obtained from Koko, an anonymous emotional support network available through various messaging applications. We annotate a small subset of the samples labeled with crisis with corresponding explanations. Our best technique significantly outperforms the baseline for detection and explanation.","pages":"66--73","doi":"10.18653\/v1\/W17-3108","url":"https:\/\/www.aclweb.org\/anthology\/W17-3108","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3109","title":"A Dictionary-Based Comparison of Autobiographies by People and Murderous Monsters","authors":["Iserman, Micah","Ireland, Molly"],"emails":["micah.iserman@ttu.edu","molly.ireland@ttu.edu"],"author_id":["micah-iserman","molly-ireland"],"abstract":"People typically assume that killers are mentally ill or fundamentally different from the rest of humanity. Similarly, people often associate mental health conditions (such as schizophrenia or autism) with violence and otherness - treatable perhaps, but not empathically understandable. We take a dictionary approach to explore word use in a set of autobiographies, comparing the narratives of 2 killers (Adolf Hitler and Elliot Rodger) and 39 non-killers. Although results suggest several dimensions that differentiate these autobiographies - such as sentiment, temporal orientation, and references to death - they appear to reflect subject matter rather than psychology per se. Additionally, the Rodger text shows roughly typical developmental arcs in its use of words relating to friends, family, sex, and affect. From these data, we discuss the challenges of understanding killers and people in general.","pages":"74--84","doi":"10.18653\/v1\/W17-3109","url":"https:\/\/www.aclweb.org\/anthology\/W17-3109","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"},{"id":"W17-3110","title":"Small but Mighty: Affective Micropatterns for Quantifying Mental Health from Social Media Language","authors":["Loveys, Kate","Crutchley, Patrick","Wyatt, Emily","Coppersmith, Glen"],"emails":["kate@qntfy.com","patrick@qntfy.com","emily.wyatt@qntfy.com","glen@qntfy.com"],"author_id":["kate-loveys","patrick-crutchley","emily-wyatt","glen-coppersmith"],"abstract":"Many psychological phenomena occur in small time windows, measured in minutes or hours. However, most computational linguistic techniques look at data on the order of weeks, months, or years. We explore micropatterns in sequences of messages occurring over a short time window for their prevalence and power for quantifying psychological phenomena, specifically, patterns in affect. We examine affective micropatterns in social media posts from users with anxiety, eating disorders, panic attacks, schizophrenia, suicidality, and matched controls.","pages":"85--95","doi":"10.18653\/v1\/W17-3110","url":"https:\/\/www.aclweb.org\/anthology\/W17-3110","publisher":"Association for Computational Linguistics","address":"Vancouver, BC","year":"2017","month":"August","booktitle":"Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology {---} From Linguistic Signal to Clinical Reality"}]