[{"id":"W17-2201","title":"Metaphor Detection in a Poetry Corpus","authors":["Kesarwani, Vaibhav","Inkpen, Diana","Szpakowicz, Stan","Tanasescu, Chris"],"emails":["vkesa079@uottawa.ca","diana.inkpen@uottawa.ca","szpak@eecs.uottawa.ca","margento.official@gmail.com"],"author_id":["vaibhav-kesarwani","diana-inkpen","stan-szpakowicz","chris-tanasescu"],"abstract":"Metaphor is indispensable in poetry. It showcases the poet{'}s creativity, and contributes to the overall emotional pertinence of the poem while honing its specific rhetorical impact. Previous work on metaphor detection relies on either rule-based or statistical models, none of them applied to poetry. Our method focuses on metaphor detection in a poetry corpus. It combines rule-based and statistical models (word embeddings) to develop a new classification system. Our system has achieved a precision of 0.759 and a recall of 0.804 in identifying one type of metaphor in poetry.","pages":"1--9","doi":"10.18653\/v1\/W17-2201","url":"https:\/\/www.aclweb.org\/anthology\/W17-2201","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2202","title":"Machine Translation and Automated Analysis of the {S}umerian Language","authors":["Pag{\\'e}-Perron, {\\'E}milie","Sukhareva, Maria","Khait, Ilya","Chiarcos, Christian"],"emails":["e.page.perron@mail.utoronto.ca","sukhareva@em.uni-frankfurt.de","ges12bry@studserv.uni-leipzig.de","chiarcos@em.uni-frankfurt.de"],"author_id":["emilie-page-perron","maria-sukhareva","ilya-khait","christian-chiarcos"],"abstract":"This paper presents a newly funded international project for machine translation and automated analysis of ancient cuneiform languages where NLP specialists and Assyriologists collaborate to create an information retrieval system for Sumerian. This research is conceived in response to the need to translate large numbers of administrative texts that are only available in transcription, in order to make them accessible to a wider audience. The methodology includes creation of a specialized NLP pipeline and also the use of linguistic linked open data to increase access to the results.","pages":"10--16","doi":"10.18653\/v1\/W17-2202","url":"https:\/\/www.aclweb.org\/anthology\/W17-2202","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2203","title":"Investigating the Relationship between Literary Genres and Emotional Plot Development","authors":["Kim, Evgeny","Pad{\\'o}, Sebastian","Klinger, Roman"],"emails":["evgeny.kim@ims.uni-stuttgart.de","sebastian.pado@ims.uni-stuttgart.de","roman.klinger@ims.uni-stuttgart.de"],"author_id":["evgeny-kim","sebastian-pado","roman-klinger"],"abstract":"Literary genres are commonly viewed as being defined in terms of content and stylistic features. In this paper, we focus on one particular class of lexical features, namely emotion information, and investigate the hypothesis that emotion-related information correlates with particular genres. Using genre classification as a testbed, we compare a model that computes lexicon-based emotion scores globally for complete stories with a model that tracks emotion arcs through stories on a subset of Project Gutenberg with five genres. Our main findings are: (a), the global emotion model is competitive with a large-vocabulary bag-of-words genre classifier (80{\\%}F1); (b), the emotion arc model shows a lower performance (59 {\\%} F1) but shows complementary behavior to the global model, as indicated by a very good performance of an oracle model (94 {\\%} F1) and an improved performance of an ensemble model (84 {\\%} F1); (c), genres differ in the extent to which stories follow the same emotional arcs, with particularly uniform behavior for anger (mystery) and fear (adventures, romance, humor, science fiction).","pages":"17--26","doi":"10.18653\/v1\/W17-2203","url":"https:\/\/www.aclweb.org\/anthology\/W17-2203","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2204","title":"Enjambment Detection in a Large Diachronic Corpus of {S}panish Sonnets","authors":["Ruiz, Pablo","Mart{\\'\\i}nez Cant{\\'o}n, Clara","Poibeau, Thierry","Gonz{\\'a}lez-Blanco, Elena"],"emails":["pablo.ruiz.fabo@ens.fr","cimartinez@flog.uned.es","thierry.poibeau@ens.fr","egonzalezblanco@flog.uned.es"],"author_id":["pablo-ruiz","clara-martinez-canton","thierry-poibeau","elena-gonzalez-blanco"],"abstract":"Enjambment takes place when a syntactic unit is broken up across two lines of poetry, giving rise to different stylistic effects. In Spanish literary studies, there are unclear points about the types of stylistic effects that can arise, and under which linguistic conditions. To systematically gather evidence about this, we developed a system to automatically identify enjambment (and its type) in Spanish. For evaluation, we manually annotated a reference corpus covering different periods. As a scholarly corpus to apply the tool, from public HTML sources we created a diachronic corpus covering four centuries of sonnets (3750 poems), and we analyzed the occurrence of enjambment across stanzaic boundaries in different periods. Besides, we found examples that highlight limitations in current definitions of enjambment.","pages":"27--32","doi":"10.18653\/v1\/W17-2204","url":"https:\/\/www.aclweb.org\/anthology\/W17-2204","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2205","title":"Plotting {M}arkson{'}s {``}Mistress{''}","authors":["Kelleher, Conor","Keane, Mark"],"emails":["conor.kelleher.1@ucdconnect.ie","mark.keane@ucd.ie"],"author_id":["conor-kelleher","mark-keane"],"abstract":"The post-modern novel {``}Wittgenstein{'}s Mistress{''} by David Markson (1988) presents the reader with a very challenging non-linear narrative, that itself appears to one of the novel{'}s themes. We present a distant reading of this work designed to complement a close reading of it by David Foster Wallace (1990). Using a combination of text analysis, entity recognition and networks, we plot repetitive structures in the novel{'}s narrative relating them to its critical analysis.","pages":"33--39","doi":"10.18653\/v1\/W17-2205","url":"https:\/\/www.aclweb.org\/anthology\/W17-2205","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2206","title":"Annotation Challenges for Reconstructing the Structural Elaboration of Middle Low {G}erman","authors":["Seemann, Nina","Merten, Marie-Luis","Geierhos, Michaela","Tophinke, Doris","H{\\\"u}llermeier, Eyke"],"emails":["seemann@hni.upb.de","mlmerten@mail.upb.de","geierhos@hni.upb.de","doris.tophinke@upb.de","eyke@upb.de"],"author_id":["nina-seemann","marie-luis-merten","michaela-geierhos","doris-tophinke","eyke-hullermeier"],"abstract":"In this paper, we present the annotation challenges we have encountered when working on a historical language that was undergoing elaboration processes. We especially focus on syntactic ambiguity and gradience in Middle Low German, which causes uncertainty to some extent. Since current annotation tools consider construction contexts and the dynamics of the grammaticalization only partially, we plan to extend CorA - a web-based annotation tool for historical and other non-standard language data - to capture elaboration phenomena and annotator unsureness. Moreover, we seek to interactively learn morphological as well as syntactic annotations.","pages":"40--45","doi":"10.18653\/v1\/W17-2206","url":"https:\/\/www.aclweb.org\/anthology\/W17-2206","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2207","title":"Phonological Soundscapes in Medieval Poetry","authors":["Hench, Christopher"],"emails":["chench@berkeley.edu"],"author_id":["christopher-hench"],"abstract":"The oral component of medieval poetry was integral to its performance and reception. Yet many believe that the medieval voice has been forever lost, and any attempts at rediscovering it are doomed to failure due to scribal practices, manuscript mouvance, and linguistic normalization in editing practices. This paper offers a method to abstract from this noise and better understand relative differences in phonological soundscapes by considering syllable qualities. The presented syllabification method and soundscape analysis offer themselves as cross-disciplinary tools for low-resource languages. As a case study, we examine medieval German lyric and argue that the heavily debated lyrical {`}I{'} follows a unique trajectory through soundscapes, shedding light on the performance and practice of these poets.","pages":"46--56","doi":"10.18653\/v1\/W17-2207","url":"https:\/\/www.aclweb.org\/anthology\/W17-2207","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2208","title":"An End-to-end Environment for Research Question-Driven Entity Extraction and Network Analysis","authors":["Blessing, Andre","Echelmeyer, Nora","John, Markus","Reiter, Nils"],"emails":["","","",""],"author_id":["andre-blessing","nora-echelmeyer","markus-john","nils-reiter"],"abstract":"This paper presents an approach to extract co-occurrence networks from literary texts. It is a deliberate decision not to aim for a fully automatic pipeline, as the literary research questions need to guide both the definition of the nature of the things that co-occur as well as how to decide co-occurrence. We showcase the approach on a Middle High German romance, \\textit{Parzival}. Manual inspection and discussion shows the huge impact various choices have.","pages":"57--67","doi":"10.18653\/v1\/W17-2208","url":"https:\/\/www.aclweb.org\/anthology\/W17-2208","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2209","title":"Modeling intra-textual variation with entropy and surprisal: topical vs. stylistic patterns","authors":["Degaetano-Ortlieb, Stefania","Teich, Elke"],"emails":["e.teich@mx.uni-saarland.de","s.degaetano@mx.uni-saarland.de"],"author_id":["stefania-degaetano-ortlieb","elke-teich"],"abstract":"We present a data-driven approach to investigate intra-textual variation by combining entropy and surprisal. With this approach we detect linguistic variation based on phrasal lexico-grammatical patterns across sections of research articles. Entropy is used to detect patterns typical of specific sections. Surprisal is used to differentiate between more and less informationally-loaded patterns as well as type of information (topical vs. stylistic). While we here focus on research articles in biology\/genetics, the methodology is especially interesting for digital humanities scholars, as it can be applied to any text type or domain and combined with additional variables (e.g. time, author or social group).","pages":"68--77","doi":"10.18653\/v1\/W17-2209","url":"https:\/\/www.aclweb.org\/anthology\/W17-2209","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2210","title":"Finding a Character{'}s Voice: Stylome Classification on Literary Characters","authors":["Dinu, Liviu P.","Uban, Ana Sabina"],"emails":["liviu.p.dinu@gmail.com","ana.uban@gmail.com"],"author_id":["liviu-p-dinu","ana-sabina-uban"],"abstract":"We investigate in this paper the problem of classifying the stylome of characters in a literary work. Previous research in the field of authorship attribution has shown that the writing style of an author can be characterized and distinguished from that of other authors automatically. In this paper we take a look at the less approached problem of how the styles of different characters can be distinguished, trying to verify if an author managed to create believable characters with individual styles. We present the results of some initial experiments developed on the novel {``}Liaisons Dangereuses{''}, showing that a simple bag of words model can be used to classify the characters.","pages":"78--82","doi":"10.18653\/v1\/W17-2210","url":"https:\/\/www.aclweb.org\/anthology\/W17-2210","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2211","title":"An Ontology-Based Method for Extracting and Classifying Domain-Specific Compositional Nominal Compounds","authors":["di Buono, Maria Pia"],"emails":["mariapia.dibuono@fer.hr"],"author_id":["maria-pia-di-buono"],"abstract":"In this paper, we present our preliminary study on an ontology-based method to extract and classify compositional nominal compounds in specific domains of knowledge. This method is based on the assumption that, applying a conceptual model to represent knowledge domain, it is possible to improve the extraction and classification of lexicon occurrences for that domain in a semi-automatic way. We explore the possibility of extracting and classifying a specific construction type (nominal compounds) spanning a specific domain (Cultural Heritage) and a specific language (Italian).","pages":"83--88","doi":"10.18653\/v1\/W17-2211","url":"https:\/\/www.aclweb.org\/anthology\/W17-2211","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2212","title":"Speeding up corpus development for linguistic research: language documentation and acquisition in {R}omansh Tuatschin","authors":["Walther, G{\\'e}raldine","Sagot, Beno{\\^\\i}t"],"emails":["geraldine.walther@uzh.ch","benoit.sagot@inria.fr"],"author_id":["geraldine-walther","benoit-sagot"],"abstract":"In this paper, we present ongoing work for developing language resources and basic NLP tools for an undocumented variety of Romansh, in the context of a language documentation and language acquisition project. Our tools are meant to improve the speed and reliability of corpus annotations for noisy data involving large amounts of code-switching, occurrences of child-speech and orthographic noise. Being able to increase the efficiency of language resource development for language documentation and acquisition research also constitutes a step towards solving the data sparsity issues with which researchers have been struggling.","pages":"89--94","doi":"10.18653\/v1\/W17-2212","url":"https:\/\/www.aclweb.org\/anthology\/W17-2212","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2213","title":"Distantly Supervised {POS} Tagging of Low-Resource Languages under Extreme Data Sparsity: The Case of {H}ittite","authors":["Sukhareva, Maria","Fuscagni, Francesco","Daxenberger, Johannes","G{\\\"o}rke, Susanne","Prechel, Doris","Gurevych, Iryna"],"emails":["sukhareva@ukp.informatik.tu-darmstadt.de","","","","",""],"author_id":["maria-sukhareva","francesco-fuscagni","johannes-daxenberger","susanne-gorke","doris-prechel","iryna-gurevych"],"abstract":"This paper presents a statistical approach to automatic morphosyntactic annotation of Hittite transcripts. Hittite is an extinct Indo-European language using the cuneiform script. There are currently no morphosyntactic annotations available for Hittite, so we explored methods of distant supervision. The annotations were projected from parallel German translations of the Hittite texts. In order to reduce data sparsity, we applied stemming of German and Hittite texts. As there is no off-the-shelf Hittite stemmer, a stemmer for Hittite was developed for this purpose. The resulting annotation projections were used to train a POS tagger, achieving an accuracy of 69{\\%} on a test sample. To our knowledge, this is the first attempt of statistical POS tagging of a cuneiform language.","pages":"95--104","doi":"10.18653\/v1\/W17-2213","url":"https:\/\/www.aclweb.org\/anthology\/W17-2213","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2214","title":"A Dataset for {S}anskrit Word Segmentation","authors":["Krishna, Amrith","Satuluri, Pavan Kumar","Goyal, Pawan"],"emails":["amrith@iitkgp.ac.in","",""],"author_id":["amrith-krishna","pavankumar-satuluri","pawan-goyal"],"abstract":"The last decade saw a surge in digitisation efforts for ancient manuscripts in Sanskrit. Due to various linguistic peculiarities inherent to the language, even the preliminary tasks such as word segmentation are non-trivial in Sanskrit. Elegant models for Word Segmentation in Sanskrit are indispensable for further syntactic and semantic processing of the manuscripts. Current works in word segmentation for Sanskrit, though commendable in their novelty, often have variations in their objective and evaluation criteria. In this work, we set the record straight. We formally define the objectives and the requirements for the word segmentation task. In order to encourage research in the field and to alleviate the time and effort required in pre-processing, we release a dataset of 115,000 sentences for word segmentation. For each sentence in the dataset we include the input character sequence, ground truth segmentation, and additionally lexical and morphological information about all the phonetically possible segments for the given sentence. In this work, we also discuss the linguistic considerations made while generating the candidate space of the possible segments.","pages":"105--114","doi":"10.18653\/v1\/W17-2214","url":"https:\/\/www.aclweb.org\/anthology\/W17-2214","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W17-2215","title":"Lexical Correction of Polish Twitter Political Data","authors":["Ogrodniczuk, Maciej","Kope{\\'c}, Mateusz"],"emails":["maciej.ogrodniczuk@ipipan.waw.pl","m.kopec@phd.ipipan.waw.pl"],"author_id":["maciej-ogrodniczuk","mateusz-kopec"],"abstract":"Language processing architectures are often evaluated in near-to-perfect conditions with respect to processed content. The tools which perform sufficiently well on electronic press, books and other type of non-interactive content may poorly handle littered, colloquial and multilingual textual data which make the majority of communication today. This paper aims at investigating how Polish Twitter data (in a slightly controlled {`}political{'} flavour) differs from expectation of linguistic tools and how they could be corrected to be ready for processing by standard language processing chains available for Polish. The setting includes specialised components for spelling correction of tweets as well as hashtag and username decoding.","pages":"115--125","doi":"10.18653\/v1\/W17-2215","url":"https:\/\/www.aclweb.org\/anthology\/W17-2215","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"}]