[{"id":"W17-1801","title":"Understanding the Semantics of Narratives of Interpersonal Violence through Reader Annotations and Physiological Reactions","authors":["Calderwood, Alexander","Pruett, Elizabeth A.","Ptucha, Raymond","Homan, Christopher","Ovesdotter Alm, Cecilia"],"emails":["1alexander.d.calderwood@gmail.com","2pruette95@gmail.com","rwpeec@rit.edu","cmhvcs@rit.edu","coagla@rit.edu"],"author_id":["alexander-calderwood","elizabeth-a-pruett","raymond-ptucha","christopher-homan","cecilia-ovesdotter-alm"],"abstract":"Interpersonal violence (IPV) is a prominent sociological problem that affects people of all demographic backgrounds. By analyzing how readers interpret, perceive, and react to experiences narrated in social media posts, we explore an understudied source for discourse about abuse. We asked readers to annotate Reddit posts about relationships with vs. without IPV for stakeholder roles and emotion, while measuring their galvanic skin response (GSR), pulse, and facial expression. We map annotations to coreference resolution output to obtain a labeled coreference chain for stakeholders in texts, and apply automated semantic role labeling for analyzing IPV discourse. Findings provide insights into how readers process roles and emotion in narratives. For example, abusers tend to be linked with violent actions and certain affect states. We train classifiers to predict stakeholder categories of coreference chains. We also find that subjects{'} GSR noticeably changed for IPV texts, suggesting that co-collected measurement-based data about annotators can be used to support text annotation.","pages":"1--9","doi":"10.18653\/v1\/W17-1801","url":"https:\/\/www.aclweb.org\/anthology\/W17-1801","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1802","title":"Intension, Attitude, and Tense Annotation in a High-Fidelity Semantic Representation","authors":["Kim, Gene","Schubert, Lenhart"],"emails":["gkim21@cs.rochester.edu","schubert@cs.rochester.edu"],"author_id":["gene-kim","lenhart-schubert"],"abstract":"This paper describes current efforts in developing an annotation schema and guidelines for sentences in Episodic Logic (EL). We focus on important distinctions for representing modality, attitudes, and tense and present an annotation schema that makes these distinctions. EL has proved competitive with other logical formulations in speed and inference-enablement, while expressing a wider array of natural language phenomena including intensional modification of predicates and sentences, propositional attitudes, and tense and aspect.","pages":"10--15","doi":"10.18653\/v1\/W17-1802","url":"https:\/\/www.aclweb.org\/anthology\/W17-1802","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1803","title":"Towards a lexicon of event-selecting predicates for a {F}rench {F}act{B}ank","authors":["Falk, Ingrid","Martin, Fabienne"],"emails":["ingrid.falk@ling.uni-stuttgart.de","fabienne.martin@ling.uni-stuttgart.de"],"author_id":["ingrid-falk","fabienne-martin"],"abstract":"This paper presents ongoing work for the construction of a French FactBank and a lexicon of French event-selecting predicates (ESPs), by applying the factuality detection algorithm introduced in (Saur{\\'\\i} and Pustejovsky, 2012). This algorithm relies on a lexicon of ESPs, specifying how these predicates influence the polarity of their embedded events. For this pilot study, we focused on French factive and implicative verbs, and capitalised on a lexical resource for the English counterparts of these verbs provided by the CLSI Group (Nairn et al., 2006; Karttunen, 2012).","pages":"16--21","doi":"10.18653\/v1\/W17-1803","url":"https:\/\/www.aclweb.org\/anthology\/W17-1803","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1804","title":"Universal Dependencies to Logical Form with Negation Scope","authors":["Fancellu, Federico","Reddy, Siva","Lopez, Adam","Webber, Bonnie"],"emails":["f.fancellu@sms.ed.ac.uk","siva.reddy@ed.ac.uk","alopez@inf.ed.ac.uk","bonnie@inf.ed.ac.uk"],"author_id":["federico-fancellu","siva-reddy","adam-lopez","bonnie-webber"],"abstract":"Many language technology applications would benefit from the ability to represent negation and its scope on top of widely-used linguistic resources. In this paper, we investigate the possibility of obtaining a first-order logic representation with negation scope marked using \\textit{Universal Dependencies}. To do so, we enhance \\textit{UDepLambda}, a framework that converts dependency graphs to logical forms. The resulting \\textit{UDepLambda$\\lnot$ } is able to handle phenomena related to scope by means of an higher-order type theory, relevant not only to negation but also to universal quantification and other complex semantic phenomena. The initial conversion we did for English is promising, in that one can represent the scope of negation also in the presence of more complex phenomena such as universal quantifiers.","pages":"22--32","doi":"10.18653\/v1\/W17-1804","url":"https:\/\/www.aclweb.org\/anthology\/W17-1804","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1805","title":"Meaning Banking beyond Events and Roles","authors":["Bos, Johan"],"emails":["johan.bos@rug.nl"],"author_id":["johan-bos"],"abstract":"In this talk I will discuss the analysis of several semantic phenomena that need meaning representations that can describe attributes of propositional contexts. I will do this in a version of Discourse Representation Theory, using a universal semantic tagset developed as part of a project that aims to produce a large meaning bank (a semantically-annotated corpus) for four languages (English, Dutch, German and Italian).","pages":"33","doi":"10.18653\/v1\/W17-1805","url":"https:\/\/www.aclweb.org\/anthology\/W17-1805","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1806","title":"The Scope and Focus of Negation: A Complete Annotation Framework for {I}talian","authors":["Altuna, Bego{\\~n}a","Minard, Anne-Lyse","Speranza, Manuela"],"emails":["begona.altuna@ehu.eus","minard@fbk.eu","manspera@fbk.eu"],"author_id":["begona-altuna","anne-lyse-minard","manuela-speranza"],"abstract":"In this paper we present a complete framework for the annotation of negation in Italian, which accounts for both negation scope and negation focus, and also for language-specific phenomena such as negative concord. In our view, the annotation of negation complements more comprehensive Natural Language Processing tasks, such as temporal information processing and sentiment analysis. We applied the proposed framework and the guidelines built on top of it to the annotation of written texts, namely news articles and tweets, thus producing annotated data for a total of over 36,000 tokens.","pages":"34--42","doi":"10.18653\/v1\/W17-1806","url":"https:\/\/www.aclweb.org\/anthology\/W17-1806","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1807","title":"Annotation of negation in the {IULA} {S}panish Clinical Record Corpus","authors":["Marimon, Montserrat","Vivaldi, Jorge","Bel, N{\\'u}ria"],"emails":["montserrat.marimon@upf.edu","jorge.vivaldi@upf.edu","nuria.bel@upf.edu"],"author_id":["montserrat-marimon","jorge-vivaldi","nuria-bel"],"abstract":"This paper presents the IULA Spanish Clinical Record Corpus, a corpus of 3,194 sentences extracted from anonymized clinical records and manually annotated with negation markers and their scope. The corpus was conceived as a resource to support clinical text-mining systems, but it is also a useful resource for other Natural Language Processing systems handling clinical texts: automatic encoding of clinical records, diagnosis support, term extraction, among others, as well as for the study of clinical texts. The corpus is publicly available with a CC-BY-SA 3.0 license.","pages":"43--52","doi":"10.18653\/v1\/W17-1807","url":"https:\/\/www.aclweb.org\/anthology\/W17-1807","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1808","title":"Annotating Negation in {S}panish Clinical Texts","authors":["Cruz, Noa","Morante, Roser","Ma{\\~n}a L{\\'o}pez, Manuel J.","Mata V{\\'a}zquez, Jacinto","Parra Calder{\\'o}n, Carlos L."],"emails":["noapatricia.cruz.exts@juntadeandalucia.es","r.morantevallejo@vu.nl","manuel.mana@dti.uhu.es","jacinto.mata@dti.uhu.es","carlos.parra.sspa@juntadeandalucia.es"],"author_id":["noa-p-cruz-diaz","roser-morante","manuel-j-mana-lopez","jacinto-mata-vazquez","carlos-l-parra-calderon"],"abstract":"In this paper we present on-going work on annotating negation in Spanish clinical documents. A corpus of anamnesis and radiology reports has been annotated by two domain expert annotators with negation markers and negated events. The Dice coefficient for inter-annotator agreement is higher than 0.94 for negation markers and higher than 0.72 for negated events. The corpus will be publicly released when the annotation process is finished, constituting the first corpus annotated with negation for Spanish clinical reports available for the NLP community.","pages":"53--58","doi":"10.18653\/v1\/W17-1808","url":"https:\/\/www.aclweb.org\/anthology\/W17-1808","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1809","title":"Neural Networks for Negation Cue Detection in {C}hinese","authors":["He, Hangfeng","Fancellu, Federico","Webber, Bonnie"],"emails":["hangfenghe@pku.edu.cn","f.fancellu@sms.ed.ac.uk","bonnie@inf.ed.ac.uk"],"author_id":["hangfeng-he","federico-fancellu","bonnie-webber"],"abstract":"Negation cue detection involves identifying the span inherently expressing negation in a negative sentence. In Chinese, negative cue detection is complicated by morphological proprieties of the language. Previous work has shown that negative cue detection in Chinese can benefit from specific lexical and morphemic features, as well as cross-lingual information. We show here that they are not necessary: A bi-directional LSTM can perform equally well, with minimal feature engineering. In particular, the use of a character-based model allows us to capture characteristics of negation cues in Chinese using word-embedding information only. Not only does our model performs on par with previous work, further error analysis clarifies what problems remain to be addressed.","pages":"59--63","doi":"10.18653\/v1\/W17-1809","url":"https:\/\/www.aclweb.org\/anthology\/W17-1809","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"},{"id":"W17-1810","title":"An open-source tool for negation detection: a maximum-margin approach","authors":["Enger, Martine","Velldal, Erik","{\\O}vrelid, Lilja"],"emails":["marenger@ifi.uio.no","erikve@ifi.uio.no","liljao@ifi.uio.no"],"author_id":["martine-enger","erik-velldal","lilja-ovrelid"],"abstract":"This paper presents an open-source toolkit for negation detection. It identifies negation cues and their corresponding scope in either raw or parsed text using maximum-margin classification. The system design draws on best practice from the existing literature on negation detection, aiming for a simple and portable system that still achieves competitive performance. Pre-trained models and experimental results are provided for English.","pages":"64--69","doi":"10.18653\/v1\/W17-1810","url":"https:\/\/www.aclweb.org\/anthology\/W17-1810","publisher":"Association for Computational Linguistics","address":"Valencia, Spain","year":"2017","month":"April","booktitle":"Proceedings of the Workshop Computational Semantics Beyond Events and Roles"}]