[{"id":"W17-4901","title":"From Shakespeare to Twitter: What are Language Styles all about?","authors":["Xu, Wei"],"emails":["weixu@cse.ohio-state.edu"],"author_id":["wei-xu"],"abstract":"As natural language processing research is growing and largely driven by the availability of data, we expanded research from news and small-scale dialog corpora to web and social media. User-generated data and crowdsourcing opened the door for investigating human language of various styles with more statistical power and real-world applications. In this position\/survey paper, I will review and discuss seven language styles that I believe to be important and interesting to study: influential work in the past, challenges at the present, and potential impact for the future.","pages":"1--9","doi":"10.18653\/v1\/W17-4901","url":"https:\/\/www.aclweb.org\/anthology\/W17-4901","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4902","title":"Shakespearizing Modern Language Using Copy-Enriched Sequence to Sequence Models","authors":["Jhamtani, Harsh","Gangal, Varun","Hovy, Eduard","Nyberg, Eric"],"emails":["jharsh@cs.cmu.edu","vgangal@cs.cmu.edu","hovy@cs.cmu.edu","ehn@cs.cmu.edu"],"author_id":["harsh-jhamtani","varun-gangal","eduard-hovy","eric-nyberg"],"abstract":"Variations in writing styles are commonly used to adapt the content to a specific context, audience, or purpose. However, applying stylistic variations is still by and large a manual process, and there have been little efforts towards automating it. In this paper we explore automated methods to transform text from modern English to Shakespearean English using an end to end trainable neural model with pointers to enable copy action. To tackle limited amount of parallel data, we pre-train embeddings of words by leveraging external dictionaries mapping Shakespearean words to modern English words as well as additional text. Our methods are able to get a BLEU score of 31+, an improvement of {\\mbox{$\\approx$}} 6 points above the strongest baseline. We publicly release our code to foster further research in this area.","pages":"10--19","doi":"10.18653\/v1\/W17-4902","url":"https:\/\/www.aclweb.org\/anthology\/W17-4902","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4903","title":"Discovering Stylistic Variations in Distributional Vector Space Models via Lexical Paraphrases","authors":["Niu, Xing","Carpuat, Marine"],"emails":["xingniu@cs.umd.edu","marine@cs.umd.edu"],"author_id":["xing-niu","marine-carpuat"],"abstract":"Detecting and analyzing stylistic variation in language is relevant to diverse Natural Language Processing applications. In this work, we investigate whether salient dimensions of style variations are embedded in standard distributional vector spaces of word meaning. We hypothesizes that distances between embeddings of lexical paraphrases can help isolate style from meaning variations and help identify latent style dimensions. We conduct a qualitative analysis of latent style dimensions, and show the effectiveness of identified style subspaces on a lexical formality prediction task.","pages":"20--27","doi":"10.18653\/v1\/W17-4903","url":"https:\/\/www.aclweb.org\/anthology\/W17-4903","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4904","title":"Harvesting Creative Templates for Generating Stylistically Varied Restaurant Reviews","authors":["Oraby, Shereen","Homayon, Sheideh","Walker, Marilyn"],"emails":["soraby@ucsc.edu","shomayon@ucsc.edu","mawalker@ucsc.edu"],"author_id":["shereen-oraby","sheideh-homayon","marilyn-walker"],"abstract":"Many of the creative and figurative elements that make language exciting are lost in translation in current natural language generation engines. In this paper, we explore a method to harvest templates from positive and negative reviews in the restaurant domain, with the goal of vastly expanding the types of stylistic variation available to the natural language generator. We learn hyperbolic adjective patterns that are representative of the strongly-valenced expressive language commonly used in either positive or negative reviews. We then identify and delexicalize entities, and use heuristics to extract generation templates from review sentences. We evaluate the learned templates against more traditional review templates, using subjective measures of convincingness, interestingness, and naturalness. Our results show that the learned templates score highly on these measures. Finally, we analyze the linguistic categories that characterize the learned positive and negative templates. We plan to use the learned templates to improve the conversational style of dialogue systems in the restaurant domain.","pages":"28--36","doi":"10.18653\/v1\/W17-4904","url":"https:\/\/www.aclweb.org\/anthology\/W17-4904","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4905","title":"Is writing style predictive of scientific fraud?","authors":["Braud, Chlo{\\'e}","S{\\o}gaard, Anders"],"emails":["chloe.braud@gmail.com","soegaard@di.ku.dk"],"author_id":["chloe-braud","anders-sogaard"],"abstract":"The problem of detecting scientific fraud using machine learning was recently introduced, with initial, positive results from a model taking into account various general indicators. The results seem to suggest that writing style is predictive of scientific fraud. We revisit these initial experiments, and show that the leave-one-out testing procedure they used likely leads to a slight over-estimate of the predictability, but also that simple models can outperform their proposed model by some margin. We go on to explore more abstract linguistic features, such as linguistic complexity and discourse structure, only to obtain negative results. Upon analyzing our models, we do see some interesting patterns, though: Scientific fraud, for examples, contains less comparison, as well as different types of hedging and ways of presenting logical reasoning.","pages":"37--42","doi":"10.18653\/v1\/W17-4905","url":"https:\/\/www.aclweb.org\/anthology\/W17-4905","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4906","title":"{``}Deep{''} Learning : Detecting Metaphoricity in Adjective-Noun Pairs","authors":["Bizzoni, Yuri","Chatzikyriakidis, Stergios","Ghanimifard, Mehdi"],"emails":["yuri.bizzoni@gu.se","stergios.chatzikyriakidis@gu.se","mehdi.ghanimifard@gu.se"],"author_id":["yuri-bizzoni","stergios-chatzikyriakidis","mehdi-ghanimifard"],"abstract":"Metaphor is one of the most studied and widespread figures of speech and an essential element of individual style. In this paper we look at metaphor identification in Adjective-Noun pairs. We show that using a single neural network combined with pre-trained vector embeddings can outperform the state of the art in terms of accuracy. In specific, the approach presented in this paper is based on two ideas: a) transfer learning via using pre-trained vectors representing adjective noun pairs, and b) a neural network as a model of composition that predicts a metaphoricity score as output. We present several different architectures for our system and evaluate their performances. Variations on dataset size and on the kinds of embeddings are also investigated. We show considerable improvement over the previous approaches both in terms of accuracy and w.r.t the size of annotated training data.","pages":"43--52","doi":"10.18653\/v1\/W17-4906","url":"https:\/\/www.aclweb.org\/anthology\/W17-4906","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4907","title":"Authorship Attribution with Convolutional Neural Networks and {POS}-Eliding","authors":["Hitschler, Julian","van den Berg, Esther","Rehbein, Ines"],"emails":["hitschler@cl.uni-heidelberg.de","vdberg@cl.uni-heidelberg.de","rehbein@cl.uni-heidelberg.de"],"author_id":["julian-hitschler","esther-van-den-berg","ines-rehbein"],"abstract":"We use a convolutional neural network to perform authorship identification on a very homogeneous dataset of scientific publications. In order to investigate the effect of domain biases, we obscure words below a certain frequency threshold, retaining only their POS-tags. This procedure improves test performance due to better generalization on unseen data. Using our method, we are able to predict the authors of scientific publications in the same discipline at levels well above chance.","pages":"53--58","doi":"10.18653\/v1\/W17-4907","url":"https:\/\/www.aclweb.org\/anthology\/W17-4907","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4908","title":"Topic and audience effects on distinctively {S}cottish vocabulary usage in Twitter data","authors":["Shoemark, Philippa","Kirby, James","Goldwater, Sharon"],"emails":["p.j.shoemark@ed.ac.uk","j.kirby@ed.ac.uk","sgwater@inf.ed.ac.uk"],"author_id":["philippa-shoemark","james-kirby","sharon-goldwater"],"abstract":"Sociolinguistic research suggests that speakers modulate their language style in response to their audience. Similar effects have recently been claimed to occur in the informal written context of Twitter, with users choosing less region-specific and non-standard vocabulary when addressing larger audiences. However, these studies have not carefully controlled for the possible confound of topic: that is, tweets addressed to a broad audience might also tend towards topics that engender a more formal style. In addition, it is not clear to what extent previous results generalize to different samples of users. Using mixed-effects models, we show that audience and topic have independent effects on the rate of distinctively Scottish usage in two demographically distinct Twitter user samples. However, not all effects are consistent between the two groups, underscoring the importance of replicating studies on distinct user samples before drawing strong conclusions from social media data.","pages":"59--68","doi":"10.18653\/v1\/W17-4908","url":"https:\/\/www.aclweb.org\/anthology\/W17-4908","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4909","title":"Differences in type-token ratio and part-of-speech frequencies in male and female {R}ussian written texts","authors":["Litvinova, Tatiana","Seredin, Pavel","Litvinova, Olga","Zagorovskaya, Olga"],"emails":["centr_rus_yaz@mail.ru","","",""],"author_id":["tatiana-litvinova","pavel-seredin","olga-litvinova","olga-zagorovskaya"],"abstract":"The differences in the frequencies of some parts of speech (POS), particularly function words, and lexical diversity in male and female speech have been pointed out in a number of papers. The classifiers using exclusively context-independent parameters have proved to be highly effective. However, there are still issues that have to be addressed as a lot of studies are performed for English and the genre and topic of texts is sometimes neglected. The aim of this paper is to investigate the association between context-independent parameters of Russian written texts and the gender of their authors and to design predictive re-gression models. A number of correlations were found. The obtained data is in good agreement with the results obtained for other languages. The model based on 5 parameters with the highest correlation coefficients was designed.","pages":"69--73","doi":"10.18653\/v1\/W17-4909","url":"https:\/\/www.aclweb.org\/anthology\/W17-4909","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4910","title":"Modeling Communicative Purpose with Functional Style: Corpus and Features for {G}erman Genre and Register Analysis","authors":["Haider, Thomas","Palmer, Alexis"],"emails":["thomas.haider@ae.mpg.de","alexis.palmer@unt.edu"],"author_id":["thomas-haider","alexis-palmer"],"abstract":"While there is wide acknowledgement in NLP of the utility of document characterization by genre, it is quite difficult to determine a definitive set of features or even a comprehensive list of genres. This paper addresses both issues. First, with prototype semantics, we develop a hierarchical taxonomy of discourse functions. We implement the taxonomy by developing a new text genre corpus of contemporary German to perform a text based comparative register analysis. Second, we extract a host of style features, both deep and shallow, aiming beyond linguistically motivated features at situational correlates in texts. The feature sets are used for supervised text genre classification, on which our models achieve high accuracy. The combination of the corpus typology and feature sets allows us to characterize types of communicative purpose in a comparative setup, by qualitative interpretation of style feature loadings of a regularized discriminant analysis. Finally, to determine the dependence of genre on topics (which are arguably the distinguishing factor of sub-genre), we compare and combine our style models with Latent Dirichlet Allocation features across different corpus settings with unstable topics.","pages":"74--84","doi":"10.18653\/v1\/W17-4910","url":"https:\/\/www.aclweb.org\/anthology\/W17-4910","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4911","title":"Stylistic Variation in Television Dialogue for Natural Language Generation","authors":["Lin, Grace","Walker, Marilyn"],"emails":["glin5@ucsc.edu","mawwalker@ucsc.edu"],"author_id":["grace-lin","marilyn-walker"],"abstract":"Conversation is a critical component of storytelling, where key information is often revealed by what\/how a character says it. We focus on the issue of character voice and build stylistic models with linguistic features related to natural language generation decisions. Using a dialogue corpus of the television series, The Big Bang Theory, we apply content analysis to extract relevant linguistic features to build character-based stylistic models, and we test the model-fit through an user perceptual experiment with Amazon{'}s Mechanical Turk. The results are encouraging in that human subjects tend to perceive the generated utterances as being more similar to the character they are modeled on, than to another random character.","pages":"85--93","doi":"10.18653\/v1\/W17-4911","url":"https:\/\/www.aclweb.org\/anthology\/W17-4911","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4912","title":"Controlling Linguistic Style Aspects in Neural Language Generation","authors":["Ficler, Jessica","Goldberg, Yoav"],"emails":["jessica.ficler@gmail.com","yoav.goldberg@gmail.com"],"author_id":["jessica-ficler","yoav-goldberg"],"abstract":"Most work on neural natural language generation (NNLG) focus on controlling the content of the generated text. We experiment with controling several stylistic aspects of the generated text, in addition to its content. The method is based on conditioned RNN language model, where the desired content as well as the stylistic parameters serve as conditioning contexts. We demonstrate the approach on the movie reviews domain and show that it is successful in generating coherent sentences corresponding to the required linguistic style and content.","pages":"94--104","doi":"10.18653\/v1\/W17-4912","url":"https:\/\/www.aclweb.org\/anthology\/W17-4912","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4913","title":"Approximating Style by N-gram-based Annotation","authors":["Andresen, Melanie","Zinsmeister, Heike"],"emails":["melanie.andresen@uni-hamburg.de","heike.zinsmeister@uni-hamburg.de"],"author_id":["melanie-andresen","heike-zinsmeister"],"abstract":"The concept of style is much debated in theoretical as well as empirical terms. From an empirical perspective, the key question is how to operationalize style and thus make it accessible for annotation and quantification. In authorship attribution, many different approaches have successfully resolved this issue at the cost of linguistic interpretability: The resulting algorithms may be able to distinguish one language variety from the other, but do not give us much information on their distinctive linguistic properties. We approach the issue of interpreting stylistic features by extracting linear and syntactic n-grams that are distinctive for a language variety. We present a study that exemplifies this process by a comparison of the German academic languages of linguistics and literary studies. Overall, our findings show that distinctive n-grams can be related to linguistic categories. The results suggest that the style of German literary studies is characterized by nominal structures and the style of linguistics by verbal ones.","pages":"105--115","doi":"10.18653\/v1\/W17-4913","url":"https:\/\/www.aclweb.org\/anthology\/W17-4913","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"},{"id":"W17-4914","title":"Assessing the Stylistic Properties of Neurally Generated Text in Authorship Attribution","authors":["Manjavacas, Enrique","De Gussem, Jeroen","Daelemans, Walter","Kestemont, Mike"],"emails":["jedgusse.degussem@ugent.be","istory@ugent.be","lastname@uantwerpen.be","firstname@uantwerpen.be"],"author_id":["enrique-manjavacas","jeroen-de-gussem","walter-daelemans","mike-kestemont"],"abstract":"Recent applications of neural language models have led to an increased interest in the automatic generation of natural language. However impressive, the evaluation of neurally generated text has so far remained rather informal and anecdotal. Here, we present an attempt at the systematic assessment of one aspect of the quality of neurally generated text. We focus on a specific aspect of neural language generation: its ability to reproduce authorial writing styles. Using established models for authorship attribution, we empirically assess the stylistic qualities of neurally generated text. In comparison to conventional language models, neural models generate fuzzier text, that is relatively harder to attribute correctly. Nevertheless, our results also suggest that neurally generated text offers more valuable perspectives for the augmentation of training data.","pages":"116--125","doi":"10.18653\/v1\/W17-4914","url":"https:\/\/www.aclweb.org\/anthology\/W17-4914","publisher":"Association for Computational Linguistics","address":"Copenhagen, Denmark","year":"2017","month":"September","booktitle":"Proceedings of the Workshop on Stylistic Variation"}]