[{"id":"W17-7701","title":"Deception Detection for the {R}ussian Language: Lexical and Syntactic Parameters","authors":["Pisarevskaya, Dina","Litvinova, Tatiana","Litvinova, Olga"],"emails":["dinabpr@gmail.com","centr_rus_yaz@mail.ru",""],"author_id":["dina-pisarevskaya","tatiana-litvinova","olga-litvinova"],"abstract":"The field of automated deception detection in written texts is methodologically challenging. Different linguistic levels (lexics, syntax and semantics) are basically used for different types of English texts to reveal if they are truthful or deceptive. Such parameters as POS tags and POS tags n-grams, punctuation marks, sentiment polarity of words, psycholinguistic features, fragments of syntaсtic structures are taken into consideration. The importance of different types of parameters was not compared for the Russian language before and should be investigated before moving to complex models and higher levels of linguistic processing. On the example of the Russian Deception Bank Corpus we estimate the impact of three groups of features (POS features including bigrams, sentiment and psycholinguistic features, syntax and readability features) on the successful deception detection and find out that POS features can be used for binary text classification, but the results should be double-checked and, if possible, improved.","pages":"1--10","doi":"10.26615\/978-954-452-038-0_001","url":"https:\/\/doi.org\/10.26615\/978-954-452-038-0_001","publisher":"INCOMA Inc.","address":"Varna, Bulgaria","year":"2017","month":"September","booktitle":"Proceedings of the 1st Workshop on Natural Language Processing and Information Retrieval associated with {RANLP} 2017"},{"id":"W17-7702","title":"o{IQ}a: An Opinion Influence Oriented Question Answering Framework with Applications to Marketing Domain","authors":["Cercel, Dumitru-Clementin","Onose, Cristian","Trausan-Matu, Stefan","Pop, Florin"],"emails":["clementin.cercel@gmail.com","onose.cristian@gmail.com","stefan.trausan@cs.pub.ro","florin.pop@cs.pub.ro"],"author_id":["dumitru-clementin-cercel","cristian-onose","stefan-trausan-matu","florin-pop"],"abstract":"Understanding questions and answers in QA system is a major challenge in the domain of natural language processing. In this paper, we present a question answering system that influences the human opinions in a conversation. The opinion words are quantified by using a lexicon-based method. We apply Latent Semantic Analysis and the cosine similarity measure between candidate answers and each question to infer the answer of the chatbot.","pages":"11--18","doi":"10.26615\/978-954-452-038-0_002","url":"https:\/\/doi.org\/10.26615\/978-954-452-038-0_002","publisher":"INCOMA Inc.","address":"Varna, Bulgaria","year":"2017","month":"September","booktitle":"Proceedings of the 1st Workshop on Natural Language Processing and Information Retrieval associated with {RANLP} 2017"},{"id":"W17-7703","title":"Automatic Summarization of Online Debates","authors":["Sanchan, Nattapong","Aker, Ahmet","Bontcheva, Kalina"],"emails":["","",""],"author_id":["nattapong-sanchan","ahmet-aker","kalina-bontcheva"],"abstract":"Debate summarization is one of the novel and challenging research areas in automatic text summarization which has been largely unexplored. In this paper, we develop a debate summarization pipeline to summarize key topics which are discussed or argued in the two opposing sides of online debates. We view that the generation of debate summaries can be achieved by clustering, cluster labeling, and visualization. In our work, we investigate two different clustering approaches for the generation of the summaries. In the first approach, we generate the summaries by applying purely term-based clustering and cluster labeling. The second approach makes use of X-means for clustering and Mutual Information for labeling the clusters. Both approaches are driven by ontologies. We visualize the results using bar charts. We think that our results are a smooth entry for users aiming to receive the first impression about what is discussed within a debate topic containing waste number of argumentations.","pages":"19--27","doi":"10.26615\/978-954-452-038-0_003","url":"https:\/\/doi.org\/10.26615\/978-954-452-038-0_003","publisher":"INCOMA Inc.","address":"Varna, Bulgaria","year":"2017","month":"September","booktitle":"Proceedings of the 1st Workshop on Natural Language Processing and Information Retrieval associated with {RANLP} 2017"},{"id":"W17-7704","title":"A Game with a Purpose for Automatic Detection of Children{'}s Speech Disabilities using Limited Speech Resources","authors":["Salem, Reem","Elmahdy, Mohamed","Abdennadher, Slim","Hamed, Injy"],"emails":["reem.elhady@student.guc.edu.eg","mohamed.elmahdy@guc.edu.eg","slim.abdennadher@guc.edu.eg","injy.hamed@guc.edu.eg"],"author_id":["reem-salem","mohamed-elmahdy","slim-abdennadher","injy-hamed"],"abstract":"Speech therapists and researchers are becoming more concerned with the use of computer-based systems in the therapy of speech disorders. In this paper, we propose a computer-based game with a purpose (GWAP) for speech therapy of Egyptian speaking children suffering from Dyslalia. Our aim is to detect if a certain phoneme is pronounced correctly. An Egyptian Arabic speech corpus has been collected. A baseline acoustic model was trained using the Egyptian corpus. In order to benefit from existing large amounts of Modern Standard Arabic (MSA) resources, MSA acoustic models were adapted with the collected Egyptian corpus. An independent testing set that covers common speech disorders has been collected for Egyptian speakers. Results show that adapted acoustic models give better recognition accuracy which could be relied on in the game and that children show more interest in playing the game than in visiting the therapist. A noticeable progress in children Dyslalia appeared with the proposed system.","pages":"28--34","doi":"10.26615\/978-954-452-038-0_004","url":"https:\/\/doi.org\/10.26615\/978-954-452-038-0_004","publisher":"INCOMA Inc.","address":"Varna, Bulgaria","year":"2017","month":"September","booktitle":"Proceedings of the 1st Workshop on Natural Language Processing and Information Retrieval associated with {RANLP} 2017"}]