[{"id":"W18-2301","title":"Embedding Transfer for Low-Resource Medical Named Entity Recognition: A Case Study on Patient Mobility","authors":["Newman-Griffis, Denis","Zirikly, Ayah"],"emails":["denis.griffis@nih.gov","ayah.zirikly@nih.gov"],"author_id":["denis-newman-griffis","ayah-zirikly"],"abstract":"Functioning is gaining recognition as an important indicator of global health, but remains under-studied in medical natural language processing research. We present the first analysis of automatically extracting descriptions of patient mobility, using a recently-developed dataset of free text electronic health records. We frame the task as a named entity recognition (NER) problem, and investigate the applicability of NER techniques to mobility extraction. As text corpora focused on patient functioning are scarce, we explore domain adaptation of word embeddings for use in a recurrent neural network NER system. We find that embeddings trained on a small in-domain corpus perform nearly as well as those learned from large out-of-domain corpora, and that domain adaptation techniques yield additional improvements in both precision and recall. Our analysis identifies several significant challenges in extracting descriptions of patient mobility, including the length and complexity of annotated entities and high linguistic variability in mobility descriptions.","pages":"1--11","doi":"10.18653\/v1\/W18-2301","url":"https:\/\/www.aclweb.org\/anthology\/W18-2301","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2302","title":"Multi-task learning for interpretable cause of death classification using key phrase prediction","authors":["Jeblee, Serena","Gomes, Mireille","Hirst, Graeme"],"emails":["sjeblee@cs.toronto.edu","mireille.m.gomes@gmail.com","gh@cs.toronto.edu"],"author_id":["serena-jeblee","mireille-gomes","graeme-hirst"],"abstract":"We introduce a multi-task learning model for cause-of-death classification of verbal autopsy narratives that jointly learns to output interpretable key phrases. Adding these key phrases outperforms the baseline model and topic modeling features.","pages":"12--17","doi":"10.18653\/v1\/W18-2302","url":"https:\/\/www.aclweb.org\/anthology\/W18-2302","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2303","title":"Identifying Risk Factors For Heart Disease in Electronic Medical Records: A Deep Learning Approach","authors":["Chokwijitkul, Thanat","Nguyen, Anthony","Hassanzadeh, Hamed","Perez, Siegfried"],"emails":["t.chokwijitkul@uqconnect.edu.au","","assanzadeh@csiro.au","erez@health.qld.gov.au"],"author_id":["thanat-chokwijitkul","anthony-nguyen","hamed-hassanzadeh","siegfried-perez"],"abstract":"Automatic identification of heart disease risk factors in clinical narratives can expedite disease progression modelling and support clinical decisions. Existing practical solutions for cardiovascular risk detection are mostly hybrid systems entailing the integration of knowledge-driven and data-driven methods, relying on dictionaries, rules and machine learning methods that require a substantial amount of human effort. This paper proposes a comparative analysis on the applicability of deep learning, a re-emerged data-driven technique, in the context of clinical text classification. Various deep learning architectures were devised and evaluated for extracting heart disease risk factors from clinical documents. The data provided for the 2014 i2b2\/UTHealth shared task focusing on identifying risk factors for heart disease was used for system development and evaluation. Results have shown that a relatively simple deep learning model can achieve a high micro-averaged F-measure of 0.9081, which is comparable to the best systems from the shared task. This is highly encouraging given the simplicity of the deep learning approach compared to the heavily feature-engineered hybrid approaches that were required to achieve state-of-the-art performances.","pages":"18--27","doi":"10.18653\/v1\/W18-2303","url":"https:\/\/www.aclweb.org\/anthology\/W18-2303","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2304","title":"Keyphrases Extraction from User-Generated Contents in Healthcare Domain Using Long Short-Term Memory Networks","authors":["Saputra, Ilham Fathy","Mahendra, Rahmad","Wicaksono, Alfan Farizki"],"emails":["ilham.fathy@ui.ac.id","rahmad.mahendra@cs.ui.ac.id","alfan@cs.ui.ac.id"],"author_id":["ilham-fathy-saputra","rahmad-mahendra","alfan-farizki-wicaksono"],"abstract":"We propose keyphrases extraction technique to extract important terms from the healthcare user-generated contents. We employ deep learning architecture, i.e. Long Short-Term Memory, and leverage word embeddings, medical concepts from a knowledge base, and linguistic components as our features. The proposed model achieves 61.37{\\%} F-1 score. Experimental results indicate that our proposed approach outperforms the baseline methods, i.e. RAKE and CRF, on the task of extracting keyphrases from Indonesian health forum posts.","pages":"28--34","doi":"10.18653\/v1\/W18-2304","url":"https:\/\/www.aclweb.org\/anthology\/W18-2304","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2305","title":"Identifying Key Sentences for Precision Oncology Using Semi-Supervised Learning","authors":["{\\v{S}}eva, Jurica","Wackerbauer, Martin","Leser, Ulf"],"emails":["seva@informatik.hu-berlin.de","wackerbm@informatik.hu-berlin.de","leser@informatik.hu-berlin.de"],"author_id":["jurica-seva","martin-wackerbauer","ulf-leser"],"abstract":"We present a machine learning pipeline that identifies key sentences in abstracts of oncological articles to aid evidence-based medicine. This problem is characterized by the lack of gold standard datasets, data imbalance and thematic differences between available silver standard corpora. Additionally, available training and target data differs with regard to their domain (professional summaries vs. sentences in abstracts). This makes supervised machine learning inapplicable. We propose the use of two semi-supervised machine learning approaches: To mitigate difficulties arising from heterogeneous data sources, overcome data imbalance and create reliable training data we propose using transductive learning from positive and unlabelled data (PU Learning). For obtaining a realistic classification model, we propose the use of abstracts summarised in relevant sentences as unlabelled examples through Self-Training. The best model achieves 84{\\%} accuracy and 0.84 F1 score on our dataset","pages":"35--46","doi":"10.18653\/v1\/W18-2305","url":"https:\/\/www.aclweb.org\/anthology\/W18-2305","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2306","title":"Ontology alignment in the biomedical domain using entity definitions and context","authors":["Wang, Lucy","Bhagavatula, Chandra","Neumann, Mark","Lo, Kyle","Wilhelm, Chris","Ammar, Waleed"],"emails":["lucylw@uw.edu","","","","",""],"author_id":["lucy-wang","chandra-bhagavatula","mark-neumann","kyle-lo","chris-wilhelm","waleed-ammar"],"abstract":"Ontology alignment is the task of identifying semantically equivalent entities from two given ontologies. Different ontologies have different representations of the same entity, resulting in a need to de-duplicate entities when merging ontologies. We propose a method for enriching entities in an ontology with external definition and context information, and use this additional information for ontology alignment. We develop a neural architecture capable of encoding the additional information when available, and show that the addition of external data results in an F1-score of 0.69 on the Ontology Alignment Evaluation Initiative (OAEI) largebio SNOMED-NCI subtask, comparable with the entity-level matchers in a SOTA system.","pages":"47--55","doi":"10.18653\/v1\/W18-2306","url":"https:\/\/www.aclweb.org\/anthology\/W18-2306","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2307","title":"Sub-word information in pre-trained biomedical word representations: evaluation and hyper-parameter optimization","authors":["Galea, Dieter","Laponogov, Ivan","Veselkov, Kirill"],"emails":["d.galea14@imperial.ac.uk","i.laponogov@imperial.ac.uk","kirill.veselkov04@imperial.ac.uk"],"author_id":["dieter-galea","ivan-laponogov","kirill-veselkov"],"abstract":"Word2vec embeddings are limited to computing vectors for in-vocabulary terms and do not take into account sub-word information. Character-based representations, such as fastText, mitigate such limitations. We optimize and compare these representations for the biomedical domain. fastText was found to consistently outperform word2vec in named entity recognition tasks for entities such as chemicals and genes. This is likely due to gained information from computed out-of-vocabulary term vectors, as well as the word compositionality of such entities. Contrastingly, performance varied on intrinsic datasets. Optimal hyper-parameters were intrinsic dataset-dependent, likely due to differences in term types distributions. This indicates embeddings should be chosen based on the task at hand. We therefore provide a number of optimized hyper-parameter sets and pre-trained word2vec and fastText models, available on \\url{https:\/\/github.com\/dterg\/bionlp-embed}.","pages":"56--66","doi":"10.18653\/v1\/W18-2307","url":"https:\/\/www.aclweb.org\/anthology\/W18-2307","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2308","title":"{PICO} Element Detection in Medical Text via Long Short-Term Memory Neural Networks","authors":["Jin, Di","Szolovits, Peter"],"emails":["jindi15@mit.edu","psz@mit.edu"],"author_id":["di-jin","peter-szolovits"],"abstract":"Successful evidence-based medicine (EBM) applications rely on answering clinical questions by analyzing large medical literature databases. In order to formulate a well-defined, focused clinical question, a framework called PICO is widely used, which identifies the sentences in a given medical text that belong to the four components: Participants\/Problem (P), Intervention (I), Comparison (C) and Outcome (O). In this work, we present a Long Short-Term Memory (LSTM) neural network based model to automatically detect PICO elements. By jointly classifying subsequent sentences in the given text, we achieve state-of-the-art results on PICO element classification compared to several strong baseline models. We also make our curated data public as a benchmarking dataset so that the community can benefit from it.","pages":"67--75","doi":"10.18653\/v1\/W18-2308","url":"https:\/\/www.aclweb.org\/anthology\/W18-2308","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2309","title":"Coding Structures and Actions with the {COSTA} Scheme in Medical Conversations","authors":["Wang, Nan","Song, Yan","Xia, Fei"],"emails":["nwang3@ucla.edu","",""],"author_id":["nan-wang","yan-song","fei-xia"],"abstract":"This paper describes the COSTA scheme for coding structures and actions in conversation. Informed by Conversation Analysis, the scheme introduces an innovative method for marking multi-layer structural organization of conversation and a structure-informed taxonomy of actions. In addition, we create a corpus of naturally occurring medical conversations, containing 318 video-recorded and manually transcribed pediatric consultations. Based on the annotated corpus, we investigate 1) treatment decision-making process in medical conversations, and 2) effects of physician-caregiver communication behaviors on antibiotic over-prescribing. Although the COSTA annotation scheme is developed based on data from the task-specific domain of pediatric consultations, it can be easily extended to apply to more general domains and other languages.","pages":"76--86","doi":"10.18653\/v1\/W18-2309","url":"https:\/\/www.aclweb.org\/anthology\/W18-2309","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2310","title":"A Neural Autoencoder Approach for Document Ranking and Query Refinement in Pharmacogenomic Information Retrieval","authors":["Pfeiffer, Jonas","Broscheit, Samuel","Gemulla, Rainer","G{\\\"o}schl, Mathias"],"emails":["","lastname@informatik.uni-mannheim.de","","oeschl@molecularhealth.com"],"author_id":["jonas-pfeiffer","samuel-broscheit","rainer-gemulla","mathias-goschl"],"abstract":"In this study, we investigate learning-to-rank and query refinement approaches for information retrieval in the pharmacogenomic domain. The goal is to improve the information retrieval process of biomedical curators, who manually build knowledge bases for personalized medicine. We study how to exploit the relationships between genes, variants, drugs, diseases and outcomes as features for document ranking and query refinement. For a supervised approach, we are faced with a small amount of annotated data and a large amount of unannotated data. Therefore, we explore ways to use a neural document auto-encoder in a semi-supervised approach. We show that a combination of established algorithms, feature-engineering and a neural auto-encoder model yield promising results in this setting.","pages":"87--97","doi":"10.18653\/v1\/W18-2310","url":"https:\/\/www.aclweb.org\/anthology\/W18-2310","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2311","title":"Biomedical Event Extraction Using Convolutional Neural Networks and Dependency Parsing","authors":["Bj{\\\"o}rne, Jari","Salakoski, Tapio"],"emails":["jari.bj{\\\"o}rne@utu.fi","tapio.salakoski@utu.fi"],"author_id":["jari-bjorne","tapio-salakoski"],"abstract":"Event and relation extraction are central tasks in biomedical text mining. Where relation extraction concerns the detection of semantic connections between pairs of entities, event extraction expands this concept with the addition of trigger words, multiple arguments and nested events, in order to more accurately model the diversity of natural language. In this work we develop a convolutional neural network that can be used for both event and relation extraction. We use a linear representation of the input text, where information is encoded with various vector space embeddings. Most notably, we encode the parse graph into this linear space using dependency path embeddings. We integrate our neural network into the open source Turku Event Extraction System (TEES) framework. Using this system, our machine learning model can be easily applied to a large set of corpora from e.g. the BioNLP, DDI Extraction and BioCreative shared tasks. We evaluate our system on 12 different event, relation and NER corpora, showing good generalizability to many tasks and achieving improved performance on several corpora.","pages":"98--108","doi":"10.18653\/v1\/W18-2311","url":"https:\/\/www.aclweb.org\/anthology\/W18-2311","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2312","title":"{B}io{AMA}: Towards an End to End {B}io{M}edical Question Answering System","authors":["Sharma, Vasu","Kulkarni, Nitish","Pranavi, Srividya","Bayomi, Gabriel","Nyberg, Eric","Mitamura, Teruko"],"emails":["vasus@cs.cmu.edu","nitishkk@cs.cmu.edu","spothara@cs.cmu.edu","gbk@cs.cmu.edu","ehn@cs.cmu.edu","teruko@cs.cmu.edu"],"author_id":["vasu-sharma","nitish-kulkarni","srividya-pranavi","gabriel-bayomi","eric-nyberg","teruko-mitamura"],"abstract":"In this paper, we present a novel Biomedical Question Answering system, BioAMA: {``}Biomedical Ask Me Anything{''} on task 5b of the annual BioASQ challenge. In this work, we focus on a wide variety of question types including factoid, list based, summary and yes\/no type questions that generate both exact and well-formed {`}ideal{'} answers. For summary-type questions, we combine effective IR-based techniques for retrieval and diversification of relevant snippets for a question to create an end-to-end system which achieves a ROUGE-2 score of 0.72 and a ROUGE-SU4 score of 0.71 on ideal answer questions (7{\\%} improvement over the previous best model). Additionally, we propose a novel NLI-based framework to answer the yes\/no questions. To train the NLI model, we also devise a transfer-learning technique by cross-domain projection of word embeddings. Finally, we present a two-stage approach to address the factoid and list type questions by first generating a candidate set using NER taggers and ranking them using both supervised or unsupervised techniques.","pages":"109--117","doi":"10.18653\/v1\/W18-2312","url":"https:\/\/www.aclweb.org\/anthology\/W18-2312","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2313","title":"{P}hrase2{V}ec{GLM}: Neural generalized language model{--}based semantic tagging for complex query reformulation in medical {IR}","authors":["Das, Manirupa","Fosler-Lussier, Eric","Lin, Simon","Moosavinasab, Soheil","Chen, David","Rust, Steve","Huang, Yungui","Ramnath, Rajiv"],"emails":["das.65@osu.edu","","fosler.1@osu.edu","","","","uang@nationwidechildrens.org","ramnath.6@osu.edu"],"author_id":["manirupa-das","eric-fosler-lussier","simon-lin","soheil-moosavinasab","david-chen","steve-rust","yungui-huang","rajiv-ramnath"],"abstract":"In this work, we develop a novel, completely unsupervised, neural language model-based document ranking approach to semantic tagging of documents, using the document to be tagged as a query into the GLM to retrieve candidate phrases from top-ranked related documents, thus associating every document with novel related concepts extracted from the text. For this we extend the word embedding-based general language model due to Ganguly et al 2015, to employ phrasal embeddings, and use the semantic tags thus obtained for downstream query expansion, both directly and in feedback loop settings. Our method, evaluated using the TREC 2016 clinical decision support challenge dataset, shows statistically significant improvement not only over various baselines that use standard MeSH terms and UMLS concepts for query expansion, but also over baselines using human expert{--}assigned concept tags for the queries, run on top of a standard Okapi BM25{--}based document retrieval system.","pages":"118--128","doi":"10.18653\/v1\/W18-2313","url":"https:\/\/www.aclweb.org\/anthology\/W18-2313","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2314","title":"Convolutional neural networks for chemical-disease relation extraction are improved with character-based word embeddings","authors":["Nguyen, Dat Quoc","Verspoor, Karin"],"emails":["dqnguyen@unimelb.edu.au","karin.verspoor@unimelb.edu.au"],"author_id":["dat-quoc-nguyen","karin-verspoor"],"abstract":"We investigate the incorporation of character-based word representations into a standard CNN-based relation extraction model. We experiment with two common neural architectures, CNN and LSTM, to learn word vector representations from character embeddings. Through a task on the BioCreative-V CDR corpus, extracting relationships between chemicals and diseases, we show that models exploiting the character-based word representations improve on models that do not use this information, obtaining state-of-the-art result relative to previous neural approaches.","pages":"129--136","doi":"10.18653\/v1\/W18-2314","url":"https:\/\/www.aclweb.org\/anthology\/W18-2314","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2315","title":"Domain Adaptation for Disease Phrase Matching with Adversarial Networks","authors":["Liu, Miaofeng","Han, Jialong","Zhang, Haisong","Song, Yan"],"emails":["water3er@gmail.com","jialonghan@gmail.com","hansonzhang@tencent.com","clksong@tencent.com"],"author_id":["miaofeng-liu","jialong-han","haisong-zhang","yan-song"],"abstract":"With the development of medical information management, numerous medical data are being classified, indexed, and searched in various systems. Disease phrase matching, i.e., deciding whether two given disease phrases interpret each other, is a basic but crucial preprocessing step for the above tasks. Being capable of relieving the scarceness of annotations, domain adaptation is generally considered useful in medical systems. However, efforts on applying it to phrase matching remain limited. This paper presents a domain-adaptive matching network for disease phrases. Our network achieves domain adaptation by adversarial training, i.e., preferring features indicating whether the two phrases match, rather than which domain they come from. Experiments suggest that our model has the best performance among the very few non-adaptive or adaptive methods that can benefit from out-of-domain annotations.","pages":"137--141","doi":"10.18653\/v1\/W18-2315","url":"https:\/\/www.aclweb.org\/anthology\/W18-2315","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2316","title":"Predicting Discharge Disposition Using Patient Complaint Notes in Electronic Medical Records","authors":["Salimi, Mohamad","Rozovskaya, Alla"],"emails":["mohamad.salimi45@qmail.cuny.edu","arozovskaya@qc.cuny.edu"],"author_id":["mohamad-salimi","alla-rozovskaya"],"abstract":"Overcrowding in emergency rooms is a major challenge faced by hospitals across the United States. Overcrowding can result in longer wait times, which, in turn, has been shown to adversely affect patient satisfaction, clinical outcomes, and procedure reimbursements. This paper presents research that aims to automatically predict discharge disposition of patients who received medical treatment in an emergency department. We make use of a corpus that consists of notes containing patient complaints, diagnosis information, and disposition, entered by health care providers. We use this corpus to develop a model that uses the complaint and diagnosis information to predict patient disposition. We show that the proposed model substantially outperforms the baseline of predicting the most common disposition type. The long-term goal of this research is to build a model that can be implemented as a real-time service in an application to predict disposition as patients arrive.","pages":"142--146","doi":"10.18653\/v1\/W18-2316","url":"https:\/\/www.aclweb.org\/anthology\/W18-2316","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2317","title":"Bacteria and Biotope Entity Recognition Using A Dictionary-Enhanced Neural Network Model","authors":["Wang, Qiuyue","Meng, Xiaofeng"],"emails":["qiuyuew@ruc.edu.cn","xfmeng@ruc.edu.cn"],"author_id":["qiuyue-wang","xiaofeng-meng"],"abstract":"Automatic recognition of biomedical entities in text is the crucial initial step in biomedical text mining. In this pa-per, we investigate employing modern neural network models for recognizing biomedical entities. To compensate for the small amount of training data in biomedical domain, we propose to integrate dictionaries into the neural model. Our experiments on BB3 data sets demonstrate that state-of-the-art neural network model is promising in recognizing biomedical entities even with very little training data. When integrated with dictionaries, its performance could be greatly improved, achieving the competitive performance compared with the best dictionary-based system on the entities with specific terminology, and much higher performance on the entities with more general terminology.","pages":"147--150","doi":"10.18653\/v1\/W18-2317","url":"https:\/\/www.aclweb.org\/anthology\/W18-2317","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2318","title":"{S}ingle{C}ite: Towards an improved Single Citation Search in {P}ub{M}ed","authors":["Yeganova, Lana","Comeau, Donald C","Kim, Won","Wilbur, W John","Lu, Zhiyong"],"emails":["yeganova@mail.nih.gov","comeau@mail.nih.gov","wonkim@mail.nih.gov","wilbur@mail.nih.gov","luzh@mail.nih.gov"],"author_id":["lana-yeganova","donald-c-comeau","won-kim","w-john-wilbur","zhiyong-lu"],"abstract":"A search that is targeted at finding a specific document in databases is called a Single Citation search. Single citation searches are particularly important for scholarly databases, such as PubMed, because users are frequently searching for a specific publication. In this work we describe SingleCite, a single citation matching system designed to facilitate user{'}s search for a specific document. We report on the progress that has been achieved towards building that functionality.","pages":"151--155","doi":"10.18653\/v1\/W18-2318","url":"https:\/\/www.aclweb.org\/anthology\/W18-2318","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2319","title":"A Framework for Developing and Evaluating Word Embeddings of Drug-named Entity","authors":["Zhao, Mengnan","Masino, Aaron J.","Yang, Christopher C."],"emails":["mz438@drexel.edu","email.chop.edu@drexel.edu","ccy24@drexel.edu"],"author_id":["mengnan-zhao","aaron-j-masino","christopher-c-yang"],"abstract":"We investigate the quality of task specific word embeddings created with relatively small, targeted corpora. We present a comprehensive evaluation framework including both intrinsic and extrinsic evaluation that can be expanded to named entities beyond drug name. Intrinsic evaluation results tell that drug name embeddings created with a domain specific document corpus outperformed the previously published versions that derived from a very large general text corpus. Extrinsic evaluation uses word embedding for the task of drug name recognition with Bi-LSTM model and the results demonstrate the advantage of using domain-specific word embeddings as the only input feature for drug name recognition with F1-score achieving 0.91. This work suggests that it may be advantageous to derive domain specific embeddings for certain tasks even when the domain specific corpus is of limited size.","pages":"156--160","doi":"10.18653\/v1\/W18-2319","url":"https:\/\/www.aclweb.org\/anthology\/W18-2319","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2320","title":"{M}e{SH}-based dataset for measuring the relevance of text retrieval","authors":["Kim, Won Gyu","Yeganova, Lana","Comeau, Donald","Wilbur, W John","Lu, Zhiyong"],"emails":["wonkim@mail.nih.gov","yeganova@mail.nih.gov","comeau@mail.nih.gov","wilbur@mail.nih.gov","luzh@mail.nih.gov"],"author_id":["won-gyu-kim","lana-yeganova","donald-c-comeau","w-john-wilbur","zhiyong-lu"],"abstract":"Creating simulated search environments has been of a significant interest in infor-mation retrieval, in both general and bio-medical search domains. Existing collec-tions include modest number of queries and are constructed by manually evaluat-ing retrieval results. In this work we pro-pose leveraging MeSH term assignments for creating synthetic test beds. We select a suitable subset of MeSH terms as queries, and utilize MeSH term assignments as pseudo-relevance rankings for retrieval evaluation. Using well studied retrieval functions, we show that their performance on the proposed data is consistent with similar findings in previous work. We further use the proposed retrieval evaluation framework to better understand how to combine heterogeneous sources of textual information.","pages":"161--165","doi":"10.18653\/v1\/W18-2320","url":"https:\/\/www.aclweb.org\/anthology\/W18-2320","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2321","title":"{CRF}-{LSTM} Text Mining Method Unveiling the Pharmacological Mechanism of Off-target Side Effect of Anti-Multiple Myeloma Drugs","authors":["Zhou, Kaiyin","Zhang, Sheng","Meng, Xiangyu","Luo, Qi","Wang, Yuxing","Ding, Ke","Feng, Yukun","Chen, Mo","Cohen, Kevin","Xia, Jingbo"],"emails":["","","","","","","","","","xiajingbo.math@gmail.com"],"author_id":["kaiyin-zhou","sheng-zhang","xiangyu-meng","qi-luo","yuxing-wang","ke-ding","yukun-feng","mo-chen","k-bretonnel-cohen","jingbo-xia"],"abstract":"Sequence labeling of biomedical entities, e.g., side effects or phenotypes, was a long-term task in BioNLP and MedNLP communities. Thanks to effects made among these communities, adverse reaction NER has developed dramatically in recent years. As an illuminative application, to achieve knowledge discovery via the combination of the text mining result and bioinformatics idea shed lights on the pharmacological mechanism research.","pages":"166--171","doi":"10.18653\/v1\/W18-2321","url":"https:\/\/www.aclweb.org\/anthology\/W18-2321","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2322","title":"Prediction Models for Risk of Type-2 Diabetes Using Health Claims","authors":["Nagata, Masatoshi","Takai, Kohichi","Yasuda, Keiji","Heracleous, Panikos","Yoneyama, Akio"],"emails":["ms-nagata@kddi-research.jp","ko-takai@kddi-research.jp","ke-yasuda@dsc.naist.jp","pa-heracleous@kddi-research.jp","yoneyama@kddi-research.jp"],"author_id":["masatoshi-nagata","kohichi-takai","keiji-yasuda","panikos-heracleous","akio-yoneyama"],"abstract":"This study focuses on highly accurate prediction of the onset of type-2 diabetes. We investigated whether prediction accuracy can be improved by utilizing lab test data obtained from health checkups and incorporating health claim text data such as medically diagnosed diseases with ICD10 codes and pharmacy information. In a previous study, prediction accuracy was increased slightly by adding diagnosis disease name and independent variables such as prescription medicine. Therefore, in the current study we explored more suitable models for prediction by using state-of-the-art techniques such as XGBoost and long short-term memory (LSTM) based on recurrent neural networks. In the current study, text data was vectorized using word2vec, and the prediction model was compared with logistic regression. The results obtained confirmed that onset of type-2 diabetes can be predicted with a high degree of accuracy when the XGBoost model is used.","pages":"172--176","doi":"10.18653\/v1\/W18-2322","url":"https:\/\/www.aclweb.org\/anthology\/W18-2322","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2323","title":"On Learning Better Embeddings from {C}hinese Clinical Records: Study on Combining In-Domain and Out-Domain Data","authors":["Wang, Yaqiang","Chen, Yunhui","Shu, Hongping","Jiang, Yongguang"],"emails":["yaqwang@cuit.edu.cn","","",""],"author_id":["yaqiang-wang","yunhui-chen","hongping-shu","yongguang-jiang"],"abstract":"High quality word embeddings are of great significance to advance applications of biomedical natural language processing. In recent years, a surge of interest on how to learn good embeddings and evaluate embedding quality based on English medical text has become increasing evident, however a limited number of studies based on Chinese medical text, particularly Chinese clinical records, were performed. Herein, we proposed a novel approach of improving the quality of learned embeddings using out-domain data as a supplementary in the case of limited Chinese clinical records. Moreover, the embedding quality evaluation method was conducted based on Medical Conceptual Similarity Property. The experimental results revealed that selecting good training samples was necessary, and collecting right amount of out-domain data and trading off between the quality of embeddings and the training time consumption were essential factors for better embeddings.","pages":"177--182","doi":"10.18653\/v1\/W18-2323","url":"https:\/\/www.aclweb.org\/anthology\/W18-2323","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2324","title":"Investigating Domain-Specific Information for Neural Coreference Resolution on Biomedical Texts","authors":["Trieu, Hai-Long","Nguyen, Nhung T. H.","Miwa, Makoto","Ananiadou, Sophia"],"emails":["long.trieu@aist.go.jp","","makoto-miwa@toyota-ti.ac.jp","naniadou@manchester.ac.uk"],"author_id":["hai-long-trieu","nhung-t-h-nguyen","makoto-miwa","sophia-ananiadou"],"abstract":"Existing biomedical coreference resolution systems depend on features and\/or rules based on syntactic parsers. In this paper, we investigate the utility of the state-of-the-art general domain neural coreference resolution system on biomedical texts. The system is an end-to-end system without depending on any syntactic parsers. We also investigate the domain specific features to enhance the system for biomedical texts. Experimental results on the BioNLP Protein Coreference dataset and the CRAFT corpus show that, with no parser information, the adapted system compared favorably with the systems that depend on parser information on these datasets, achieving 51.23{\\%} on the BioNLP dataset and 36.33{\\%} on the CRAFT corpus in F1 score. In-domain embeddings and domain-specific features helped improve the performance on the BioNLP dataset, but they did not on the CRAFT corpus.","pages":"183--188","doi":"10.18653\/v1\/W18-2324","url":"https:\/\/www.aclweb.org\/anthology\/W18-2324","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"},{"id":"W18-2325","title":"Toward Cross-Domain Engagement Analysis in Medical Notes","authors":["Rosenthal, Sara","Faulkner, Adam"],"emails":["sjrosenthal@us.ibm.com","adam.faulkner@grammarly.com"],"author_id":["sara-rosenthal","adam-faulkner"],"abstract":"We present a novel annotation task evaluating a patient{'}s engagement with their health care regimen. The concept of engagement supplements the traditional concept of adherence with a focus on the patient{'}s affect, lifestyle choices, and health goal status. We describe an engagement annotation task across two patient note domains: traditional clinical notes and a novel domain, care manager notes, where we find engagement to be more common. The annotation task resulted in a kappa of .53, suggesting strong annotator intuitions regarding engagement-bearing language. In addition, we report the results of a series of preliminary engagement classification experiments using domain adaptation.","pages":"189--193","doi":"10.18653\/v1\/W18-2325","url":"https:\/\/www.aclweb.org\/anthology\/W18-2325","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the {B}io{NLP} 2018 workshop"}]