[{"id":"W18-1601","title":"Stylistic variation over 200 years of court proceedings according to gender and social class","authors":["Degaetano-Ortlieb, Stefania"],"emails":["s.degaetano@mx.uni-saarland.de"],"author_id":["stefania-degaetano-ortlieb"],"abstract":"We present an approach to detect stylistic variation across social variables (here: gender and social class), considering also diachronic change in language use. For detection of stylistic variation, we use relative entropy, measuring the difference between probability distributions at different linguistic levels (here: lexis and grammar). In addition, by relative entropy, we can determine which linguistic units are related to stylistic variation.","pages":"1--10","doi":"10.18653\/v1\/W18-1601","url":"https:\/\/www.aclweb.org\/anthology\/W18-1601","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Stylistic Variation"},{"id":"W18-1602","title":"Stylistic Variation in Social Media Part-of-Speech Tagging","authors":["Balusu, Murali Raghu Babu","Merghani, Taha","Eisenstein, Jacob"],"emails":["b.murali@gatech.edu","tmerghani3@gatech.edu","jacobe@gatech.edu"],"author_id":["murali-raghu-babu-balusu","taha-merghani","jacob-eisenstein"],"abstract":"Social media features substantial stylistic variation, raising new challenges for syntactic analysis of online writing. However, this variation is often aligned with author attributes such as age, gender, and geography, as well as more readily-available social network metadata. In this paper, we report new evidence on the link between language and social networks in the task of part-of-speech tagging. We find that tagger error rates are correlated with network structure, with high accuracy in some parts of the network, and lower accuracy elsewhere. As a result, tagger accuracy depends on training from a balanced sample of the network, rather than training on texts from a narrow subcommunity. We also describe our attempts to add robustness to stylistic variation, by building a mixture-of-experts model in which each expert is associated with a region of the social network. While prior work found that similar approaches yield performance improvements in sentiment analysis and entity linking, we were unable to obtain performance improvements in part-of-speech tagging, despite strong evidence for the link between part-of-speech error rates and social network structure.","pages":"11--19","doi":"10.18653\/v1\/W18-1602","url":"https:\/\/www.aclweb.org\/anthology\/W18-1602","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Stylistic Variation"},{"id":"W18-1603","title":"Detecting Syntactic Features of Translated {C}hinese","authors":["Hu, Hai","Li, Wen","K{\\\"u}bler, Sandra"],"emails":["huhai@indiana.edu","wl9@indiana.edu","skuebler@indiana.edu"],"author_id":["hai-hu","wen-li","sandra-kubler"],"abstract":"We present a machine learning approach to distinguish texts translated to Chinese (by humans) from texts originally written in Chinese, with a focus on a wide range of syntactic features. Using Support Vector Machines (SVMs) as classifier on a genre-balanced corpus in translation studies of Chinese, we find that constituent parse trees and dependency triples as features without lexical information perform very well on the task, with an F-measure above 90{\\%}, close to the results of lexical n-gram features, without the risk of learning topic information rather than translation features. Thus, we claim syntactic features alone can accurately distinguish translated from original Chinese. Translated Chinese exhibits an increased use of determiners, subject position pronouns, NP + {``}的{''} as NP modifiers, multiple NPs or VPs conjoined by ''、'', among other structures. We also interpret the syntactic features with reference to previous translation studies in Chinese, particularly the usage of pronouns.","pages":"20--28","doi":"10.18653\/v1\/W18-1603","url":"https:\/\/www.aclweb.org\/anthology\/W18-1603","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Stylistic Variation"},{"id":"W18-1604","title":"Evaluating Creative Language Generation: The Case of Rap Lyric Ghostwriting","authors":["Potash, Peter","Romanov, Alexey","Rumshisky, Anna"],"emails":["ppotash@cs.uml.edu","aromanov@cs.uml.edu","arum@cs.uml.edu"],"author_id":["peter-potash","alexey-romanov","anna-rumshisky"],"abstract":"Language generation tasks that seek to mimic human ability to use language creatively are difficult to evaluate, since one must consider creativity, style, and other non-trivial aspects of the generated text. The goal of this paper is to develop evaluations methods for one such task, ghostwriting of rap lyrics, and to provide an explicit, quantifiable foundation for the goals and future directions for this task. Ghostwriting must produce text that is similar in style to the emulated artist, yet distinct in content. We develop a novel evaluation methodology that addresses several complementary aspects of this task, and illustrate how such evaluation can be used to meaning fully analyze system performance. We provide a corpus of lyrics for 13 rap artists, annotated for stylistic similarity, which allows us to assess the feasibility of manual evaluation for generated verse.","pages":"29--38","doi":"10.18653\/v1\/W18-1604","url":"https:\/\/www.aclweb.org\/anthology\/W18-1604","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Stylistic Variation"},{"id":"W18-1605","title":"Cross-corpus Native Language Identification via Statistical Embedding","authors":["Rangel, Francisco","Rosso, Paolo","Brooke, Julian","Uitdenbogerd, Alexandra"],"emails":["francisco.rangel@autoritas.es","prosso@dsic.upv.es","julian.brooke@gmail.com","sandra.uitdenbogerd@rmit.edu.au"],"author_id":["francisco-rangel","paolo-rosso","julian-brooke","alexandra-l-uitdenbogerd"],"abstract":"In this paper, we approach the task of native language identification in a realistic cross-corpus scenario where a model is trained with available data and has to predict the native language from data of a different corpus. The motivation behind this study is to investigate native language identification in the Australian academic scenario where a majority of students come from China, Indonesia, and Arabic-speaking nations. We have proposed a statistical embedding representation reporting a significant improvement over common single-layer approaches of the state of the art, identifying Chinese, Arabic, and Indonesian in a cross-corpus scenario. The proposed approach was shown to be competitive even when the data is scarce and imbalanced.","pages":"39--43","doi":"10.18653\/v1\/W18-1605","url":"https:\/\/www.aclweb.org\/anthology\/W18-1605","publisher":"Association for Computational Linguistics","address":"New Orleans","year":"2018","month":"June","booktitle":"Proceedings of the Second Workshop on Stylistic Variation"}]