[{"id":"W18-2701","title":"Findings of the Second Workshop on Neural Machine Translation and Generation","authors":["Birch, Alexandra","Finch, Andrew","Luong, Minh-Thang","Neubig, Graham","Oda, Yusuke"],"emails":["","","","",""],"author_id":["alexandra-birch","andrew-finch","minh-thang-luong","graham-neubig","yusuke-oda"],"abstract":"This document describes the findings of the Second Workshop on Neural Machine Translation and Generation, held in concert with the annual conference of the Association for Computational Linguistics (ACL 2018). First, we summarize the research trends of papers presented in the proceedings, and note that there is particular interest in linguistic structure, domain adaptation, data augmentation, handling inadequate resources, and analysis of models. Second, we describe the results of the workshop{'}s shared task on efficient neural machine translation, where participants were tasked with creating MT systems that are both accurate and efficient.","pages":"1--10","doi":"10.18653\/v1\/W18-2701","url":"https:\/\/www.aclweb.org\/anthology\/W18-2701","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2702","title":"A Shared Attention Mechanism for Interpretation of Neural Automatic Post-Editing Systems","authors":["Jauregi Unanue, Inigo","Zare Borzeshi, Ehsan","Piccardi, Massimo"],"emails":["ijauregi@cmcrc.com","ezborzeshi@cmcrc.com","massimo.piccardi@uts.edu.au"],"author_id":["inigo-jauregi-unanue","ehsan-zare-borzeshi","massimo-piccardi"],"abstract":"Automatic post-editing (APE) systems aim to correct the systematic errors made by machine translators. In this paper, we propose a neural APE system that encodes the source (src) and machine translated (mt) sentences with two separate encoders, but leverages a shared attention mechanism to better understand how the two inputs contribute to the generation of the post-edited (pe) sentences. Our empirical observations have showed that when the mt is incorrect, the attention shifts weight toward tokens in the src sentence to properly edit the incorrect translation. The model has been trained and evaluated on the official data from the WMT16 and WMT17 APE IT domain English-German shared tasks. Additionally, we have used the extra 500K artificial data provided by the shared task. Our system has been able to reproduce the accuracies of systems trained with the same data, while at the same time providing better interpretability.","pages":"11--17","doi":"10.18653\/v1\/W18-2702","url":"https:\/\/www.aclweb.org\/anthology\/W18-2702","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2703","title":"Iterative Back-Translation for Neural Machine Translation","authors":["Hoang, Vu Cong Duy","Koehn, Philipp","Haffari, Gholamreza","Cohn, Trevor"],"emails":["vhoang2@student.unimelb.edu.au","phi@jhu.edu","gholamreza.haffari@monash.edu","tcohn@unimelb.edu.au"],"author_id":["vu-cong-duy-hoang","philipp-koehn","gholamreza-haffari","trevor-cohn"],"abstract":"We present iterative back-translation, a method for generating increasingly better synthetic parallel data from monolingual data to train neural machine translation systems. Our proposed method is very simple yet effective and highly applicable in practice. We demonstrate improvements in neural machine translation quality in both high and low resourced scenarios, including the best reported BLEU scores for the WMT 2017 German↔English tasks.","pages":"18--24","doi":"10.18653\/v1\/W18-2703","url":"https:\/\/www.aclweb.org\/anthology\/W18-2703","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2704","title":"Inducing Grammars with and for Neural Machine Translation","authors":["Bisk, Yonatan","Tran, Ke"],"emails":["ybisk@cs.washington.com","ketranmanh@gmail.com"],"author_id":["yonatan-bisk","ke-m-tran"],"abstract":"Machine translation systems require semantic knowledge and grammatical understanding. Neural machine translation (NMT) systems often assume this information is captured by an attention mechanism and a decoder that ensures fluency. Recent work has shown that incorporating explicit syntax alleviates the burden of modeling both types of knowledge. However, requiring parses is expensive and does not explore the question of what syntax a model needs during translation. To address both of these issues we introduce a model that simultaneously translates while inducing dependency trees. In this way, we leverage the benefits of structure while investigating what syntax NMT must induce to maximize performance. We show that our dependency trees are 1. language pair dependent and 2. improve translation quality.","pages":"25--35","doi":"10.18653\/v1\/W18-2704","url":"https:\/\/www.aclweb.org\/anthology\/W18-2704","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2705","title":"Regularized Training Objective for Continued Training for Domain Adaptation in Neural Machine Translation","authors":["Khayrallah, Huda","Thompson, Brian","Duh, Kevin","Koehn, Philipp"],"emails":["huda@jhu.edu","brian.thompson@jhu.edu","kevinduh@cs.jhu.edu","phi@cs.jhu.edu"],"author_id":["huda-khayrallah","brian-thompson","kevin-duh","philipp-koehn"],"abstract":"Supervised domain adaptation{---}where a large generic corpus and a smaller in-domain corpus are both available for training{---}is a challenge for neural machine translation (NMT). Standard practice is to train a generic model and use it to initialize a second model, then continue training the second model on in-domain data to produce an in-domain model. We add an auxiliary term to the training objective during continued training that minimizes the cross entropy between the in-domain model{'}s output word distribution and that of the out-of-domain model to prevent the model{'}s output from differing too much from the original out-of-domain model. We perform experiments on EMEA (descriptions of medicines) and TED (rehearsed presentations), initialized from a general domain (WMT) model. Our method shows improvements over standard continued training by up to 1.5 BLEU.","pages":"36--44","doi":"10.18653\/v1\/W18-2705","url":"https:\/\/www.aclweb.org\/anthology\/W18-2705","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2706","title":"Controllable Abstractive Summarization","authors":["Fan, Angela","Grangier, David","Auli, Michael"],"emails":["","",""],"author_id":["angela-fan","david-grangier","michael-auli"],"abstract":"Current models for document summarization disregard user preferences such as the desired length, style, the entities that the user might be interested in, or how much of the document the user has already read. We present a neural summarization model with a simple but effective mechanism to enable users to specify these high level attributes in order to control the shape of the final summaries to better suit their needs. With user input, our system can produce high quality summaries that follow user preferences. Without user input, we set the control variables automatically {--} on the full text CNN-Dailymail dataset, we outperform state of the art abstractive systems (both in terms of F1-ROUGE1 40.38 vs. 39.53 F1-ROUGE and human evaluation.","pages":"45--54","doi":"10.18653\/v1\/W18-2706","url":"https:\/\/www.aclweb.org\/anthology\/W18-2706","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2707","title":"Enhancement of Encoder and Attention Using Target Monolingual Corpora in Neural Machine Translation","authors":["Imamura, Kenji","Fujita, Atsushi","Sumita, Eiichiro"],"emails":["kenji.imamura@nict.go.jp","atsushi.fujita@nict.go.jp","eiichiro.sumita@nict.go.jp"],"author_id":["kenji-imamura","atsushi-fujita","eiichiro-sumita"],"abstract":"A large-scale parallel corpus is required to train encoder-decoder neural machine translation. The method of using synthetic parallel texts, in which target monolingual corpora are automatically translated into source sentences, is effective in improving the decoder, but is unreliable for enhancing the encoder. In this paper, we propose a method that enhances the encoder and attention using target monolingual corpora by generating multiple source sentences via sampling. By using multiple source sentences, diversity close to that of humans is achieved. Our experimental results show that the translation quality is improved by increasing the number of synthetic source sentences for each given target sentence, and quality close to that using a manually created parallel corpus was achieved.","pages":"55--63","doi":"10.18653\/v1\/W18-2707","url":"https:\/\/www.aclweb.org\/anthology\/W18-2707","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2708","title":"Document-Level Adaptation for Neural Machine Translation","authors":["Kothur, Sachith Sri Ram","Knowles, Rebecca","Koehn, Philipp"],"emails":["kothursachith@gmail.com","rknowles@jhu.edu","phi@jhu.edu"],"author_id":["sachith-sri-ram-kothur","rebecca-knowles","philipp-koehn"],"abstract":"It is common practice to adapt machine translation systems to novel domains, but even a well-adapted system may be able to perform better on a particular document if it were to learn from a translator{'}s corrections within the document itself. We focus on adaptation within a single document {--} appropriate for an interactive translation scenario where a model adapts to a human translator{'}s input over the course of a document. We propose two methods: single-sentence adaptation (which performs online adaptation one sentence at a time) and dictionary adaptation (which specifically addresses the issue of translating novel words). Combining the two models results in improvements over both approaches individually, and over baseline systems, even on short documents. On WMT news test data, we observe an improvement of +1.8 BLEU points and +23.3{\\%} novel word translation accuracy and on EMEA data (descriptions of medications) we observe an improvement of +2.7 BLEU points and +49.2{\\%} novel word translation accuracy.","pages":"64--73","doi":"10.18653\/v1\/W18-2708","url":"https:\/\/www.aclweb.org\/anthology\/W18-2708","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2709","title":"On the Impact of Various Types of Noise on Neural Machine Translation","authors":["Khayrallah, Huda","Koehn, Philipp"],"emails":["huda@jhu.edu","phi@jhu.edu"],"author_id":["huda-khayrallah","philipp-koehn"],"abstract":"We examine how various types of noise in the parallel training data impact the quality of neural machine translation systems. We create five types of artificial noise and analyze how they degrade performance in neural and statistical machine translation. We find that neural models are generally more harmed by noise than statistical models. For one especially egregious type of noise they learn to just copy the input sentence.","pages":"74--83","doi":"10.18653\/v1\/W18-2709","url":"https:\/\/www.aclweb.org\/anthology\/W18-2709","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2710","title":"Bi-Directional Neural Machine Translation with Synthetic Parallel Data","authors":["Niu, Xing","Denkowski, Michael","Carpuat, Marine"],"emails":["xingniu@cs.umd.edu","mdenkows@amazon.com","marine@cs.umd.edu"],"author_id":["xing-niu","michael-denkowski","marine-carpuat"],"abstract":"Despite impressive progress in high-resource settings, Neural Machine Translation (NMT) still struggles in low-resource and out-of-domain scenarios, often failing to match the quality of phrase-based translation. We propose a novel technique that combines back-translation and multilingual NMT to improve performance in these difficult cases. Our technique trains a single model for both directions of a language pair, allowing us to back-translate source or target monolingual data without requiring an auxiliary model. We then continue training on the augmented parallel data, enabling a cycle of improvement for a single model that can incorporate any source, target, or parallel data to improve both translation directions. As a byproduct, these models can reduce training and deployment costs significantly compared to uni-directional models. Extensive experiments show that our technique outperforms standard back-translation in low-resource scenarios, improves quality on cross-domain tasks, and effectively reduces costs across the board.","pages":"84--91","doi":"10.18653\/v1\/W18-2710","url":"https:\/\/www.aclweb.org\/anthology\/W18-2710","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2711","title":"Multi-Source Neural Machine Translation with Missing Data","authors":["Nishimura, Yuta","Sudoh, Katsuhito","Neubig, Graham","Nakamura, Satoshi"],"emails":["nishimura.yuta.nn9@is.naist.jp","sudoh@is.naist.jp","gneubig@cs.cmu.edu","s-nakamura@is.naist.jp"],"author_id":["yuta-nishimura","katsuhito-sudoh","graham-neubig","satoshi-nakamura"],"abstract":"Multi-source translation is an approach to exploit multiple inputs (e.g. in two different languages) to increase translation accuracy. In this paper, we examine approaches for multi-source neural machine translation (NMT) using an incomplete multilingual corpus in which some translations are missing. In practice, many multilingual corpora are not complete due to the difficulty to provide translations in all of the relevant languages (for example, in TED talks, most English talks only have subtitles for a small portion of the languages that TED supports). Existing studies on multi-source translation did not explicitly handle such situations. This study focuses on the use of incomplete multilingual corpora in multi-encoder NMT and mixture of NMT experts and examines a very simple implementation where missing source translations are replaced by a special symbol {\\textless}NULL{\\textgreater}. These methods allow us to use incomplete corpora both at training time and test time. In experiments with real incomplete multilingual corpora of TED Talks, the multi-source NMT with the {\\textless}NULL{\\textgreater} tokens achieved higher translation accuracies measured by BLEU than those by any one-to-one NMT systems.","pages":"92--99","doi":"10.18653\/v1\/W18-2711","url":"https:\/\/www.aclweb.org\/anthology\/W18-2711","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2712","title":"Towards one-shot learning for rare-word translation with external experts","authors":["Pham, Ngoc-Quan","Niehues, Jan","Waibel, Alexander"],"emails":["ngoc.pham@kit.edu","jan.niehues@kit.edu","alex.waibel@kit.edu"],"author_id":["ngoc-quan-pham","jan-niehues","alex-waibel"],"abstract":"Neural machine translation (NMT) has significantly improved the quality of automatic translation models. One of the main challenges in current systems is the translation of rare words. We present a generic approach to address this weakness by having external models annotate the training data as Experts, and control the model-expert interaction with a pointer network and reinforcement learning. Our experiments using phrase-based models to simulate Experts to complement neural machine translation models show that the model can be trained to copy the annotations into the output consistently. We demonstrate the benefit of our proposed framework in outof domain translation scenarios with only lexical resources, improving more than 1.0 BLEU point in both translation directions English-Spanish and German-English.","pages":"100--109","doi":"10.18653\/v1\/W18-2712","url":"https:\/\/www.aclweb.org\/anthology\/W18-2712","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2713","title":"{NICT} Self-Training Approach to Neural Machine Translation at {NMT}-2018","authors":["Imamura, Kenji","Sumita, Eiichiro"],"emails":["kenji.imamura@nict.go.jp","eiichiro.sumita@nict.go.jp"],"author_id":["kenji-imamura","eiichiro-sumita"],"abstract":"This paper describes the NICT neural machine translation system submitted at the NMT-2018 shared task. A characteristic of our approach is the introduction of self-training. Since our self-training does not change the model structure, it does not influence the efficiency of translation, such as the translation speed. The experimental results showed that the translation quality improved not only in the sequence-to-sequence (seq-to-seq) models but also in the transformer models.","pages":"110--115","doi":"10.18653\/v1\/W18-2713","url":"https:\/\/www.aclweb.org\/anthology\/W18-2713","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2714","title":"Fast Neural Machine Translation Implementation","authors":["Hoang, Hieu","Dwojak, Tomasz","Krislauks, Rihards","Torregrosa, Daniel","Heafield, Kenneth"],"emails":["","","","",""],"author_id":["hieu-hoang","tomasz-dwojak","rihards-krislauks","daniel-torregrosa","kenneth-heafield"],"abstract":"This paper describes the submissions to the efficiency track for GPUs at the Workshop for Neural Machine Translation and Generation by members of the University of Edinburgh, Adam Mickiewicz University, Tilde and University of Alicante. We focus on efficient implementation of the recurrent deep-learning model as implemented in Amun, the fast inference engine for neural machine translation. We improve the performance with an efficient mini-batching algorithm, and by fusing the softmax operation with the k-best extraction algorithm. Submissions using Amun were first, second and third fastest in the GPU efficiency track.","pages":"116--121","doi":"10.18653\/v1\/W18-2714","url":"https:\/\/www.aclweb.org\/anthology\/W18-2714","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2715","title":"{O}pen{NMT} System Description for {WNMT} 2018: 800 words\/sec on a single-core {CPU}","authors":["Senellart, Jean","Zhang, Dakun","Wang, Bo","Klein, Guillaume","Ramatchandirin, Jean-Pierre","Crego, Josep","Rush, Alexander"],"emails":["jean.senellart@systrangroup.com","dakun.zhang@systrangroup.com","bo.wang@systrangroup.com","guillaume.klein@systrangroup.com","jean-pierre.ramatchandirin@systrangroup.com","josep.crego@systrangroup.com","srush@seas.harvard.edu"],"author_id":["jean-senellart","dakun-zhang","bo-wang","guillaume-klein","jean-pierre-ramatchandirin","josep-m-crego","alexander-m-rush"],"abstract":"We present a system description of the OpenNMT Neural Machine Translation entry for the WNMT 2018 evaluation. In this work, we developed a heavily optimized NMT inference model targeting a high-performance CPU system. The final system uses a combination of four techniques, all of them lead to significant speed-ups in combination: (a) sequence distillation, (b) architecture modifications, (c) precomputation, particularly of vocabulary, and (d) CPU targeted quantization. This work achieves the fastest performance of the shared task, and led to the development of new features that have been integrated to OpenNMT and available to the community.","pages":"122--128","doi":"10.18653\/v1\/W18-2715","url":"https:\/\/www.aclweb.org\/anthology\/W18-2715","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"},{"id":"W18-2716","title":"{M}arian: Cost-effective High-Quality Neural Machine Translation in {C}++","authors":["Junczys-Dowmunt, Marcin","Heafield, Kenneth","Hoang, Hieu","Grundkiewicz, Roman","Aue, Anthony"],"emails":["","","","",""],"author_id":["marcin-junczys-dowmunt","kenneth-heafield","hieu-hoang","roman-grundkiewicz","anthony-aue"],"abstract":"This paper describes the submissions of the {``}Marian{''} team to the WNMT 2018 shared task. We investigate combinations of teacher-student training, low-precision matrix products, auto-tuning and other methods to optimize the Transformer model on GPU and CPU. By further integrating these methods with the new averaging attention networks, a recently introduced faster Transformer variant, we create a number of high-quality, high-performance models on the GPU and CPU, dominating the Pareto frontier for this shared task.","pages":"129--135","doi":"10.18653\/v1\/W18-2716","url":"https:\/\/www.aclweb.org\/anthology\/W18-2716","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 2nd Workshop on Neural Machine Translation and Generation"}]