[{"id":"W18-4501","title":"Learning Diachronic Analogies to Analyze Concept Change","authors":["Orlikowski, Matthias","Hartung, Matthias","Cimiano, Philipp"],"emails":["morlikow@mail.upb.de","mhartung@cit-ec.uni-bielefeld.de","cimiano@cit-ec.uni-bielefeld.de"],"author_id":["matthias-orlikowski","matthias-hartung","philipp-cimiano"],"abstract":"We propose to study the evolution of concepts by learning to complete diachronic analogies between lists of terms which relate to the same concept at different points in time. We present a number of models based on operations on word embedddings that correspond to different assumptions about the characteristics of diachronic analogies and change in concept vocabularies. These are tested in a quantitative evaluation for nine different concepts on a corpus of Dutch newspapers from the 1950s and 1980s. We show that a model which treats the concept terms as analogous and learns weights to compensate for diachronic changes (weighted linear combination) is able to more accurately predict the missing term than a learned transformation and two baselines for most of the evaluated concepts. We also find that all models tend to be coherent in relation to the represented concept, but less discriminative in regard to other concepts. Additionally, we evaluate the effect of aligning the time-specific embedding spaces using orthogonal Procrustes, finding varying effects on performance, depending on the model, concept and evaluation metric. For the weighted linear combination, however, results improve with alignment in a majority of cases. All related code is released publicly.","pages":"1--11","url":"https:\/\/www.aclweb.org\/anthology\/W18-4501","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4502","title":"A Linked {C}optic Dictionary Online","authors":["Feder, Frank","Kupreyev, Maxim","Manning, Emma","Schroeder, Caroline T.","Zeldes, Amir"],"emails":["frank.feder@mail.uni-goettingen.de","maxim.kupreyev@bbaw.de","esm76@georgetown.edu","carrie@carrieschroeder.com","amir.zeldes@georgetown.edu"],"author_id":["frank-feder","maxim-kupreyev","emma-manning","caroline-t-schroeder","amir-zeldes"],"abstract":"We describe a new project publishing a freely available online dictionary for Coptic. The dictionary encompasses comprehensive cross-referencing mechanisms, including linking entries to an online scanned edition of Crum{'}s Coptic Dictionary, internal cross-references and etymological information, translated searchable definitions in English, French and German, and linked corpus data which provides frequencies and corpus look-up for headwords and multiword expressions. Headwords are available for linking in external projects using a REST API. We describe the challenges in encoding our dictionary using TEI XML and implementing linking mechanisms to construct a Web interface querying frequency information, which draw on NLP tools to recognize inflected forms in context. We evaluate our dictionary{'}s coverage using digital corpora of Coptic available online.","pages":"12--21","url":"https:\/\/www.aclweb.org\/anthology\/W18-4502","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4503","title":"Using relative entropy for detection and analysis of periods of diachronic linguistic change","authors":["Degaetano-Ortlieb, Stefania","Teich, Elke"],"emails":["e.teich@mx.uni-saarland.de","s.degaetano@mx.uni-saarland.de"],"author_id":["stefania-degaetano-ortlieb","elke-teich"],"abstract":"We present a data-driven approach to detect periods of linguistic change and the lexical and grammatical features contributing to change. We focus on the development of scientific English in the late modern period. Our approach is based on relative entropy (Kullback-Leibler Divergence) comparing temporally adjacent periods and sliding over the time line from past to present. Using a diachronic corpus of scientific publications of the Royal Society of London, we show how periods of change reflect the interplay between lexis and grammar, where periods of lexical expansion are typically followed by periods of grammatical consolidation resulting in a balance between expressivity and communicative efficiency. Our method is generic and can be applied to other data sets, languages and time ranges.","pages":"22--33","url":"https:\/\/www.aclweb.org\/anthology\/W18-4503","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4504","title":"Cliche Expressions in Literary and Genre Novels","authors":["van Cranenburgh, Andreas"],"emails":["cranenburgh@phil.hhu.de"],"author_id":["andreas-van-cranenburgh"],"abstract":"Should writers {``}avoid clich{\\'e}s like the plague{''}? Clich{\\'e}s are said to be a prominent characteristic of {``}low brow{''} literature, and conversely, a negative marker of {``}high brow{''} literature. Clich{\\'e}s may concern the storyline, the characters, or the style of writing. We focus on clich{\\'e} expressions, ready-made stock phrases which can be taken as a sign of uncreative writing. We present a corpus study in which we examine to what extent clich{\\'e} expressions can be attested in a corpus of various kinds of contemporary fiction, based on a large, curated lexicon of clich{\\'e} expressions. The results show to what extent the negative view on clich{\\'e}s is supported by data: we find a significant negative correlation of -0.48 between clich{\\'e} density and literary ratings of texts. We also investigate interactions with genre and characterize the language of clich{\\'e}s with several basic textual features. Code used for this paper is available at \\url{https:\/\/github.com\/andreasvc\/litcliches\/}","pages":"34--43","url":"https:\/\/www.aclweb.org\/anthology\/W18-4504","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4505","title":"Analysis of Rhythmic Phrasing: Feature Engineering vs. Representation Learning for Classifying Readout Poetry","authors":["Baumann, Timo","Hussein, Hussein","Meyer-Sickendiek, Burkhard"],"emails":["tbaumann@cs.cmu.edu","hussein@zedat.fu-berlin.de","bumesi@zedat.fu-berlin.de"],"author_id":["timo-baumann","hussein-hussein","burkhard-meyer-sickendiek"],"abstract":"We show how to classify the phrasing of readout poems with the help of machine learning algorithms that use manually engineered features or automatically learn representations. We investigate modern and postmodern poems from the webpage lyrikline, and focus on two exemplary rhythmical patterns in order to detect the rhythmic phrasing: The Parlando and the Variable Foot. These rhythmical patterns have been compared by using two important theoretical works: The Generative Theory of Tonal Music and the Rhythmic Phrasing in English Verse. Using both, we focus on a combination of four different features: The grouping structure, the metrical structure, the time-span-variation, and the prolongation in order to detect the rhythmic phrasing in the two rhythmical types. We use manually engineered features based on text-speech alignment and parsing for classification. We also train a neural network to learn its own representation based on text, speech and audio during pauses. The neural network outperforms manual feature engineering, reaching an f-measure of 0.85.","pages":"44--49","url":"https:\/\/www.aclweb.org\/anthology\/W18-4505","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4506","title":"Cross-Discourse and Multilingual Exploration of Textual Corpora with the {D}ual{N}eighbors Algorithm","authors":["Arnold, Taylor","Tilton, Lauren"],"emails":["tarnold2@richmond.edu","ltilton@richmond.edu"],"author_id":["taylor-arnold","lauren-tilton"],"abstract":"Word choice is dependent on the cultural context of writers and their subjects. Different words are used to describe similar actions, objects, and features based on factors such as class, race, gender, geography and political affinity. Exploratory techniques based on locating and counting words may, therefore, lead to conclusions that reinforce culturally inflected boundaries. We offer a new method, the DualNeighbors algorithm, for linking thematically similar documents both within and across discursive and linguistic barriers to reveal cross-cultural connections. Qualitative and quantitative evaluations of this technique are shown as applied to two cultural datasets of interest to researchers across the humanities and social sciences. An open-source implementation of the DualNeighbors algorithm is provided to assist in its application.","pages":"50--59","url":"https:\/\/www.aclweb.org\/anthology\/W18-4506","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4507","title":"The Historical Significance of Textual Distances","authors":["Underwood, Ted"],"emails":["tunder@illinois.edu"],"author_id":["ted-underwood"],"abstract":"Measuring similarity is a basic task in information retrieval, and now often a building-block for more complex arguments about cultural change. But do measures of textual similarity and distance really correspond to evidence about cultural proximity and differentiation? To explore that question empirically, this paper compares textual and social measures of the similarities between genres of English-language fiction. Existing measures of textual similarity (cosine similarity on tf-idf vectors or topic vectors) are also compared to new strategies that strive to anchor textual measurement in a social context.","pages":"60--69","url":"https:\/\/www.aclweb.org\/anthology\/W18-4507","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4508","title":"One Size Fits All? A simple {LSTM} for non-literal token and construction-level classification","authors":["Do Dinh, Erik-L{\\^a}n","Eger, Steffen","Gurevych, Iryna"],"emails":["","",""],"author_id":["erik-lan-do-dinh","steffen-eger","iryna-gurevych"],"abstract":"In this paper, we tackle four different tasks of non-literal language classification: token and construction level metaphor detection, classification of idiomatic use of infinitive-verb compounds, and classification of non-literal particle verbs. One of the tasks operates on the token level, while the three other tasks classify constructions such as {``}hot topic{''} or {``}stehen lassen{''} ({``}to allow sth. to stand{''} vs. {``}to abandon so.{''}). The two metaphor detection tasks are in English, while the two non-literal language detection tasks are in German. We propose a simple context-encoding LSTM model and show that it outperforms the state-of-the-art on two tasks. Additionally, we experiment with different embeddings for the token level metaphor detection task and find that 1) their performance varies according to the genre, and 2) word2vec embeddings perform best on 3 out of 4 genres, despite being one of the simplest tested model. In summary, we present a large-scale analysis of a neural model for non-literal language classification (i) at different granularities, (ii) in different languages, (iii) over different non-literal language phenomena.","pages":"70--80","url":"https:\/\/www.aclweb.org\/anthology\/W18-4508","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4509","title":"Supervised Rhyme Detection with {S}iamese Recurrent Networks","authors":["Haider, Thomas","Kuhn, Jonas"],"emails":["thomas.haider@ae.mpg.de","jonas.kuhn@ims-stuttgart.de"],"author_id":["thomas-haider","jonas-kuhn"],"abstract":"We present the first supervised approach to rhyme detection with Siamese Recurrent Networks (SRN) that offer near perfect performance (97{\\%} accuracy) with a single model on rhyme pairs for German, English and French, allowing future large scale analyses. SRNs learn a similarity metric on variable length character sequences that can be used as judgement on the distance of imperfect rhyme pairs and for binary classification. For training, we construct a diachronically balanced rhyme goldstandard of New High German (NHG) poetry. For further testing, we sample a second collection of NHG poetry and set of contemporary Hip-Hop lyrics, annotated for rhyme and assonance. We train several high-performing SRN models and evaluate them qualitatively on selected sonnetts.","pages":"81--86","url":"https:\/\/www.aclweb.org\/anthology\/W18-4509","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4510","title":"Normalizing Early {E}nglish Letters to Present-day {E}nglish Spelling","authors":["H{\\\"a}m{\\\"a}l{\\\"a}inen, Mika","S{\\\"a}ily, Tanja","Rueter, Jack","Tiedemann, J{\\\"o}rg","M{\\\"a}kel{\\\"a}, Eetu"],"emails":["mika.h{\\\"a}m{\\\"a}l{\\\"a}inen@helsinki.fi","tanja.s{\\\"a}ily@helsinki.fi","jack.rueter@helsinki.fi","j{\\\"o}rg.tiedemann@helsinki.fi","eetu.m{\\\"a}kel{\\\"a}@helsinki.fi"],"author_id":["mika-hamalainen","tanja-saily","jack-rueter","jorg-tiedemann","eetu-makela"],"abstract":"This paper presents multiple methods for normalizing the most deviant and infrequent historical spellings in a corpus consisting of personal correspondence from the 15th to the 19th century. The methods include machine translation (neural and statistical), edit distance and rule-based FST. Different normalization methods are compared and evaluated. All of the methods have their own strengths in word normalization. This calls for finding ways of combining the results from these methods to leverage their individual strengths.","pages":"87--96","url":"https:\/\/www.aclweb.org\/anthology\/W18-4510","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4511","title":"Power Networks: A Novel Neural Architecture to Predict Power Relations","authors":["Lam, Michelle","Xu, Catherina","Prabhakaran, Vinodkumar"],"emails":["mlam4@cs.stanford.edu","yuex@cs.stanford.edu","vinod@cs.stanford.edu"],"author_id":["michelle-lam","catherina-xu","vinodkumar-prabhakaran"],"abstract":"Can language analysis reveal the underlying social power relations that exist between participants of an interaction? Prior work within NLP has shown promise in this area, but the performance of automatically predicting power relations using NLP analysis of social interactions remains wanting. In this paper, we present a novel neural architecture that captures manifestations of power within individual emails which are then aggregated in an order-preserving way in order to infer the direction of power between pairs of participants in an email thread. We obtain an accuracy of 80.4{\\%}, a 10.1{\\%} improvement over state-of-the-art methods, in this task. We further apply our model to the task of predicting power relations between individuals based on the entire set of messages exchanged between them; here also, our model significantly outperforms the 70.0{\\%} accuracy using prior state-of-the-art techniques, obtaining an accuracy of 83.0{\\%}.","pages":"97--102","url":"https:\/\/www.aclweb.org\/anthology\/W18-4511","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4512","title":"Automated Acquisition of Patterns for Coding Political Event Data: Two Case Studies","authors":["Makarov, Peter"],"emails":["makarov@cl.uzh.ch"],"author_id":["peter-makarov"],"abstract":"We present a simple approach to the generation and labeling of extraction patterns for coding political event data, an important task in computational social science. We use weak supervision to identify pattern candidates and learn distributed representations for them. Given seed extraction patterns from existing pattern dictionaries, we use label propagation to label pattern candidates. We present two case studies. i) We derive patterns of acceptable quality for a number of international relations {\\&} conflicts categories using pattern candidates of O{'}Connor et al (2013). ii) We derive patterns for coding protest events that outperform an established set of Tabari \/ Petrarch hand-crafted patterns.","pages":"103--112","url":"https:\/\/www.aclweb.org\/anthology\/W18-4512","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4513","title":"A Method for Human-Interpretable Paraphrasticality Prediction","authors":["Moritz, Maria","Hellrich, Johannes","B{\\\"u}chel, Sven"],"emails":["mmoritz@gwdg.de","",""],"author_id":["maria-moritz","johannes-hellrich","sven-buechel"],"abstract":"The detection of reused text is important in a wide range of disciplines. However, even as research in the field of plagiarism detection is constantly improving, heavily modified or paraphrased text is still challenging for current methodologies. For historical texts, these problems are even more severe, since text sources were often subject to stronger and more frequent modifications. Despite the need for tools to automate text criticism, e.g., tracing modifications in historical text, algorithmic support is still limited. While current techniques can tell if and how frequently a text has been modified, very little work has been done on determining the degree and kind of paraphrastic modification{---}despite such information being of substantial interest to scholars. We present a human-interpretable, feature-based method to measure paraphrastic modification. Evaluating our technique on three data sets, we find that our approach performs competitive to text similarity scores borrowed from machine translation evaluation, being much harder to interpret.","pages":"113--118","url":"https:\/\/www.aclweb.org\/anthology\/W18-4513","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4514","title":"Exploring word embeddings and phonological similarity for the unsupervised correction of language learner errors","authors":["Pil{\\'a}n, Ildik{\\'o}","Volodina, Elena"],"emails":["ildiko.pilan@gu.se","elena.volodina@gu.se"],"author_id":["ildiko-pilan","elena-volodina"],"abstract":"The presence of misspellings and other errors or non-standard word forms poses a considerable challenge for NLP systems. Although several supervised approaches have been proposed previously to normalize these, annotated training data is scarce for many languages. We investigate, therefore, an unsupervised method where correction candidates for Swedish language learners{'} errors are retrieved from word embeddings. Furthermore, we compare the usefulness of combining cosine similarity with orthographic and phonological similarity based on a neural grapheme-to-phoneme conversion system we train for this purpose. Although combinations of similarity measures have been explored for finding error correction candidates, it remains unclear how these measures relate to each other and how much they contribute individually to identifying the correct alternative. We experiment with different combinations of these and find that integrating phonological information is especially useful when the majority of learner errors are related to misspellings, but less so when errors are of a variety of types including, e.g. grammatical errors.","pages":"119--128","url":"https:\/\/www.aclweb.org\/anthology\/W18-4514","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4515","title":"Towards Coreference for Literary Text: Analyzing Domain-Specific Phenomena","authors":["Roesiger, Ina","Schulz, Sarah","Reiter, Nils"],"emails":["roesigia@ims.uni-stuttgart.de","schulzsh@ims.uni-stuttgart.de","nils.reiter@ims.uni-stuttgart.de"],"author_id":["ina-roesiger","sarah-schulz","nils-reiter"],"abstract":"Coreference resolution is the task of grouping together references to the same discourse entity. Resolving coreference in literary texts could benefit a number of Digital Humanities (DH) tasks, such as analyzing the depiction of characters and\/or their relations. Domain-dependent training data has shown to improve coreference resolution for many domains, e.g. the biomedical domain, as its properties differ significantly from news text or dialogue, on which automatic systems are typically trained. Literary texts could also benefit from corpora annotated with coreference. We therefore analyze the specific properties of coreference-related phenomena on a number of texts and give directions for the adaptation of annotation guidelines. As some of the adaptations have profound impact, we also present a new annotation tool for coreference, with a focus on enabling annotation of long texts with many discourse entities.","pages":"129--138","url":"https:\/\/www.aclweb.org\/anthology\/W18-4515","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4516","title":"An Evaluation of Lexicon-based Sentiment Analysis Techniques for the Plays of {G}otthold {E}phraim {L}essing","authors":["Schmidt, Thomas","Burghardt, Manuel"],"emails":["thomas.schmidt@ur.de","burghardt@informatik.uni"],"author_id":["thomas-schmidt","manuel-burghardt"],"abstract":"We present results from a project in the research area of sentiment analysis of drama texts, more concretely the plays of Gotthold Ephraim Lessing. We conducted an annotation study to create a gold standard for a systematic evaluation. The gold standard consists of 200 speeches of Lessing{'}s plays manually annotated with sentiment information. We explore the performance of different German sentiment lexicons and processing configurations like lemmatization, the extension of lexicons with historical linguistic variants or stop words elimination to explore the influence of these parameters and find best practices for our domain of application. The best performing configuration accomplishes an accuracy of 70{\\%}. We discuss the problems and challenges for sentiment analysis in this area and describe our next steps toward further research.","pages":"139--149","url":"https:\/\/www.aclweb.org\/anthology\/W18-4516","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4517","title":"Automatic identification of unknown names with specific roles","authors":["Touileb, Samia","Pedersen, Truls","Sj{\\o}vaag, Helle"],"emails":["samiat@ifi.uio.no","truls.pedersen@uib.no","helle.sjovaag@uis.no"],"author_id":["samia-touileb","truls-pedersen","helle-sjovaag"],"abstract":"Automatically identifying persons in a particular role within a large corpus can be a difficult task, especially if you don{'}t know who you are actually looking for. Resources compiling names of persons can be available, but no exhaustive lists exist. However, such lists usually contain known names that are {``}visible{''} in the national public sphere, and tend to ignore the marginal and international ones. In this article we propose a method for automatically generating suggestions of names found in a corpus of Norwegian news articles, and which {``}naturally{''} belong to a given initial list of members, and that were not known (compiled in a list) beforehand. The approach is based, in part, on the assumption that surface level syntactic features reveal parts of the underlying semantic content and can help uncover the structure of the language.","pages":"150--158","url":"https:\/\/www.aclweb.org\/anthology\/W18-4517","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"},{"id":"W18-4518","title":"Induction of a Large-Scale Knowledge Graph from the {R}egesta {I}mperii","authors":["Opitz, Juri","Born, Leo","Nastase, Vivi"],"emails":["opitz@cl.uni-heidelberg.de","born@cl.uni-heidelberg.de","nastase@cl.uni-heidelberg.de"],"author_id":["juri-opitz","leo-born","vivi-nastase"],"abstract":"We induce and visualize a Knowledge Graph over the Regesta Imperii (RI), an important large-scale resource for medieval history research. The RI comprise more than 150,000 digitized abstracts of medieval charters issued by the Roman-German kings and popes distributed over many European locations and a time span of more than 700 years. Our goal is to provide a resource for historians to visualize and query the RI, possibly aiding medieval history research. The resulting medieval graph and visualization tools are shared publicly.","pages":"159--168","url":"https:\/\/www.aclweb.org\/anthology\/W18-4518","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico","year":"2018","month":"August","booktitle":"Proceedings of the Second Joint {SIGHUM} Workshop on Computational Linguistics for Cultural Heritage, Social Sciences, Humanities and Literature"}]