[{"id":"W18-2401","title":"Automatic Extraction of Entities and Relation from Legal Documents","authors":["Andrew, Judith Jeyafreeda"],"emails":["judithjeyafreeda@gmail.com"],"author_id":["judith-jeyafreeda-andrew"],"abstract":"In recent years, the journalists and computer sciences speak to each other to identify useful technologies which would help them in extracting useful information. This is called {``}computational Journalism{''}. In this paper, we present a method that will enable the journalists to automatically identifies and annotates entities such as names of people, organizations, role and functions of people in legal documents; the relationship between these entities are also explored. The system uses a combination of both statistical and rule based technique. The statistical method used is Conditional Random Fields and for the rule based technique, document and language specific regular expressions are used.","pages":"1--8","doi":"10.18653\/v1\/W18-2401","url":"https:\/\/www.aclweb.org\/anthology\/W18-2401","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2402","title":"Connecting Distant Entities with Induction through Conditional Random Fields for Named Entity Recognition: Precursor-Induced {CRF}","authors":["Lee, Wangjin","Choi, Jinwook"],"emails":["jinsamdol@snu.ac.kr","jinchoi@snu.ac.kr"],"author_id":["wangjin-lee","jinwook-choi"],"abstract":"This paper presents a method of designing specific high-order dependency factor on the linear chain conditional random fields (CRFs) for named entity recognition (NER). Named entities tend to be separated from each other by multiple outside tokens in a text, and thus the first-order CRF, as well as the second-order CRF, may innately lose transition information between distant named entities. The proposed design uses outside label in NER as a transmission medium of precedent entity information on the CRF. Then, empirical results apparently demonstrate that it is possible to exploit long-distance label dependency in the original first-order linear chain CRF structure upon NER while reducing computational loss rather than in the second-order CRF.","pages":"9--13","doi":"10.18653\/v1\/W18-2402","url":"https:\/\/www.aclweb.org\/anthology\/W18-2402","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2403","title":"A Sequence Learning Method for Domain-Specific Entity Linking","authors":["Inan, Emrah","Dikenelli, Oguz"],"emails":["emrah.inan@ege.edu.tr","oguz.dikenelli@ege.edu.tr"],"author_id":["emrah-inan","oguz-dikenelli"],"abstract":"Recent collective Entity Linking studies usually promote global coherence of all the mapped entities in the same document by using semantic embeddings and graph-based approaches. Although graph-based approaches are shown to achieve remarkable results, they are computationally expensive for general datasets. Also, semantic embeddings only indicate relatedness between entity pairs without considering sequences. In this paper, we address these problems by introducing a two-fold neural model. First, we match easy mention-entity pairs and using the domain information of this pair to filter candidate entities of closer mentions. Second, we resolve more ambiguous pairs using bidirectional Long Short-Term Memory and CRF models for the entity disambiguation. Our proposed system outperforms state-of-the-art systems on the generated domain-specific evaluation dataset.","pages":"14--21","doi":"10.18653\/v1\/W18-2403","url":"https:\/\/www.aclweb.org\/anthology\/W18-2403","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2404","title":"Attention-based Semantic Priming for Slot-filling","authors":["Wu, Jiewen","Banchs, Rafael E.","D{'}Haro, Luis Fernando","Krishnaswamy, Pavitra","Chen, Nancy"],"emails":["wujw@i2r.a-star.edu.sg","rembanchs@i2r.a-star.edu.sg","luisdhe@i2r.a-star.edu.sg","pavitrak@i2r.a-star.edu.sg","nfychen@i2r.a-star.edu.sg"],"author_id":["jiewen-wu","rafael-e-banchs","luis-fernando-dharo","pavitra-krishnaswamy","nancy-chen"],"abstract":"The problem of sequence labelling in language understanding would benefit from approaches inspired by semantic priming phenomena. We propose that an attention-based RNN architecture can be used to simulate semantic priming for sequence labelling. Specifically, we employ pre-trained word embeddings to characterize the semantic relationship between utterances and labels. We validate the approach using varying sizes of the ATIS and MEDIA datasets, and show up to 1.4-1.9{\\%} improvement in F1 score. The developed framework can enable more explainable and generalizable spoken language understanding systems.","pages":"22--26","doi":"10.18653\/v1\/W18-2404","url":"https:\/\/www.aclweb.org\/anthology\/W18-2404","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2405","title":"Named Entity Recognition for {H}indi-{E}nglish Code-Mixed Social Media Text","authors":["Singh, Vinay","Vijay, Deepanshu","Akhtar, Syed Sarfaraz","Shrivastava, Manish"],"emails":["vinay.singh@research.iiit.ac.in","deepanshu.vijay@research.iiit.ac.in","syed.akhtar@research.iiit.ac.in","m.shrivastava@iiit.ac.in"],"author_id":["vinay-singh","deepanshu-vijay","syed-sarfaraz-akhtar","manish-shrivastava"],"abstract":"Named Entity Recognition (NER) is a major task in the field of Natural Language Processing (NLP), and also is a sub-task of Information Extraction. The challenge of NER for tweets lie in the insufficient information available in a tweet. There has been a significant amount of work done related to entity extraction, but only for resource rich languages and domains such as newswire. Entity extraction is, in general, a challenging task for such an informal text, and code-mixed text further complicates the process with it{'}s unstructured and incomplete information. We propose experiments with different machine learning classification algorithms with word, character and lexical features. The algorithms we experimented with are Decision tree, Long Short-Term Memory (LSTM), and Conditional Random Field (CRF). In this paper, we present a corpus for NER in Hindi-English Code-Mixed along with extensive experiments on our machine learning models which achieved the best f1-score of 0.95 with both CRF and LSTM.","pages":"27--35","doi":"10.18653\/v1\/W18-2405","url":"https:\/\/www.aclweb.org\/anthology\/W18-2405","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2406","title":"Forms of Anaphoric Reference to Organisational Named Entities: Hoping to widen appeal, they diversified","authors":["Hardmeier, Christian","Bevacqua, Luca","Lo{\\'a}iciga, Sharid","Rohde, Hannah"],"emails":["christian.hardmeier@lingfil.uu.se","lbevacqu@ed.ac.uk","sharid.loaiciga@gu.se","hannah.rohde@ed.ac.uk"],"author_id":["christian-hardmeier","luca-bevacqua","sharid-loaiciga","hannah-rohde"],"abstract":"Proper names of organisations are a special case of collective nouns. Their meaning can be conceptualised as a collective unit or as a plurality of persons, allowing for different morphological marking of coreferent anaphoric pronouns. This paper explores the variability of references to organisation names with 1) a corpus analysis and 2) two crowd-sourced story continuation experiments. The first shows that the preference for singular vs. plural conceptualisation is dependent on the level of formality of a text. In the second, we observe a strong preference for the plural they otherwise typical of informal speech. Using edited corpus data instead of constructed sentences as stimuli reduces this preference.","pages":"36--40","doi":"10.18653\/v1\/W18-2406","url":"https:\/\/www.aclweb.org\/anthology\/W18-2406","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2407","title":"Named-Entity Tagging and Domain adaptation for Better Customized Translation","authors":["Li, Zhongwei","Wang, Xuancong","Aw, Ai Ti","Chng, Eng Siong","Li, Haizhou"],"emails":["li-z@i2r.a-star.edu.sg","wangxc@i2r.a-star.edu.sg","aaiti@i2r.a-star.edu.sg","",""],"author_id":["zhongwei-li","xuancong-wang","aiti-aw","eng-siong-chng","haizhou-li"],"abstract":"Customized translation need pay spe-cial attention to the target domain ter-minology especially the named-entities for the domain. Adding linguistic features to neural machine translation (NMT) has been shown to benefit translation in many studies. In this paper, we further demonstrate that adding named-entity (NE) feature with named-entity recognition (NER) into the source language produces better translation with NMT. Our experiments show that by just including the different NE classes and boundary tags, we can increase the BLEU score by around 1 to 2 points using the standard test sets from WMT2017. We also show that adding NE tags using NER and applying in-domain adaptation can be combined to further improve customized machine translation.","pages":"41--46","doi":"10.18653\/v1\/W18-2407","url":"https:\/\/www.aclweb.org\/anthology\/W18-2407","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2408","title":"NEWS 2018 Whitepaper","authors":["Chen, Nancy","Duan, Xiangyu","Zhang, Min","Banchs, Rafael E.","Li, Haizhou"],"emails":["","","","",""],"author_id":["nancy-chen","xiangyu-duan","min-zhang","rafael-e-banchs","haizhou-li"],"abstract":"Transliteration is defined as phonetic translation of names across languages. Transliteration of Named Entities (NEs) is necessary in many applications, such as machine translation, corpus alignment, cross-language IR, information extraction and automatic lexicon acquisition. All such systems call for high-performance transliteration, which is the focus of shared task in the NEWS 2018 workshop. The objective of the shared task is to promote machine transliteration research by providing a common benchmarking platform for the community to evaluate the state-of-the-art technologies.","pages":"47--54","doi":"10.18653\/v1\/W18-2408","url":"https:\/\/www.aclweb.org\/anthology\/W18-2408","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2409","title":"Report of {NEWS} 2018 Named Entity Transliteration Shared Task","authors":["Chen, Nancy","Banchs, Rafael E.","Zhang, Min","Duan, Xiangyu","Li, Haizhou"],"emails":["nancychen@alum.mit.edu","rbanchs@ntu.edu.sg","minzhang@suda.edu.cn","xiangyuduan@suda.edu.cn","haizhou.li@nus.edu.sg"],"author_id":["nancy-chen","rafael-e-banchs","min-zhang","xiangyu-duan","haizhou-li"],"abstract":"This report presents the results from the Named Entity Transliteration Shared Task conducted as part of The Seventh Named Entities Workshop (NEWS 2018) held at ACL 2018 in Melbourne, Australia. Similar to previous editions of NEWS, the Shared Task featured 19 tasks on proper name transliteration, including 13 different languages and two different Japanese scripts. A total of 6 teams from 8 different institutions participated in the evaluation, submitting 424 runs, involving different transliteration methodologies. Four performance metrics were used to report the evaluation results. The NEWS shared task on machine transliteration has successfully achieved its objectives by providing a common ground for the research community to conduct comparative evaluations of state-of-the-art technologies that will benefit the future research and development in this area.","pages":"55--73","doi":"10.18653\/v1\/W18-2409","url":"https:\/\/www.aclweb.org\/anthology\/W18-2409","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2410","title":"Statistical Machine Transliteration Baselines for {NEWS} 2018","authors":["Singhania, Snigdha","Nguyen, Minh","Ngo, Gia H.","Chen, Nancy"],"emails":["singhaniasnigdha@u.nus.edu","nguyen.binh.minh92@u.nus.edu","ngohgia@u.nus.edu","nancychen@alum.mit.edu"],"author_id":["snigdha-singhania","minh-nguyen","gia-h-ngo","nancy-chen"],"abstract":"This paper reports the results of our trans-literation experiments conducted on NEWS 2018 Shared Task dataset. We focus on creating the baseline systems trained using two open-source, statistical transliteration tools, namely Sequitur and Moses. We discuss the pre-processing steps performed on this dataset for both the systems. We also provide a re-ranking system which uses top hypotheses from Sequitur and Moses to create a consolidated list of transliterations. The results obtained from each of these models can be used to present a good starting point for the participating teams.","pages":"74--78","doi":"10.18653\/v1\/W18-2410","url":"https:\/\/www.aclweb.org\/anthology\/W18-2410","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2411","title":"A Deep Learning Based Approach to Transliteration","authors":["Kundu, Soumyadeep","Paul, Sayantan","Pal, Santanu"],"emails":["soumyadeep1497@gmail.com","sayantanpaul98@gmail.com","santanu.pal@uni-saarland.de"],"author_id":["soumyadeep-kundu","sayantan-paul","santanu-pal"],"abstract":"In this paper, we propose different architectures for language independent machine transliteration which is extremely important for natural language processing (NLP) applications. Though a number of statistical models for transliteration have already been proposed in the past few decades, we proposed some neural network based deep learning architectures for the transliteration of named entities. Our transliteration systems adapt two different neural machine translation (NMT) frameworks: recurrent neural network and convolutional sequence to sequence based NMT. It is shown that our method provides quite satisfactory results when it comes to multi lingual machine transliteration. Our submitted runs are an ensemble of different transliteration systems for all the language pairs. In the NEWS 2018 Shared Task on Transliteration, our method achieves top performance for the En{--}Pe and Pe{--}En language pairs and comparable results for other cases.","pages":"79--83","doi":"10.18653\/v1\/W18-2411","url":"https:\/\/www.aclweb.org\/anthology\/W18-2411","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2412","title":"Comparison of Assorted Models for Transliteration","authors":["Najafi, Saeed","Hauer, Bradley","Riyadh, Rashed Rubby","Yu, Leyuan","Kondrak, Grzegorz"],"emails":["snajafi@ualberta.ca","bmhauer@ualberta.ca","riyadh@ualberta.ca","leyuan@ualberta.ca","gkondrak@ualberta.ca"],"author_id":["saeed-najafi","bradley-hauer","rashed-rubby-riyadh","leyuan-yu","grzegorz-kondrak"],"abstract":"We report the results of our experiments in the context of the NEWS 2018 Shared Task on Transliteration. We focus on the comparison of several diverse systems, including three neural MT models. A combination of discriminative, generative, and neural models obtains the best results on the development sets. We also put forward ideas for improving the shared task.","pages":"84--88","doi":"10.18653\/v1\/W18-2412","url":"https:\/\/www.aclweb.org\/anthology\/W18-2412","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2413","title":"Neural Machine Translation Techniques for Named Entity Transliteration","authors":["Grundkiewicz, Roman","Heafield, Kenneth"],"emails":["rgrundki@inf.ed.ac.uk","kheafiel@inf.ed.ac.uk"],"author_id":["roman-grundkiewicz","kenneth-heafield"],"abstract":"Transliterating named entities from one language into another can be approached as neural machine translation (NMT) problem, for which we use deep attentional RNN encoder-decoder models. To build a strong transliteration system, we apply well-established techniques from NMT, such as dropout regularization, model ensembling, rescoring with right-to-left models, and back-translation. Our submission to the NEWS 2018 Shared Task on Named Entity Transliteration ranked first in several tracks.","pages":"89--94","doi":"10.18653\/v1\/W18-2413","url":"https:\/\/www.aclweb.org\/anthology\/W18-2413","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"},{"id":"W18-2414","title":"Low-Resource Machine Transliteration Using Recurrent Neural Networks of {A}sian Languages","authors":["Le, Ngoc Tan","Sadat, Fatiha"],"emails":["le.ngoc_tan@uqam.ca","sadat.fatiha@uqam.ca"],"author_id":["ngoc-tan-le","fatiha-sadat"],"abstract":"Grapheme-to-phoneme models are key components in automatic speech recognition and text-to-speech systems. With low-resource language pairs that do not have available and well-developed pronunciation lexicons, grapheme-to-phoneme models are particularly useful. These models are based on initial alignments between grapheme source and phoneme target sequences. Inspired by sequence-to-sequence recurrent neural network-based translation methods, the current research presents an approach that applies an alignment representation for input sequences and pre-trained source and target embeddings to overcome the transliteration problem for a low-resource languages pair. We participated in the NEWS 2018 shared task for the English-Vietnamese transliteration task.","pages":"95--100","doi":"10.18653\/v1\/W18-2414","url":"https:\/\/www.aclweb.org\/anthology\/W18-2414","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Seventh Named Entities Workshop"}]