[{"id":"W19-2001","title":"Neural Vector Conceptualization for Word Vector Space Interpretation","authors":["Schwarzenberg, Robert","Raithel, Lisa","Harbecke, David"],"emails":["robert.schwarzenberg@dfki.de","lisa.raithel@dfki.de","david.harbecke@dfki.de"],"author_id":["robert-schwarzenberg","lisa-raithel","david-harbecke"],"abstract":"Distributed word vector spaces are considered hard to interpret which hinders the understanding of natural language processing (NLP) models. In this work, we introduce a new method to interpret arbitrary samples from a word vector space. To this end, we train a neural model to conceptualize word vectors, which means that it activates higher order concepts it recognizes in a given vector. Contrary to prior approaches, our model operates in the original vector space and is capable of learning non-linear relations between word vectors and concepts. Furthermore, we show that it produces considerably less entropic concept activation profiles than the popular cosine similarity.","pages":"1--7","doi":"10.18653\/v1\/W19-2001","url":"https:\/\/www.aclweb.org\/anthology\/W19-2001","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2002","title":"Characterizing the Impact of Geometric Properties of Word Embeddings on Task Performance","authors":["Whitaker, Brendan","Newman-Griffis, Denis","Haldar, Aparajita","Ferhatosmanoglu, Hakan","Fosler-Lussier, Eric"],"emails":["whitaker.213@osu.edu","newman-griffis.1@osu.edu","aparajita.haldar@warwick.ac.uk","h.ferhatosmanoglu@warwick.ac.uk","fosler-lussier.1@osu.edu"],"author_id":["brendan-whitaker","denis-newman-griffis","aparajita-haldar","hakan-ferhatosmanoglu","eric-fosler-lussier"],"abstract":"Analysis of word embedding properties to inform their use in downstream NLP tasks has largely been studied by assessing nearest neighbors. However, geometric properties of the continuous feature space contribute directly to the use of embedding features in downstream models, and are largely unexplored. We consider four properties of word embedding geometry, namely: position relative to the origin, distribution of features in the vector space, global pairwise distances, and local pairwise distances. We define a sequence of transformations to generate new embeddings that expose subsets of these properties to downstream models and evaluate change in task performance to understand the contribution of each property to NLP models. We transform publicly available pretrained embeddings from three popular toolkits (word2vec, GloVe, and FastText) and evaluate on a variety of intrinsic tasks, which model linguistic information in the vector space, and extrinsic tasks, which use vectors as input to machine learning models. We find that intrinsic evaluations are highly sensitive to absolute position, while extrinsic tasks rely primarily on local similarity. Our findings suggest that future embedding models and post-processing techniques should focus primarily on similarity to nearby points in vector space.","pages":"8--17","doi":"10.18653\/v1\/W19-2002","url":"https:\/\/www.aclweb.org\/anthology\/W19-2002","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2003","title":"The Influence of Down-Sampling Strategies on {SVD} Word Embedding Stability","authors":["Hellrich, Johannes","Kampe, Bernd","Hahn, Udo"],"emails":["johannes.hellrich@uni-jena.de","bernd.kampe@uni-jena.de","udo.hahn@uni-jena.de"],"author_id":["johannes-hellrich","bernd-kampe","udo-hahn"],"abstract":"The stability of word embedding algorithms, i.e., the consistency of the word representations they reveal when trained repeatedly on the same data set, has recently raised concerns. We here compare word embedding algorithms on three corpora of different sizes, and evaluate both their stability and accuracy. We find strong evidence that down-sampling strategies (used as part of their training procedures) are particularly influential for the stability of SVD-PPMI-type embeddings. This finding seems to explain diverging reports on their stability and lead us to a simple modification which provides superior stability as well as accuracy on par with skip-gram embedding","pages":"18--26","doi":"10.18653\/v1\/W19-2003","url":"https:\/\/www.aclweb.org\/anthology\/W19-2003","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2004","title":"How Well Do Embedding Models Capture Non-compositionality? A View from Multiword Expressions","authors":["Nandakumar, Navnita","Baldwin, Timothy","Salehi, Bahar"],"emails":["nnandakumar@student.unimelb.edu.au","tbaldwin@unimelb.edu.au","salehi.b@unimelb.edu.au"],"author_id":["navnita-nandakumar","timothy-baldwin","bahar-salehi"],"abstract":"In this paper, we apply various embedding methods on multiword expressions to study how well they capture the nuances of non-compositional data. Our results from a pool of word-, character-, and document-level embbedings suggest that Word2vec performs the best, followed by FastText and Infersent. Moreover, we find that recently-proposed contextualised embedding models such as Bert and ELMo are not adept at handling non-compositionality in multiword expressions.","pages":"27--34","doi":"10.18653\/v1\/W19-2004","url":"https:\/\/www.aclweb.org\/anthology\/W19-2004","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2005","title":"Measuring Semantic Abstraction of Multilingual {NMT} with Paraphrase Recognition and Generation Tasks","authors":["Tiedemann, J{\\\"o}rg","Scherrer, Yves"],"emails":["",""],"author_id":["jorg-tiedemann","yves-scherrer"],"abstract":"In this paper, we investigate whether multilingual neural translation models learn stronger semantic abstractions of sentences than bilingual ones. We test this hypotheses by measuring the perplexity of such models when applied to paraphrases of the source language. The intuition is that an encoder produces better representations if a decoder is capable of recognizing synonymous sentences in the same language even though the model is never trained for that task. In our setup, we add 16 different auxiliary languages to a bidirectional bilingual baseline model (English-French) and test it with in-domain and out-of-domain paraphrases in English. The results show that the perplexity is significantly reduced in each of the cases, indicating that meaning can be grounded in translation. This is further supported by a study on paraphrase generation that we also include at the end of the paper.","pages":"35--42","doi":"10.18653\/v1\/W19-2005","url":"https:\/\/www.aclweb.org\/anthology\/W19-2005","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2006","title":"{SWOW}-8500: Word Association task for Intrinsic Evaluation of Word Embeddings","authors":["Thawani, Avijit","Srivastava, Biplav","Singh, Anil"],"emails":["thawani@usc.edu","biplav.srivastava@gmail.com","aksingh.cse@iitbhu.ac.in"],"author_id":["avijit-thawani","biplav-srivastava","anil-singh"],"abstract":"Downstream evaluation of pretrained word embeddings is expensive, more so for tasks where current state of the art models are very large architectures. Intrinsic evaluation using word similarity or analogy datasets, on the other hand, suffers from several disadvantages. We propose a novel intrinsic evaluation task employing large word association datasets (particularly the Small World of Words dataset). We observe correlations not just between performances on SWOW-8500 and previously proposed intrinsic tasks of word similarity prediction, but also with downstream tasks (eg. Text Classification and Natural Language Inference). Most importantly, we report better confidence intervals for scores on our word association task, with no fall in correlation with downstream performance.","pages":"43--51","doi":"10.18653\/v1\/W19-2006","url":"https:\/\/www.aclweb.org\/anthology\/W19-2006","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2007","title":"Classification of Semantic Paraphasias: Optimization of a Word Embedding Model","authors":["McKinney-Bock, Katy","Bedrick, Steven"],"emails":["mckinnka@ohsu.edu","bedricks@ohsu.edu"],"author_id":["katy-mckinney-bock","steven-bedrick"],"abstract":"In clinical assessment of people with aphasia, impairment in the ability to recall and produce words for objects (anomia) is assessed using a confrontation naming task, where a target stimulus is viewed and a corresponding label is spoken by the participant. Vector space word embedding models have had inital results in assessing semantic similarity of target-production pairs in order to automate scoring of this task; however, the resulting models are also highly dependent upon training parameters. To select an optimal family of models, we fit a beta regression model to the distribution of performance metrics on a set of 2,880 grid search models and evaluate the resultant first- and second-order effects to explore how parameterization affects model performance. Comparing to SimLex-999, we show that clinical data can be used in an evaluation task with comparable optimal parameter settings as standard NLP evaluation datasets.","pages":"52--62","doi":"10.18653\/v1\/W19-2007","url":"https:\/\/www.aclweb.org\/anthology\/W19-2007","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2008","title":"{CODAH}: An Adversarially-Authored Question Answering Dataset for Common Sense","authors":["Chen, Michael","D{'}Arcy, Mike","Liu, Alisa","Fernandez, Jared","Downey, Doug"],"emails":["y-chen@u.northwestern.edu","m.m.darcy@u.northwestern.edu","alisa@u.northwestern.edu","jared.fern@u.northwestern.edu","ddowney@eecs.northwestern.edu"],"author_id":["michael-chen","mike-darcy","alisa-liu","jared-fernandez","doug-downey"],"abstract":"Commonsense reasoning is a critical AI capability, but it is difficult to construct challenging datasets that test common sense. Recent neural question answering systems, based on large pre-trained models of language, have already achieved near-human-level performance on commonsense knowledge benchmarks. These systems do not possess human-level common sense, but are able to exploit limitations of the datasets to achieve human-level scores. We introduce the CODAH dataset, an adversarially-constructed evaluation dataset for testing common sense. CODAH forms a challenging extension to the recently-proposed SWAG dataset, which tests commonsense knowledge using sentence-completion questions that describe situations observed in video. To produce a more difficult dataset, we introduce a novel procedure for question acquisition in which workers author questions designed to target weaknesses of state-of-the-art neural question answering systems. Workers are rewarded for submissions that models fail to answer correctly both before and after fine-tuning (in cross-validation). We create 2.8k questions via this procedure and evaluate the performance of multiple state-of-the-art question answering systems on our dataset. We observe a significant gap between human performance, which is 95.3{\\%}, and the performance of the best baseline accuracy of 65.3{\\%} by the OpenAI GPT model.","pages":"63--69","doi":"10.18653\/v1\/W19-2008","url":"https:\/\/www.aclweb.org\/anthology\/W19-2008","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2009","title":"Syntactic Interchangeability in Word Embedding Models","authors":["Hershcovich, Daniel","Toledo, Assaf","Halfon, Alon","Slonim, Noam"],"emails":["daniel.hershcovich@gmail.com","assaf.toledo@ibm.com","alonhal@il.ibm.com","noams@il.ibm.com"],"author_id":["daniel-hershcovich","assaf-toledo","alon-halfon","noam-slonim"],"abstract":"Nearest neighbors in word embedding models are commonly observed to be semantically similar, but the relations between them can vary greatly. We investigate the extent to which word embedding models preserve syntactic interchangeability, as reflected by distances between word vectors, and the effect of hyper-parameters{---}context window size in particular. We use part of speech (POS) as a proxy for syntactic interchangeability, as generally speaking, words with the same POS are syntactically valid in the same contexts. We also investigate the relationship between interchangeability and similarity as judged by commonly-used word similarity benchmarks, and correlate the result with the performance of word embedding models on these benchmarks. Our results will inform future research and applications in the selection of word embedding model, suggesting a principle for an appropriate selection of the context window size parameter depending on the use-case.","pages":"70--76","doi":"10.18653\/v1\/W19-2009","url":"https:\/\/www.aclweb.org\/anthology\/W19-2009","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2010","title":"Evaluation of Morphological Embeddings for {E}nglish and {R}ussian Languages","authors":["Romanov, Vitaly","Khusainova, Albina"],"emails":["v.romanov@innopolis.ru","a.khusainova@innopolis.ru"],"author_id":["vitaly-romanov","albina-khusainova"],"abstract":"This paper evaluates morphology-based embeddings for English and Russian languages. Despite the interest and introduction of several morphology based word embedding models in the past and acclaimed performance improvements on word similarity and language modeling tasks, in our experiments, we did not observe any stable preference over two of our baseline models - SkipGram and FastText. The performance exhibited by morphological embeddings is the average of the two baselines mentioned above.","pages":"77--81","doi":"10.18653\/v1\/W19-2010","url":"https:\/\/www.aclweb.org\/anthology\/W19-2010","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2011","title":"Probing Biomedical Embeddings from Language Models","authors":["Jin, Qiao","Dhingra, Bhuwan","Cohen, William","Lu, Xinghua"],"emails":["qiao.jin@pitt.edu","bdhingra@cs.cmu.edu","wcohen@google.com","xinghua@pitt.edu"],"author_id":["qiao-jin","bhuwan-dhingra","william-cohen","xinghua-lu"],"abstract":"Contextualized word embeddings derived from pre-trained language models (LMs) show significant improvements on downstream NLP tasks. Pre-training on domain-specific corpora, such as biomedical articles, further improves their performance. In this paper, we conduct probing experiments to determine what additional information is carried intrinsically by the in-domain trained contextualized embeddings. For this we use the pre-trained LMs as fixed feature extractors and restrict the downstream task models to not have additional sequence modeling layers. We compare BERT (Devlin et al. 2018), ELMo (Peters et al., 2018), BioBERT (Lee et al., 2019) and BioELMo, a biomedical version of ELMo trained on 10M PubMed abstracts. Surprisingly, while fine-tuned BioBERT is better than BioELMo in biomedical NER and NLI tasks, as a fixed feature extractor BioELMo outperforms BioBERT in our probing tasks. We use visualization and nearest neighbor analysis to show that better encoding of entity-type and relational information leads to this superiority.","pages":"82--89","doi":"10.18653\/v1\/W19-2011","url":"https:\/\/www.aclweb.org\/anthology\/W19-2011","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2012","title":"Dyr Bul Shchyl. Proxying Sound Symbolism With Word Embeddings","authors":["Yamshchikov, Ivan","Shibaev, Viascheslav","Tikhonov, Alexey"],"emails":["ivan@yamshchikov.info","v.a.shibaev@urfu.ru","altsoph@gmail.com"],"author_id":["ivan-yamshchikov","viascheslav-shibaev","alexey-tikhonov"],"abstract":"This paper explores modern word embeddings in the context of sound symbolism. Using basic properties of the representations space one can construct semantic axes. A method is proposed to measure if the presence of individual sounds in a given word shifts its semantics of that word along a specific axis. It is shown that, in accordance with several experimental and statistical results, word embeddings capture symbolism for certain sounds.","pages":"90--94","doi":"10.18653\/v1\/W19-2012","url":"https:\/\/www.aclweb.org\/anthology\/W19-2012","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"},{"id":"W19-2013","title":"Multi-Context Term Embeddings: the Use Case of Corpus-based Term Set Expansion","authors":["Mamou, Jonathan","Pereg, Oren","Wasserblat, Moshe","Dagan, Ido"],"emails":["jonathan.mamou@intel.com","oren.pereg@intel.com","moshe.wasserblat@intel.com","2dagan@cs.biu.ac.il"],"author_id":["jonathan-mamou","oren-pereg","moshe-wasserblat","ido-dagan"],"abstract":"In this paper, we present a novel algorithm that combines multi-context term embeddings using a neural classifier and we test this approach on the use case of corpus-based term set expansion. In addition, we present a novel and unique dataset for intrinsic evaluation of corpus-based term set expansion algorithms. We show that, over this dataset, our algorithm provides up to 5 mean average precision points over the best baseline.","pages":"95--101","doi":"10.18653\/v1\/W19-2013","url":"https:\/\/www.aclweb.org\/anthology\/W19-2013","publisher":"Association for Computational Linguistics","address":"Minneapolis, USA","year":"2019","month":"June","booktitle":"Proceedings of the 3rd Workshop on Evaluating Vector Space Representations for {NLP}"}]