[{"id":"W19-2701","title":"Introduction to Discourse Relation Parsing and Treebanking ({DISRPT}): 7th Workshop on Rhetorical Structure Theory and Related Formalisms","authors":["Zeldes, Amir","Das, Debopam","Maziero, Erick Galani","Antonio, Juliano","Iruskieta, Mikel"],"emails":["az364@georgetown.edu","ddas@sfu.ca","erick.maziero@ufla.br","jdantonio@uem.br","mikel.iruskieta@ehu.eus"],"author_id":["amir-zeldes","debopam-das","erick-galani-maziero","juliano-antonio","mikel-iruskieta"],"abstract":"This overview summarizes the main contributions of the accepted papers at the 2019 workshop on Discourse Relation Parsing and Treebanking (DISRPT 2019). Co-located with NAACL 2019 in Minneapolis, the workshop{'}s aim was to bring together researchers working on corpus-based and computational approaches to discourse relations. In addition to an invited talk, eighteen papers outlined below were presented, four of which were submitted as part of a shared task on elementary discourse unit segmentation and connective detection.","pages":"1--6","doi":"10.18653\/v1\/W19-2701","url":"https:\/\/www.aclweb.org\/anthology\/W19-2701","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2702","title":"Toward Cross-theory Discourse Relation Annotation","authors":["Bourgonje, Peter","Zolotarenko, Olha"],"emails":["peter.bourgonje@uni-potsdam.de","olha.zolotarenko@uni-potsdam.de"],"author_id":["peter-bourgonje","olha-zolotarenko"],"abstract":"In this exploratory study, we attempt to automatically induce PDTB-style relations from RST trees. We work with a German corpus of news commentary articles, annotated for RST trees and explicit PDTB-style relations and we focus on inducing the implicit relations in an automated way. Preliminary results look promising as a high-precision (but low-recall) way of finding implicit relations where there is no shallow structure annotated at all, but mapping proves more difficult in cases where EDUs and relation arguments overlap, yet do not seem to signal the same relation.","pages":"7--11","doi":"10.18653\/v1\/W19-2702","url":"https:\/\/www.aclweb.org\/anthology\/W19-2702","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2703","title":"Acquiring Annotated Data with Cross-lingual Explicitation for Implicit Discourse Relation Classification","authors":["Shi, Wei","Yung, Frances","Demberg, Vera"],"emails":["w.shi@coli.uni-saarland.de","frances@coli.uni-saarland.de","vera@coli.uni-saarland.de"],"author_id":["wei-shi","frances-yung","vera-demberg"],"abstract":"Implicit discourse relation classification is one of the most challenging and important tasks in discourse parsing, due to the lack of connectives as strong linguistic cues. A principle bottleneck to further improvement is the shortage of training data (ca. 18k instances in the Penn Discourse Treebank (PDTB)). Shi et al. (2017) proposed to acquire additional data by exploiting connectives in translation: human translators mark discourse relations which are implicit in the source language explicitly in the translation. Using back-translations of such explicitated connectives improves discourse relation parsing performance. This paper addresses the open question of whether the choice of the translation language matters, and whether multiple translations into different languages can be effectively used to improve the quality of the additional data.","pages":"12--21","doi":"10.18653\/v1\/W19-2703","url":"https:\/\/www.aclweb.org\/anthology\/W19-2703","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2704","title":"From News to Medical: Cross-domain Discourse Segmentation","authors":["Ferracane, Elisa","Page, Titan","Li, Junyi Jessy","Erk, Katrin"],"emails":["jessy@austin.utexas.edu","titan@colorado.edu","elisa@ferracane.com","katrin.erk@mail.utexas.edu"],"author_id":["elisa-ferracane","titan-page","junyi-jessy-li","katrin-erk"],"abstract":"The first step in discourse analysis involves di- viding a text into segments. We annotate the first high-quality small-scale medical corpus in English with discourse segments and analyze how well news-trained segmenters perform on this domain. While we expectedly find a drop in performance, the nature of the segmentation errors suggests some problems can be addressed earlier in the pipeline, while others would require expanding the corpus to a trainable size to learn the nuances of the medical domain.","pages":"22--29","doi":"10.18653\/v1\/W19-2704","url":"https:\/\/www.aclweb.org\/anthology\/W19-2704","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2705","title":"Nuclearity in {RST} and signals of coherence relations","authors":["Das, Debopam"],"emails":["dasdebop@hu-berlin.de"],"author_id":["debopam-das"],"abstract":"We investigate the relationship between the notion of nuclearity as proposed in Rhetorical Structure Theory (RST) and the signalling of coherence relations. RST relations are categorized as either mononuclear (comprising a nucleus and a satellite span) or multinuclear (comprising two or more nuclei spans). We examine how mononuclear relations (e.g., Antithesis, Condition) and multinuclear relations (e.g., Contrast, List) are indicated by relational signals, more particularly by discourse markers (e.g., because, however, if, therefore). We conduct a corpus study, examining the distribution of either type of relations in the RST Discourse Treebank (Carlson et al., 2002) and the distribution of discourse markers for those relations in the RST Signalling Corpus (Das et al., 2015). Our results show that discourse markers are used more often to signal multinuclear relations than mononuclear relations. The findings also suggest a complex relationship between the relation types and syntactic categories of discourse markers (subordinating and coordinating conjunctions).","pages":"30--37","doi":"10.18653\/v1\/W19-2705","url":"https:\/\/www.aclweb.org\/anthology\/W19-2705","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2706","title":"The Rhetorical Structure of Attribution","authors":["Potter, Andrew"],"emails":[""],"author_id":["andrew-potter"],"abstract":"The relational status of Attribution in Rhetorical Structure Theory has been a matter of ongoing debate. Although several researchers have weighed in on the topic, and although numerous studies have relied upon attributional structures for their analyses, nothing approaching consensus has emerged. This paper identifies three basic issues that must be resolved to determine the relational status of attributions. These are identified as the Discourse Units Issue, the Nuclearity Issue, and the Relation Identification Issue. These three issues are analyzed from the perspective of classical RST. A finding of this analysis is that the nuclearity and the relational identification of attribution structures are shown to depend on the writer{'}s intended effect, such that attributional relations cannot be considered as a single relation, but rather as attributional instances of other RST relations.","pages":"38--49","doi":"10.18653\/v1\/W19-2706","url":"https:\/\/www.aclweb.org\/anthology\/W19-2706","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2707","title":"Annotating Shallow Discourse Relations in Twitter Conversations","authors":["Scheffler, Tatjana","Akta{\\c{s}}, Berfin","Das, Debopam","Stede, Manfred"],"emails":["tatjana.scheffler@uni-potsdam.de","","",""],"author_id":["tatjana-scheffler","berfin-aktas","debopam-das","manfred-stede"],"abstract":"We introduce our pilot study applying PDTB-style annotation to Twitter conversations. Lexically grounded coherence annotation for Twitter threads will enable detailed investigations of the discourse structure of conversations on social media. Here, we present our corpus of 185 threads and annotation, including an inter-annotator agreement study. We discuss our observations as to how Twitter discourses differ from written news text wrt. discourse connectives and relations. We confirm our hypothesis that discourse relations in written social media conversations are expressed differently than in (news) text. We find that in Twitter, connective arguments frequently are not full syntactic clauses, and that a few general connectives expressing EXPANSION and CONTINGENCY make up the majority of the explicit relations in our data.","pages":"50--55","doi":"10.18653\/v1\/W19-2707","url":"https:\/\/www.aclweb.org\/anthology\/W19-2707","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2708","title":"A Discourse Signal Annotation System for {RST} Trees","authors":["Gessler, Luke","Liu, Yang","Zeldes, Amir"],"emails":["lg876@georgetown.edu","yl879@georgetown.edu","amir.zeldes@georgetown.edu"],"author_id":["luke-gessler","yang-liu-georgetown","amir-zeldes"],"abstract":"This paper presents a new system for open-ended discourse relation signal annotation in the framework of Rhetorical Structure Theory (RST), implemented on top of an online tool for RST annotation. We discuss existing projects annotating textual signals of discourse relations, which have so far not allowed simultaneously structuring and annotating words signaling hierarchical discourse trees, and demonstrate the design and applications of our interface by extending existing RST annotations in the freely available GUM corpus.","pages":"56--61","doi":"10.18653\/v1\/W19-2708","url":"https:\/\/www.aclweb.org\/anthology\/W19-2708","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2709","title":"{E}us{D}is{P}arser: improving an under-resourced discourse parser with cross-lingual data","authors":["Iruskieta, Mikel","Braud, Chlo{\\'e}"],"emails":["mikel.iruskieta@ehu.eus","chloe.braud@loria.fr"],"author_id":["mikel-iruskieta","chloe-braud"],"abstract":"Development of discourse parsers to annotate the relational discourse structure of a text is crucial for many downstream tasks. However, most of the existing work focuses on English, assuming a quite large dataset. Discourse data have been annotated for Basque, but training a system on these data is challenging since the corpus is very small. In this paper, we create the first demonstrator based on RST for Basque, and we investigate the use of data in another language to improve the performance of a Basque discourse parser. More precisely, we build a monolingual system using the small set of data available and investigate the use of multilingual word embeddings to train a system for Basque using data annotated for another language. We found that our approach to building a system limited to the small set of data available for Basque allowed us to get an improvement over previous approaches making use of many data annotated in other languages. At best, we get 34.78 in F1 for the full discourse structure. More data annotation is necessary in order to improve the results obtained with these techniques. We also describe which relations match with the gold standard, in order to understand these results.","pages":"62--71","doi":"10.18653\/v1\/W19-2709","url":"https:\/\/www.aclweb.org\/anthology\/W19-2709","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2710","title":"Beyond The Wall Street Journal: Anchoring and Comparing Discourse Signals across Genres","authors":["Liu, Yang"],"emails":["yl879@georgetown.edu"],"author_id":["yang-liu-georgetown"],"abstract":"Recent research on discourse relations has found that they are cued not only by discourse markers (DMs) but also by other textual signals and that signaling information is indicative of genres. While several corpora exist with discourse relation signaling information such as the Penn Discourse Treebank (PDTB, Prasad et al. 2008) and the Rhetorical Structure Theory Signalling Corpus (RST-SC, Das and Taboada 2018), they both annotate the Wall Street Journal (WSJ) section of the Penn Treebank (PTB, Marcus et al. 1993), which is limited to the news domain. Thus, this paper adapts the signal identification and anchoring scheme (Liu and Zeldes, 2019) to three more genres, examines the distribution of signaling devices across relations and genres, and provides a taxonomy of indicative signals found in this dataset.","pages":"72--81","doi":"10.18653\/v1\/W19-2710","url":"https:\/\/www.aclweb.org\/anthology\/W19-2710","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2711","title":"Towards the Data-driven System for Rhetorical Parsing of {R}ussian Texts","authors":["Shelmanov, Artem","Pisarevskaya, Dina","Chistova, Elena","Toldova, Svetlana","Kobozeva, Maria","Smirnov, Ivan"],"emails":["a.shelmanov@skoltech.ru","dinabpr@gmail.com","chistova@isa.ru","toldova@yandex.ru","kobozeva@isa.ru","ivs@isa.ru"],"author_id":["artem-shelmanov","dina-pisarevskaya","elena-chistova","svetlana-toldova","maria-kobozeva","ivan-smirnov"],"abstract":"Results of the first experimental evaluation of machine learning models trained on Ru-RSTreebank {--} first Russian corpus annotated within RST framework {--} are presented. Various lexical, quantitative, morphological, and semantic features were used. In rhetorical relation classification, ensemble of CatBoost model with selected features and a linear SVM model provides the best score (macro F1 = 54.67 {\\mbox{$\\pm$}} 0.38). We discover that most of the important features for rhetorical relation classification are related to discourse connectives derived from the connectives lexicon for Russian and from other sources.","pages":"82--87","doi":"10.18653\/v1\/W19-2711","url":"https:\/\/www.aclweb.org\/anthology\/W19-2711","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2712","title":"{RST}-Tace A tool for automatic comparison and evaluation of {RST} trees","authors":["Wan, Shujun","Kutschbach, Tino","L{\\\"u}deling, Anke","Stede, Manfred"],"emails":["shujun.wan@hu-berlin.de","tino.kutschbach@mailbox.org","anke.luedeling@hu-berlin.de","stede@uni-potsdam.de"],"author_id":["shujun-wan","tino-kutschbach","anke-ludeling","manfred-stede"],"abstract":"This paper presents RST-Tace, a tool for automatic comparison and evaluation of RST trees. RST-Tace serves as an implementation of Iruskieta{'}s comparison method, which allows trees to be compared and evaluated without the influence of decisions at lower levels in a tree in terms of four factors: constituent, attachment point, nuclearity as well as relation. RST-Tace can be used regardless of the language or the size of rhetorical trees. This tool aims to measure the agreement between two annotators. The result is reflected by F- measure and inter-annotator agreement. Both the comparison table and the result of the evaluation can be obtained automatically.","pages":"88--96","doi":"10.18653\/v1\/W19-2712","url":"https:\/\/www.aclweb.org\/anthology\/W19-2712","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2713","title":"The {DISRPT} 2019 Shared Task on Elementary Discourse Unit Segmentation and Connective Detection","authors":["Zeldes, Amir","Das, Debopam","Maziero, Erick Galani","Antonio, Juliano","Iruskieta, Mikel"],"emails":["az364@georgetown.edu","ddas@sfu.ca","erick.maziero@ufla.br","jdantonio@uem.br","mikel.iruskieta@ehu.eus"],"author_id":["amir-zeldes","debopam-das","erick-galani-maziero","juliano-antonio","mikel-iruskieta"],"abstract":"In 2019, we organized the first iteration of a shared task dedicated to the underlying units used in discourse parsing across formalisms: the DISRPT Shared Task on Elementary Discourse Unit Segmentation and Connective Detection. In this paper we review the data included in the task, which cover 2.6 million manually annotated tokens from 15 datasets in 10 languages, survey and compare submitted systems and report on system performance on each task for both annotated and plain-tokenized versions of the data.","pages":"97--104","doi":"10.18653\/v1\/W19-2713","url":"https:\/\/www.aclweb.org\/anthology\/W19-2713","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2714","title":"Multi-lingual and Cross-genre Discourse Unit Segmentation","authors":["Bourgonje, Peter","Sch{\\\"a}fer, Robin"],"emails":["peter.bourgonje@uni-potsdam.de","robin.sch{\\\"a}fer@uni-potsdam.de"],"author_id":["peter-bourgonje","robin-schafer"],"abstract":"We describe a series of experiments applied to data sets from different languages and genres annotated for coherence relations according to different theoretical frameworks. Specifically, we investigate the feasibility of a unified (theory-neutral) approach toward discourse segmentation; a process which divides a text into minimal discourse units that are involved in s coherence relation. We apply a RandomForest and an LSTM based approach for all data sets, and we improve over a simple baseline assuming simple sentence or clause-like segmentation. Performance however varies a lot depending on language, and more importantly genre, with f-scores ranging from 73.00 to 94.47.","pages":"105--114","doi":"10.18653\/v1\/W19-2714","url":"https:\/\/www.aclweb.org\/anthology\/W19-2714","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2715","title":"{T}o{N}y: Contextual embeddings for accurate multilingual discourse segmentation of full documents","authors":["Muller, Philippe","Braud, Chlo{\\'e}","Morey, Mathieu"],"emails":["philippe.muller@irit.fr","chloe.braud@loria.fr","mathieu@datactivist.coop"],"author_id":["philippe-muller","chloe-braud","mathieu-morey"],"abstract":"Segmentation is the first step in building practical discourse parsers, and is often neglected in discourse parsing studies. The goal is to identify the minimal spans of text to be linked by discourse relations, or to isolate explicit marking of discourse relations. Existing systems on English report F1 scores as high as 95{\\%}, but they generally assume gold sentence boundaries and are restricted to English newswire texts annotated within the RST framework. This article presents a generic approach and a system, ToNy, a discourse segmenter developed for the DisRPT shared task where multiple discourse representation schemes, languages and domains are represented. In our experiments, we found that a straightforward sequence prediction architecture with pretrained contextual embeddings is sufficient to reach performance levels comparable to existing systems, when separately trained on each corpus. We report performance between 81{\\%} and 96{\\%} in F1 score. We also observed that discourse segmentation models only display a moderate generalization capability, even within the same language and discourse representation scheme.","pages":"115--124","doi":"10.18653\/v1\/W19-2715","url":"https:\/\/www.aclweb.org\/anthology\/W19-2715","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2716","title":"Multilingual segmentation based on neural networks and pre-trained word embeddings","authors":["Iruskieta, Mikel","Bengoetxea, Kepa","Atutxa Salazar, Aitziber","Diaz de Ilarraza, Arantza"],"emails":["mikel.iruskieta@ehu.eus","kepa.bengoetxea@ehu.eus","aitziber.atucha@ehu.eus","a.diazdeilarraza@ehu.eus"],"author_id":["mikel-iruskieta","kepa-bengoetxea","aitziber-atutxa-salazar","arantza-diaz-de-ilarraza"],"abstract":"The DISPRT 2019 workshop has organized a shared task aiming to identify cross-formalism and multilingual discourse segments. Elementary Discourse Units (EDUs) are quite similar across different theories. Segmentation is the very first stage on the way of rhetorical annotation. Still, each annotation project adopted several decisions with consequences not only on the annotation of the relational discourse structure but also at the segmentation stage. In this shared task, we have employed pre-trained word embeddings, neural networks (BiLSTM+CRF) to perform the segmentation. We report F1 results for 6 languages: Basque (0.853), English (0.919), French (0.907), German (0.913), Portuguese (0.926) and Spanish (0.868 and 0.769). Finally, we also pursued an error analysis based on clause typology for Basque and Spanish, in order to understand the performance of the segmenter.","pages":"125--132","doi":"10.18653\/v1\/W19-2716","url":"https:\/\/www.aclweb.org\/anthology\/W19-2716","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2717","title":"{G}um{D}rop at the {DISRPT}2019 Shared Task: A Model Stacking Approach to Discourse Unit Segmentation and Connective Detection","authors":["Yu, Yue","Zhu, Yilun","Liu, Yang","Liu, Yan","Peng, Siyao","Gong, Mackenzie","Zeldes, Amir"],"emails":["yy476@georgetown.edu","yz565@georgetown.edu","yl879@georgetown.edu","yl1023@georgetown.edu","sp1184@georgetown.edu","mg1745@georgetown.edu","az364@georgetown.edu"],"author_id":["yue-yu","yilun-zhu","yang-liu-georgetown","yan-liu","siyao-peng","mackenzie-gong","amir-zeldes"],"abstract":"In this paper we present GumDrop, Georgetown University{'}s entry at the DISRPT 2019 Shared Task on automatic discourse unit segmentation and connective detection. Our approach relies on model stacking, creating a heterogeneous ensemble of classifiers, which feed into a metalearner for each final task. The system encompasses three trainable component stacks: one for sentence splitting, one for discourse unit segmentation and one for connective detection. The flexibility of each ensemble allows the system to generalize well to datasets of different sizes and with varying levels of homogeneity.","pages":"133--143","doi":"10.18653\/v1\/W19-2717","url":"https:\/\/www.aclweb.org\/anthology\/W19-2717","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2718","title":"Towards discourse annotation and sentiment analysis of the Basque Opinion Corpus","authors":["Alkorta, Jon","Gojenola, Koldo","Iruskieta, Mikel"],"emails":["jon.alkorta@ehu.eus","koldo.gojenola@ehu.eus","mikel.iruskieta@ehu.eus"],"author_id":["jon-alkorta","koldo-gojenola","mikel-iruskieta"],"abstract":"Discourse information is crucial for a better understanding of the text structure and it is also necessary to describe which part of an opinionated text is more relevant or to decide how a text span can change the polarity (strengthen or weaken) of other span by means of coherence relations. This work presents the first results on the annotation of the Basque Opinion Corpus using Rhetorical Structure Theory (RST). Our evaluation results and analysis show us the main avenues to improve on a future annotation process. We have also extracted the subjectivity of several rhetorical relations and the results show the effect of sentiment words in relations and the influence of each relation in the semantic orientation value.","pages":"144--152","doi":"10.18653\/v1\/W19-2718","url":"https:\/\/www.aclweb.org\/anthology\/W19-2718","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2719","title":"Using Rhetorical Structure Theory to Assess Discourse Coherence for Non-native Spontaneous Speech","authors":["Wang, Xinhao","Gyawali, Binod","Bruno, James V.","Molloy, Hillary R.","Evanini, Keelan","Zechner, Klaus"],"emails":["xwang002@ets.org","bgyawali@ets.org","jbruno@ets.org","hmolloy@ets.org","kevanini@ets.org","kzechner@ets.org"],"author_id":["xinhao-wang","binod-gyawali","james-v-bruno","hillary-r-molloy","keelan-evanini","klaus-zechner"],"abstract":"This study aims to model the discourse structure of spontaneous spoken responses within the context of an assessment of English speaking proficiency for non-native speakers. Rhetorical Structure Theory (RST) has been commonly used in the analysis of discourse organization of written texts; however, limited research has been conducted to date on RST annotation and parsing of spoken language, in particular, non-native spontaneous speech. Due to the fact that the measurement of discourse coherence is typically a key metric in human scoring rubrics for assessments of spoken language, we conducted research to obtain RST annotations on non-native spoken responses from a standardized assessment of academic English proficiency. Subsequently, automatic parsers were trained on these annotations to process non-native spontaneous speech. Finally, a set of features were extracted from automatically generated RST trees to evaluate the discourse structure of non-native spontaneous speech, which were then employed to further improve the validity of an automated speech scoring system.","pages":"153--162","doi":"10.18653\/v1\/W19-2719","url":"https:\/\/www.aclweb.org\/anthology\/W19-2719","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"},{"id":"W19-2720","title":"Applying Rhetorical Structure Theory to Student Essays for Providing Automated Writing Feedback","authors":["Jiang, Shiyan","Yang, Kexin","Suvarna, Chandrakumari","Casula, Pooja","Zhang, Mingtong","Ros{\\'e}, Carolyn"],"emails":["","","","","",""],"author_id":["shiyan-jiang","kexin-yang","chandrakumari-suvarna","pooja-casula","mingtong-zhang","carolyn-rose"],"abstract":"We present a package of annotation resources, including annotation guideline, flowchart, and an Intelligent Tutoring System for training human annotators. These resources can be used to apply Rhetorical Structure Theory (RST) to essays written by students in K-12 schools. Furthermore, we highlight the great potential of using RST to provide automated feedback for improving writing quality across genres.","pages":"163--168","doi":"10.18653\/v1\/W19-2720","url":"https:\/\/www.aclweb.org\/anthology\/W19-2720","publisher":"Association for Computational Linguistics","address":"Minneapolis, MN","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Discourse Relation Parsing and Treebanking 2019"}]