[{"id":"N18-2001","title":"Enhanced Word Representations for Bridging Anaphora Resolution","authors":["Hou, Yufang"],"emails":["yhou@ie.ibm.com"],"author_id":["yufang-hou"],"abstract":"Most current models of word representations (e.g., GloVe) have successfully captured fine-grained semantics. However, semantic similarity exhibited in these word embeddings is not suitable for resolving bridging anaphora, which requires the knowledge of associative similarity (i.e., relatedness) instead of semantic similarity information between synonyms or hypernyms. We create word embeddings (embeddings{\\_}PP) to capture such relatedness by exploring the syntactic structure of noun phrases. We demonstrate that using embeddings {\\_}PP alone achieves around 30{\\%} of accuracy for bridging anaphora resolution on the ISNotes corpus. Furthermore, we achieve a substantial gain over the state-of-the-art system (Hou et al., 2013b) for bridging antecedent selection.","pages":"1--7","doi":"10.18653\/v1\/N18-2001","url":"https:\/\/www.aclweb.org\/anthology\/N18-2001","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2002","title":"Gender Bias in Coreference Resolution","authors":["Rudinger, Rachel","Naradowsky, Jason","Leonard, Brian","Van Durme, Benjamin"],"emails":["","","",""],"author_id":["rachel-rudinger","jason-naradowsky","brian-leonard","benjamin-van-durme"],"abstract":"We present an empirical study of gender bias in coreference resolution systems. We first introduce a novel, Winograd schema-style set of minimal pair sentences that differ only by pronoun gender. With these {``}Winogender schemas,{''} we evaluate and confirm systematic gender bias in three publicly-available coreference resolution systems, and correlate this bias with real-world and textual gender statistics.","pages":"8--14","doi":"10.18653\/v1\/N18-2002","url":"https:\/\/www.aclweb.org\/anthology\/N18-2002","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2003","title":"Gender Bias in Coreference Resolution: Evaluation and Debiasing Methods","authors":["Zhao, Jieyu","Wang, Tianlu","Yatskar, Mark","Ordonez, Vicente","Chang, Kai-Wei"],"emails":["jyzhao@cs.ucla.edu","tw8bc@virginia.edu","marky@allenai.org","vicente@virginia.edu","kwchang@cs.ucla.edu"],"author_id":["jieyu-zhao","tianlu-wang","mark-yatskar","vicente-ordonez","kai-wei-chang"],"abstract":"In this paper, we introduce a new benchmark for co-reference resolution focused on gender bias, WinoBias. Our corpus contains Winograd-schema style sentences with entities corresponding to people referred by their occupation (e.g. the nurse, the doctor, the carpenter). We demonstrate that a rule-based, a feature-rich, and a neural coreference system all link gendered pronouns to pro-stereotypical entities with higher accuracy than anti-stereotypical entities, by an average difference of 21.1 in F1 score. Finally, we demonstrate a data-augmentation approach that, in combination with existing word-embedding debiasing techniques, removes the bias demonstrated by these systems in WinoBias without significantly affecting their performance on existing datasets.","pages":"15--20","doi":"10.18653\/v1\/N18-2003","url":"https:\/\/www.aclweb.org\/anthology\/N18-2003","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2004","title":"Integrating Stance Detection and Fact Checking in a Unified Corpus","authors":["Baly, Ramy","Mohtarami, Mitra","Glass, James","M{\\`a}rquez, Llu{\\'\\i}s","Moschitti, Alessandro","Nakov, Preslav"],"emails":["baly@mit.edu","mitram@mit.edu","glass@mit.edu","lluismv@amazon.com","amosch@amazon.com","pnakov@qf.org.qa"],"author_id":["ramy-baly","mitra-mohtarami","james-glass","lluis-marquez","alessandro-moschitti","preslav-nakov"],"abstract":"A reasonable approach for fact checking a claim involves retrieving potentially relevant documents from different sources (e.g., news websites, social media, etc.), determining the stance of each document with respect to the claim, and finally making a prediction about the claim{'}s factuality by aggregating the strength of the stances, while taking the reliability of the source into account. Moreover, a fact checking system should be able to explain its decision by providing relevant extracts (rationales) from the documents. Yet, this setup is not directly supported by existing datasets, which treat fact checking, document retrieval, source credibility, stance detection and rationale extraction as independent tasks. In this paper, we support the interdependencies between these tasks as annotations in the same corpus. We implement this setup on an Arabic fact checking corpus, the first of its kind.","pages":"21--27","doi":"10.18653\/v1\/N18-2004","url":"https:\/\/www.aclweb.org\/anthology\/N18-2004","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2005","title":"Is Something Better than Nothing? Automatically Predicting Stance-based Arguments Using Deep Learning and Small Labelled Dataset","authors":["Rajendran, Pavithra","Bollegala, Danushka","Parsons, Simon"],"emails":["","",""],"author_id":["pavithra-rajendran","danushka-bollegala","simon-parsons"],"abstract":"Online reviews have become a popular portal among customers making decisions about purchasing products. A number of corpora of reviews have been widely investigated in NLP in general, and, in particular, in argument mining. This is a subset of NLP that deals with extracting arguments and the relations among them from user-based content. A major problem faced by argument mining research is the lack of human-annotated data. In this paper, we investigate the use of weakly supervised and semi-supervised methods for automatically annotating data, and thus providing large annotated datasets. We do this by building on previous work that explores the classification of opinions present in reviews based whether the stance is expressed explicitly or implicitly. In the work described here, we automatically annotate stance as implicit or explicit and our results show that the datasets we generate, although noisy, can be used to learn better models for implicit\/explicit opinion classification.","pages":"28--34","doi":"10.18653\/v1\/N18-2005","url":"https:\/\/www.aclweb.org\/anthology\/N18-2005","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2006","title":"Multi-Task Learning for Argumentation Mining in Low-Resource Settings","authors":["Schulz, Claudia","Eger, Steffen","Daxenberger, Johannes","Kahse, Tobias","Gurevych, Iryna"],"emails":["","","","",""],"author_id":["claudia-schulz","steffen-eger","johannes-daxenberger","tobias-kahse","iryna-gurevych"],"abstract":"We investigate whether and where multi-task learning (MTL) can improve performance on NLP problems related to argumentation mining (AM), in particular argument component identification. Our results show that MTL performs particularly well (and better than single-task learning) when little training data is available for the main task, a common scenario in AM. Our findings challenge previous assumptions that conceptualizations across AM datasets are divergent and that MTL is difficult for semantic or higher-level tasks.","pages":"35--41","doi":"10.18653\/v1\/N18-2006","url":"https:\/\/www.aclweb.org\/anthology\/N18-2006","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2007","title":"Neural Models for Reasoning over Multiple Mentions Using Coreference","authors":["Dhingra, Bhuwan","Jin, Qiao","Yang, Zhilin","Cohen, William","Salakhutdinov, Ruslan"],"emails":["bdhingra@cs.cmu.edu","qij9@pitt.edu","zhiliny@cs.cmu.edu","wcohen@cs.cmu.edu","rsalakhu@cs.cmu.edu"],"author_id":["bhuwan-dhingra","qiao-jin","zhilin-yang","william-cohen","ruslan-salakhutdinov"],"abstract":"Many problems in NLP require aggregating information from multiple mentions of the same entity which may be far apart in the text. Existing Recurrent Neural Network (RNN) layers are biased towards short-term dependencies and hence not suited to such tasks. We present a recurrent layer which is instead biased towards coreferent dependencies. The layer uses coreference annotations extracted from an external system to connect entity mentions belonging to the same cluster. Incorporating this layer into a state-of-the-art reading comprehension model improves performance on three datasets {--} Wikihop, LAMBADA and the bAbi AI tasks {--} with large gains when training data is scarce.","pages":"42--48","doi":"10.18653\/v1\/N18-2007","url":"https:\/\/www.aclweb.org\/anthology\/N18-2007","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2008","title":"Automatic Dialogue Generation with Expressed Emotions","authors":["Huang, Chenyang","Za{\\\"\\i}ane, Osmar","Trabelsi, Amine","Dziri, Nouha"],"emails":["chuang8@ualberta.ca","zaiane@ualberta.ca","atrabels@ualberta.ca","dziri@ualberta.ca"],"author_id":["chenyang-huang","osmar-r-zaiane","amine-trabelsi","nouha-dziri"],"abstract":"Despite myriad efforts in the literature designing neural dialogue generation systems in recent years, very few consider putting restrictions on the response itself. They learn from collections of past responses and generate one based on a given utterance without considering, speech act, desired style or emotion to be expressed. In this research, we address the problem of forcing the dialogue generation to express emotion. We present three models that either concatenate the desired emotion with the source input during the learning, or push the emotion in the decoder. The results, evaluated with an emotion tagger, are encouraging with all three models, but present better outcome and promise with our model that adds the emotion vector in the decoder.","pages":"49--54","doi":"10.18653\/v1\/N18-2008","url":"https:\/\/www.aclweb.org\/anthology\/N18-2008","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2009","title":"Guiding Generation for Abstractive Text Summarization Based on Key Information Guide Network","authors":["Li, Chenliang","Xu, Weiran","Li, Si","Gao, Sheng"],"emails":["chenliangli@bupt.edu.cn","xuweiran@bupt.edu.cn","lisi@bupt.edu.cn","gaosheng@bupt.edu.cn"],"author_id":["chenliang-li","weiran-xu","si-li","sheng-gao"],"abstract":"Neural network models, based on the attentional encoder-decoder model, have good capability in abstractive text summarization. However, these models are hard to be controlled in the process of generation, which leads to a lack of key information. We propose a guiding generation model that combines the extractive method and the abstractive method. Firstly, we obtain keywords from the text by a extractive model. Then, we introduce a Key Information Guide Network (KIGN), which encodes the keywords to the key information representation, to guide the process of generation. In addition, we use a prediction-guide mechanism, which can obtain the long-term value for future decoding, to further guide the summary generation. We evaluate our model on the CNN\/Daily Mail dataset. The experimental results show that our model leads to significant improvements.","pages":"55--60","doi":"10.18653\/v1\/N18-2009","url":"https:\/\/www.aclweb.org\/anthology\/N18-2009","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2010","title":"Natural Language Generation by Hierarchical Decoding with Linguistic Patterns","authors":["Su, Shang-Yu","Lo, Kai-Ling","Yeh, Yi-Ting","Chen, Yun-Nung"],"emails":["r05921117@ntu.edu.tw","b04902010@ntu.edu.tw","b03902071@ntu.edu.tw","y.v.chen@ieee.org"],"author_id":["shang-yu-su","kai-ling-lo","yi-ting-yeh","yun-nung-chen"],"abstract":"Natural language generation (NLG) is a critical component in spoken dialogue systems. Classic NLG can be divided into two phases: (1) sentence planning: deciding on the overall sentence structure, (2) surface realization: determining specific word forms and flattening the sentence structure into a string. Many simple NLG models are based on recurrent neural networks (RNN) and sequence-to-sequence (seq2seq) model, which basically contains a encoder-decoder structure; these NLG models generate sentences from scratch by jointly optimizing sentence planning and surface realization using a simple cross entropy loss training criterion. However, the simple encoder-decoder architecture usually suffers from generating complex and long sentences, because the decoder has to learn all grammar and diction knowledge. This paper introduces a hierarchical decoding NLG model based on linguistic patterns in different levels, and shows that the proposed method outperforms the traditional one with a smaller model size. Furthermore, the design of the hierarchical decoding is flexible and easily-extendible in various NLG systems.","pages":"61--66","doi":"10.18653\/v1\/N18-2010","url":"https:\/\/www.aclweb.org\/anthology\/N18-2010","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2011","title":"Neural Poetry Translation","authors":["Ghazvininejad, Marjan","Choi, Yejin","Knight, Kevin"],"emails":["ghazvini@isi.edu","yejin@cs.washington.edu","knight@isi.edu"],"author_id":["marjan-ghazvininejad","yejin-choi","kevin-knight"],"abstract":"We present the first neural poetry translation system. Unlike previous works that often fail to produce any translation for fixed rhyme and rhythm patterns, our system always translates a source text to an English poem. Human evaluation of the translations ranks the quality as acceptable 78.2{\\%} of the time.","pages":"67--71","doi":"10.18653\/v1\/N18-2011","url":"https:\/\/www.aclweb.org\/anthology\/N18-2011","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2012","title":"{R}ank{ME}: Reliable Human Ratings for Natural Language Generation","authors":["Novikova, Jekaterina","Du{\\v{s}}ek, Ond{\\v{r}}ej","Rieser, Verena"],"emails":["j.novikova@hw.ac.uk","o.dusek@hw.ac.uk","v.t.rieser@hw.ac.uk"],"author_id":["jekaterina-novikova","ondrej-dusek","verena-rieser"],"abstract":"Human evaluation for natural language generation (NLG) often suffers from inconsistent user ratings. While previous research tends to attribute this problem to individual user preferences, we show that the quality of human judgements can also be improved by experimental design. We present a novel rank-based magnitude estimation method (RankME), which combines the use of continuous scales and relative assessments. We show that RankME significantly improves the reliability and consistency of human ratings compared to traditional evaluation methods. In addition, we show that it is possible to evaluate NLG systems according to multiple, distinct criteria, which is important for error analysis. Finally, we demonstrate that RankME, in combination with Bayesian estimation of system quality, is a cost-effective alternative for ranking multiple NLG systems.","pages":"72--78","doi":"10.18653\/v1\/N18-2012","url":"https:\/\/www.aclweb.org\/anthology\/N18-2012","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2013","title":"Sentence Simplification with Memory-Augmented Neural Networks","authors":["Vu, Tu","Hu, Baotian","Munkhdalai, Tsendsuren","Yu, Hong"],"emails":["tuvu@cs.umass.edu","baotian.hu@umassmed.edu","tsendsuren.munkhdalai@microsoft.com","hong.yu@umassmed.edu"],"author_id":["tu-vu","baotian-hu","tsendsuren-munkhdalai","hong-yu"],"abstract":"Sentence simplification aims to simplify the content and structure of complex sentences, and thus make them easier to interpret for human readers, and easier to process for downstream NLP applications. Recent advances in neural machine translation have paved the way for novel approaches to the task. In this paper, we adapt an architecture with augmented memory capacities called Neural Semantic Encoders (Munkhdalai and Yu, 2017) for sentence simplification. Our experiments demonstrate the effectiveness of our approach on different simplification datasets, both in terms of automatic evaluation measures and human judgments.","pages":"79--85","doi":"10.18653\/v1\/N18-2013","url":"https:\/\/www.aclweb.org\/anthology\/N18-2013","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2014","title":"A Corpus of Non-Native Written {E}nglish Annotated for Metaphor","authors":["Beigman Klebanov, Beata","Leong, Chee Wee (Ben)","Flor, Michael"],"emails":["bbeigmanklebanov@ets.org","cleong@ets.org","mflor@ets.org"],"author_id":["beata-beigman-klebanov","chee-wee-leong","michael-flor"],"abstract":"We present a corpus of 240 argumentative essays written by non-native speakers of English annotated for metaphor. The corpus is made publicly available. We provide benchmark performance of state-of-the-art systems on this new corpus, and explore the relationship between writing proficiency and metaphor use.","pages":"86--91","doi":"10.18653\/v1\/N18-2014","url":"https:\/\/www.aclweb.org\/anthology\/N18-2014","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2015","title":"A Simple and Effective Approach to the Story Cloze Test","authors":["Srinivasan, Siddarth","Arora, Richa","Riedl, Mark"],"emails":["sidsrini@gatech.edu","richa.arora@gatech.edu","riedl@gatech.edu"],"author_id":["siddarth-srinivasan","richa-arora","mark-riedl"],"abstract":"In the Story Cloze Test, a system is presented with a 4-sentence prompt to a story, and must determine which one of two potential endings is the {`}right{'} ending to the story. Previous work has shown that ignoring the training set and training a model on the validation set can achieve high accuracy on this task due to stylistic differences between the story endings in the training set and validation and test sets. Following this approach, we present a simpler fully-neural approach to the Story Cloze Test using skip-thought embeddings of the stories in a feed-forward network that achieves close to state-of-the-art performance on this task without any feature engineering. We also find that considering just the last sentence of the prompt instead of the whole prompt yields higher accuracy with our approach.","pages":"92--96","doi":"10.18653\/v1\/N18-2015","url":"https:\/\/www.aclweb.org\/anthology\/N18-2015","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2016","title":"An Annotated Corpus for Machine Reading of Instructions in Wet Lab Protocols","authors":["Kulkarni, Chaitanya","Xu, Wei","Ritter, Alan","Machiraju, Raghu"],"emails":["kulkarni.132@osu.edu","xu.1265@osu.edu","ritter.1492@osu.edu","machiraju.1@osu.edu"],"author_id":["chaitanya-kulkarni","wei-xu","alan-ritter","raghu-machiraju"],"abstract":"We describe an effort to annotate a corpus of natural language instructions consisting of 622 wet lab protocols to facilitate automatic or semi-automatic conversion of protocols into a machine-readable format and benefit biological research. Experimental results demonstrate the utility of our corpus for developing machine learning approaches to shallow semantic parsing of instructional texts. We make our annotated Wet Lab Protocol Corpus available to the research community.","pages":"97--106","doi":"10.18653\/v1\/N18-2016","url":"https:\/\/www.aclweb.org\/anthology\/N18-2016","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2017","title":"Annotation Artifacts in Natural Language Inference Data","authors":["Gururangan, Suchin","Swayamdipta, Swabha","Levy, Omer","Schwartz, Roy","Bowman, Samuel","Smith, Noah A."],"emails":["sg01@cs.washington.edu","swabha@cs.washington.edu","omerlevy@cs.washington.edu","roysch@cs.washington.edu","bowman@nyu.edu","nasmith@cs.washington.edu"],"author_id":["suchin-gururangan","swabha-swayamdipta","omer-levy","roy-schwartz","samuel-bowman","noah-a-smith"],"abstract":"Large-scale datasets for natural language inference are created by presenting crowd workers with a sentence (premise), and asking them to generate three new sentences (hypotheses) that it entails, contradicts, or is logically neutral with respect to. We show that, in a significant portion of such data, this protocol leaves clues that make it possible to identify the label by looking only at the hypothesis, without observing the premise. Specifically, we show that a simple text categorization model can correctly classify the hypothesis alone in about 67{\\%} of SNLI (Bowman et. al, 2015) and 53{\\%} of MultiNLI (Williams et. al, 2017). Our analysis reveals that specific linguistic phenomena such as negation and vagueness are highly correlated with certain inference classes. Our findings suggest that the success of natural language inference models to date has been overestimated, and that the task remains a hard open problem.","pages":"107--112","doi":"10.18653\/v1\/N18-2017","url":"https:\/\/www.aclweb.org\/anthology\/N18-2017","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2018","title":"Humor Recognition Using Deep Learning","authors":["Chen, Peng-Yu","Soo, Von-Wun"],"emails":["pengyu@nlplab.cc","soo@cs.nthu.edu.tw"],"author_id":["peng-yu-chen","von-wun-soo"],"abstract":"Humor is an essential but most fascinating element in personal communication. How to build computational models to discover the structures of humor, recognize humor and even generate humor remains a challenge and there have been yet few attempts on it. In this paper, we construct and collect four datasets with distinct joke types in both English and Chinese and conduct learning experiments on humor recognition. We implement a Convolutional Neural Network (CNN) with extensive filter size, number and Highway Networks to increase the depth of networks. Results show that our model outperforms in recognition of different types of humor with benchmarks collected in both English and Chinese languages on accuracy, precision, and recall in comparison to previous works.","pages":"113--117","doi":"10.18653\/v1\/N18-2018","url":"https:\/\/www.aclweb.org\/anthology\/N18-2018","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2019","title":"Leveraging Intra-User and Inter-User Representation Learning for Automated Hate Speech Detection","authors":["Qian, Jing","ElSherief, Mai","Belding, Elizabeth","Wang, William Yang"],"emails":["qian@cs.ucsb.edu","mayelsherif@cs.ucsb.edu","ebelding@cs.ucsb.edu","william@cs.ucsb.edu"],"author_id":["jing-qian","mai-elsherief","elizabeth-belding","william-yang-wang"],"abstract":"Hate speech detection is a critical, yet challenging problem in Natural Language Processing (NLP). Despite the existence of numerous studies dedicated to the development of NLP hate speech detection approaches, the accuracy is still poor. The central problem is that social media posts are short and noisy, and most existing hate speech detection solutions take each post as an isolated input instance, which is likely to yield high false positive and negative rates. In this paper, we radically improve automated hate speech detection by presenting a novel model that leverages intra-user and inter-user representation learning for robust hate speech detection on Twitter. In addition to the target Tweet, we collect and analyze the user{'}s historical posts to model intra-user Tweet representations. To suppress the noise in a single Tweet, we also model the similar Tweets posted by all other users with reinforced inter-user representation learning techniques. Experimentally, we show that leveraging these two representations can significantly improve the f-score of a strong bidirectional LSTM baseline model by 10.1{\\%}.","pages":"118--123","doi":"10.18653\/v1\/N18-2019","url":"https:\/\/www.aclweb.org\/anthology\/N18-2019","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2020","title":"Reference-less Measure of Faithfulness for Grammatical Error Correction","authors":["Choshen, Leshem","Abend, Omri"],"emails":["leshem.choshen@mail.huji.ac.il","oabend@cs.huji.ac.il"],"author_id":["leshem-choshen","omri-abend"],"abstract":"We propose USim, a semantic measure for Grammatical Error Correction (that measures the semantic faithfulness of the output to the source, thereby complementing existing reference-less measures (RLMs) for measuring the output{'}s grammaticality. USim operates by comparing the semantic symbolic structure of the source and the correction, without relying on manually-curated references. Our experiments establish the validity of USim, by showing that the semantic structures can be consistently applied to ungrammatical text, that valid corrections obtain a high USim similarity score to the source, and that invalid corrections obtain a lower score.","pages":"124--129","doi":"10.18653\/v1\/N18-2020","url":"https:\/\/www.aclweb.org\/anthology\/N18-2020","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2021","title":"Training Structured Prediction Energy Networks with Indirect Supervision","authors":["Rooshenas, Amirmohammad","Kamath, Aishwarya","McCallum, Andrew"],"emails":["mccallum@cs.umass.edu","akamath@cs.umass.edu","pedram@cs.umass.edu"],"author_id":["amirmohammad-rooshenas","aishwarya-kamath","andrew-mccallum"],"abstract":"This paper introduces rank-based training of structured prediction energy networks (SPENs). Our method samples from output structures using gradient descent and minimizes the ranking violation of the sampled structures with respect to a scalar scoring function defined with domain knowledge. We have successfully trained SPEN for citation field extraction without any labeled data instances, where the only source of supervision is a simple human-written scoring function. Such scoring functions are often easy to provide; the SPEN then furnishes an efficient structured prediction inference procedure.","pages":"130--135","doi":"10.18653\/v1\/N18-2021","url":"https:\/\/www.aclweb.org\/anthology\/N18-2021","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2022","title":"Si O No, Que Penses? {C}atalonian Independence and Linguistic Identity on Social Media","authors":["Stewart, Ian","Pinter, Yuval","Eisenstein, Jacob"],"emails":["istewart6@gatech.edu","uvp@gatech.edu","jacobe@gatech.edu"],"author_id":["ian-stewart","yuval-pinter","jacob-eisenstein"],"abstract":"Political identity is often manifested in language variation, but the relationship between the two is still relatively unexplored from a quantitative perspective. This study examines the use of Catalan, a language local to the semi-autonomous region of Catalonia in Spain, on Twitter in discourse related to the 2017 independence referendum. We corroborate prior findings that pro-independence tweets are more likely to include the local language than anti-independence tweets. We also find that Catalan is used more often in referendum-related discourse than in other contexts, contrary to prior findings on language variation. This suggests a strong role for the Catalan language in the expression of Catalonian political identity.","pages":"136--141","doi":"10.18653\/v1\/N18-2022","url":"https:\/\/www.aclweb.org\/anthology\/N18-2022","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2023","title":"A Transition-Based Algorithm for Unrestricted {AMR} Parsing","authors":["Vilares, David","G{\\'o}mez-Rodr{\\'\\i}guez, Carlos"],"emails":["david.vilares@udc.es","carlos.gomez@udc.es"],"author_id":["david-vilares","carlos-gomez-rodriguez"],"abstract":"Non-projective parsing can be useful to handle cycles and reentrancy in AMR graphs. We explore this idea and introduce a greedy left-to-right non-projective transition-based parser. At each parsing configuration, an oracle decides whether to create a concept or whether to connect a pair of existing concepts. The algorithm handles reentrancy and arbitrary cycles natively, i.e. within the transition system itself. The model is evaluated on the LDC2015E86 corpus, obtaining results close to the state of the art, including a Smatch of 64{\\%}, and showing good behavior on reentrant edges.","pages":"142--149","doi":"10.18653\/v1\/N18-2023","url":"https:\/\/www.aclweb.org\/anthology\/N18-2023","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2024","title":"Analogies in Complex Verb Meaning Shifts: the Effect of Affect in Semantic Similarity Models","authors":["K{\\\"o}per, Maximilian","Schulte im Walde, Sabine"],"emails":["maximilian.koeper@ims.uni-stuttgart.de","schulte@ims.uni-stuttgart.de"],"author_id":["maximilian-koper","sabine-schulte-im-walde"],"abstract":"We present a computational model to detect and distinguish analogies in meaning shifts between German base and complex verbs. In contrast to corpus-based studies, a novel dataset demonstrates that {``}regular{''} shifts represent the smallest class. Classification experiments relying on a standard similarity model successfully distinguish between four types of shifts, with verb classes boosting the performance, and affective features for abstractness, emotion and sentiment representing the most salient indicators.","pages":"150--156","doi":"10.18653\/v1\/N18-2024","url":"https:\/\/www.aclweb.org\/anthology\/N18-2024","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2025","title":"Character-Based Neural Networks for Sentence Pair Modeling","authors":["Lan, Wuwei","Xu, Wei"],"emails":["lan.105@osu.edu","xu.1265@osu.edu"],"author_id":["wuwei-lan","wei-xu"],"abstract":"Sentence pair modeling is critical for many NLP tasks, such as paraphrase identification, semantic textual similarity, and natural language inference. Most state-of-the-art neural models for these tasks rely on pretrained word embedding and compose sentence-level semantics in varied ways; however, few works have attempted to verify whether we really need pretrained embeddings in these tasks. In this paper, we study how effective subword-level (character and character n-gram) representations are in sentence pair modeling. Though it is well-known that subword models are effective in tasks with single sentence input, including language modeling and machine translation, they have not been systematically studied in sentence pair modeling tasks where the semantic and string similarities between texts matter. Our experiments show that subword models without any pretrained word embedding can achieve new state-of-the-art results on two social media datasets and competitive results on news data for paraphrase identification.","pages":"157--163","doi":"10.18653\/v1\/N18-2025","url":"https:\/\/www.aclweb.org\/anthology\/N18-2025","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2026","title":"Determining Event Durations: Models and Error Analysis","authors":["Vempala, Alakananda","Blanco, Eduardo","Palmer, Alexis"],"emails":["alakanandavempala@my.unt.edu","eduardo.blanco@unt.edu","alexis.palmer@unt.edu"],"author_id":["alakananda-vempala","eduardo-blanco","alexis-palmer"],"abstract":"This paper presents models to predict event durations. We introduce aspectual features that capture deeper linguistic information than previous work, and experiment with neural networks. Our analysis shows that tense, aspect and temporal structure of the clause provide useful clues, and that an LSTM ensemble captures relevant context around the event.","pages":"164--168","doi":"10.18653\/v1\/N18-2026","url":"https:\/\/www.aclweb.org\/anthology\/N18-2026","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2027","title":"Diachronic Usage Relatedness ({DUR}el): A Framework for the Annotation of Lexical Semantic Change","authors":["Schlechtweg, Dominik","Schulte im Walde, Sabine","Eckmann, Stefanie"],"emails":["dominik.schlechtweg@ims.uni-stuttgart.de","schulte@ims.uni-stuttgart.de","stefanie.eckmann@campus.lmu.de"],"author_id":["dominik-schlechtweg","sabine-schulte-im-walde","stefanie-eckmann"],"abstract":"We propose a framework that extends synchronic polysemy annotation to diachronic changes in lexical meaning, to counteract the lack of resources for evaluating computational models of lexical semantic change. Our framework exploits an intuitive notion of semantic relatedness, and distinguishes between innovative and reductive meaning changes with high inter-annotator agreement. The resulting test set for German comprises ratings from five annotators for the relatedness of 1,320 use pairs across 22 target words.","pages":"169--174","doi":"10.18653\/v1\/N18-2027","url":"https:\/\/www.aclweb.org\/anthology\/N18-2027","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2028","title":"Directional Skip-Gram: Explicitly Distinguishing Left and Right Context for Word Embeddings","authors":["Song, Yan","Shi, Shuming","Li, Jing","Zhang, Haisong"],"emails":["clksong@tencent.com","shumingshi@tencent.com","ameliajli@tencent.com","hansonzhang@tencent.com"],"author_id":["yan-song","shuming-shi","jing-li","haisong-zhang"],"abstract":"In this paper, we present directional skip-gram (DSG), a simple but effective enhancement of the skip-gram model by explicitly distinguishing left and right context in word prediction. In doing so, a direction vector is introduced for each word, whose embedding is thus learned by not only word co-occurrence patterns in its context, but also the directions of its contextual words. Theoretical and empirical studies on complexity illustrate that our model can be trained as efficient as the original skip-gram model, when compared to other extensions of the skip-gram model. Experimental results show that our model outperforms others on different datasets in semantic (word similarity measurement) and syntactic (part-of-speech tagging) evaluations, respectively.","pages":"175--180","doi":"10.18653\/v1\/N18-2028","url":"https:\/\/www.aclweb.org\/anthology\/N18-2028","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2029","title":"Discriminating between Lexico-Semantic Relations with the Specialization Tensor Model","authors":["Glava{\\v{s}}, Goran","Vuli{\\'c}, Ivan"],"emails":["goran@informatik.uni-mannheim.de","iv250@cam.ac.uk"],"author_id":["goran-glavas","ivan-vulic"],"abstract":"We present a simple and effective feed-forward neural architecture for discriminating between lexico-semantic relations (synonymy, antonymy, hypernymy, and meronymy). Our Specialization Tensor Model (STM) simultaneously produces multiple different specializations of input distributional word vectors, tailored for predicting lexico-semantic relations for word pairs. STM outperforms more complex state-of-the-art architectures on two benchmark datasets and exhibits stable performance across languages. We also show that, if coupled with a bilingual distributional space, the proposed model can transfer the prediction of lexico-semantic relations to a resource-lean target language without any training data.","pages":"181--187","doi":"10.18653\/v1\/N18-2029","url":"https:\/\/www.aclweb.org\/anthology\/N18-2029","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2030","title":"Evaluating bilingual word embeddings on the long tail","authors":["Braune, Fabienne","Hangya, Viktor","Eder, Tobias","Fraser, Alexander"],"emails":["fabienne.braune@volkswagen.de","hangyav@cis.uni-muenchen.de","tobias.eder@germanistik.uni-muenchen.de","fraser@cis.uni-muenchen.de"],"author_id":["fabienne-braune","viktor-hangya","tobias-eder","alexander-fraser"],"abstract":"Bilingual word embeddings are useful for bilingual lexicon induction, the task of mining translations of given words. Many studies have shown that bilingual word embeddings perform well for bilingual lexicon induction but they focused on frequent words in general domains. For many applications, bilingual lexicon induction of rare and domain-specific words is of critical importance. Therefore, we design a new task to evaluate bilingual word embeddings on rare words in different domains. We show that state-of-the-art approaches fail on this task and present simple new techniques to improve bilingual word embeddings for mining rare words. We release new gold standard datasets and code to stimulate research on this task.","pages":"188--193","doi":"10.18653\/v1\/N18-2030","url":"https:\/\/www.aclweb.org\/anthology\/N18-2030","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2031","title":"Frustratingly Easy Meta-Embedding {--} Computing Meta-Embeddings by Averaging Source Word Embeddings","authors":["Coates, Joshua","Bollegala, Danushka"],"emails":["j.n.coates@liverpool.ac.uk","danushka@liverpool.ac.uk"],"author_id":["joshua-coates","danushka-bollegala"],"abstract":"Creating accurate meta-embeddings from pre-trained source embeddings has received attention lately. Methods based on global and locally-linear transformation and concatenation have shown to produce accurate meta-embeddings. In this paper, we show that the arithmetic mean of two distinct word embedding sets yields a performant meta-embedding that is comparable or better than more complex meta-embedding learning methods. The result seems counter-intuitive given that vector spaces in different source embeddings are not comparable and cannot be simply averaged. We give insight into why averaging can still produce accurate meta-embedding despite the incomparability of the source vector spaces.","pages":"194--198","doi":"10.18653\/v1\/N18-2031","url":"https:\/\/www.aclweb.org\/anthology\/N18-2031","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2032","title":"Introducing Two {V}ietnamese Datasets for Evaluating Semantic Models of (Dis-)Similarity and Relatedness","authors":["Nguyen, Kim Anh","Schulte im Walde, Sabine","Vu, Ngoc Thang"],"emails":["nguyenkh@ims.uni-stuttgart.de","schulte@ims.uni-stuttgart.de","thangvu@ims.uni-stuttgart.de"],"author_id":["kim-anh-nguyen","sabine-schulte-im-walde","ngoc-thang-vu"],"abstract":"We present two novel datasets for the low-resource language Vietnamese to assess models of semantic similarity: ViCon comprises pairs of synonyms and antonyms across word classes, thus offering data to distinguish between similarity and dissimilarity. ViSim-400 provides degrees of similarity across five semantic relations, as rated by human judges. The two datasets are verified through standard co-occurrence and neural network models, showing results comparable to the respective English datasets.","pages":"199--205","doi":"10.18653\/v1\/N18-2032","url":"https:\/\/www.aclweb.org\/anthology\/N18-2032","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2033","title":"Lexical Substitution for Evaluating Compositional Distributional Models","authors":["Buljan, Maja","Pad{\\'o}, Sebastian","{\\v{S}}najder, Jan"],"emails":["maja.buljan@ims.uni-stuttgart.de","pado@ims.uni-stuttgart.de","jan.snajder@fer.hr"],"author_id":["maja-buljan","sebastian-pado","jan-snajder"],"abstract":"Compositional Distributional Semantic Models (CDSMs) model the meaning of phrases and sentences in vector space. They have been predominantly evaluated on limited, artificial tasks such as semantic sentence similarity on hand-constructed datasets. This paper argues for lexical substitution (LexSub) as a means to evaluate CDSMs. LexSub is a more natural task, enables us to evaluate meaning composition at the level of individual words, and provides a common ground to compare CDSMs with dedicated LexSub models. We create a LexSub dataset for CDSM evaluation from a corpus with manual {``}all-words{''} LexSub annotation. Our experiments indicate that the Practical Lexical Function CDSM outperforms simple component-wise CDSMs and performs on par with the context2vec LexSub model using the same context.","pages":"206--211","doi":"10.18653\/v1\/N18-2033","url":"https:\/\/www.aclweb.org\/anthology\/N18-2033","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2034","title":"{M}ittens: an Extension of {G}lo{V}e for Learning Domain-Specialized Representations","authors":["Dingwall, Nicholas","Potts, Christopher"],"emails":["nick@roamanalytics.com","cgpotts@stanford.edu"],"author_id":["nicholas-dingwall","christopher-potts"],"abstract":"We present a simple extension of the GloVe representation learning model that begins with general-purpose representations and updates them based on data from a specialized domain. We show that the resulting representations can lead to faster learning and better results on a variety of tasks.","pages":"212--217","doi":"10.18653\/v1\/N18-2034","url":"https:\/\/www.aclweb.org\/anthology\/N18-2034","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2035","title":"Olive Oil is Made \\textit{of} Olives, Baby Oil is Made \\textit{for} Babies: Interpreting Noun Compounds Using Paraphrases in a Neural Model","authors":["Shwartz, Vered","Waterson, Chris"],"emails":["vered1986@gmail.com","waterson@google.com"],"author_id":["vered-shwartz","chris-waterson"],"abstract":"Automatic interpretation of the relation between the constituents of a noun compound, e.g. olive oil (source) and baby oil (purpose) is an important task for many NLP applications. Recent approaches are typically based on either noun-compound representations or paraphrases. While the former has initially shown promising results, recent work suggests that the success stems from memorizing single prototypical words for each relation. We explore a neural paraphrasing approach that demonstrates superior performance when such memorization is not possible.","pages":"218--224","doi":"10.18653\/v1\/N18-2035","url":"https:\/\/www.aclweb.org\/anthology\/N18-2035","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2036","title":"Semantic Pleonasm Detection","authors":["Kashefi, Omid","Lucas, Andrew T.","Hwa, Rebecca"],"emails":["kashefi@cs.pitt.edu","andrew.lucas@cs.pitt.edu","hwa@cs.pitt.edu"],"author_id":["omid-kashefi","andrew-t-lucas","rebecca-hwa"],"abstract":"Pleonasms are words that are redundant. To aid the development of systems that detect pleonasms in text, we introduce an annotated corpus of semantic pleonasms. We validate the integrity of the corpus with interannotator agreement analyses. We also compare it against alternative resources in terms of their effects on several automatic redundancy detection methods.","pages":"225--230","doi":"10.18653\/v1\/N18-2036","url":"https:\/\/www.aclweb.org\/anthology\/N18-2036","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2037","title":"Similarity Measures for the Detection of Clinical Conditions with Verbal Fluency Tasks","authors":["Paula, Felipe","Wilkens, Rodrigo","Idiart, Marco","Villavicencio, Aline"],"emails":["felipesfpaula@gmail.com","rodrigo.wilkens@uclouvain.be","marco.idiart@gmail.com","avillavicencio@inf.ufrgs.br"],"author_id":["felipe-paula","rodrigo-wilkens","marco-idiart","aline-villavicencio"],"abstract":"Semantic Verbal Fluency tests have been used in the detection of certain clinical conditions, like Dementia. In particular, given a sequence of semantically related words, a large number of switches from one semantic class to another has been linked to clinical conditions. In this work, we investigate three similarity measures for automatically identifying switches in semantic chains: semantic similarity from a manually constructed resource, and word association strength and semantic relatedness, both calculated from corpora. This information is used for building classifiers to distinguish healthy controls from clinical cases with early stages of Alzheimer{'}s Disease and Mild Cognitive Deficits. The overall results indicate that for clinical conditions the classifiers that use these similarity measures outperform those that use a gold standard taxonomy.","pages":"231--235","doi":"10.18653\/v1\/N18-2037","url":"https:\/\/www.aclweb.org\/anthology\/N18-2037","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2038","title":"Sluice Resolution without Hand-Crafted Features over Brittle Syntax Trees","authors":["R{\\o}nning, Ola","Hardt, Daniel","S{\\o}gaard, Anders"],"emails":["ronning@protonmail.com","dh.digi@cbs.dk","soegaard@di.ku.dk"],"author_id":["ola-ronning","daniel-hardt","anders-sogaard"],"abstract":"Sluice resolution in English is the problem of finding antecedents of \\textit{wh}-fronted ellipses. Previous work has relied on hand-crafted features over syntax trees that scale poorly to other languages and domains; in particular, to dialogue, which is one of the most interesting applications of sluice resolution. Syntactic information is arguably important for sluice resolution, but we show that multi-task learning with partial parsing as auxiliary tasks effectively closes the gap and buys us an additional 9{\\%} error reduction over previous work. Since we are not directly relying on features from partial parsers, our system is more robust to domain shifts, giving a 26{\\%} error reduction on embedded sluices in dialogue.","pages":"236--241","doi":"10.18653\/v1\/N18-2038","url":"https:\/\/www.aclweb.org\/anthology\/N18-2038","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2039","title":"The Word Analogy Testing Caveat","authors":["Schluter, Natalie"],"emails":["natschluter@itu.dk"],"author_id":["natalie-schluter"],"abstract":"There are some important problems in the evaluation of word embeddings using standard word analogy tests. In particular, in virtue of the assumptions made by systems generating the embeddings, these remain tests over randomness. We show that even supposing there were such word analogy regularities that should be detected in the word embeddings obtained via unsupervised means, standard word analogy test implementation practices provide distorted or contrived results. We raise concerns regarding the use of Principal Component Analysis to 2 or 3 dimensions as a provision of visual evidence for the existence of word analogy relations in embeddings. Finally, we propose some solutions to these problems.","pages":"242--246","doi":"10.18653\/v1\/N18-2039","url":"https:\/\/www.aclweb.org\/anthology\/N18-2039","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2040","title":"Transition-Based {C}hinese {AMR} Parsing","authors":["Wang, Chuan","Li, Bin","Xue, Nianwen"],"emails":["cwang24@brandeis.edu","libin.njnu@gmail.com","xuen@brandeis.edu"],"author_id":["chuan-wang","bin-li","nianwen-xue"],"abstract":"This paper presents the first AMR parser built on the Chinese AMR bank. By applying a transition-based AMR parsing framework to Chinese, we first investigate how well the transitions first designed for English AMR parsing generalize to Chinese and provide a comparative analysis between the transitions for English and Chinese. We then perform a detailed error analysis to identify the major challenges in Chinese AMR parsing that we hope will inform future research in this area.","pages":"247--252","doi":"10.18653\/v1\/N18-2040","url":"https:\/\/www.aclweb.org\/anthology\/N18-2040","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2041","title":"Knowledge-Enriched Two-Layered Attention Network for Sentiment Analysis","authors":["Kumar, Abhishek","Kawahara, Daisuke","Kurohashi, Sadao"],"emails":["abhishek.ee14@iitp.ac.in","dk@i.kyoto-u.ac.jp","kuro@i.kyoto-u.ac.jp"],"author_id":["abhishek-kumar","daisuke-kawahara","sadao-kurohashi"],"abstract":"We propose a novel two-layered attention network based on Bidirectional Long Short-Term Memory for sentiment analysis. The novel two-layered attention network takes advantage of the external knowledge bases to improve the sentiment prediction. It uses the Knowledge Graph Embedding generated using the WordNet. We build our model by combining the two-layered attention network with the supervised model based on Support Vector Regression using a Multilayer Perceptron network for sentiment analysis. We evaluate our model on the benchmark dataset of SemEval 2017 Task 5. Experimental results show that the proposed model surpasses the top system of SemEval 2017 Task 5. The model performs significantly better by improving the state-of-the-art system at SemEval 2017 Task 5 by 1.7 and 3.7 points for sub-tracks 1 and 2 respectively.","pages":"253--258","doi":"10.18653\/v1\/N18-2041","url":"https:\/\/www.aclweb.org\/anthology\/N18-2041","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2042","title":"Letting Emotions Flow: Success Prediction by Modeling the Flow of Emotions in Books","authors":["Maharjan, Suraj","Kar, Sudipta","Montes, Manuel","Gonz{\\'a}lez, Fabio A.","Solorio, Thamar"],"emails":["smaharjan2@uh.edu","skar3@uh.edu","mmontesg@ccc.inoep.mx","fagonzalezo@unal.edu.co","solorio@cs.uh.edu"],"author_id":["suraj-maharjan","sudipta-kar","manuel-montes","fabio-a-gonzalez","thamar-solorio"],"abstract":"Books have the power to make us feel happiness, sadness, pain, surprise, or sorrow. An author{'}s dexterity in the use of these emotions captivates readers and makes it difficult for them to put the book down. In this paper, we model the flow of emotions over a book using recurrent neural networks and quantify its usefulness in predicting success in books. We obtained the best weighted F1-score of 69{\\%} for predicting books{'} success in a multitask setting (simultaneously predicting success and genre of books).","pages":"259--265","doi":"10.18653\/v1\/N18-2042","url":"https:\/\/www.aclweb.org\/anthology\/N18-2042","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2043","title":"Modeling Inter-Aspect Dependencies for Aspect-Based Sentiment Analysis","authors":["Hazarika, Devamanyu","Poria, Soujanya","Vij, Prateek","Krishnamurthy, Gangeshwar","Cambria, Erik","Zimmermann, Roger"],"emails":["devamanyu@comp.nus.edu.sg","sporia@ihpc.a-star.edu.sg","v.prateek@iitg.ernet.in","gangeshwark@ihpc.a-star.edu.sg","cambria@ntu.edu.sg","rogerz@comp.nus.edu.sg"],"author_id":["devamanyu-hazarika","soujanya-poria","prateek-vij","gangeshwar-krishnamurthy","erik-cambria","roger-zimmermann"],"abstract":"Aspect-based Sentiment Analysis is a fine-grained task of sentiment classification for multiple aspects in a sentence. Present neural-based models exploit aspect and its contextual information in the sentence but largely ignore the inter-aspect dependencies. In this paper, we incorporate this pattern by simultaneous classification of all aspects in a sentence along with temporal dependency processing of their corresponding sentence representations using recurrent networks. Results on the benchmark SemEval 2014 dataset suggest the effectiveness of our proposed approach.","pages":"266--270","doi":"10.18653\/v1\/N18-2043","url":"https:\/\/www.aclweb.org\/anthology\/N18-2043","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2044","title":"Multi-Task Learning Framework for Mining Crowd Intelligence towards Clinical Treatment","authors":["Yadav, Shweta","Ekbal, Asif","Saha, Sriparna","Bhattacharyya, Pushpak","Sheth, Amit"],"emails":["shweta.pcs14@iitp.ac.in","asif@iitp.ac.in","sriparna@iitp.ac.in","pb@iitp.ac.in","amit@knoesis.org"],"author_id":["shweta-yadav","asif-ekbal","sriparna-saha","pushpak-bhattacharyya","amit-sheth"],"abstract":"In recent past, social media has emerged as an active platform in the context of healthcare and medicine. In this paper, we present a study where medical user{'}s opinions on health-related issues are analyzed to capture the medical sentiment at a blog level. The medical sentiments can be studied in various facets such as medical condition, treatment, and medication that characterize the overall health status of the user. Considering these facets, we treat analysis of this information as a multi-task classification problem. In this paper, we adopt a novel adversarial learning approach for our multi-task learning framework to learn the sentiment{'}s strengths expressed in a medical blog. Our evaluation shows promising results for our target tasks.","pages":"271--277","doi":"10.18653\/v1\/N18-2044","url":"https:\/\/www.aclweb.org\/anthology\/N18-2044","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2045","title":"Recurrent Entity Networks with Delayed Memory Update for Targeted Aspect-Based Sentiment Analysis","authors":["Liu, Fei","Cohn, Trevor","Baldwin, Timothy"],"emails":["fliu3@student.unimelb.edu.au","t.cohn@unimelb.edu.au","tb@ldwin.net"],"author_id":["fei-liu","trevor-cohn","timothy-baldwin"],"abstract":"While neural networks have been shown to achieve impressive results for sentence-level sentiment analysis, targeted aspect-based sentiment analysis (TABSA) {---} extraction of fine-grained opinion polarity w.r.t. a pre-defined set of aspects {---} remains a difficult task. Motivated by recent advances in memory-augmented models for machine reading, we propose a novel architecture, utilising external {``}memory chains{''} with a delayed memory update mechanism to track entities. On a TABSA task, the proposed model demonstrates substantial improvements over state-of-the-art approaches, including those using external knowledge bases.","pages":"278--283","doi":"10.18653\/v1\/N18-2045","url":"https:\/\/www.aclweb.org\/anthology\/N18-2045","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2046","title":"Near Human-Level Performance in Grammatical Error Correction with Hybrid Machine Translation","authors":["Grundkiewicz, Roman","Junczys-Dowmunt, Marcin"],"emails":["rgrundki@inf.ed.ac.uk","marcinjd@microsoft.com"],"author_id":["roman-grundkiewicz","marcin-junczys-dowmunt"],"abstract":"We combine two of the most popular approaches to automated Grammatical Error Correction (GEC): GEC based on Statistical Machine Translation (SMT) and GEC based on Neural Machine Translation (NMT). The hybrid system achieves new state-of-the-art results on the CoNLL-2014 and JFLEG benchmarks. This GEC system preserves the accuracy of SMT output and, at the same time, generates more fluent sentences as it typical for NMT. Our analysis shows that the created systems are closer to reaching human-level performance than any other GEC system reported so far.","pages":"284--290","doi":"10.18653\/v1\/N18-2046","url":"https:\/\/www.aclweb.org\/anthology\/N18-2046","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2047","title":"Strong Baselines for Simple Question Answering over Knowledge Graphs with and without Neural Networks","authors":["Mohammed, Salman","Shi, Peng","Lin, Jimmy"],"emails":["smohammed1993@gmail.com","peng.shi@uwaterloo.ca","jimmylin@uwaterloo.ca"],"author_id":["salman-mohammed","peng-shi","jimmy-lin"],"abstract":"We examine the problem of question answering over knowledge graphs, focusing on simple questions that can be answered by the lookup of a single fact. Adopting a straightforward decomposition of the problem into entity detection, entity linking, relation prediction, and evidence combination, we explore simple yet strong baselines. On the popular SimpleQuestions dataset, we find that basic LSTMs and GRUs plus a few heuristics yield accuracies that approach the state of the art, and techniques that do not use neural networks also perform reasonably well. These results show that gains from sophisticated deep learning techniques proposed in the literature are quite modest and that some previous models exhibit unnecessary complexity.","pages":"291--296","doi":"10.18653\/v1\/N18-2047","url":"https:\/\/www.aclweb.org\/anthology\/N18-2047","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2048","title":"Looking for Structure in Lexical and Acoustic-Prosodic Entrainment Behaviors","authors":["Weise, Andreas","Levitan, Rivka"],"emails":["aweise@gradcenter.cuny.edu","rlevitan@brooklyn.cuny.edu"],"author_id":["andreas-weise","rivka-levitan"],"abstract":"Entrainment has been shown to occur for various linguistic features individually. Motivated by cognitive theories regarding linguistic entrainment, we analyze speakers{'} overall entrainment behaviors and search for an underlying structure. We consider various measures of both acoustic-prosodic and lexical entrainment, measuring the latter with a novel application of two previously introduced methods in addition to a standard high-frequency word measure. We present a negative result of our search, finding no meaningful correlations, clusters, or principal components in various entrainment measures, and discuss practical and theoretical implications.","pages":"297--302","doi":"10.18653\/v1\/N18-2048","url":"https:\/\/www.aclweb.org\/anthology\/N18-2048","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2049","title":"Modeling Semantic Plausibility by Injecting World Knowledge","authors":["Wang, Su","Durrett, Greg","Erk, Katrin"],"emails":["shrekwang@utexas.edu","gdurrett@cs.utexas.edu","katrin.erk@mail.utexas.edu"],"author_id":["su-wang","greg-durrett","katrin-erk"],"abstract":"Distributional data tells us that a man can swallow candy, but not that a man can swallow a paintball, since this is never attested. However both are physically plausible events. This paper introduces the task of semantic plausibility: recognizing plausible but possibly novel events. We present a new crowdsourced dataset of semantic plausibility judgments of single events such as man swallow paintball. Simple models based on distributional representations perform poorly on this task, despite doing well on selection preference, but injecting manually elicited knowledge about entity properties provides a substantial performance boost. Our error analysis shows that our new dataset is a great testbed for semantic plausibility models: more sophisticated knowledge representation and propagation could address many of the remaining errors.","pages":"303--308","doi":"10.18653\/v1\/N18-2049","url":"https:\/\/www.aclweb.org\/anthology\/N18-2049","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2050","title":"A Bi-Model Based {RNN} Semantic Frame Parsing Model for Intent Detection and Slot Filling","authors":["Wang, Yu","Shen, Yilin","Jin, Hongxia"],"emails":["yu.wang1@samsung.com","yilin.shen@samsung.com","hongxia.jin@samsung.com"],"author_id":["yu-wang","yilin-shen","hongxia-jin"],"abstract":"Intent detection and slot filling are two main tasks for building a spoken language understanding(SLU) system. Multiple deep learning based models have demonstrated good results on these tasks . The most effective algorithms are based on the structures of sequence to sequence models (or {``}encoder-decoder{''} models), and generate the intents and semantic tags either using separate models. Most of the previous studies, however, either treat the intent detection and slot filling as two separate parallel tasks, or use a sequence to sequence model to generate both semantic tags and intent. None of the approaches consider the cross-impact between the intent detection task and the slot filling task. In this paper, new Bi-model based RNN semantic frame parsing network structures are designed to perform the intent detection and slot filling tasks jointly, by considering their cross-impact to each other using two correlated bidirectional LSTMs (BLSTM). Our Bi-model structure with a decoder achieves state-of-art result on the benchmark ATIS data, with about 0.5{\\%} intent accuracy improvement and 0.9 {\\%} slot filling improvement.","pages":"309--314","doi":"10.18653\/v1\/N18-2050","url":"https:\/\/www.aclweb.org\/anthology\/N18-2050","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2051","title":"A Comparison of Two Paraphrase Models for Taxonomy Augmentation","authors":["Plachouras, Vassilis","Petroni, Fabio","Nugent, Timothy","Leidner, Jochen L."],"emails":["vplachouras@fb.com","fabio.petroni@tr.com","tim.nugent@tr.com","jochen.leidner@tr.com"],"author_id":["vassilis-plachouras","fabio-petroni","timothy-nugent","jochen-l-leidner"],"abstract":"Taxonomies are often used to look up the concepts they contain in text documents (for instance, to classify a document). The more comprehensive the taxonomy, the higher recall the application has that uses the taxonomy. In this paper, we explore automatic taxonomy augmentation with paraphrases. We compare two state-of-the-art paraphrase models based on Moses, a statistical Machine Translation system, and a sequence-to-sequence neural network, trained on a paraphrase datasets with respect to their abilities to add novel nodes to an existing taxonomy from the risk domain. We conduct component-based and task-based evaluations. Our results show that paraphrasing is a viable method to enrich a taxonomy with more terms, and that Moses consistently outperforms the sequence-to-sequence neural model. To the best of our knowledge, this is the first approach to augment taxonomies with paraphrases.","pages":"315--320","doi":"10.18653\/v1\/N18-2051","url":"https:\/\/www.aclweb.org\/anthology\/N18-2051","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2052","title":"A Laypeople Study on Terminology Identification across Domains and Task Definitions","authors":["H{\\\"a}tty, Anna","Schulte im Walde, Sabine"],"emails":["anna.haetty@de.bosch.com","schulte@ims.uni-stuttgart.de"],"author_id":["anna-hatty","sabine-schulte-im-walde"],"abstract":"This paper introduces a new dataset of term annotation. Given that even experts vary significantly in their understanding of termhood, and that term identification is mostly performed as a binary task, we offer a novel perspective to explore the common, natural understanding of what constitutes a term: Laypeople annotate single-word and multi-word terms, across four domains and across four task definitions. Analyses based on inter-annotator agreement offer insights into differences in term specificity, term granularity and subtermhood.","pages":"321--326","doi":"10.18653\/v1\/N18-2052","url":"https:\/\/www.aclweb.org\/anthology\/N18-2052","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2053","title":"A Novel Embedding Model for Knowledge Base Completion Based on Convolutional Neural Network","authors":["Nguyen, Dai Quoc","Nguyen, Tu Dinh","Nguyen, Dat Quoc","Phung, Dinh"],"emails":["dai.nguyen@deakin.edu.au","tu.nguyen@deakin.edu.au","dqnguyen@unimelb.edu.au","dinh.phung@deakin.edu.au"],"author_id":["dat-quoc-nguyen","tu-dinh-nguyen","dai-quoc-nguyen","dinh-phung"],"abstract":"In this paper, we propose a novel embedding model, named ConvKB, for knowledge base completion. Our model ConvKB advances state-of-the-art models by employing a convolutional neural network, so that it can capture global relationships and transitional characteristics between entities and relations in knowledge bases. In ConvKB, each triple (head entity, relation, tail entity) is represented as a 3-column matrix where each column vector represents a triple element. This 3-column matrix is then fed to a convolution layer where multiple filters are operated on the matrix to generate different feature maps. These feature maps are then concatenated into a single feature vector representing the input triple. The feature vector is multiplied with a weight vector via a dot product to return a score. This score is then used to predict whether the triple is valid or not. Experiments show that ConvKB achieves better link prediction performance than previous state-of-the-art embedding models on two benchmark datasets WN18RR and FB15k-237.","pages":"327--333","doi":"10.18653\/v1\/N18-2053","url":"https:\/\/www.aclweb.org\/anthology\/N18-2053","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2054","title":"Cross-language Article Linking Using Cross-Encyclopedia Entity Embedding","authors":["Wu, Chun-Kai","Tsai, Richard Tzong-Han"],"emails":["s106062851@m106.nthu.edu.tw","thtsai@csie.ncu.edu.tw"],"author_id":["chun-kai-wu","richard-tzong-han-tsai"],"abstract":"Cross-language article linking (CLAL) is the task of finding corresponding article pairs of different languages across encyclopedias. This task is a difficult disambiguation problem in which one article must be selected among several candidate articles with similar titles and contents. Existing works focus on engineering text-based or link-based features for this task, which is a time-consuming job, and some of these features are only applicable within the same encyclopedia. In this paper, we address these problems by proposing cross-encyclopedia entity embedding. Unlike other works, our proposed method does not rely on known cross-language pairs. We apply our method to CLAL between English Wikipedia and Chinese Baidu Baike. Our features improve performance relative to the baseline by 29.62{\\%}. Tested 30 times, our system achieved an average improvement of 2.76{\\%} over the current best system (26.86{\\%} over baseline), a statistically significant result.","pages":"334--339","doi":"10.18653\/v1\/N18-2054","url":"https:\/\/www.aclweb.org\/anthology\/N18-2054","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2055","title":"Identifying the Most Dominant Event in a News Article by Mining Event Coreference Relations","authors":["Choubey, Prafulla Kumar","Raju, Kaushik","Huang, Ruihong"],"emails":["prafulla.choubey@tamu.edu","kaushik.raju@tamu.edu","huangrh@tamu.edu"],"author_id":["prafulla-kumar-choubey","kaushik-raju","ruihong-huang"],"abstract":"Identifying the most dominant and central event of a document, which governs and connects other foreground and background events in the document, is useful for many applications, such as text summarization, storyline generation and text segmentation. We observed that the central event of a document usually has many coreferential event mentions that are scattered throughout the document for enabling a smooth transition of subtopics. Our empirical experiments, using gold event coreference relations, have shown that the central event of a document can be well identified by mining properties of event coreference chains. But the performance drops when switching to system predicted event coreference relations. In addition, we found that the central event can be more accurately identified by further considering the number of sub-events as well as the realis status of an event.","pages":"340--345","doi":"10.18653\/v1\/N18-2055","url":"https:\/\/www.aclweb.org\/anthology\/N18-2055","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2056","title":"Improve Neural Entity Recognition via Multi-Task Data Selection and Constrained Decoding","authors":["Zhao, Huasha","Yang, Yi","Zhang, Qiong","Si, Luo"],"emails":["huasha.zhao@alibaba-inc.com","yangyi868@gmail.com","qz.zhang@alibaba-inc.com","luo.si@alibaba-inc.com"],"author_id":["huasha-zhao","yi-yang","qiong-zhang","luo-si"],"abstract":"Entity recognition is a widely benchmarked task in natural language processing due to its massive applications. The state-of-the-art solution applies a neural architecture named BiLSTM-CRF to model the language sequences. In this paper, we propose an entity recognition system that improves this neural architecture with two novel techniques. The first technique is Multi-Task Data Selection, which ensures the consistency of data distribution and labeling guidelines between source and target datasets. The other one is constrained decoding using knowledge base. The decoder of the model operates at the document level, and leverages global and external information sources to further improve performance. Extensive experiments have been conducted to show the advantages of each technique. Our system achieves state-of-the-art results on the English entity recognition task in KBP 2017 official evaluation, and it also yields very strong results in other languages.","pages":"346--351","doi":"10.18653\/v1\/N18-2056","url":"https:\/\/www.aclweb.org\/anthology\/N18-2056","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2057","title":"Keep Your Bearings: Lightly-Supervised Information Extraction with Ladder Networks That Avoids Semantic Drift","authors":["Nagesh, Ajay","Surdeanu, Mihai"],"emails":["ajaynagesh@email.arizona.edu","surdeanu@email.arizona.edu"],"author_id":["ajay-nagesh","mihai-surdeanu"],"abstract":"We propose a novel approach to semi-supervised learning for information extraction that uses ladder networks (Rasmus et al., 2015). In particular, we focus on the task of named entity classification, defined as identifying the correct label (e.g., person or organization name) of an entity mention in a given context. Our approach is simple, efficient and has the benefit of being robust to semantic drift, a dominant problem in most semi-supervised learning systems. We empirically demonstrate the superior performance of our system compared to the state-of-the-art on two standard datasets for named entity classification. We obtain between 62{\\%} and 200{\\%} improvement over the state-of-art baseline on these two datasets.","pages":"352--358","doi":"10.18653\/v1\/N18-2057","url":"https:\/\/www.aclweb.org\/anthology\/N18-2057","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2058","title":"Semi-Supervised Event Extraction with Paraphrase Clusters","authors":["Ferguson, James","Lockard, Colin","Weld, Daniel","Hajishirzi, Hannaneh"],"emails":["jfferg@cs.washington.edu","lockardc@cs.washington.edu","weld@cs.washington.edu","hannaneh@cs.washington.edu"],"author_id":["james-ferguson","colin-lockard","daniel-s-weld","hannaneh-hajishirzi"],"abstract":"Supervised event extraction systems are limited in their accuracy due to the lack of available training data. We present a method for self-training event extraction systems by bootstrapping additional training data. This is done by taking advantage of the occurrence of multiple mentions of the same event instances across newswire articles from multiple sources. If our system can make a high-confidence extraction of some mentions in such a cluster, it can then acquire diverse training examples by adding the other mentions as well. Our experiments show significant performance improvements on multiple event extractors over ACE 2005 and TAC-KBP 2015 datasets.","pages":"359--364","doi":"10.18653\/v1\/N18-2058","url":"https:\/\/www.aclweb.org\/anthology\/N18-2058","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2059","title":"Structure Regularized Neural Network for Entity Relation Classification for {C}hinese Literature Text","authors":["Wen, Ji","Sun, Xu","Ren, Xuancheng","Su, Qi"],"emails":["wenjics@pku.edu.cn","xusun@pku.edu.cn","renxc@pku.edu.cn","sukia@pku.edu.cn"],"author_id":["ji-wen","xu-sun","xuancheng-ren","qi-su"],"abstract":"Relation classification is an important semantic processing task in the field of natural language processing. In this paper, we propose the task of relation classification for Chinese literature text. A new dataset of Chinese literature text is constructed to facilitate the study in this task. We present a novel model, named Structure Regularized Bidirectional Recurrent Convolutional Neural Network (SR-BRCNN), to identify the relation between entities. The proposed model learns relation representations along the shortest dependency path (SDP) extracted from the structure regularized dependency tree, which has the benefits of reducing the complexity of the whole model. Experimental results show that the proposed method significantly improves the F1 score by 10.3, and outperforms the state-of-the-art approaches on Chinese literature text.","pages":"365--370","doi":"10.18653\/v1\/N18-2059","url":"https:\/\/www.aclweb.org\/anthology\/N18-2059","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2060","title":"Syntactic Patterns Improve Information Extraction for Medical Search","authors":["Patel, Roma","Yang, Yinfei","Marshall, Iain","Nenkova, Ani","Wallace, Byron"],"emails":["","","","",""],"author_id":["roma-patel","yinfei-yang","iain-marshall","ani-nenkova","byron-c-wallace"],"abstract":"Medical professionals search the published literature by specifying the type of patients, the medical intervention(s) and the outcome measure(s) of interest. In this paper we demonstrate how features encoding syntactic patterns improve the performance of state-of-the-art sequence tagging models (both neural and linear) for information extraction of these medically relevant categories. We present an analysis of the type of patterns exploited and of the semantic space induced for these, i.e., the distributed representations learned for identified multi-token patterns. We show that these learned representations differ substantially from those of the constituent unigrams, suggesting that the patterns capture contextual information that is otherwise lost.","pages":"371--377","doi":"10.18653\/v1\/N18-2060","url":"https:\/\/www.aclweb.org\/anthology\/N18-2060","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2061","title":"Syntactically Aware Neural Architectures for Definition Extraction","authors":["Espinosa-Anke, Luis","Schockaert, Steven"],"emails":["espinosa-ankel@cardiff.ac.uk","schockaerts1@cardiff.ac.uk"],"author_id":["luis-espinosa-anke","steven-schockaert"],"abstract":"Automatically identifying definitional knowledge in text corpora (Definition Extraction or DE) is an important task with direct applications in, among others, Automatic Glossary Generation, Taxonomy Learning, Question Answering and Semantic Search. It is generally cast as a binary classification problem between definitional and non-definitional sentences. In this paper we present a set of neural architectures combining Convolutional and Recurrent Neural Networks, which are further enriched by incorporating linguistic information via syntactic dependencies. Our experimental results in the task of sentence classification, on two benchmarking DE datasets (one generic, one domain-specific), show that these models obtain consistent state of the art results. Furthermore, we demonstrate that models trained on clean Wikipedia-like definitions can successfully be applied to more noisy domain-specific corpora.","pages":"378--385","doi":"10.18653\/v1\/N18-2061","url":"https:\/\/www.aclweb.org\/anthology\/N18-2061","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2062","title":"A Dynamic Oracle for Linear-Time 2-Planar Dependency Parsing","authors":["Fern{\\'a}ndez-Gonz{\\'a}lez, Daniel","G{\\'o}mez-Rodr{\\'\\i}guez, Carlos"],"emails":["d.fgonzalez@udc.es","carlos.gomez@udc.es"],"author_id":["daniel-fernandez-gonzalez","carlos-gomez-rodriguez"],"abstract":"We propose an efficient dynamic oracle for training the 2-Planar transition-based parser, a linear-time parser with over 99{\\%} coverage on non-projective syntactic corpora. This novel approach outperforms the static training strategy in the vast majority of languages tested and scored better on most datasets than the arc-hybrid parser enhanced with the Swap transition, which can handle unrestricted non-projectivity.","pages":"386--392","doi":"10.18653\/v1\/N18-2062","url":"https:\/\/www.aclweb.org\/anthology\/N18-2062","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2063","title":"Are Automatic Methods for Cognate Detection Good Enough for Phylogenetic Reconstruction in Historical Linguistics?","authors":["Rama, Taraka","List, Johann-Mattis","Wahle, Johannes","J{\\\"a}ger, Gerhard"],"emails":["tarakark@ifi.uio.no","list@shh.mpg.de","johannes.wahle@uni-tuebingen.de","gerhard.jaeger@uni-tuebingen.de"],"author_id":["taraka-rama","johann-mattis-list","johannes-wahle","gerhard-jager"],"abstract":"We evaluate the performance of state-of-the-art algorithms for automatic cognate detection by comparing how useful automatically inferred cognates are for the task of phylogenetic inference compared to classical manually annotated cognate sets. Our findings suggest that phylogenies inferred from automated cognate sets come close to phylogenies inferred from expert-annotated ones, although on average, the latter are still superior. We conclude that future work on phylogenetic reconstruction can profit much from automatic cognate detection. Especially where scholars are merely interested in exploring the bigger picture of a language family{'}s phylogeny, algorithms for automatic cognate detection are a useful complement for current research on language phylogenies.","pages":"393--400","doi":"10.18653\/v1\/N18-2063","url":"https:\/\/www.aclweb.org\/anthology\/N18-2063","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2064","title":"Automatically Selecting the Best Dependency Annotation Design with Dynamic Oracles","authors":["Wisniewski, Guillaume","Lacroix, Oph{\\'e}lie","Yvon, Fran{\\c{c}}ois"],"emails":["wisniews@limsi.fr","ola@siteimprove.com","yvon@limsi.fr"],"author_id":["guillaume-wisniewski","ophelie-lacroix","francois-yvon"],"abstract":"This work introduces a new strategy to compare the numerous conventions that have been proposed over the years for expressing dependency structures and discover the one for which a parser will achieve the highest parsing performance. Instead of associating each sentence in the training set with a single gold reference we propose to consider a set of references encoding alternative syntactic representations. Training a parser with a dynamic oracle will then automatically select among all alternatives the reference that will be predicted with the highest accuracy. Experiments on the UD corpora show the validity of this approach.","pages":"401--406","doi":"10.18653\/v1\/N18-2064","url":"https:\/\/www.aclweb.org\/anthology\/N18-2064","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2065","title":"Consistent {CCG} Parsing over Multiple Sentences for Improved Logical Reasoning","authors":["Yoshikawa, Masashi","Mineshima, Koji","Noji, Hiroshi","Bekki, Daisuke"],"emails":["yoshikawa.masashi.yh8@is.naist.jp","mineshima.koji@ocha.ac.jp","hiroshi.noji@aist.go.jp","bekki@is.ocha.ac.jp"],"author_id":["masashi-yoshikawa","koji-mineshima","hiroshi-noji","daisuke-bekki"],"abstract":"In formal logic-based approaches to Recognizing Textual Entailment (RTE), a Combinatory Categorial Grammar (CCG) parser is used to parse input premises and hypotheses to obtain their logical formulas. Here, it is important that the parser processes the sentences consistently; failing to recognize the similar syntactic structure results in inconsistent predicate argument structures among them, in which case the succeeding theorem proving is doomed to failure. In this work, we present a simple method to extend an existing CCG parser to parse a set of sentences consistently, which is achieved with an inter-sentence modeling with Markov Random Fields (MRF). When combined with existing logic-based systems, our method always shows improvement in the RTE experiments on English and Japanese languages.","pages":"407--412","doi":"10.18653\/v1\/N18-2065","url":"https:\/\/www.aclweb.org\/anthology\/N18-2065","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2066","title":"Exploiting Dynamic Oracles to Train Projective Dependency Parsers on Non-Projective Trees","authors":["Aufrant, Lauriane","Wisniewski, Guillaume","Yvon, Fran{\\c{c}}ois"],"emails":["lauriane.aufrant@limsi.fr","guillaume.wisniewski@limsi.fr","francois.yvon@limsi.fr"],"author_id":["lauriane-aufrant","guillaume-wisniewski","francois-yvon"],"abstract":"Because the most common transition systems are projective, training a transition-based dependency parser often implies to either ignore or rewrite the non-projective training examples, which has an adverse impact on accuracy. In this work, we propose a simple modification of dynamic oracles, which enables the use of non-projective data when training projective parsers. Evaluation on 73 treebanks shows that our method achieves significant gains (+2 to +7 UAS for the most non-projective languages) and consistently outperforms traditional projectivization and pseudo-projectivization approaches.","pages":"413--419","doi":"10.18653\/v1\/N18-2066","url":"https:\/\/www.aclweb.org\/anthology\/N18-2066","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2067","title":"Improving Coverage and Runtime Complexity for Exact Inference in Non-Projective Transition-Based Dependency Parsers","authors":["Shi, Tianze","G{\\'o}mez-Rodr{\\'\\i}guez, Carlos","Lee, Lillian"],"emails":["tianze@cs.cornell.edu","carlos.gomez@udc.es","llee@cs.cornell.edu"],"author_id":["tianze-shi","carlos-gomez-rodriguez","lillian-lee"],"abstract":"We generalize Cohen, G{\\'o}mez-Rodr{\\'\\i}guez, and Satta{'}s (2011) parser to a family of non-projective transition-based dependency parsers allowing polynomial-time exact inference. This includes novel parsers with better coverage than Cohen et al. (2011), and even a variant that reduces time complexity to $O(n^6)$, improving over the known bounds in exact inference for non-projective transition-based parsing. We hope that this piece of theoretical work inspires design of novel transition systems with better coverage and better run-time guarantees.","pages":"420--425","doi":"10.18653\/v1\/N18-2067","url":"https:\/\/www.aclweb.org\/anthology\/N18-2067","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2068","title":"Towards a Variability Measure for Multiword Expressions","authors":["Pasquer, Caroline","Savary, Agata","Antoine, Jean-Yves","Ramisch, Carlos"],"emails":["caroline.pasquer@univ-tours.fr","agata.savary@univ-tours.fr","jean-yves.antoine@univ-tours.fr","carlos.ramisch@lis-lab.fr"],"author_id":["caroline-pasquer","agata-savary","jean-yves-antoine","carlos-ramisch"],"abstract":"One of the most outstanding properties of multiword expressions (MWEs), especially verbal ones (VMWEs), important both in theoretical models and applications, is their idiosyncratic variability. Some MWEs are always continuous, while some others admit certain types of insertions. Components of some MWEs are rarely or never modified, while some others admit either specific or unrestricted modification. This unpredictable variability profile of MWEs hinders modeling and processing them as {``}words-with-spaces{''} on the one hand, and as regular syntactic structures on the other hand. Since variability of MWEs is a matter of scale rather than a binary property, we propose a 2-dimensional language-independent measure of variability dedicated to verbal MWEs based on syntactic and discontinuity-related clues. We assess its relevance with respect to a linguistic benchmark and its utility for the tasks of VMWE classification and variant identification on a French corpus.","pages":"426--432","doi":"10.18653\/v1\/N18-2068","url":"https:\/\/www.aclweb.org\/anthology\/N18-2068","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2069","title":"Defoiling Foiled Image Captions","authors":["Madhyastha, Pranava Swaroop","Wang, Josiah","Specia, Lucia"],"emails":["p.madhyastha@sheffield.ac.uk","j.k.wang@sheffield.ac.uk","l.specia@sheffield.ac.uk"],"author_id":["pranava-swaroop-madhyastha","josiah-wang","lucia-specia"],"abstract":"We address the task of detecting foiled image captions, i.e. identifying whether a caption contains a word that has been deliberately replaced by a semantically similar word, thus rendering it inaccurate with respect to the image being described. Solving this problem should in principle require a fine-grained understanding of images to detect subtle perturbations in captions. In such contexts, encoding sufficiently descriptive image information becomes a key challenge. In this paper, we demonstrate that it is possible to solve this task using simple, interpretable yet powerful representations based on explicit object information over multilayer perceptron models. Our models achieve state-of-the-art performance on a recently published dataset, with scores exceeding those achieved by humans on the task. We also measure the upper-bound performance of our models using gold standard annotations. Our study and analysis reveals that the simpler model performs well even without image information, suggesting that the dataset contains strong linguistic bias.","pages":"433--438","doi":"10.18653\/v1\/N18-2069","url":"https:\/\/www.aclweb.org\/anthology\/N18-2069","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2070","title":"Pragmatically Informative Image Captioning with Character-Level Inference","authors":["Cohn-Gordon, Reuben","Goodman, Noah","Potts, Christopher"],"emails":["reubencg@stanford.edu","ngoodman@stanford.edu","cgpotts@stanford.edu"],"author_id":["reuben-cohn-gordon","noah-goodman","christopher-potts"],"abstract":"We combine a neural image captioner with a Rational Speech Acts (RSA) model to make a system that is pragmatically informative: its objective is to produce captions that are not merely true but also distinguish their inputs from similar images. Previous attempts to combine RSA with neural image captioning require an inference which normalizes over the entire set of possible utterances. This poses a serious problem of efficiency, previously solved by sampling a small subset of possible utterances. We instead solve this problem by implementing a version of RSA which operates at the level of characters ({``}a{''}, {``}b{''}, {``}c{''}, ...) during the unrolling of the caption. We find that the utterance-level effect of referential captions can be obtained with only character-level decisions. Finally, we introduce an automatic method for testing the performance of pragmatic speaker models, and show that our model outperforms a non-pragmatic baseline as well as a word-level RSA captioner.","pages":"439--443","doi":"10.18653\/v1\/N18-2070","url":"https:\/\/www.aclweb.org\/anthology\/N18-2070","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2071","title":"Object Ordering with Bidirectional Matchings for Visual Reasoning","authors":["Tan, Hao","Bansal, Mohit"],"emails":["haotan@cs.unc.edu","mbansal@cs.unc.edu"],"author_id":["hao-tan","mohit-bansal"],"abstract":"Visual reasoning with compositional natural language instructions, e.g., based on the newly-released Cornell Natural Language Visual Reasoning (NLVR) dataset, is a challenging task, where the model needs to have the ability to create an accurate mapping between the diverse phrases and the several objects placed in complex arrangements in the image. Further, this mapping needs to be processed to answer the question in the statement given the ordering and relationship of the objects across three similar images. In this paper, we propose a novel end-to-end neural model for the NLVR task, where we first use joint bidirectional attention to build a two-way conditioning between the visual information and the language phrases. Next, we use an RL-based pointer network to sort and process the varying number of unordered objects (so as to match the order of the statement phrases) in each of the three images and then pool over the three decisions. Our model achieves strong improvements (of 4-6{\\%} absolute) over the state-of-the-art on both the structured representation and raw image versions of the dataset.","pages":"444--451","doi":"10.18653\/v1\/N18-2071","url":"https:\/\/www.aclweb.org\/anthology\/N18-2071","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2072","title":"Contextual Augmentation: Data Augmentation by Words with Paradigmatic Relations","authors":["Kobayashi, Sosuke"],"emails":["sosk@preferred.jp"],"author_id":["sosuke-kobayashi"],"abstract":"We propose a novel data augmentation for labeled sentences called contextual augmentation. We assume an invariance that sentences are natural even if the words in the sentences are replaced with other words with paradigmatic relations. We stochastically replace words with other words that are predicted by a bi-directional language model at the word positions. Words predicted according to a context are numerous but appropriate for the augmentation of the original words. Furthermore, we retrofit a language model with a label-conditional architecture, which allows the model to augment sentences without breaking the label-compatibility. Through the experiments for six various different text classification tasks, we demonstrate that the proposed method improves classifiers based on the convolutional or recurrent neural networks.","pages":"452--457","doi":"10.18653\/v1\/N18-2072","url":"https:\/\/www.aclweb.org\/anthology\/N18-2072","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2073","title":"Cross-Lingual Learning-to-Rank with Shared Representations","authors":["Sasaki, Shota","Sun, Shuo","Schamoni, Shigehiko","Duh, Kevin","Inui, Kentaro"],"emails":["sasaki.shota@ecei.tohoku.ac.jp","ssun32@jhu.edu","schamoni@cl.uni-heidelberg.de","kevinduh@cs.jhu.edu","inui@ecei.tohoku.ac.jp"],"author_id":["shota-sasaki","shuo-sun","shigehiko-schamoni","kevin-duh","kentaro-inui"],"abstract":"Cross-lingual information retrieval (CLIR) is a document retrieval task where the documents are written in a language different from that of the user{'}s query. This is a challenging problem for data-driven approaches due to the general lack of labeled training data. We introduce a large-scale dataset derived from Wikipedia to support CLIR research in 25 languages. Further, we present a simple yet effective neural learning-to-rank model that shares representations across languages and reduces the data requirement. This model can exploit training data in, for example, Japanese-English CLIR to improve the results of Swahili-English CLIR.","pages":"458--463","doi":"10.18653\/v1\/N18-2073","url":"https:\/\/www.aclweb.org\/anthology\/N18-2073","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2074","title":"Self-Attention with Relative Position Representations","authors":["Shaw, Peter","Uszkoreit, Jakob","Vaswani, Ashish"],"emails":["petershaw@google.com","usz@google.com","avaswani@google.com"],"author_id":["peter-shaw","jakob-uszkoreit","ashish-vaswani"],"abstract":"Relying entirely on an attention mechanism, the Transformer introduced by Vaswani et al. (2017) achieves state-of-the-art results for machine translation. In contrast to recurrent and convolutional neural networks, it does not explicitly model relative or absolute position information in its structure. Instead, it requires adding representations of absolute positions to its inputs. In this work we present an alternative approach, extending the self-attention mechanism to efficiently consider representations of the relative positions, or distances between sequence elements. On the WMT 2014 English-to-German and English-to-French translation tasks, this approach yields improvements of 1.3 BLEU and 0.3 BLEU over absolute position representations, respectively. Notably, we observe that combining relative and absolute position representations yields no further improvement in translation quality. We describe an efficient implementation of our method and cast it as an instance of relation-aware self-attention mechanisms that can generalize to arbitrary graph-labeled inputs.","pages":"464--468","doi":"10.18653\/v1\/N18-2074","url":"https:\/\/www.aclweb.org\/anthology\/N18-2074","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2075","title":"Text Segmentation as a Supervised Learning Task","authors":["Koshorek, Omri","Cohen, Adir","Mor, Noam","Rotman, Michael","Berant, Jonathan"],"emails":["omri.koshorek@cs.tau.ac.il","adir.cohen@cs.tau.ac.il","noam.mor@cs.tau.ac.il","michael.rotman@cs.tau.ac.il","joberant@cs.tau.ac.il"],"author_id":["omri-koshorek","adir-cohen","noam-mor","michael-rotman","jonathan-berant"],"abstract":"Text segmentation, the task of dividing a document into contiguous segments based on its semantic structure, is a longstanding challenge in language understanding. Previous work on text segmentation focused on unsupervised methods such as clustering or graph search, due to the paucity in labeled data. In this work, we formulate text segmentation as a supervised learning problem, and present a large new dataset for text segmentation that is automatically extracted and labeled from Wikipedia. Moreover, we develop a segmentation model based on this dataset and show that it generalizes well to unseen natural text.","pages":"469--473","doi":"10.18653\/v1\/N18-2075","url":"https:\/\/www.aclweb.org\/anthology\/N18-2075","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2076","title":"What{'}s in a Domain? Learning Domain-Robust Text Representations using Adversarial Training","authors":["Li, Yitong","Baldwin, Timothy","Cohn, Trevor"],"emails":["yitongl4@student.unimelb.edu.au","tbaldwin@unimelb.edu.au","tcohn@unimelb.edu.au"],"author_id":["yitong-li","timothy-baldwin","trevor-cohn"],"abstract":"Most real world language problems require learning from heterogenous corpora, raising the problem of learning robust models which generalise well to both similar (\\textit{in domain}) and dissimilar (\\textit{out of domain}) instances to those seen in training. This requires learning an underlying task, while not learning irrelevant signals and biases specific to individual domains. We propose a novel method to optimise both in- and out-of-domain accuracy based on joint learning of a structured neural model with domain-specific and domain-general components, coupled with adversarial training for domain. Evaluating on multi-domain language identification and multi-domain sentiment analysis, we show substantial improvements over standard domain adaptation techniques, and domain-adversarial training.","pages":"474--479","doi":"10.18653\/v1\/N18-2076","url":"https:\/\/www.aclweb.org\/anthology\/N18-2076","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2077","title":"Automated Paraphrase Lattice Creation for {H}y{TER} Machine Translation Evaluation","authors":["Apidianaki, Marianna","Wisniewski, Guillaume","Cocos, Anne","Callison-Burch, Chris"],"emails":["marapi@seas.upenn.edu","guillaume.wisniewski@limsi.fr","acocos@seas.upenn.edu","ccb@seas.upenn.edu"],"author_id":["marianna-apidianaki","guillaume-wisniewski","anne-cocos","chris-callison-burch"],"abstract":"We propose a variant of a well-known machine translation (MT) evaluation metric, HyTER (Dreyer and Marcu, 2012), which exploits reference translations enriched with meaning equivalent expressions. The original HyTER metric relied on hand-crafted paraphrase networks which restricted its applicability to new data. We test, for the first time, HyTER with automatically built paraphrase lattices. We show that although the metric obtains good results on small and carefully curated data with both manually and automatically selected substitutes, it achieves medium performance on much larger and noisier datasets, demonstrating the limits of the metric for tuning and evaluation of current MT systems.","pages":"480--485","doi":"10.18653\/v1\/N18-2077","url":"https:\/\/www.aclweb.org\/anthology\/N18-2077","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2078","title":"Exploiting Semantics in Neural Machine Translation with Graph Convolutional Networks","authors":["Marcheggiani, Diego","Bastings, Joost","Titov, Ivan"],"emails":["marcheggiani@uva.nl","bastings@uva.nl","ititov@inf.ed.ac.uk"],"author_id":["diego-marcheggiani","joost-bastings","ivan-titov"],"abstract":"Semantic representations have long been argued as potentially useful for enforcing meaning preservation and improving generalization performance of machine translation methods. In this work, we are the first to incorporate information about predicate-argument structure of source sentences (namely, semantic-role representations) into neural machine translation. We use Graph Convolutional Networks (GCNs) to inject a semantic bias into sentence encoders and achieve improvements in BLEU scores over the linguistic-agnostic and syntax-aware versions on the English{--}German language pair.","pages":"486--492","doi":"10.18653\/v1\/N18-2078","url":"https:\/\/www.aclweb.org\/anthology\/N18-2078","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2079","title":"Incremental Decoding and Training Methods for Simultaneous Translation in Neural Machine Translation","authors":["Dalvi, Fahim","Durrani, Nadir","Sajjad, Hassan","Vogel, Stephan"],"emails":["faimaduddin@qf.org.qa","ndurrani@qf.org.qa","hsajjad@qf.org.qa","svogel@qf.org.qa"],"author_id":["fahim-dalvi","nadir-durrani","hassan-sajjad","stephan-vogel"],"abstract":"We address the problem of simultaneous translation by modifying the Neural MT decoder to operate with dynamically built encoder and attention. We propose a tunable agent which decides the best segmentation strategy for a user-defined BLEU loss and Average Proportion (AP) constraint. Our agent outperforms previously proposed Wait-if-diff and Wait-if-worse agents (Cho and Esipova, 2016) on BLEU with a lower latency. Secondly we proposed data-driven changes to Neural MT training to better match the incremental decoding framework.","pages":"493--499","doi":"10.18653\/v1\/N18-2079","url":"https:\/\/www.aclweb.org\/anthology\/N18-2079","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2080","title":"Learning Hidden Unit Contribution for Adapting Neural Machine Translation Models","authors":["Vilar, David"],"emails":["dvilar@amazon.com"],"author_id":["david-vilar"],"abstract":"In this paper we explore the use of Learning Hidden Unit Contribution for the task of neural machine translation. The method was initially proposed in the context of speech recognition for adapting a general system to the specific acoustic characteristics of each speaker. Similar in spirit, in a machine translation framework we want to adapt a general system to a specific domain. We show that the proposed method achieves improvements of up to 2.6 BLEU points over a general system, and up to 6 BLEU points if the initial system has only been trained on out-of-domain data, a situation which may easily happen in practice. The good performance together with its short training time and small memory footprint make it a very attractive solution for domain adaptation.","pages":"500--505","doi":"10.18653\/v1\/N18-2080","url":"https:\/\/www.aclweb.org\/anthology\/N18-2080","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2081","title":"Neural Machine Translation Decoding with Terminology Constraints","authors":["Hasler, Eva","de Gispert, Adri{\\`a}","Iglesias, Gonzalo","Byrne, Bill"],"emails":["ehasler@sdl.com","giglesias@sdl.com","agispert@sdl.com","bbyrne@sdl.com"],"author_id":["eva-hasler","adria-de-gispert","gonzalo-iglesias","bill-byrne"],"abstract":"Despite the impressive quality improvements yielded by neural machine translation (NMT) systems, controlling their translation output to adhere to user-provided terminology constraints remains an open problem. We describe our approach to constrained neural decoding based on finite-state machines and multi-stack decoding which supports target-side constraints as well as constraints with corresponding aligned input text spans. We demonstrate the performance of our framework on multiple translation tasks and motivate the need for constrained decoding with attentions as a means of reducing misplacement and duplication when translating user constraints.","pages":"506--512","doi":"10.18653\/v1\/N18-2081","url":"https:\/\/www.aclweb.org\/anthology\/N18-2081","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2082","title":"On the Evaluation of Semantic Phenomena in Neural Machine Translation Using Natural Language Inference","authors":["Poliak, Adam","Belinkov, Yonatan","Glass, James","Van Durme, Benjamin"],"emails":["azpoliak@cs.jhu.edu","belinkov@mit.edu","glass@mit.edu","vandurme@cs.jhu.edu"],"author_id":["adam-poliak","yonatan-belinkov","james-glass","benjamin-van-durme"],"abstract":"We propose a process for investigating the extent to which sentence representations arising from neural machine translation (NMT) systems encode distinct semantic phenomena. We use these representations as features to train a natural language inference (NLI) classifier based on datasets recast from existing semantic annotations. In applying this process to a representative NMT system, we find its encoder appears most suited to supporting inferences at the syntax-semantics interface, as compared to anaphora resolution requiring world knowledge. We conclude with a discussion on the merits and potential deficiencies of the existing process, and how it may be improved and extended as a broader framework for evaluating semantic coverage","pages":"513--523","doi":"10.18653\/v1\/N18-2082","url":"https:\/\/www.aclweb.org\/anthology\/N18-2082","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2083","title":"Using Word Vectors to Improve Word Alignments for Low Resource Machine Translation","authors":["Pourdamghani, Nima","Ghazvininejad, Marjan","Knight, Kevin"],"emails":["damghani@isi.edu","ghazvini@isi.edu","knight@isi.edu"],"author_id":["nima-pourdamghani","marjan-ghazvininejad","kevin-knight"],"abstract":"We present a method for improving word alignments using word similarities. This method is based on encouraging common alignment links between semantically similar words. We use word vectors trained on monolingual data to estimate similarity. Our experiments on translating fifteen languages into English show consistent BLEU score improvements across the languages.","pages":"524--528","doi":"10.18653\/v1\/N18-2083","url":"https:\/\/www.aclweb.org\/anthology\/N18-2083","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2084","title":"When and Why Are Pre-Trained Word Embeddings Useful for Neural Machine Translation?","authors":["Qi, Ye","Sachan, Devendra","Felix, Matthieu","Padmanabhan, Sarguna","Neubig, Graham"],"emails":["yeq@andrew.cmu.edu","dsachan@andrew.cmu.edu","matthief@andrew.cmu.edu","sjpadman@andrew.cmu.edu","gneubig@andrew.cmu.edu"],"author_id":["ye-qi","devendra-sachan","matthieu-felix","sarguna-padmanabhan","graham-neubig"],"abstract":"The performance of Neural Machine Translation (NMT) systems often suffers in low-resource scenarios where sufficiently large-scale parallel corpora cannot be obtained. Pre-trained word embeddings have proven to be invaluable for improving performance in natural language analysis tasks, which often suffer from paucity of data. However, their utility for NMT has not been extensively explored. In this work, we perform five sets of experiments that analyze when we can expect pre-trained word embeddings to help in NMT tasks. We show that such embeddings can be surprisingly effective in some cases {--} providing gains of up to 20 BLEU points in the most favorable setting.","pages":"529--535","doi":"10.18653\/v1\/N18-2084","url":"https:\/\/www.aclweb.org\/anthology\/N18-2084","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2085","title":"Are All Languages Equally Hard to Language-Model?","authors":["Cotterell, Ryan","Mielke, Sebastian J.","Eisner, Jason","Roark, Brian"],"emails":["","","","roark@google.com"],"author_id":["ryan-cotterell","sebastian-j-mielke","jason-eisner","brian-roark"],"abstract":"For general modeling methods applied to diverse languages, a natural question is: how well should we expect our models to work on languages with differing typological profiles? In this work, we develop an evaluation framework for fair cross-linguistic comparison of language models, using translated text so that all models are asked to predict approximately the same information. We then conduct a study on 21 languages, demonstrating that in some languages, the textual expression of the information is harder to predict with both n-gram and LSTM language models. We show complex inflectional morphology to be a cause of performance differences among languages.","pages":"536--541","doi":"10.18653\/v1\/N18-2085","url":"https:\/\/www.aclweb.org\/anthology\/N18-2085","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2086","title":"The Computational Complexity of Distinctive Feature Minimization in Phonology","authors":["Chen, Hubie","Hulden, Mans"],"emails":["hubie@dcs.bbk.ac.uk","mans.hulden@colorado.edu"],"author_id":["hubie-chen","mans-hulden"],"abstract":"We analyze the complexity of the problem of determining whether a set of phonemes forms a natural class and, if so, that of finding the minimal feature specification for the class. A standard assumption in phonology is that finding a minimal feature specification is an automatic part of acquisition and generalization. We find that the natural class decision problem is tractable (i.e. is in P), while the minimization problem is not; the decision version of the problem which determines whether a natural class can be defined with $k$ features or less is NP-complete. We also show that, empirically, a greedy algorithm for finding minimal feature specifications will sometimes fail, and thus cannot be assumed to be the basis for human performance in solving the problem.","pages":"542--547","doi":"10.18653\/v1\/N18-2086","url":"https:\/\/www.aclweb.org\/anthology\/N18-2086","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2087","title":"Unsupervised Disambiguation of Syncretism in Inflected Lexicons","authors":["Cotterell, Ryan","Kirov, Christo","Mielke, Sebastian J.","Eisner, Jason"],"emails":["","","",""],"author_id":["ryan-cotterell","christo-kirov","sebastian-j-mielke","jason-eisner"],"abstract":"Lexical ambiguity makes it difficult to compute useful statistics of a corpus. A given word form might represent any of several morphological feature bundles. One can, however, use unsupervised learning (as in EM) to fit a model that probabilistically disambiguates word forms. We present such an approach, which employs a neural network to smoothly model a prior distribution over feature bundles (even rare ones). Although this basic model does not consider a token{'}s context, that very property allows it to operate on a simple list of unigram type counts, partitioning each count among different analyses of that unigram. We discuss evaluation metrics for this novel task and report results on 5 languages.","pages":"548--553","doi":"10.18653\/v1\/N18-2087","url":"https:\/\/www.aclweb.org\/anthology\/N18-2087","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2088","title":"Contextualized Word Representations for Reading Comprehension","authors":["Salant, Shimi","Berant, Jonathan"],"emails":["shimi.salant@cs.tau.ac.il","joberant@cs.tau.ac.il"],"author_id":["shimi-salant","jonathan-berant"],"abstract":"Reading a document and extracting an answer to a question about its content has attracted substantial attention recently. While most work has focused on the interaction between the question and the document, in this work we evaluate the importance of context when the question and document are processed independently. We take a standard neural architecture for this task, and show that by providing rich contextualized word representations from a large pre-trained language model as well as allowing the model to choose between context-dependent and context-independent word representations, we can obtain dramatic improvements and reach performance comparable to state-of-the-art on the competitive SQuAD dataset.","pages":"554--559","doi":"10.18653\/v1\/N18-2088","url":"https:\/\/www.aclweb.org\/anthology\/N18-2088","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2089","title":"Crowdsourcing Question-Answer Meaning Representations","authors":["Michael, Julian","Stanovsky, Gabriel","He, Luheng","Dagan, Ido","Zettlemoyer, Luke"],"emails":["julianjm@cs.washington.edu","gabriel.stanovsky@gmail.com","luheng@cs.washington.edu","dagan@cs.biu.ac.il","lsz@cs.washington.edu"],"author_id":["julian-michael","gabriel-stanovsky","luheng-he","ido-dagan","luke-zettlemoyer"],"abstract":"We introduce Question-Answer Meaning Representations (QAMRs), which represent the predicate-argument structure of a sentence as a set of question-answer pairs. We develop a crowdsourcing scheme to show that QAMRs can be labeled with very little training, and gather a dataset with over 5,000 sentences and 100,000 questions. A qualitative analysis demonstrates that the crowd-generated question-answer pairs cover the vast majority of predicate-argument relationships in existing datasets (including PropBank, NomBank, and QA-SRL) along with many previously under-resourced ones, including implicit arguments and relations. We also report baseline models for question generation and answering, and summarize a recent approach for using QAMR labels to improve an Open IE system. These results suggest the freely available QAMR data and annotation scheme should support significant future work.","pages":"560--568","doi":"10.18653\/v1\/N18-2089","url":"https:\/\/www.aclweb.org\/anthology\/N18-2089","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2090","title":"Leveraging Context Information for Natural Question Generation","authors":["Song, Linfeng","Wang, Zhiguo","Hamza, Wael","Zhang, Yue","Gildea, Daniel"],"emails":["","","","",""],"author_id":["linfeng-song","zhiguo-wang","wael-hamza","yue-zhang","daniel-gildea"],"abstract":"The task of natural question generation is to generate a corresponding question given the input passage (fact) and answer. It is useful for enlarging the training set of QA systems. Previous work has adopted sequence-to-sequence models that take a passage with an additional bit to indicate answer position as input. However, they do not explicitly model the information between answer and other context within the passage. We propose a model that matches the answer with the passage before generating the question. Experiments show that our model outperforms the existing state of the art using rich features.","pages":"569--574","doi":"10.18653\/v1\/N18-2090","url":"https:\/\/www.aclweb.org\/anthology\/N18-2090","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2091","title":"Robust Machine Comprehension Models via Adversarial Training","authors":["Wang, Yicheng","Bansal, Mohit"],"emails":["yicheng@cs.unc.edu","mbansal@cs.unc.edu"],"author_id":["yicheng-wang","mohit-bansal"],"abstract":"It is shown that many published models for the Stanford Question Answering Dataset (Rajpurkar et al., 2016) lack robustness, suffering an over 50{\\%} decrease in F1 score during adversarial evaluation based on the AddSent (Jia and Liang, 2017) algorithm. It has also been shown that retraining models on data generated by AddSent has limited effect on their robustness. We propose a novel alternative adversary-generation algorithm, AddSentDiverse, that significantly increases the variance within the adversarial training data by providing effective examples that punish the model for making certain superficial assumptions. Further, in order to improve robustness to AddSent{'}s semantic perturbations (e.g., antonyms), we jointly improve the model{'}s semantic-relationship learning capabilities in addition to our AddSentDiverse-based adversarial training data augmentation. With these additions, we show that we can make a state-of-the-art model significantly more robust, achieving a 36.5{\\%} increase in F1 score under many different types of adversarial evaluation while maintaining performance on the regular SQuAD task.","pages":"575--581","doi":"10.18653\/v1\/N18-2091","url":"https:\/\/www.aclweb.org\/anthology\/N18-2091","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2092","title":"Simple and Effective Semi-Supervised Question Answering","authors":["Dhingra, Bhuwan","Danish, Danish","Rajagopal, Dheeraj"],"emails":["bdhingra@cs.cmu.edu","ddanish@cs.cmu.edu","dheeraj@cs.cmu.edu"],"author_id":["bhuwan-dhingra","danish-danish","dheeraj-rajagopal"],"abstract":"Recent success of deep learning models for the task of extractive Question Answering (QA) is hinged on the availability of large annotated corpora. However, large domain specific annotated corpora are limited and expensive to construct. In this work, we envision a system where the end user specifies a set of base documents and only a few labelled examples. Our system exploits the document structure to create cloze-style questions from these base documents; pre-trains a powerful neural network on the cloze style questions; and further fine-tunes the model on the labeled examples. We evaluate our proposed system across three diverse datasets from different domains, and find it to be highly effective with very little labeled data. We attain more than 50{\\%} F1 score on SQuAD and TriviaQA with less than a thousand labelled examples. We are also releasing a set of 3.2M cloze-style questions for practitioners to use while building QA systems.","pages":"582--587","doi":"10.18653\/v1\/N18-2092","url":"https:\/\/www.aclweb.org\/anthology\/N18-2092","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2093","title":"{T}ype{SQL}: Knowledge-Based Type-Aware Neural Text-to-{SQL} Generation","authors":["Yu, Tao","Li, Zifan","Zhang, Zilin","Zhang, Rui","Radev, Dragomir"],"emails":["tao.yu@yale.edu","zifan.li@yale.edu","zilin.zhang@yale.edu","r.zhang@yale.edu","dragomir.radev@yale.edu"],"author_id":["tao-yu","zifan-li","zilin-zhang","rui-zhang","dragomir-radev"],"abstract":"Interacting with relational databases through natural language helps users with any background easily query and analyze a vast amount of data. This requires a system that understands users{'} questions and converts them to SQL queries automatically. In this paper, we present a novel approach TypeSQL which formats the problem as a slot filling task in a more reasonable way. In addition, TypeSQL utilizes type information to better understand rare entities and numbers in the questions. We experiment this idea on the WikiSQL dataset and outperform the prior art by 6{\\%} in much shorter time. We also show that accessing the content of databases can significantly improve the performance when users{'} queries are not well-formed. TypeSQL can reach 82.6{\\%} accuracy, a 17.5{\\%} absolute improvement compared to the previous content-sensitive model.","pages":"588--594","doi":"10.18653\/v1\/N18-2093","url":"https:\/\/www.aclweb.org\/anthology\/N18-2093","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2094","title":"Community Member Retrieval on Social Media Using Textual Information","authors":["Jaech, Aaron","Hathi, Shobhit","Ostendorf, Mari"],"emails":["","",""],"author_id":["aaron-jaech","shobhit-hathi","mari-ostendorf"],"abstract":"This paper addresses the problem of community membership detection using only text features in a scenario where a small number of positive labeled examples defines the community. The solution introduces an unsupervised proxy task for learning user embeddings: user re-identification. Experiments with 16 different communities show that the resulting embeddings are more effective for community membership identification than common unsupervised representations.","pages":"595--601","doi":"10.18653\/v1\/N18-2094","url":"https:\/\/www.aclweb.org\/anthology\/N18-2094","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2095","title":"Cross-Domain Review Helpfulness Prediction Based on Convolutional Neural Networks with Auxiliary Domain Discriminators","authors":["Chen, Cen","Yang, Yinfei","Zhou, Jun","Li, Xiaolong","Bao, Forrest Sheng"],"emails":["chencen.cc@antfin.com","yangyin7@gmail.com","jun.zhoujun@antfin.com","xl.li@antfin.com","forrest.bao@gmail.com"],"author_id":["cen-chen","yinfei-yang","jun-zhou","xiaolong-li","forrest-bao"],"abstract":"With the growing amount of reviews in e-commerce websites, it is critical to assess the helpfulness of reviews and recommend them accordingly to consumers. Recent studies on review helpfulness require plenty of labeled samples for each domain\/category of interests. However, such an approach based on close-world assumption is not always practical, especially for domains with limited reviews or the {``}out-of-vocabulary{''} problem. Therefore, we propose a convolutional neural network (CNN) based model which leverages both word-level and character-based representations. To transfer knowledge between domains, we further extend our model to jointly model different domains with auxiliary domain discriminators. On the Amazon product review dataset, our approach significantly outperforms the state of the art in terms of both accuracy and cross-domain robustness.","pages":"602--607","doi":"10.18653\/v1\/N18-2095","url":"https:\/\/www.aclweb.org\/anthology\/N18-2095","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2096","title":"Predicting Foreign Language Usage from {E}nglish-Only Social Media Posts","authors":["Volkova, Svitlana","Ranshous, Stephen","Phillips, Lawrence"],"emails":["svitlana.volkova@pnnl.gov","stephen.ranshous@pnnl.gov","lawrence.phillips@pnnl.gov"],"author_id":["svitlana-volkova","stephen-ranshous","lawrence-phillips"],"abstract":"Social media is known for its multi-cultural and multilingual interactions, a natural product of which is code-mixing. Multilingual speakers mix languages they tweet to address a different audience, express certain feelings, or attract attention. This paper presents a large-scale analysis of 6 million tweets produced by 27 thousand multilingual users speaking 12 other languages besides English. We rely on this corpus to build predictive models to infer non-English languages that users speak exclusively from their English tweets. Unlike native language identification task, we rely on large amounts of informal social media communications rather than ESL essays. We contrast the predictive power of the state-of-the-art machine learning models trained on lexical, syntactic, and stylistic signals with neural network models learned from word, character and byte representations extracted from English only tweets. We report that content, style and syntax are the most predictive of non-English languages that users speak on Twitter. Neural network models learned from byte representations of user content combined with transfer learning yield the best performance. Finally, by analyzing cross-lingual transfer {--} the influence of non-English languages on various levels of linguistic performance in English, we present novel findings on stylistic and syntactic variations across speakers of 12 languages in social media.","pages":"608--614","doi":"10.18653\/v1\/N18-2096","url":"https:\/\/www.aclweb.org\/anthology\/N18-2096","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2097","title":"A Discourse-Aware Attention Model for Abstractive Summarization of Long Documents","authors":["Cohan, Arman","Dernoncourt, Franck","Kim, Doo Soon","Bui, Trung","Kim, Seokhwan","Chang, Walter","Goharian, Nazli"],"emails":["arman@ir.cs.georgetown.edu","dernonco@adobe.com","dkim@adobe.com","bui@adobe.com","seokim@adobe.com","wachang@adobe.com","nazli@ir.cs.georgetown.edu"],"author_id":["arman-cohan","franck-dernoncourt","doo-soon-kim","trung-bui","seokhwan-kim","walter-chang","nazli-goharian"],"abstract":"Neural abstractive summarization models have led to promising results in summarizing relatively short documents. We propose the first model for abstractive summarization of single, longer-form documents (e.g., research papers). Our approach consists of a new hierarchical encoder that models the discourse structure of a document, and an attentive discourse-aware decoder to generate the summary. Empirical results on two large-scale datasets of scientific papers show that our model significantly outperforms state-of-the-art models.","pages":"615--621","doi":"10.18653\/v1\/N18-2097","url":"https:\/\/www.aclweb.org\/anthology\/N18-2097","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2098","title":"A Mixed Hierarchical Attention Based Encoder-Decoder Approach for Standard Table Summarization","authors":["Jain, Parag","Laha, Anirban","Sankaranarayanan, Karthik","Nema, Preksha","Khapra, Mitesh M.","Shetty, Shreyas"],"emails":["pajain34@in.ibm.com","anirlaha@in.ibm.com","kartsank@in.ibm.com","preksha@cse.iitm.ac.in","miteshk@cse.iitm.ac.in","shshett@cse.iitm.ac.in"],"author_id":["parag-jain","anirban-laha","karthik-sankaranarayanan","preksha-nema","mitesh-m-khapra","shreyas-shetty"],"abstract":"Structured data summarization involves generation of natural language summaries from structured input data. In this work, we consider summarizing structured data occurring in the form of tables as they are prevalent across a wide variety of domains. We formulate the standard table summarization problem, which deals with tables conforming to a single predefined schema. To this end, we propose a mixed hierarchical attention based encoder-decoder model which is able to leverage the structure in addition to the content of the tables. Our experiments on the publicly available weathergov dataset show around 18 BLEU (around 30{\\%}) improvement over the current state-of-the-art.","pages":"622--627","doi":"10.18653\/v1\/N18-2098","url":"https:\/\/www.aclweb.org\/anthology\/N18-2098","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2099","title":"Effective Crowdsourcing for a New Type of Summarization Task","authors":["Jiang, Youxuan","Finegan-Dollak, Catherine","Kummerfeld, Jonathan K.","Lasecki, Walter"],"emails":["lyjiang@umich.edu","cfdollak@umich.edu","jkummerf@umich.edu","wlasecki@umich.edu"],"author_id":["youxuan-jiang","catherine-finegan-dollak","jonathan-k-kummerfeld","walter-lasecki"],"abstract":"Most summarization research focuses on summarizing the entire given text, but in practice readers are often interested in only one aspect of the document or conversation. We propose targeted summarization as an umbrella category for summarization tasks that intentionally consider only parts of the input data. This covers query-based summarization, update summarization, and a new task we propose where the goal is to summarize a particular aspect of a document. However, collecting data for this new task is hard because directly asking annotators (e.g., crowd workers) to write summaries leads to data with low accuracy when there are a large number of facts to include. We introduce a novel crowdsourcing workflow, Pin-Refine, that allows us to collect high-quality summaries for our task, a necessary step for the development of automatic systems.","pages":"628--633","doi":"10.18653\/v1\/N18-2099","url":"https:\/\/www.aclweb.org\/anthology\/N18-2099","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2100","title":"{K}ey2{V}ec: Automatic Ranked Keyphrase Extraction from Scientific Articles using Phrase Embeddings","authors":["Mahata, Debanjan","Kuriakose, John","Shah, Rajiv Ratn","Zimmermann, Roger"],"emails":["dmahata@bloomberg.net","uriakose@infosys.com","rajivratn@iiitd.ac.in","rogerz@comp.nus.edu.sg"],"author_id":["debanjan-mahata","john-kuriakose","rajiv-shah","roger-zimmermann"],"abstract":"Keyphrase extraction is a fundamental task in natural language processing that facilitates mapping of documents to a set of representative phrases. In this paper, we present an unsupervised technique (Key2Vec) that leverages phrase embeddings for ranking keyphrases extracted from scientific articles. Specifically, we propose an effective way of processing text documents for training multi-word phrase embeddings that are used for thematic representation of scientific articles and ranking of keyphrases extracted from them using theme-weighted PageRank. Evaluations are performed on benchmark datasets producing state-of-the-art results.","pages":"634--639","doi":"10.18653\/v1\/N18-2100","url":"https:\/\/www.aclweb.org\/anthology\/N18-2100","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2101","title":"Learning to Generate {W}ikipedia Summaries for Underserved Languages from {W}ikidata","authors":["Kaffee, Lucie-Aim{\\'e}e","Elsahar, Hady","Vougiouklis, Pavlos","Gravier, Christophe","Laforest, Fr{\\'e}d{\\'e}rique","Hare, Jonathon","Simperl, Elena"],"emails":["kaffee@ecs.soton.ac.uk","hady.elsahar@univ-st-etienne.fr","pv1e13@ecs.soton.ac.uk","christophe.gravier@univ-st-etienne.fr","frederique.laforest@univ-st-etienne.fr","jsh2@ecs.soton.ac.uk","e.simperl@ecs.soton.ac.uk"],"author_id":["lucie-aimee-kaffee","hady-elsahar","pavlos-vougiouklis","christophe-gravier","frederique-laforest","jonathon-hare","elena-simperl"],"abstract":"While Wikipedia exists in 287 languages, its content is unevenly distributed among them. In this work, we investigate the generation of open domain Wikipedia summaries in underserved languages using structured data from Wikidata. To this end, we propose a neural network architecture equipped with copy actions that learns to generate single-sentence and comprehensible textual summaries from Wikidata triples. We demonstrate the effectiveness of the proposed approach by evaluating it against a set of baselines on two languages of different natures: Arabic, a morphological rich language with a larger vocabulary than English, and Esperanto, a constructed language known for its easy acquisition.","pages":"640--645","doi":"10.18653\/v1\/N18-2101","url":"https:\/\/www.aclweb.org\/anthology\/N18-2101","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2102","title":"Multi-Reward Reinforced Summarization with Saliency and Entailment","authors":["Pasunuru, Ramakanth","Bansal, Mohit"],"emails":["ram@cs.unc.edu","mbansal@cs.unc.edu"],"author_id":["ramakanth-pasunuru","mohit-bansal"],"abstract":"Abstractive text summarization is the task of compressing and rewriting a long document into a short summary while maintaining saliency, directed logical entailment, and non-redundancy. In this work, we address these three important aspects of a good summary via a reinforcement learning approach with two novel reward functions: ROUGESal and Entail, on top of a coverage-based baseline. The ROUGESal reward modifies the ROUGE metric by up-weighting the salient phrases\/words detected via a keyphrase classifier. The Entail reward gives high (length-normalized) scores to logically-entailed summaries using an entailment classifier. Further, we show superior performance improvement when these rewards are combined with traditional metric (ROUGE) based rewards, via our novel and effective multi-reward approach of optimizing multiple rewards simultaneously in alternate mini-batches. Our method achieves the new state-of-the-art results on CNN\/Daily Mail dataset as well as strong improvements in a test-only transfer setup on DUC-2002.","pages":"646--653","doi":"10.18653\/v1\/N18-2102","url":"https:\/\/www.aclweb.org\/anthology\/N18-2102","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2103","title":"Objective Function Learning to Match Human Judgements for Optimization-Based Summarization","authors":["Peyrard, Maxime","Gurevych, Iryna"],"emails":["",""],"author_id":["maxime-peyrard","iryna-gurevych"],"abstract":"Supervised summarization systems usually rely on supervision at the sentence or n-gram level provided by automatic metrics like ROUGE, which act as noisy proxies for human judgments. In this work, we learn a summary-level scoring function $\\theta$ including human judgments as supervision and automatically generated data as regularization. We extract summaries with a genetic algorithm using $\\theta$ as a fitness function. We observe strong and promising performances across datasets in both automatic and manual evaluation.","pages":"654--660","doi":"10.18653\/v1\/N18-2103","url":"https:\/\/www.aclweb.org\/anthology\/N18-2103","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2104","title":"Pruning Basic Elements for Better Automatic Evaluation of Summaries","authors":["Honda, Ukyo","Hirao, Tsutomu","Nagata, Masaaki"],"emails":["honda.ukyo.hn6@is.naist.jp","hirao.tsutomu@lab.ntt.co.jp","nagata.masaaki@lab.ntt.co.jp"],"author_id":["ukyo-honda","tsutomu-hirao","masaaki-nagata"],"abstract":"We propose a simple but highly effective automatic evaluation measure of summarization, pruned Basic Elements (pBE). Although the BE concept is widely used for the automated evaluation of summaries, its weakness is that it redundantly matches basic elements. To avoid this redundancy, pBE prunes basic elements by (1) disregarding frequency count of basic elements and (2) reducing semantically overlapped basic elements based on word similarity. Even though it is simple, pBE outperforms ROUGE in DUC datasets in most cases and achieves the highest rank correlation coefficient in TAC 2011 AESOP task.","pages":"661--666","doi":"10.18653\/v1\/N18-2104","url":"https:\/\/www.aclweb.org\/anthology\/N18-2104","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2105","title":"Unsupervised Keyphrase Extraction with Multipartite Graphs","authors":["Boudin, Florian"],"emails":["florian.boudin@univ-nantes.fr"],"author_id":["florian-boudin"],"abstract":"We propose an unsupervised keyphrase extraction model that encodes topical information within a multipartite graph structure. Our model represents keyphrase candidates and topics in a single graph and exploits their mutually reinforcing relationship to improve candidate ranking. We further introduce a novel mechanism to incorporate keyphrase selection preferences into the model. Experiments conducted on three widely used datasets show significant improvements over state-of-the-art graph-based models.","pages":"667--672","doi":"10.18653\/v1\/N18-2105","url":"https:\/\/www.aclweb.org\/anthology\/N18-2105","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2106","title":"Where Have {I} Heard This Story Before? Identifying Narrative Similarity in Movie Remakes","authors":["Chaturvedi, Snigdha","Srivastava, Shashank","Roth, Dan"],"emails":["snigdha@ucsc.edu","ssrivastava@cmu.edu","danroth@seas.upenn.edu"],"author_id":["snigdha-chaturvedi","shashank-srivastava","dan-roth"],"abstract":"People can identify correspondences between narratives in everyday life. For example, an analogy with the Cinderella story may be made in describing the unexpected success of an underdog in seemingly different stories. We present a new task and dataset for story understanding: identifying instances of similar narratives from a collection of narrative texts. We present an initial approach for this problem, which finds correspondences between narratives in terms of plot events, and resemblances between characters and their social relationships. Our approach yields an 8{\\%} absolute improvement in performance over a competitive information-retrieval baseline on a novel dataset of plot summaries of 577 movie remakes from Wikipedia.","pages":"673--678","doi":"10.18653\/v1\/N18-2106","url":"https:\/\/www.aclweb.org\/anthology\/N18-2106","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2107","title":"Multimodal Emoji Prediction","authors":["Barbieri, Francesco","Ballesteros, Miguel","Ronzano, Francesco","Saggion, Horacio"],"emails":["francesco.barbieri@ibm.com","miguel.ballesteros@ibm.com","","horacio.saggion@ibm.com"],"author_id":["francesco-barbieri","miguel-ballesteros","francesco-ronzano","horacio-saggion"],"abstract":"Emojis are small images that are commonly included in social media text messages. The combination of visual and textual content in the same message builds up a modern way of communication, that automatic systems are not used to deal with. In this paper we extend recent advances in emoji prediction by putting forward a multimodal approach that is able to predict emojis in Instagram posts. Instagram posts are composed of pictures together with texts which sometimes include emojis. We show that these emojis can be predicted by using the text, but also using the picture. Our main finding is that incorporating the two synergistic modalities, in a combined model, improves accuracy in an emoji prediction task. This result demonstrates that these two modalities (text and images) encode different information on the use of emojis and therefore can complement each other.","pages":"679--686","doi":"10.18653\/v1\/N18-2107","url":"https:\/\/www.aclweb.org\/anthology\/N18-2107","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2108","title":"Higher-Order Coreference Resolution with Coarse-to-Fine Inference","authors":["Lee, Kenton","He, Luheng","Zettlemoyer, Luke"],"emails":["kentonl@cs.washington.edu","luheng@cs.washington.edu","lsz@cs.washington.edu"],"author_id":["kenton-lee","luheng-he","luke-zettlemoyer"],"abstract":"We introduce a fully-differentiable approximation to higher-order inference for coreference resolution. Our approach uses the antecedent distribution from a span-ranking architecture as an attention mechanism to iteratively refine span representations. This enables the model to softly consider multiple hops in the predicted clusters. To alleviate the computational cost of this iterative process, we introduce a coarse-to-fine approach that incorporates a less accurate but more efficient bilinear factor, enabling more aggressive pruning without hurting accuracy. Compared to the existing state-of-the-art span-ranking approach, our model significantly improves accuracy on the English OntoNotes benchmark, while being far more computationally efficient.","pages":"687--692","doi":"10.18653\/v1\/N18-2108","url":"https:\/\/www.aclweb.org\/anthology\/N18-2108","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2109","title":"Non-Projective Dependency Parsing with Non-Local Transitions","authors":["Fern{\\'a}ndez-Gonz{\\'a}lez, Daniel","G{\\'o}mez-Rodr{\\'\\i}guez, Carlos"],"emails":["d.fgonzalez@udc.es","carlos.gomez@udc.es"],"author_id":["daniel-fernandez-gonzalez","carlos-gomez-rodriguez"],"abstract":"We present a novel transition system, based on the Covington non-projective parser, introducing non-local transitions that can directly create arcs involving nodes to the left of the current focus positions. This avoids the need for long sequences of No-Arcs transitions to create long-distance arcs, thus alleviating error propagation. The resulting parser outperforms the original version and achieves the best accuracy on the Stanford Dependencies conversion of the Penn Treebank among greedy transition-based parsers.","pages":"693--700","doi":"10.18653\/v1\/N18-2109","url":"https:\/\/www.aclweb.org\/anthology\/N18-2109","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2110","title":"Detecting Linguistic Characteristics of {A}lzheimer{'}s Dementia by Interpreting Neural Models","authors":["Karlekar, Sweta","Niu, Tong","Bansal, Mohit"],"emails":["swetakar@cs.unc.edu","tongn@cs.unc.edu","mbansal@cs.unc.edu"],"author_id":["sweta-karlekar","tong-niu","mohit-bansal"],"abstract":"Alzheimer{'}s disease (AD) is an irreversible and progressive brain disease that can be stopped or slowed down with medical treatment. Language changes serve as a sign that a patient{'}s cognitive functions have been impacted, potentially leading to early diagnosis. In this work, we use NLP techniques to classify and analyze the linguistic characteristics of AD patients using the DementiaBank dataset. We apply three neural models based on CNNs, LSTM-RNNs, and their combination, to distinguish between language samples from AD and control patients. We achieve a new independent benchmark accuracy for the AD classification task. More importantly, we next interpret what these neural models have learned about the linguistic characteristics of AD patients, via analysis based on activation clustering and first-derivative saliency techniques. We then perform novel automatic pattern discovery inside activation clusters, and consolidate AD patients{'} distinctive grammar patterns. Additionally, we show that first derivative saliency can not only rediscover previous language patterns of AD patients, but also shed light on the limitations of neural models. Lastly, we also include analysis of gender-separated AD data.","pages":"701--707","doi":"10.18653\/v1\/N18-2110","url":"https:\/\/www.aclweb.org\/anthology\/N18-2110","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2111","title":"Deep Dungeons and Dragons: Learning Character-Action Interactions from Role-Playing Game Transcripts","authors":["Louis, Annie","Sutton, Charles"],"emails":["alouis@inf.ed.ac.uk","sutton@inf.ed.ac.uk"],"author_id":["annie-louis","charles-sutton"],"abstract":"An essential aspect to understanding narratives is to grasp the interaction between characters in a story and the actions they take. We examine whether computational models can capture this interaction, when both character attributes and actions are expressed as complex natural language descriptions. We propose role-playing games as a testbed for this problem, and introduce a large corpus of game transcripts collected from online discussion forums. Using neural language models which combine character and action descriptions from these stories, we show that we can learn the latent ties. Action sequences are better predicted when the character performing the action is also taken into account, and vice versa for character attributes.","pages":"708--713","doi":"10.18653\/v1\/N18-2111","url":"https:\/\/www.aclweb.org\/anthology\/N18-2111","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2112","title":"Feudal Reinforcement Learning for Dialogue Management in Large Domains","authors":["Casanueva, I{\\~n}igo","Budzianowski, Pawe{\\l}","Su, Pei-Hao","Ultes, Stefan","Rojas-Barahona, Lina M.","Tseng, Bo-Hsiang","Ga{\\v{s}}i{\\'c}, Milica"],"emails":["ic340@cam.ac.uk","","","","","",""],"author_id":["inigo-casanueva","pawel-budzianowski","pei-hao-su","stefan-ultes","lina-m-rojas-barahona","bo-hsiang-tseng","milica-gasic"],"abstract":"Reinforcement learning (RL) is a promising approach to solve dialogue policy optimisation. Traditional RL algorithms, however, fail to scale to large domains due to the curse of dimensionality. We propose a novel Dialogue Management architecture, based on Feudal RL, which decomposes the decision into two steps; a first step where a master policy selects a subset of primitive actions, and a second step where a primitive action is chosen from the selected subset. The structural information included in the domain ontology is used to abstract the dialogue state space, taking the decisions at each step using different parts of the abstracted state. This, combined with an information sharing mechanism between slots, increases the scalability to large domains. We show that an implementation of this approach, based on Deep-Q Networks, significantly outperforms previous state of the art in several dialogue domains and environments, without the need of any additional reward signal.","pages":"714--719","doi":"10.18653\/v1\/N18-2112","url":"https:\/\/www.aclweb.org\/anthology\/N18-2112","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2113","title":"Evaluating Historical Text Normalization Systems: How Well Do They Generalize?","authors":["Robertson, Alexander","Goldwater, Sharon"],"emails":["alexander.robertson@ed.ac.uk","sgwater@inf.ed.ac.uk"],"author_id":["alexander-robertson","sharon-goldwater"],"abstract":"We highlight several issues in the evaluation of historical text normalization systems that make it hard to tell how well these systems would actually work in practice{---}i.e., for new datasets or languages; in comparison to more na{\\\"\\i}ve systems; or as a preprocessing step for downstream NLP tools. We illustrate these issues and exemplify our proposed evaluation practices by comparing two neural models against a na{\\\"\\i}ve baseline system. We show that the neural models generalize well to unseen words in tests on five languages; nevertheless, they provide no clear benefit over the na{\\\"\\i}ve baseline for downstream POS tagging of an English historical collection. We conclude that future work should include more rigorous evaluation, including both intrinsic and extrinsic measures where possible.","pages":"720--725","doi":"10.18653\/v1\/N18-2113","url":"https:\/\/www.aclweb.org\/anthology\/N18-2113","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2114","title":"Gated Multi-Task Network for Text Classification","authors":["Xiao, Liqiang","Zhang, Honglun","Chen, Wenqing"],"emails":["xiaoliqiang@sjtu.edu.cn","zhanghonglun@sjtu.edu.cn","wenqingchen@sjtu.edu.cn"],"author_id":["liqiang-xiao","honglun-zhang","wenqing-chen"],"abstract":"Multi-task learning with Convolutional Neural Network (CNN) has shown great success in many Natural Language Processing (NLP) tasks. This success can be largely attributed to the feature sharing by fusing some layers among tasks. However, most existing approaches just fully or proportionally share the features without distinguishing the helpfulness of them. By that the network would be confused by the helpless even harmful features, generating undesired interference between tasks. In this paper, we introduce gate mechanism into multi-task CNN and propose a new Gated Sharing Unit, which can filter the feature flows between tasks and greatly reduce the interference. Experiments on 9 text classification datasets shows that our approach can learn selection rules automatically and gain a great improvement over strong baselines.","pages":"726--731","doi":"10.18653\/v1\/N18-2114","url":"https:\/\/www.aclweb.org\/anthology\/N18-2114","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2115","title":"Natural Language to Structured Query Generation via Meta-Learning","authors":["Huang, Po-Sen","Wang, Chenglong","Singh, Rishabh","Yih, Wen-tau","He, Xiaodong"],"emails":["pshuang@microsoft.com","clwang@cs.washington.edu","rishabh.iit@gmail.com","scottyih@allenai.org","xiaodong.he@jd.com"],"author_id":["po-sen-huang","chenglong-wang","rishabh-singh","wen-tau-yih","xiaodong-he"],"abstract":"In conventional supervised training, a model is trained to fit all the training examples. However, having a monolithic model may not always be the best strategy, as examples could vary widely. In this work, we explore a different learning protocol that treats each example as a unique pseudo-task, by reducing the original learning problem to a few-shot meta-learning scenario with the help of a domain-dependent relevance function. When evaluated on the WikiSQL dataset, our approach leads to faster convergence and achieves 1.1{\\%}{--}5.4{\\%} absolute accuracy gains over the non-meta-learning counterparts.","pages":"732--738","doi":"10.18653\/v1\/N18-2115","url":"https:\/\/www.aclweb.org\/anthology\/N18-2115","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2116","title":"Smaller Text Classifiers with Discriminative Cluster Embeddings","authors":["Chen, Mingda","Gimpel, Kevin"],"emails":["mchen@ttic.edu","kgimpel@ttic.edu"],"author_id":["mingda-chen","kevin-gimpel"],"abstract":"Word embedding parameters often dominate overall model sizes in neural methods for natural language processing. We reduce deployed model sizes of text classifiers by learning a hard word clustering in an end-to-end manner. We use the Gumbel-Softmax distribution to maximize over the latent clustering while minimizing the task loss. We propose variations that selectively assign additional parameters to words, which further improves accuracy while still remaining parameter-efficient.","pages":"739--745","doi":"10.18653\/v1\/N18-2116","url":"https:\/\/www.aclweb.org\/anthology\/N18-2116","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2117","title":"Role-specific Language Models for Processing Recorded Neuropsychological Exams","authors":["Al Hanai, Tuka","Au, Rhoda","Glass, James"],"emails":["tuka@mit.edu","rhodaau@bu.edu","glass@mit.edu"],"author_id":["tuka-al-hanai","rhoda-au","james-glass"],"abstract":"Neuropsychological examinations are an important screening tool for the presence of cognitive conditions (e.g. Alzheimer{'}s, Parkinson{'}s Disease), and require a trained tester to conduct the exam through spoken interactions with the subject. While audio is relatively easy to record, it remains a challenge to automatically diarize (who spoke when?), decode (what did they say?), and assess a subject{'}s cognitive health. This paper demonstrates a method to determine the cognitive health (impaired or not) of 92 subjects, from audio that was diarized using an automatic speech recognition system trained on TED talks and on the structured language used by testers and subjects. Using leave-one-out cross validation and logistic regression modeling we show that even with noisily decoded data (81{\\%} WER) we can still perform accurate enough diarization (0.02{\\%} confusion rate) to determine the cognitive state of a subject (0.76 AUC).","pages":"746--752","doi":"10.18653\/v1\/N18-2117","url":"https:\/\/www.aclweb.org\/anthology\/N18-2117","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2118","title":"Slot-Gated Modeling for Joint Slot Filling and Intent Prediction","authors":["Goo, Chih-Wen","Gao, Guang","Hsu, Yun-Kai","Huo, Chih-Li","Chen, Tsung-Chieh","Hsu, Keng-Wei","Chen, Yun-Nung"],"emails":["r05944049@ntu.edu.tw","","","","y.v.chen@ieee.org","",""],"author_id":["chih-wen-goo","guang-gao","yun-kai-hsu","chih-li-huo","tsung-chieh-chen","keng-wei-hsu","yun-nung-chen"],"abstract":"Attention-based recurrent neural network models for joint intent detection and slot filling have achieved the state-of-the-art performance, while they have independent attention weights. Considering that slot and intent have the strong relationship, this paper proposes a slot gate that focuses on learning the relationship between intent and slot attention vectors in order to obtain better semantic frame results by the global optimization. The experiments show that our proposed model significantly improves sentence-level semantic frame accuracy with 4.2{\\%} and 1.9{\\%} relative improvement compared to the attentional model on benchmark ATIS and Snips datasets respectively","pages":"753--757","doi":"10.18653\/v1\/N18-2118","url":"https:\/\/www.aclweb.org\/anthology\/N18-2118","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2119","title":"An Evaluation of Image-Based Verb Prediction Models against Human Eye-Tracking Data","authors":["Gella, Spandana","Keller, Frank"],"emails":["spandana.gella@ed.ac.uk","keller@inf.ed.ac.uk"],"author_id":["spandana-gella","frank-keller"],"abstract":"Recent research in language and vision has developed models for predicting and disambiguating verbs from images. Here, we ask whether the predictions made by such models correspond to human intuitions about visual verbs. We show that the image regions a verb prediction model identifies as salient for a given verb correlate with the regions fixated by human observers performing a verb classification task.","pages":"758--763","doi":"10.18653\/v1\/N18-2119","url":"https:\/\/www.aclweb.org\/anthology\/N18-2119","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2120","title":"Learning to Color from Language","authors":["Manjunatha, Varun","Iyyer, Mohit","Boyd-Graber, Jordan","Davis, Larry"],"emails":["","miyyer@cs.umass.edu","",""],"author_id":["varun-manjunatha","mohit-iyyer","jordan-boyd-graber","larry-davis"],"abstract":"Automatic colorization is the process of adding color to greyscale images. We condition this process on language, allowing end users to manipulate a colorized image by feeding in different captions. We present two different architectures for language-conditioned colorization, both of which produce more accurate and plausible colorizations than a language-agnostic version. Furthermore, we demonstrate through crowdsourced experiments that we can dramatically alter colorizations simply by manipulating descriptive color words in captions.","pages":"764--769","doi":"10.18653\/v1\/N18-2120","url":"https:\/\/www.aclweb.org\/anthology\/N18-2120","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2121","title":"Punny Captions: Witty Wordplay in Image Descriptions","authors":["Chandrasekaran, Arjun","Parikh, Devi","Bansal, Mohit"],"emails":["carjun@gatech.edu","parikh@gatech.edu","mbansal@cs.unc.edu"],"author_id":["arjun-chandrasekaran","devi-parikh","mohit-bansal"],"abstract":"Wit is a form of rich interaction that is often grounded in a specific situation (e.g., a comment in response to an event). In this work, we attempt to build computational models that can produce witty descriptions for a given image. Inspired by a cognitive account of humor appreciation, we employ linguistic wordplay, specifically puns, in image descriptions. We develop two approaches which involve retrieving witty descriptions for a given image from a large corpus of sentences, or generating them via an encoder-decoder neural network architecture. We compare our approach against meaningful baseline approaches via human studies and show substantial improvements. Moreover, in a Turing test style evaluation, people find the image descriptions generated by our model to be slightly wittier than human-written witty descriptions when the human is subject to similar constraints as the model regarding word usage and style.","pages":"770--775","doi":"10.18653\/v1\/N18-2121","url":"https:\/\/www.aclweb.org\/anthology\/N18-2121","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2122","title":"The Emergence of Semantics in Neural Network Representations of Visual Information","authors":["Dharmaretnam, Dhanush","Fyshe, Alona"],"emails":["dhanushd@uvic.ca","afyshe@uvic.ca"],"author_id":["dhanush-dharmaretnam","alona-fyshe"],"abstract":"Word vector models learn about semantics through corpora. Convolutional Neural Networks (CNNs) can learn about semantics through images. At the most abstract level, some of the information in these models must be shared, as they model the same real-world phenomena. Here we employ techniques previously used to detect semantic representations in the human brain to detect semantic representations in CNNs. We show the accumulation of semantic information in the layers of the CNN, and discover that, for misclassified images, the correct class can be recovered in intermediate layers of a CNN.","pages":"776--780","doi":"10.18653\/v1\/N18-2122","url":"https:\/\/www.aclweb.org\/anthology\/N18-2122","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2123","title":"Visual Referring Expression Recognition: What Do Systems Actually Learn?","authors":["Cirik, Volkan","Morency, Louis-Philippe","Berg-Kirkpatrick, Taylor"],"emails":["vcirik@cs.cmu.edu","morency@cs.cmu.edu","tberg@cs.cmu.edu"],"author_id":["volkan-cirik","louis-philippe-morency","taylor-berg-kirkpatrick"],"abstract":"We present an empirical analysis of state-of-the-art systems for referring expression recognition {--} the task of identifying the object in an image referred to by a natural language expression {--} with the goal of gaining insight into how these systems reason about language and vision. Surprisingly, we find strong evidence that even sophisticated and linguistically-motivated models for this task may ignore linguistic structure, instead relying on shallow correlations introduced by unintended biases in the data selection and annotation process. For example, we show that a system trained and tested on the input image without the input referring expression can achieve a precision of 71.2{\\%} in top-2 predictions. Furthermore, a system that predicts only the object category given the input can achieve a precision of 84.2{\\%} in top-2 predictions. These surprisingly positive results for what should be deficient prediction scenarios suggest that careful analysis of what our models are learning {--} and further, how our data is constructed {--} is critical as we seek to make substantive progress on grounded language tasks.","pages":"781--787","doi":"10.18653\/v1\/N18-2123","url":"https:\/\/www.aclweb.org\/anthology\/N18-2123","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2124","title":"Visually Guided Spatial Relation Extraction from Text","authors":["Rahgooy, Taher","Manzoor, Umar","Kordjamshidi, Parisa"],"emails":["trahgooy@tulane.edu","umanzoor@tulane.edu","pkordjam@tulane.edu"],"author_id":["taher-rahgooy","umar-manzoor","parisa-kordjamshidi"],"abstract":"Extraction of spatial relations from sentences with complex\/nesting relationships is very challenging as often needs resolving inherent semantic ambiguities. We seek help from visual modality to fill the information gap in the text modality and resolve spatial semantic ambiguities. We use various recent vision and language datasets and techniques to train inter-modality alignment models, visual relationship classifiers and propose a novel global inference model to integrate these components into our structured output prediction model for spatial role and relation extraction. Our global inference model enables us to utilize the visual and geometric relationships between objects and improves the state-of-art results of spatial information extraction from text.","pages":"788--794","doi":"10.18653\/v1\/N18-2124","url":"https:\/\/www.aclweb.org\/anthology\/N18-2124","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"},{"id":"N18-2125","title":"Watch, Listen, and Describe: Globally and Locally Aligned Cross-Modal Attentions for Video Captioning","authors":["Wang, Xin","Wang, Yuan-Fang","Wang, William Yang"],"emails":["xwang@cs.ucsb.edu","yfwang@cs.ucsb.edu","william@cs.ucsb.edu"],"author_id":["xin-wang","yuan-fang-wang","william-yang-wang"],"abstract":"A major challenge for video captioning is to combine audio and visual cues. Existing multi-modal fusion methods have shown encouraging results in video understanding. However, the temporal structures of multiple modalities at different granularities are rarely explored, and how to selectively fuse the multi-modal representations at different levels of details remains uncharted. In this paper, we propose a novel hierarchically aligned cross-modal attention (HACA) framework to learn and selectively fuse both global and local temporal dynamics of different modalities. Furthermore, for the first time, we validate the superior performance of the deep audio features on the video captioning task. Finally, our HACA model significantly outperforms the previous best systems and achieves new state-of-the-art results on the widely used MSR-VTT dataset.","pages":"795--801","doi":"10.18653\/v1\/N18-2125","url":"https:\/\/www.aclweb.org\/anthology\/N18-2125","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana","year":"2018","month":"June","booktitle":"Proceedings of the 2018 Conference of the North {A}merican Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers)"}]