[{"id":"N19-4001","title":"Abbreviation Explorer - an interactive system for pre-evaluation of Unsupervised Abbreviation Disambiguation","authors":["Ciosici, Manuel","Assent, Ira"],"emails":["manuel@cs.au.dk","ira@cs.au.dk"],"author_id":["manuel-ciosici","ira-assent"],"abstract":"We present Abbreviation Explorer, a system that supports interactive exploration of abbreviations that are challenging for Unsupervised Abbreviation Disambiguation (UAD). Abbreviation Explorer helps to identify long-forms that are easily confused, and to pinpoint likely causes such as limitations of normalization, language switching, or inconsistent typing. It can also support determining which long-forms would benefit from additional input text for unsupervised abbreviation disambiguation. The system provides options for creating corrective rules that merge redundant long-forms with identical meaning. The identified rules can be easily applied to the already existing vector spaces used by UAD to improve disambiguation performance, while also avoiding the cost of retraining.","pages":"1--5","doi":"10.18653\/v1\/N19-4001","url":"https:\/\/www.aclweb.org\/anthology\/N19-4001","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4002","title":"{ADIDA}: Automatic Dialect Identification for {A}rabic","authors":["Obeid, Ossama","Salameh, Mohammad","Bouamor, Houda","Habash, Nizar"],"emails":["oobeid@nyu.edu","msalameh@cmu.edu","hbouamor@cmu.edu","nizar.habash@nyu.edu"],"author_id":["ossama-obeid","mohammad-salameh","houda-bouamor","nizar-habash"],"abstract":"This demo paper describes ADIDA, a web-based system for automatic dialect identification for Arabic text. The system distinguishes among the dialects of 25 Arab cities (from Rabat to Muscat) in addition to Modern Standard Arabic. The results are presented with either a point map or a heat map visualizing the automatic identification probabilities over a geographical map of the Arab World.","pages":"6--11","doi":"10.18653\/v1\/N19-4002","url":"https:\/\/www.aclweb.org\/anthology\/N19-4002","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4003","title":"Enabling Search and Collaborative Assembly of Causal Interactions Extracted from Multilingual and Multi-domain Free Text","authors":["Barbosa, George C. G.","Wong, Zechy","Hahn-Powell, Gus","Bell, Dane","Sharp, Rebecca","Valenzuela-Esc{\\'a}rcega, Marco A.","Surdeanu, Mihai"],"emails":["gcgbarbosa@email.arizona.edu","zechy@email.arizona.edu","ghp@lum.ai","dane@lum.ai","bsharp@email.arizona.edu","marcov@email.arizona.edu","msurdeanu@email.arizona.edu"],"author_id":["george-c-g-barbosa","zechy-wong","gus-hahn-powell","dane-bell","rebecca-sharp","marco-a-valenzuela-escarcega","mihai-surdeanu"],"abstract":"Many of the most pressing current research problems (e.g., public health, food security, or climate change) require multi-disciplinary collaborations. In order to facilitate this process, we propose a system that incorporates multi-domain extractions of causal interactions into a single searchable knowledge graph. Our system enables users to search iteratively over direct and indirect connections in this knowledge graph, and collaboratively build causal models in real time. To enable the aggregation of causal information from multiple languages, we extend an open-domain machine reader to Portuguese. The new Portuguese reader extracts over 600 thousand causal statements from 120 thousand Portuguese publications with a precision of 62{\\%}, which demonstrates the value of mining multilingual scientific information.","pages":"12--17","doi":"10.18653\/v1\/N19-4003","url":"https:\/\/www.aclweb.org\/anthology\/N19-4003","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4004","title":"{INS}: An Interactive {C}hinese News Synthesis System","authors":["Liu, Hui","Qin, Wentao","Wan, Xiaojun"],"emails":["xinkeliuhui@pku.edu.cn","qinwentao@pku.edu.cn","wanxiaojun@pku.edu.cn"],"author_id":["hui-liu","wentao-qin","xiaojun-wan"],"abstract":"Nowadays, we are surrounded by more and more online news articles. Tens or hundreds of news articles need to be read if we wish to explore a hot news event or topic. So it is of vital importance to automatically synthesize a batch of news articles related to the event or topic into a new synthesis article (or overview article) for reader{'}s convenience. It is so challenging to make news synthesis fully automatic that there is no successful solution by now. In this paper, we put forward a novel Interactive News Synthesis system (i.e. INS), which can help generate news overview articles automatically or by interacting with users. More importantly, INS can serve as a tool for editors to help them finish their jobs. In our experiments, INS performs well on both topic representation and synthesis article generation. A user study also demonstrates the usefulness and users{'} satisfaction with the INS tool. A demo video is available at \\url{https:\/\/youtu.be\/7ItteKW3GEk}.","pages":"18--23","doi":"10.18653\/v1\/N19-4004","url":"https:\/\/www.aclweb.org\/anthology\/N19-4004","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4005","title":"Learning to Respond to Mixed-code Queries using Bilingual Word Embeddings","authors":["Ho, Chia-Fang","Chang, Jason","Chen, Jhih-Jie","Yang, Chingyu"],"emails":["fun@nlplab.cc","jjc@nlplab.cc","jason@nlplab.cc","chingyu@nlplab.cc"],"author_id":["chia-fang-ho","jason-s-chang","jhih-jie-chen","chingyu-yang"],"abstract":"We present a method for learning bilingual word embeddings in order to support second language (L2) learners in finding recurring phrases and example sentences that match mixed-code queries (e.g., {``}接 受 sentence{''}) composed of words in both target language and native language (L1). In our approach, mixed-code queries are transformed into target language queries aimed at maximizing the probability of retrieving relevant target language phrases and sentences. The method involves converting a given parallel corpus into mixed-code data, generating word embeddings from mixed-code data, and expanding queries in target languages based on bilingual word embeddings. We present a prototype search engine, x.Linggle, that applies the method to a linguistic search engine for a parallel corpus. Preliminary evaluation on a list of common word-translation shows that the method performs reasonablly well.","pages":"24--28","doi":"10.18653\/v1\/N19-4005","url":"https:\/\/www.aclweb.org\/anthology\/N19-4005","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4006","title":"Train, Sort, Explain: Learning to Diagnose Translation Models","authors":["Schwarzenberg, Robert","Harbecke, David","Macketanz, Vivien","Avramidis, Eleftherios","M{\\\"o}ller, Sebastian"],"emails":["robert.schwarzenberg@dfki.de","david.harbecke@dfki.de","vivien.macketanz@dfki.de","eleftherios.avramidis@dfki.de","sebastian.m{\\\"o}ller@dfki.de"],"author_id":["robert-schwarzenberg","david-harbecke","vivien-macketanz","eleftherios-avramidis","sebastian-moller"],"abstract":"Evaluating translation models is a trade-off between effort and detail. On the one end of the spectrum there are automatic count-based methods such as BLEU, on the other end linguistic evaluations by humans, which arguably are more informative but also require a disproportionately high effort. To narrow the spectrum, we propose a general approach on how to automatically expose systematic differences between human and machine translations to human experts. Inspired by adversarial settings, we train a neural text classifier to distinguish human from machine translations. A classifier that performs and generalizes well after training should recognize systematic differences between the two classes, which we uncover with neural explainability methods. Our proof-of-concept implementation, DiaMaT, is open source. Applied to a dataset translated by a state-of-the-art neural Transformer model, DiaMaT achieves a classification accuracy of 75{\\%} and exposes meaningful differences between humans and the Transformer, amidst the current discussion about human parity.","pages":"29--34","doi":"10.18653\/v1\/N19-4006","url":"https:\/\/www.aclweb.org\/anthology\/N19-4006","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4007","title":"compare-mt: A Tool for Holistic Comparison of Language Generation Systems","authors":["Neubig, Graham","Dou, Zi-Yi","Hu, Junjie","Michel, Paul","Pruthi, Danish","Wang, Xinyi"],"emails":["gneubig@cs.cmu.edu","","","","",""],"author_id":["graham-neubig","zi-yi-dou","junjie-hu","paul-michel","danish-pruthi","xinyi-wang"],"abstract":"In this paper, we describe compare-mt, a tool for holistic analysis and comparison of the results of systems for language generation tasks such as machine translation. The main goal of the tool is to give the user a high-level and coherent view of the salient differences between systems that can then be used to guide further analysis or system improvement. It implements a number of tools to do so, such as analysis of accuracy of generation of particular types of words, bucketed histograms of sentence accuracies or counts based on salient characteristics, and extraction of characteristic n-grams for each system. It also has a number of advanced features such as use of linguistic labels, source side data, or comparison of log likelihoods for probabilistic models, and also aims to be easily extensible by users to new types of analysis. compare-mt is a pure-Python open source package, that has already proven useful to generate analyses that have been used in our published papers. Demo Video: https:\/\/youtu.be\/NyJEQT7t2CA","pages":"35--41","doi":"10.18653\/v1\/N19-4007","url":"https:\/\/www.aclweb.org\/anthology\/N19-4007","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4008","title":"Eidos, {INDRA}, {\\&} Delphi: From Free Text to Executable Causal Models","authors":["Sharp, Rebecca","Pyarelal, Adarsh","Gyori, Benjamin","Alcock, Keith","Laparra, Egoitz","Valenzuela-Esc{\\'a}rcega, Marco A.","Nagesh, Ajay","Yadav, Vikas","Bachman, John","Tang, Zheng","Lent, Heather","Luo, Fan","Paul, Mithun","Bethard, Steven","Barnard, Kobus","Morrison, Clayton","Surdeanu, Mihai"],"emails":["bsharp@email.arizona.edu","adarsh@email.arizona.edu","","","","","","","","","","","","","","",""],"author_id":["rebecca-sharp","adarsh-pyarelal","benjamin-gyori","keith-alcock","egoitz-laparra","marco-a-valenzuela-escarcega","ajay-nagesh","vikas-yadav","john-bachman","zheng-tang","heather-lent","fan-luo","mithun-paul","steven-bethard","kobus-barnard","clayton-morrison","mihai-surdeanu"],"abstract":"Building causal models of complicated phenomena such as food insecurity is currently a slow and labor-intensive manual process. In this paper, we introduce an approach that builds executable probabilistic models from raw, free text. The proposed approach is implemented through three systems: Eidos, INDRA, and Delphi. Eidos is an open-domain machine reading system designed to extract causal relations from natural language. It is rule-based, allowing for rapid domain transfer, customizability, and interpretability. INDRA aggregates multiple sources of causal information and performs assembly to create a coherent knowledge base and assess its reliability. This assembled knowledge serves as the starting point for modeling. Delphi is a modeling framework that assembles quantified causal fragments and their contexts into executable probabilistic models that respect the semantics of the original text, and can be used to support decision making.","pages":"42--47","doi":"10.18653\/v1\/N19-4008","url":"https:\/\/www.aclweb.org\/anthology\/N19-4008","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4009","title":"fairseq: A Fast, Extensible Toolkit for Sequence Modeling","authors":["Ott, Myle","Edunov, Sergey","Baevski, Alexei","Fan, Angela","Gross, Sam","Ng, Nathan","Grangier, David","Auli, Michael"],"emails":["","","","","","","",""],"author_id":["myle-ott","sergey-edunov","alexei-baevski","angela-fan","sam-gross","nathan-ng","david-grangier","michael-auli"],"abstract":"fairseq is an open-source sequence modeling toolkit that allows researchers and developers to train custom models for translation, summarization, language modeling, and other text generation tasks. The toolkit is based on PyTorch and supports distributed training across multiple GPUs and machines. We also support fast mixed-precision training and inference on modern GPUs. A demo video can be found at https:\/\/www.youtube.com\/watch?v=OtgDdWtHvto","pages":"48--53","doi":"10.18653\/v1\/N19-4009","url":"https:\/\/www.aclweb.org\/anthology\/N19-4009","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4010","title":"{FLAIR}: An Easy-to-Use Framework for State-of-the-Art {NLP}","authors":["Akbik, Alan","Bergmann, Tanja","Blythe, Duncan","Rasul, Kashif","Schweter, Stefan","Vollgraf, Roland"],"emails":["","","","","",""],"author_id":["alan-akbik","tanja-bergmann","duncan-blythe","kashif-rasul","stefan-schweter","roland-vollgraf"],"abstract":"We present FLAIR, an NLP framework designed to facilitate training and distribution of state-of-the-art sequence labeling, text classification and language models. The core idea of the framework is to present a simple, unified interface for conceptually very different types of word and document embeddings. This effectively hides all embedding-specific engineering complexity and allows researchers to {``}mix and match{''} various embeddings with little effort. The framework also implements standard model training and hyperparameter selection routines, as well as a data fetching module that can download publicly available NLP datasets and convert them into data structures for quick set up of experiments. Finally, FLAIR also ships with a {``}model zoo{''} of pre-trained models to allow researchers to use state-of-the-art NLP models in their applications. This paper gives an overview of the framework and its functionality. The framework is available on GitHub at https:\/\/github.com\/zalandoresearch\/flair .","pages":"54--59","doi":"10.18653\/v1\/N19-4010","url":"https:\/\/www.aclweb.org\/anthology\/N19-4010","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4011","title":"{C}hat{E}val: A Tool for Chatbot Evaluation","authors":["Sedoc, Jo{\\~a}o","Ippolito, Daphne","Kirubarajan, Arun","Thirani, Jai","Ungar, Lyle","Callison-Burch, Chris"],"emails":["joao@seas.upenn.edu","daphnei@seas.upenn.edu","kiruba@seas.upenn.edu","jthirani@seas.upenn.edu","ungar@seas.upenn.edu","ccb@seas.upenn.edu"],"author_id":["joao-sedoc","daphne-ippolito","arun-kirubarajan","jai-thirani","lyle-ungar","chris-callison-burch"],"abstract":"Open-domain dialog systems (i.e. chatbots) are difficult to evaluate. The current best practice for analyzing and comparing these dialog systems is the use of human judgments. However, the lack of standardization in evaluation procedures, and the fact that model parameters and code are rarely published hinder systematic human evaluation experiments. We introduce a unified framework for human evaluation of chatbots that augments existing tools and provides a web-based hub for researchers to share and compare their dialog systems. Researchers can submit their trained models to the ChatEval web interface and obtain comparisons with baselines and prior work. The evaluation code is open-source to ensure standardization and transparency. In addition, we introduce open-source baseline models and evaluation datasets. ChatEval can be found at https:\/\/chateval.org.","pages":"60--65","doi":"10.18653\/v1\/N19-4011","url":"https:\/\/www.aclweb.org\/anthology\/N19-4011","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4012","title":"{L}eaf{NATS}: An Open-Source Toolkit and Live Demo System for Neural Abstractive Text Summarization","authors":["Shi, Tian","Wang, Ping","Reddy, Chandan K."],"emails":["tshi@vt.edu","ping@vt.edu","reddy@cs.vt.edu"],"author_id":["tian-shi","ping-wang","chandan-k-reddy"],"abstract":"Neural abstractive text summarization (NATS) has received a lot of attention in the past few years from both industry and academia. In this paper, we introduce an open-source toolkit, namely LeafNATS, for training and evaluation of different sequence-to-sequence based models for the NATS task, and for deploying the pre-trained models to real-world applications. The toolkit is modularized and extensible in addition to maintaining competitive performance in the NATS task. A live news blogging system has also been implemented to demonstrate how these models can aid blog\/news editors by providing them suggestions of headlines and summaries of their articles.","pages":"66--71","doi":"10.18653\/v1\/N19-4012","url":"https:\/\/www.aclweb.org\/anthology\/N19-4012","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4013","title":"End-to-End Open-Domain Question Answering with {BERT}serini","authors":["Yang, Wei","Xie, Yuqing","Lin, Aileen","Li, Xingyu","Tan, Luchen","Xiong, Kun","Li, Ming","Lin, Jimmy"],"emails":["","","","","","","",""],"author_id":["wei-yang","yuqing-xie","aileen-lin","xingyu-li","luchen-tan","kun-xiong","ming-li","jimmy-lin"],"abstract":"We demonstrate an end-to-end question answering system that integrates BERT with the open-source Anserini information retrieval toolkit. In contrast to most question answering and reading comprehension models today, which operate over small amounts of input text, our system integrates best practices from IR with a BERT-based reader to identify answers from a large corpus of Wikipedia articles in an end-to-end fashion. We report large improvements over previous results on a standard benchmark test collection, showing that fine-tuning pretrained BERT with SQuAD is sufficient to achieve high accuracy in identifying answer spans.","pages":"72--77","doi":"10.18653\/v1\/N19-4013","url":"https:\/\/www.aclweb.org\/anthology\/N19-4013","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4014","title":"{FAKTA}: An Automatic End-to-End Fact Checking System","authors":["Nadeem, Moin","Fang, Wei","Xu, Brian","Mohtarami, Mitra","Glass, James"],"emails":["mnadeem@mit.edu","weifang@mit.edu","bwxu@mit.edu","mitram@mit.edu","glass@mit.edu"],"author_id":["moin-nadeem","wei-fang","brian-xu","mitra-mohtarami","james-glass"],"abstract":"We present FAKTA which is a unified framework that integrates various components of a fact-checking process: document retrieval from media sources with various types of reliability, stance detection of documents with respect to given claims, evidence extraction, and linguistic analysis. FAKTA predicts the factuality of given claims and provides evidence at the document and sentence level to explain its predictions.","pages":"78--83","doi":"10.18653\/v1\/N19-4014","url":"https:\/\/www.aclweb.org\/anthology\/N19-4014","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4015","title":"i{C}omposer: An Automatic Songwriting System for {C}hinese Popular Music","authors":["Lee, Hsin-Pei","Fang, Jhih-Sheng","Ma, Wei-Yun"],"emails":["hhpslily@iis.sinica.edu.tw","fann1993814@iis.sinica.edu.tw","ma@iis.sinica.edu.tw"],"author_id":["hsin-pei-lee","jhih-sheng-fang","wei-yun-ma"],"abstract":"In this paper, we introduce iComposer, an interactive web-based songwriting system designed to assist human creators by greatly simplifying music production. iComposer automatically creates melodies to accompany any given text. It also enables users to generate a set of lyrics given arbitrary melodies. iComposer is based on three sequence-to-sequence models, which are used to predict melody, rhythm, and lyrics, respectively. Songs generated by iComposer are compared with human-composed and randomly-generated ones in a subjective test, the experimental results of which demonstrate the capability of the proposed system to write pleasing melodies and meaningful lyrics at a level similar to that of humans.","pages":"84--88","doi":"10.18653\/v1\/N19-4015","url":"https:\/\/www.aclweb.org\/anthology\/N19-4015","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4016","title":"Plan, Write, and Revise: an Interactive System for Open-Domain Story Generation","authors":["Goldfarb-Tarrant, Seraphina","Feng, Haining","Peng, Nanyun"],"emails":["serif@uw.edu","haining@usc.edu","npeng@isi.edu"],"author_id":["seraphina-goldfarb-tarrant","haining-feng","nanyun-peng"],"abstract":"Story composition is a challenging problem for machines and even for humans. We present a neural narrative generation system that interacts with humans to generate stories. Our system has different levels of human interaction, which enables us to understand at what stage of story-writing human collaboration is most productive, both to improving story quality and human engagement in the writing process. We compare different varieties of interaction in story-writing, story-planning, and diversity controls under time constraints, and show that increased types of human collaboration at both planning and writing stages results in a 10-50{\\%} improvement in story quality as compared to less interactive baselines. We also show an accompanying increase in user engagement and satisfaction with stories as compared to our own less interactive systems and to previous turn-taking approaches to interaction. Finally, we find that humans tasked with collaboratively improving a particular characteristic of a story are in fact able to do so, which has implications for future uses of human-in-the-loop systems.","pages":"89--97","doi":"10.18653\/v1\/N19-4016","url":"https:\/\/www.aclweb.org\/anthology\/N19-4016","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4017","title":"{LT} Expertfinder: An Evaluation Framework for Expert Finding Methods","authors":["Fischer, Tim","Remus, Steffen","Biemann, Chris"],"emails":["5fischer@informatik.uni-hamburg.de","lastname@informatik.uni-hamburg.de",""],"author_id":["tim-fischer","steffen-remus","chris-biemann"],"abstract":"Expert finding is the task of ranking persons for a predefined topic or search query. Finding experts for a specified area is an important task and has attracted much attention in the information retrieval community. Most approaches for this task are evaluated in a supervised fashion, which depend on predefined topics of interest as well as gold standard expert rankings. Famous representatives of such datasets are enriched versions of DBLP provided by the ArnetMiner projet or the W3C Corpus of TREC. However, manually ranking experts can be considered highly subjective and detailed rankings are hardly distinguishable. Evaluating these datasets does not necessarily guarantee a good or bad performance of the system. Particularly for dynamic systems, where topics are not predefined but formulated as a search query, we believe a more informative approach is to perform user studies for directly comparing different methods in the same view. In order to accomplish this in a user-friendly way, we present the LT Expert Finder web-application, which is equipped with various query-based expert finding methods that can be easily extended, a detailed expert profile view, detailed evidence in form of relevant documents and statistics, and an evaluation component that allows the qualitative comparison between different rankings.","pages":"98--104","doi":"10.18653\/v1\/N19-4017","url":"https:\/\/www.aclweb.org\/anthology\/N19-4017","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4018","title":"{S}kill{B}ot: Towards Automatic Skill Development via User Demonstration","authors":["Shen, Yilin","Ray, Avik","Jin, Hongxia","Nama, Sandeep"],"emails":["yilin.shen@samsung.com","avik.r@samsung.com","hongxia.jin@samsung.com","s.nama@samsung.com"],"author_id":["yilin-shen","avik-ray","hongxia-jin","sandeep-nama"],"abstract":"We present SkillBot that takes the first step to enable end users to teach new skills in personal assistants (PA). Unlike existing PA products that need software developers to build new skills via IDE tools, an end user can use SkillBot to build new skills just by naturally demonstrating the task on device screen. SkillBot automatically develops a natural language understanding (NLU) engine and implements the action without the need of coding. On both benchmark and in-house datasets, we validate the competitive performance of SkillBot automatically built NLU. We also observe that it only takes a few minutes for an end user to build a new skill using SkillBot.","pages":"105--109","doi":"10.18653\/v1\/N19-4018","url":"https:\/\/www.aclweb.org\/anthology\/N19-4018","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4019","title":"Multilingual Entity, Relation, Event and Human Value Extraction","authors":["Li, Manling","Lin, Ying","Hoover, Joseph","Whitehead, Spencer","Voss, Clare","Dehghani, Morteza","Ji, Heng"],"emails":["lim22@rpi.edu","liny9@rpi.edu","jehoover@usc.edu","whites5@rpi.edu","clare.r.voss.civ@mail.mil","mdehghan@usc.edu","jih@rpi.edu"],"author_id":["manling-li","ying-lin","joseph-hoover","spencer-whitehead","clare-voss","morteza-dehghani","heng-ji"],"abstract":"This paper demonstrates a state-of-the-art end-to-end multilingual (English, Russian, and Ukrainian) knowledge extraction system that can perform entity discovery and linking, relation extraction, event extraction, and coreference. It extracts and aggregates knowledge elements across multiple languages and documents as well as provides visualizations of the results along three dimensions: temporal (as displayed in an event timeline), spatial (as displayed in an event heatmap), and relational (as displayed in entity-relation networks). For our system to further support users{'} analyses of causal sequences of events in complex situations, we also integrate a wide range of human moral value measures, independently derived from region-based survey, into the event heatmap. This system is publicly available as a docker container and a live demo.","pages":"110--115","doi":"10.18653\/v1\/N19-4019","url":"https:\/\/www.aclweb.org\/anthology\/N19-4019","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4020","title":"Litigation Analytics: Extracting and querying motions and orders from {US} federal courts","authors":["Vacek, Thomas","Song, Dezhao","Molina-Salgado, Hugo","Teo, Ronald","Cowling, Conner","Schilder, Frank"],"emails":["","","","","",""],"author_id":["thomas-vacek","dezhao-song","hugo-molina-salgado","ronald-teo","conner-cowling","frank-schilder"],"abstract":"Legal litigation planning can benefit from statistics collected from past decisions made by judges. Information on the typical duration for a submitted motion, for example, can give valuable clues for developing a successful strategy. Such information is encoded in semi-structured documents called dockets. In order to extract and aggregate this information, we deployed various information extraction and machine learning techniques. The aggregated data can be queried in real time within the Westlaw Edge search engine. In addition to a keyword search for judges, lawyers, law firms, parties and courts, we also implemented a question answering interface that offers targeted questions in order to get to the respective answers quicker.","pages":"116--121","doi":"10.18653\/v1\/N19-4020","url":"https:\/\/www.aclweb.org\/anthology\/N19-4020","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4021","title":"Community lexical access for an endangered polysynthetic language: An electronic dictionary for St. Lawrence Island Yupik","authors":["Hunt, Benjamin","Chen, Emily","Schreiner, Sylvia L.R.","Schwartz, Lane"],"emails":["bhunt6@gmu.edu","echen41@illinois.edu","sschrei2@gmu.edu","lanes@illinois.edu"],"author_id":["benjamin-hunt","emily-chen","sylvia-l-r-schreiner","lane-schwartz"],"abstract":"In this paper, we introduce a morphologically-aware electronic dictionary for St. Lawrence Island Yupik, an endangered language of the Bering Strait region. Implemented using HTML, Javascript, and CSS, the dictionary is set in an uncluttered interface and permits users to search in Yupik or in English for Yupik root words and Yupik derivational suffixes. For each matching result, our electronic dictionary presents the user with the corresponding entry from the Badten (2008) Yupik-English paper dictionary. Because Yupik is a polysynthetic language, handling of multimorphemic word forms is critical. If a user searches for an inflected Yupik word form, we perform a morphological analysis and return entries for the root word and for any derivational suffixes present in the word. This electronic dictionary should serve not only as a valuable resource for all students and speakers of Yupik, but also for field linguists working towards documentation and conservation of the language.","pages":"122--126","doi":"10.18653\/v1\/N19-4021","url":"https:\/\/www.aclweb.org\/anthology\/N19-4021","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4022","title":"Visualizing Inferred Morphotactic Systems","authors":["Lepp, Haley","Zamaraeva, Olga","Bender, Emily M."],"emails":["hlepp@uw.edu","olzama@uw.edu","ebender@uw.edu"],"author_id":["haley-lepp","olga-zamaraeva","emily-m-bender"],"abstract":"We present a web-based system that facilitates the exploration of complex morphological patterns found in morphologically very rich languages. The need for better understanding of such patterns is urgent for linguistics and important for cross-linguistically applicable natural language processing. In this paper we give an overview of the system architecture and describe a sample case study on Abui [abz], a Trans-New Guinea language spoken in Indonesia.","pages":"127--131","doi":"10.18653\/v1\/N19-4022","url":"https:\/\/www.aclweb.org\/anthology\/N19-4022","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4023","title":"A {R}esearch {P}latform for {M}ulti-{R}obot {D}ialogue with {H}umans","authors":["Marge, Matthew","Nogar, Stephen","Hayes, Cory J.","Lukin, Stephanie M.","Bloecker, Jesse","Holder, Eric","Voss, Clare"],"emails":["matthew.r.marge.civ@mail.mil","","","","","",""],"author_id":["matthew-marge","stephen-nogar","cory-hayes","stephanie-lukin","jesse-bloecker","eric-holder","clare-voss"],"abstract":"This paper presents a research platform that supports spoken dialogue interaction with multiple robots. The demonstration showcases our crafted MultiBot testing scenario in which users can verbally issue search, navigate, and follow instructions to two robotic teammates: a simulated ground robot and an aerial robot. This flexible language and robotic platform takes advantage of existing tools for speech recognition and dialogue management that are compatible with new domains, and implements an inter-agent communication protocol (tactical behavior specification), where verbal instructions are encoded for tasks assigned to the appropriate robot.","pages":"132--137","doi":"10.18653\/v1\/N19-4023","url":"https:\/\/www.aclweb.org\/anthology\/N19-4023","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"},{"id":"N19-4024","title":"Chat-crowd: A Dialog-based Platform for Visual Layout Composition","authors":["Cascante-Bonilla, Paola","Yin, Xuwang","Ordonez, Vicente","Feng, Song"],"emails":["pc9za@virginia.edu","xy4cm@virginia.edu","vicente@virginia.edu","sfeng@us.ibm.com"],"author_id":["paola-cascante-bonilla","xuwang-yin","vicente-ordonez","song-feng"],"abstract":"In this paper we introduce Chat-crowd, an interactive environment for visual layout composition via conversational interactions. Chat-crowd supports multiple agents with two conversational roles: agents who play the role of a designer are in charge of placing objects in an editable canvas according to instructions or commands issued by agents with a director role. The system can be integrated with crowdsourcing platforms for both synchronous and asynchronous data collection and is equipped with comprehensive quality controls on the performance of both types of agents. We expect that this system will be useful to build multimodal goal-oriented dialog tasks that require spatial and geometric reasoning.","pages":"138--142","doi":"10.18653\/v1\/N19-4024","url":"https:\/\/www.aclweb.org\/anthology\/N19-4024","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the 2019 Conference of the North {A}merican Chapter of the Association for Computational Linguistics (Demonstrations)"}]