[{"id":"P19-2001","title":"Distributed Knowledge Based Clinical Auto-Coding System","authors":["Kaur, Rajvir"],"emails":["18531738@student.westernsydney.edu.au"],"author_id":["rajvir-kaur"],"abstract":"Codification of free-text clinical narratives have long been recognised to be beneficial for secondary uses such as funding, insurance claim processing and research. In recent years, many researchers have studied the use of Natural Language Processing (NLP), related Machine Learning (ML) methods and techniques to resolve the problem of manual coding of clinical narratives. Most of the studies are focused on classification systems relevant to the U.S and there is a scarcity of studies relevant to Australian classification systems such as ICD-10-AM and ACHI. Therefore, we aim to develop a knowledge-based clinical auto-coding system, that utilise appropriate NLP and ML techniques to assign ICD-10-AM and ACHI codes to clinical records, while adhering to both local coding standards (Australian Coding Standard) and international guidelines that get updated and validated continuously.","pages":"1--9","doi":"10.18653\/v1\/P19-2001","url":"https:\/\/www.aclweb.org\/anthology\/P19-2001","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2002","title":"Robust to Noise Models in Natural Language Processing Tasks","authors":["Malykh, Valentin"],"emails":["valentin.malykh@phystech.edu"],"author_id":["valentin-malykh"],"abstract":"There are a lot of noise texts surrounding a person in modern life. The traditional approach is to use spelling correction, yet the existing solutions are far from perfect. We propose robust to noise word embeddings model, which outperforms existing commonly used models, like fasttext and word2vec in different tasks. In addition, we investigate the noise robustness of current models in different natural language processing tasks. We propose extensions for modern models in three downstream tasks, i.e. text classification, named entity recognition and aspect extraction, which shows improvement in noise robustness over existing solutions.","pages":"10--16","doi":"10.18653\/v1\/P19-2002","url":"https:\/\/www.aclweb.org\/anthology\/P19-2002","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2003","title":"A Computational Linguistic Study of Personal Recovery in Bipolar Disorder","authors":["Jagfeld, Glorianna"],"emails":["g.jagfeld@lancaster.ac.uk"],"author_id":["glorianna-jagfeld"],"abstract":"Mental health research can benefit increasingly fruitfully from computational linguistics methods, given the abundant availability of language data in the internet and advances of computational tools. This interdisciplinary project will collect and analyse social media data of individuals diagnosed with bipolar disorder with regard to their recovery experiences. Personal recovery - living a satisfying and contributing life along symptoms of severe mental health issues - so far has only been investigated qualitatively with structured interviews and quantitatively with standardised questionnaires with mainly English-speaking participants inWestern countries. Complementary to this evidence, computational linguistic methods allow us to analyse first-person accounts shared online in large quantities, representing unstructured settings and a more heterogeneous, multilingual population, to draw a more complete picture of the aspects and mechanisms of personal recovery in bipolar disorder.","pages":"17--26","doi":"10.18653\/v1\/P19-2003","url":"https:\/\/www.aclweb.org\/anthology\/P19-2003","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2004","title":"Measuring the Value of Linguistics: A Case Study from St. Lawrence Island Yupik","authors":["Chen, Emily"],"emails":["echen41@illinois.edu"],"author_id":["emily-chen"],"abstract":"The adaptation of neural approaches to NLP is a landmark achievement that has called into question the utility of linguistics in the development of computational systems. This research proposal consequently explores this question in the context of a neural morphological analyzer for a polysynthetic language, St. Lawrence Island Yupik. It asks whether incorporating elements of Yupik linguistics into the implementation of the analyzer can improve performance, both in low-resource settings and in high-resource settings, where rich quantities of data are readily available.","pages":"27--33","doi":"10.18653\/v1\/P19-2004","url":"https:\/\/www.aclweb.org\/anthology\/P19-2004","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2005","title":"Not All Reviews Are Equal: Towards Addressing Reviewer Biases for Opinion Summarization","authors":["Tay, Wenyi"],"emails":["wenyi.tay@student.rmit.edu.au"],"author_id":["wenyi-tay"],"abstract":"Consumers read online reviews for insights which help them to make decisions. Given the large volumes of reviews, succinct review summaries are important for many applications. Existing research has focused on mining for opinions from only review texts and largely ignores the reviewers. However, reviewers have biases and may write lenient or harsh reviews; they may also have preferences towards some topics over others. Therefore, not all reviews are equal. Ignoring the biases in reviews can generate misleading summaries. We aim for summarization of reviews to include balanced opinions from reviewers of different biases and preferences. We propose to model reviewer biases from their review texts and rating distributions, and learn a bias-aware opinion representation. We further devise an approach for balanced opinion summarization of reviews using our bias-aware opinion representation.","pages":"34--42","doi":"10.18653\/v1\/P19-2005","url":"https:\/\/www.aclweb.org\/anthology\/P19-2005","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2006","title":"Towards {T}urkish Abstract Meaning Representation","authors":["Azin, Zahra","Eryi{\\u{g}}it, G{\\\"u}l{\\c{s}}en"],"emails":["",""],"author_id":["zahra-azin","gulsen-eryigit"],"abstract":"Using rooted, directed and labeled graphs, Abstract Meaning Representation (AMR) abstracts away from syntactic features such as word order and does not annotate every constituent in a sentence. AMR has been specified for English and was not supposed to be an Interlingua. However, several studies strived to overcome divergences in the annotations between English AMRs and those of their target languages by refining the annotation specification. Following this line of research, we have started to build the first Turkish AMR corpus by hand-annotating 100 sentences of the Turkish translation of the novel {``}The Little Prince{''} and comparing the results with the English AMRs available for the same corpus. The next step is to prepare the Turkish AMR annotation specification for training future annotators.","pages":"43--47","doi":"10.18653\/v1\/P19-2006","url":"https:\/\/www.aclweb.org\/anthology\/P19-2006","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2007","title":"Gender Stereotypes Differ between Male and Female Writings","authors":["Qian, Yusu"],"emails":["yq729@nyu.edu"],"author_id":["yusu-qian"],"abstract":"Written language often contains gender stereotypes, typically conveyed unintentionally by the author. To study the difference in how female and male authors portray people of different genders, we quantitatively evaluate and analyze the gender stereotypes in their writings on two different datasets and from multiple aspects. We show that writings by females on average have lower gender stereotype scores. We plan to study and interpret the distributions of gender stereotype scores of individual words, and how they differ between male and female writings. We also plan on using more datasets over the past century to study how the stereotypes in female and male writings evolved over time.","pages":"48--53","doi":"10.18653\/v1\/P19-2007","url":"https:\/\/www.aclweb.org\/anthology\/P19-2007","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2008","title":"Question Answering in the Biomedical Domain","authors":["Nguyen, Vincent"],"emails":["vincent.nguyen@anu.edu.au"],"author_id":["vincent-nguyen"],"abstract":"Question answering techniques have mainly been investigated in open domains. However, there are particular challenges in extending these open-domain techniques to extend into the biomedical domain. Question answering focusing on patients is less studied. We find that there are some challenges in patient question answering such as limited annotated data, lexical gap and quality of answer spans. We aim to address some of these gaps by extending and developing upon the literature to design a question answering system that can decide on the most appropriate answers for patients attempting to self-diagnose while including the ability to abstain from answering when confidence is low.","pages":"54--63","doi":"10.18653\/v1\/P19-2008","url":"https:\/\/www.aclweb.org\/anthology\/P19-2008","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2009","title":"Knowledge Discovery and Hypothesis Generation from Online Patient Forums: A Research Proposal","authors":["Dirkson, Anne"],"emails":["a.r.dirkson@liacs.leidenuniv.nl"],"author_id":["anne-dirkson"],"abstract":"The unprompted patient experiences shared on patient forums contain a wealth of unexploited knowledge. Mining this knowledge and cross-linking it with biomedical literature, could expose novel insights, which could subsequently provide hypotheses for further clinical research. As of yet, automated methods for open knowledge discovery on patient forum text are lacking. Thus, in this research proposal, we outline future research into methods for mining, aggregating and cross-linking patient knowledge from online forums. Additionally, we aim to address how one could measure the credibility of this extracted knowledge.","pages":"64--73","doi":"10.18653\/v1\/P19-2009","url":"https:\/\/www.aclweb.org\/anthology\/P19-2009","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2010","title":"Automated Cross-language Intelligibility Analysis of {P}arkinson{'}s Disease Patients Using Speech Recognition Technologies","authors":["Hosseini-Kivanani, Nina","V{\\'a}squez-Correa, Juan Camilo","Stede, Manfred","N{\\\"o}th, Elmar"],"emails":["hosseinikiva@uni-potsdam.de","jcamilo.vasquez@udea.edu.co","stede@uni-potsdam.de","elmar.noeth@fau.de"],"author_id":["nina-hosseini-kivanani","juan-camilo-vasquez-correa","manfred-stede","elmar-noth"],"abstract":"Speech deficits are common symptoms amongParkinson{'}s Disease (PD) patients. The automatic assessment of speech signals is promising for the evaluation of the neurological state and the speech quality of the patients. Recently, progress has been made in applying machine learning and computational methods to automatically evaluate the speech of PD patients. In the present study, we plan to analyze the speech signals of PD patients and healthy control (HC) subjects in three different languages: German, Spanish, and Czech, with the aim to identify biomarkers to discriminate between PD patients and HC subjects and to evaluate the neurological state of the patients. Therefore, the main contribution of this study is the automatic classification of PD patients and HC subjects in different languages with focusing on phonation, articulation, and prosody. We will focus on an intelligibility analysis based on automatic speech recognition systems trained on these three languages. This is one of the first studies done that considers the evaluation of the speech of PD patients in different languages. The purpose of this research proposal is to build a model that can discriminate PD and HC subjects even when the language used for train and test is different.","pages":"74--80","doi":"10.18653\/v1\/P19-2010","url":"https:\/\/www.aclweb.org\/anthology\/P19-2010","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2011","title":"Natural Language Generation: Recently Learned Lessons, Directions for Semantic Representation-based Approaches, and the Case of {B}razilian {P}ortuguese Language","authors":["Sobrevilla Cabezudo, Marco Antonio","Pardo, Thiago"],"emails":["msobrevillac@usp.br","taspardo@icmc.usp.br"],"author_id":["marco-antonio-sobrevilla-cabezudo","thiago-pardo"],"abstract":"This paper presents a more recent literature review on Natural Language Generation. In particular, we highlight the efforts for Brazilian Portuguese in order to show the available resources and the existent approaches for this language. We also focus on the approaches for generation from semantic representations (emphasizing the Abstract Meaning Representation formalism) as well as their advantages and limitations, including possible future directions.","pages":"81--88","doi":"10.18653\/v1\/P19-2011","url":"https:\/\/www.aclweb.org\/anthology\/P19-2011","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2012","title":"Long-Distance Dependencies Don{'}t Have to Be Long: Simplifying through Provably (Approximately) Optimal Permutations","authors":["Bommasani, Rishi"],"emails":["rb724@cornell.edu"],"author_id":["rishi-bommasani"],"abstract":"Neural models at the sentence level often operate on the constituent words\/tokens in a way that encodes the inductive bias of processing the input in a similar fashion to how humans do. However, there is no guarantee that the standard ordering of words is computationally efficient or optimal. To help mitigate this, we consider a dependency parse as a proxy for the inter-word dependencies in a sentence and simplify the sentence with respect to combinatorial objectives imposed on the sentence-parse pair. The associated optimization results in permuted sentences that are provably (approximately) optimal with respect to minimizing dependency parse lengths and that are demonstrably simpler. We evaluate our general-purpose permutations within a fine-tuning schema for the downstream task of subjectivity analysis. Our fine-tuned baselines reflect a new state of the art for the SUBJ dataset and the permutations we introduce lead to further improvements with a 2.0{\\%} increase in classification accuracy (absolute) and a 45{\\%} reduction in classification error (relative) over the previous state of the art.","pages":"89--99","doi":"10.18653\/v1\/P19-2012","url":"https:\/\/www.aclweb.org\/anthology\/P19-2012","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2013","title":"Predicting the Outcome of Deliberative Democracy: A Research Proposal","authors":["McKillop, Conor"],"emails":["c.z.mckillop@dundee.ac.uk"],"author_id":["conor-mckillop"],"abstract":"As liberal states across the world face a decline in political participation by citizens, deliberative democracy is a promising solution for the public{'}s decreasing confidence and apathy towards the democratic process. Deliberative dialogue is method of public interaction that is fundamental to the concept of deliberative democracy. The ability to identify and predict consensus in the dialogues could bring greater accessibility and transparency to the face-to-face participatory process. The paper sets out a research plan for the first steps at automatically identifying and predicting consensus in a corpus of German language debates on hydraulic fracking. It proposes the use of a unique combination of lexical, sentiment, durational and further {`}derivative{'} features of adjacency pairs to train traditional classification models. In addition to this, the use of deep learning techniques to improve the accuracy of the classification and prediction tasks is also discussed. Preliminary results at the classification of utterances are also presented, with an F1 between 0.61 and 0.64 demonstrating that the task of recognising agreement is demanding but possible.","pages":"100--105","doi":"10.18653\/v1\/P19-2013","url":"https:\/\/www.aclweb.org\/anthology\/P19-2013","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2014","title":"Active Reading Comprehension: A Dataset for Learning the Question-Answer Relationship Strategy","authors":["Galv{\\'a}n-Sosa, Diana"],"emails":["dianags@ecei.tohoku.ac.jp"],"author_id":["diana-galvan-sosa"],"abstract":"Reading comprehension (RC) through question answering is a useful method for evaluating if a reader understands a text. Standard accuracy metrics are used for evaluation, where high accuracy is taken as indicative of a good understanding. However, literature in quality learning suggests that task performance should also be evaluated on the undergone process to answer. The Question-Answer Relationship (QAR) is one of the strategies for evaluating a reader{'}s understanding based on their ability to select different sources of information depending on the question type. We propose the creation of a dataset to learn the QAR strategy with weak supervision. We expect to complement current work on reading comprehension by introducing a new setup for evaluation.","pages":"106--112","doi":"10.18653\/v1\/P19-2014","url":"https:\/\/www.aclweb.org\/anthology\/P19-2014","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2015","title":"Paraphrases as Foreign Languages in Multilingual Neural Machine Translation","authors":["Zhou, Zhong","Sperber, Matthias","Waibel, Alexander"],"emails":["zhongzhou@cmu.edu","matthias.sperber@kit.edu","alex@waibel.com"],"author_id":["zhong-zhou","matthias-sperber","alex-waibel"],"abstract":"Paraphrases, rewordings of the same semantic meaning, are useful for improving generalization and translation. Unlike previous works that only explore paraphrases at the word or phrase level, we use different translations of the whole training data that are consistent in structure as paraphrases at the corpus level. We treat paraphrases as foreign languages, tag source sentences with paraphrase labels, and train on parallel paraphrases in the style of multilingual Neural Machine Translation (NMT). Our multi-paraphrase NMT that trains only on two languages outperforms the multilingual baselines. Adding paraphrases improves the rare word translation and increases entropy and diversity in lexical choice. Adding the source paraphrases boosts performance better than adding the target ones, while adding both lifts performance further. We achieve a BLEU score of 57.2 for French-to-English translation using 24 corpus-level paraphrases of the Bible, which outperforms the multilingual baselines and is +34.7 above the single-source single-target NMT baseline.","pages":"113--122","doi":"10.18653\/v1\/P19-2015","url":"https:\/\/www.aclweb.org\/anthology\/P19-2015","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2016","title":"Improving {M}ongolian-{C}hinese Neural Machine Translation with Morphological Noise","authors":["Ji, Yatu","Hou, Hongxu","Junjie, Chen","Wu, Nier"],"emails":["jiyatu0@126.com","cshhx@imu.edu.cn","chenjj@imau.edu.cn","wunier04@126.com"],"author_id":["yatu-ji","hongxu-hou","chen-junjie","nier-wu"],"abstract":"For the translation of agglutinative language such as typical Mongolian, unknown (UNK) words not only come from the quite restricted vocabulary, but also mostly from misunderstanding of the translation model to the morphological changes. In this study, we introduce a new adversarial training model to alleviate the UNK problem in Mongolian-Chinese machine translation. The training process can be described as three adversarial sub models (generator, value screener and discriminator), playing a win-win game. In this game, the added screener plays the role of emphasizing that the discriminator pays attention to the added Mongolian morphological noise in the form of pseudo-data and improving the training efficiency. The experimental results show that the newly emerged Mongolian-Chinese task is state-of-the-art. Under this premise, the training time is greatly shortened.","pages":"123--129","doi":"10.18653\/v1\/P19-2016","url":"https:\/\/www.aclweb.org\/anthology\/P19-2016","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2017","title":"Unsupervised Pretraining for Neural Machine Translation Using Elastic Weight Consolidation","authors":["Vari{\\v{s}}, Du{\\v{s}}an","Bojar, Ond{\\v{r}}ej"],"emails":["varis@ufal.mff.cuni.cz","bojar@ufal.mff.cuni.cz"],"author_id":["dusan-varis","ondrej-bojar"],"abstract":"This work presents our ongoing research of unsupervised pretraining in neural machine translation (NMT). In our method, we initialize the weights of the encoder and decoder with two language models that are trained with monolingual data and then fine-tune the model on parallel data using Elastic Weight Consolidation (EWC) to avoid forgetting of the original language modeling task. We compare the regularization by EWC with the previous work that focuses on regularization by language modeling objectives. The positive result is that using EWC with the decoder achieves BLEU scores similar to the previous work. However, the model converges 2-3 times faster and does not require the original unlabeled training data during the fine-tuning stage. In contrast, the regularization using EWC is less effective if the original and new tasks are not closely related. We show that initializing the bidirectional NMT encoder with a left-to-right language model and forcing the model to remember the original left-to-right language modeling task limits the learning capacity of the encoder for the whole bidirectional context.","pages":"130--135","doi":"10.18653\/v1\/P19-2017","url":"https:\/\/www.aclweb.org\/anthology\/P19-2017","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2018","title":"{M}{\\=a}{O}ri Loanwords: A Corpus of New {Z}ealand {E}nglish Tweets","authors":["Trye, David","Calude, Andreea","Bravo-Marquez, Felipe","Keegan, Te Taka"],"emails":["dgt12@students.waikato.ac.nz","andreea.calude@waikato.ac.nz","fbravo@dcc.uchile.cl","tetaka.keegan@waikato.ac.nz"],"author_id":["david-trye","andreea-calude","felipe-bravo-marquez","te-taka-keegan"],"abstract":"M{\\=a}ori loanwords are widely used in New Zealand English for various social functions by New Zealanders within and outside of the M{\\=a}ori community. Motivated by the lack of linguistic resources for studying how M{\\=a}ori loanwords are used in social media, we present a new corpus of New Zealand English tweets. We collected tweets containing selected M{\\=a}ori words that are likely to be known by New Zealanders who do not speak M{\\=a}ori. Since over 30{\\%} of these words turned out to be irrelevant, we manually annotated a sample of our tweets into relevant and irrelevant categories. This data was used to train machine learning models to automatically filter out irrelevant tweets.","pages":"136--142","doi":"10.18653\/v1\/P19-2018","url":"https:\/\/www.aclweb.org\/anthology\/P19-2018","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2019","title":"Ranking of Potential Questions","authors":["Schricker, Luise","Scheffler, Tatjana"],"emails":["luise.schricker@uni-potsdam.de","tatjana.scheffler@uni-potsdam.de"],"author_id":["luise-schricker","tatjana-scheffler"],"abstract":"Questions are an integral part of discourse. They provide structure and support the exchange of information. One linguistic theory, the Questions Under Discussion model, takes question structures as integral to the functioning of a coherent discourse. This theory has not been tested on the count of its validity for predicting observations in real dialogue data, however. In this submission, a system for ranking explicit and implicit questions by their appropriateness in a dialogue is presented. This system implements constraints and principles put forward in the linguistic literature.","pages":"143--148","doi":"10.18653\/v1\/P19-2019","url":"https:\/\/www.aclweb.org\/anthology\/P19-2019","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2020","title":"Controlling Grammatical Error Correction Using Word Edit Rate","authors":["Hotate, Kengo","Kaneko, Masahiro","Katsumata, Satoru","Komachi, Mamoru"],"emails":["hotate-kengo@ed.tmu.ac.jp","kaneko-masahiro@ed.tmu.ac.jp","satoru-katsumata@ed.tmu.ac.jp","komachi@tmu.ac.jp"],"author_id":["kengo-hotate","masahiro-kaneko","satoru-katsumata","mamoru-komachi"],"abstract":"When professional English teachers correct grammatically erroneous sentences written by English learners, they use various methods. The correction method depends on how much corrections a learner requires. In this paper, we propose a method for neural grammar error correction (GEC) that can control the degree of correction. We show that it is possible to actually control the degree of GEC by using new training data annotated with word edit rate. Thereby, diverse corrected sentences is obtained from a single erroneous sentence. Moreover, compared to a GEC model that does not use information on the degree of correction, the proposed method improves correction accuracy.","pages":"149--154","doi":"10.18653\/v1\/P19-2020","url":"https:\/\/www.aclweb.org\/anthology\/P19-2020","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2021","title":"From Brain Space to Distributional Space: The Perilous Journeys of f{MRI} Decoding","authors":["Minnema, Gosse","Herbelot, Aur{\\'e}lie"],"emails":["gosseminnema@gmail.com","aurelie.herbelot@unitn.it"],"author_id":["gosse-minnema","aurelie-herbelot"],"abstract":"Recent work in cognitive neuroscience has introduced models for predicting distributional word meaning representations from brain imaging data. Such models have great potential, but the quality of their predictions has not yet been thoroughly evaluated from a computational linguistics point of view. Due to the limited size of available brain imaging datasets, standard quality metrics (e.g. similarity judgments and analogies) cannot be used. Instead, we investigate the use of several alternative measures for evaluating the predicted distributional space against a corpus-derived distributional space. We show that a state-of-the-art decoder, while performing impressively on metrics that are commonly used in cognitive neuroscience, performs unexpectedly poorly on our metrics. To address this, we propose strategies for improving the model{'}s performance. Despite returning promising results, our experiments also demonstrate that much work remains to be done before distributional representations can reliably be predicted from brain data.","pages":"155--161","doi":"10.18653\/v1\/P19-2021","url":"https:\/\/www.aclweb.org\/anthology\/P19-2021","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2022","title":"Towards Incremental Learning of Word Embeddings Using Context Informativeness","authors":["Kabbach, Alexandre","Gulordava, Kristina","Herbelot, Aur{\\'e}lie"],"emails":["","",""],"author_id":["alexandre-kabbach","kristina-gulordava","aurelie-herbelot"],"abstract":"In this paper, we investigate the task of learning word embeddings from very sparse data in an incremental, cognitively-plausible way. We focus on the notion of {`}informativeness{'}, that is, the idea that some content is more valuable to the learning process than other. We further highlight the challenges of online learning and argue that previous systems fall short of implementing incrementality. Concretely, we incorporate informativeness in a previously proposed model of nonce learning, using it for context selection and learning rate modulation. We test our system on the task of learning new words from definitions, as well as on the task of learning new words from potentially uninformative contexts. We demonstrate that informativeness is crucial to obtaining state-of-the-art performance in a truly incremental setup.","pages":"162--168","doi":"10.18653\/v1\/P19-2022","url":"https:\/\/www.aclweb.org\/anthology\/P19-2022","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2023","title":"A Strong and Robust Baseline for Text-Image Matching","authors":["Liu, Fangyu","Ye, Rongtian"],"emails":["fangyu.liu@uwaterloo.ca","rongtian7@gmail.com"],"author_id":["fangyu-liu","rongtian-ye"],"abstract":"We review the current schemes of text-image matching models and propose improvements for both training and inference. First, we empirically show limitations of two popular loss (sum and max-margin loss) widely used in training text-image embeddings and propose a trade-off: a kNN-margin loss which 1) utilizes information from hard negatives and 2) is robust to noise as all K-most hardest samples are taken into account, tolerating pseudo negatives and outliers. Second, we advocate the use of Inverted Softmax (IS) and Cross-modal Local Scaling (CSLS) during inference to mitigate the so-called hubness problem in high-dimensional embedding space, enhancing scores of all metrics by a large margin.","pages":"169--176","doi":"10.18653\/v1\/P19-2023","url":"https:\/\/www.aclweb.org\/anthology\/P19-2023","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2024","title":"Incorporating Textual Information on User Behavior for Personality Prediction","authors":["Yamada, Kosuke","Sasano, Ryohei","Takeda, Koichi"],"emails":["yamada.kosuke@c.mbox.nagoya-u.ac.jp","sasano@i.nagoya-u.ac.jp","takedasu@i.nagoya-u.ac.jp"],"author_id":["kosuke-yamada","ryohei-sasano","koichi-takeda"],"abstract":"Several recent studies have shown that textual information of user posts and user behaviors such as liking and sharing the specific posts are useful for predicting the personality of social media users. However, less attention has been paid to the textual information derived from the user behaviors. In this paper, we investigate the effect of textual information on user behaviors for personality prediction. Our experiments on the personality prediction of Twitter users show that the textual information of user behaviors is more useful than the co-occurrence information of the user behaviors. They also show that taking user behaviors into account is crucial for predicting the personality of users who do not post frequently.","pages":"177--182","doi":"10.18653\/v1\/P19-2024","url":"https:\/\/www.aclweb.org\/anthology\/P19-2024","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2025","title":"Corpus Creation and Analysis for Named Entity Recognition in {T}elugu-{E}nglish Code-Mixed Social Media Data","authors":["Srirangam, Vamshi Krishna","Reddy, Appidi Abhinav","Singh, Vinay","Shrivastava, Manish"],"emails":["v.srirangam@research.iiit.ac.in","abhinav.appidi@research.iiit.ac.in","vinay.singh@research.iiit.ac.in","m.shrivastava@iiit.ac.in"],"author_id":["vamshi-krishna-srirangam","appidi-abhinav-reddy","vinay-singh","manish-shrivastava"],"abstract":"Named Entity Recognition(NER) is one of the important tasks in Natural Language Processing(NLP) and also is a subtask of Information Extraction. In this paper we present our work on NER in Telugu-English code-mixed social media data. Code-Mixing, a progeny of multilingualism is a way in which multilingual people express themselves on social media by using linguistics units from different languages within a sentence or speech context. Entity Extraction from social media data such as tweets(twitter) is in general difficult due to its informal nature, code-mixed data further complicates the problem due to its informal, unstructured and incomplete information. We present a Telugu-English code-mixed corpus with the corresponding named entity tags. The named entities used to tag data are Person({`}Per{'}), Organization({`}Org{'}) and Location({`}Loc{'}). We experimented with the machine learning models Conditional Random Fields(CRFs), Decision Trees and BiLSTMs on our corpus which resulted in a F1-score of 0.96, 0.94 and 0.95 respectively.","pages":"183--189","doi":"10.18653\/v1\/P19-2025","url":"https:\/\/www.aclweb.org\/anthology\/P19-2025","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2026","title":"Joint Learning of Named Entity Recognition and Entity Linking","authors":["Martins, Pedro Henrique","Marinho, Zita","Martins, Andr{\\'e} F. T."],"emails":["pedrohenriqueamartins@gmail.com","zita.marinho@priberam.pt","andre.martins@unbabel.com"],"author_id":["pedro-henrique-martins","zita-marinho","andre-f-t-martins"],"abstract":"Named entity recognition (NER) and entity linking (EL) are two fundamentally related tasks, since in order to perform EL, first the mentions to entities have to be detected. However, most entity linking approaches disregard the mention detection part, assuming that the correct mentions have been previously detected. In this paper, we perform joint learning of NER and EL to leverage their relatedness and obtain a more robust and generalisable system. For that, we introduce a model inspired by the Stack-LSTM approach. We observe that, in fact, doing multi-task learning of NER and EL improves the performance in both tasks when comparing with models trained with individual objectives. Furthermore, we achieve results competitive with the state-of-the-art in both NER and EL.","pages":"190--196","doi":"10.18653\/v1\/P19-2026","url":"https:\/\/www.aclweb.org\/anthology\/P19-2026","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2027","title":"Dialogue-Act Prediction of Future Responses Based on Conversation History","authors":["Tanaka, Koji","Takayama, Junya","Arase, Yuki"],"emails":["tanaka.koji@ist.osaka-u.ac.jp","takayama.junya@ist.osaka-u.ac.jp","arase@ist.osaka-u.ac.jp"],"author_id":["koji-tanaka","junya-takayama","yuki-arase"],"abstract":"Sequence-to-sequence models are a common approach to develop a chatbot. They can train a conversational model in an end-to-end manner. One significant drawback of such a neural network based approach is that the response generation process is a black-box, and how a specific response is generated is unclear. To tackle this problem, an interpretable response generation mechanism is desired. As a step toward this direction, we focus on dialogue-acts (DAs) that may provide insight to understand the response generation process. In particular, we propose a method to predict a DA of the next response based on the history of previous utterances and their DAs. Experiments using a Switch Board Dialogue Act corpus show that compared to the baseline considering only a single utterance, our model achieves 10.8{\\%} higher F1-score and 3.0{\\%} higher accuracy on DA prediction.","pages":"197--202","doi":"10.18653\/v1\/P19-2027","url":"https:\/\/www.aclweb.org\/anthology\/P19-2027","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2028","title":"Computational Ad Hominem Detection","authors":["Delobelle, Pieter","Cunha, Murilo","Massip Cano, Eric","Peperkamp, Jeroen","Berendt, Bettina"],"emails":["pieter.delobelle@student.kuleuven.be","murilo.cunha@student.kuleuven.be","eric.massipcano@student.kuleuven.be","jeroen.peperkamp@kuleuven.be","bettina.berendt@kuleuven.be"],"author_id":["pieter-delobelle","murilo-cunha","eric-massip-cano","jeroen-peperkamp","bettina-berendt"],"abstract":"Fallacies like the personal attack{---}also known as the ad hominem attack{---}are introduced in debates as an easy win, even though they provide no rhetorical contribution. Although their importance in argumentation mining is acknowledged, automated mining and analysis is still lacking. We show TF-IDF approaches are insufficient to detect the ad hominem attack. Therefore we present a machine learning approach for information extraction, which has a recall of 80{\\%} for a social media data source. We also demonstrate our approach with an application that uses online learning.","pages":"203--209","doi":"10.18653\/v1\/P19-2028","url":"https:\/\/www.aclweb.org\/anthology\/P19-2028","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2029","title":"Multiple Character Embeddings for {C}hinese Word Segmentation","authors":["Zhou, Jianing","Wang, Jingkang","Liu, Gongshen"],"emails":["zhjjn1919@gmail.com","wangjksjtu@gmail.com","lgshen@sjtu.edu.cn"],"author_id":["jianing-zhou","jingkang-wang","gongshen-liu"],"abstract":"Chinese word segmentation (CWS) is often regarded as a character-based sequence labeling task in most current works which have achieved great success with the help of powerful neural networks. However, these works neglect an important clue: Chinese characters incorporate both semantic and phonetic meanings. In this paper, we introduce multiple character embeddings including Pinyin Romanization and Wubi Input, both of which are easily accessible and effective in depicting semantics of characters. We propose a novel shared Bi-LSTM-CRF model to fuse linguistic features efficiently by sharing the LSTM network during the training procedure. Extensive experiments on five corpora show that extra embeddings help obtain a significant improvement in labeling accuracy. Specifically, we achieve the state-of-the-art performance in AS and CityU corpora with F1 scores of 96.9 and 97.3, respectively without leveraging any external lexical resources.","pages":"210--216","doi":"10.18653\/v1\/P19-2029","url":"https:\/\/www.aclweb.org\/anthology\/P19-2029","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2030","title":"Attention over Heads: A Multi-Hop Attention for Neural Machine Translation","authors":["Iida, Shohei","Kimura, Ryuichiro","Cui, Hongyi","Hung, Po-Hsuan","Utsuro, Takehito","Nagata, Masaaki"],"emails":["","","","","",""],"author_id":["shohei-iida","ryuichiro-kimura","hongyi-cui","po-hsuan-hung","takehito-utsuro","masaaki-nagata"],"abstract":"In this paper, we propose a multi-hop attention for the Transformer. It refines the attention for an output symbol by integrating that of each head, and consists of two hops. The first hop attention is the scaled dot-product attention which is the same attention mechanism used in the original Transformer. The second hop attention is a combination of multi-layer perceptron (MLP) attention and head gate, which efficiently increases the complexity of the model by adding dependencies between heads. We demonstrate that the translation accuracy of the proposed multi-hop attention outperforms the baseline Transformer significantly, +0.85 BLEU point for the IWSLT-2017 German-to-English task and +2.58 BLEU point for the WMT-2017 German-to-English task. We also find that the number of parameters required for a multi-hop attention is smaller than that for stacking another self-attention layer and the proposed model converges significantly faster than the original Transformer.","pages":"217--222","doi":"10.18653\/v1\/P19-2030","url":"https:\/\/www.aclweb.org\/anthology\/P19-2030","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2031","title":"Reducing Gender Bias in Word-Level Language Models with a Gender-Equalizing Loss Function","authors":["Qian, Yusu","Muaz, Urwa","Zhang, Ben","Hyun, Jae Won"],"emails":["yq729@nyu.edu","um367@nyu.edu","bz957@nyu.edu","jaewhyun@nyu.edu"],"author_id":["yusu-qian","urwa-muaz","ben-zhang","jae-won-hyun"],"abstract":"Gender bias exists in natural language datasets, which neural language models tend to learn, resulting in biased text generation. In this research, we propose a debiasing approach based on the loss function modification. We introduce a new term to the loss function which attempts to equalize the probabilities of male and female words in the output. Using an array of bias evaluation metrics, we provide empirical evidence that our approach successfully mitigates gender bias in language models without increasing perplexity. In comparison to existing debiasing strategies, data augmentation, and word embedding debiasing, our method performs better in several aspects, especially in reducing gender bias in occupation words. Finally, we introduce a combination of data augmentation and our approach and show that it outperforms existing strategies in all bias evaluation metrics.","pages":"223--228","doi":"10.18653\/v1\/P19-2031","url":"https:\/\/www.aclweb.org\/anthology\/P19-2031","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2032","title":"Automatic Generation of Personalized Comment Based on User Profile","authors":["Zeng, Wenhuan","Abuduweili, Abulikemu","Li, Lei","Yang, Pengcheng"],"emails":["zengwenhuan@pku.edu.cn","tobiaslee@foxmail.com","abduwali@pku.edu.cn","pc@pku.edu.cn"],"author_id":["wenhuan-zeng","abulikemu-abuduweili","lei-li","pengcheng-yang"],"abstract":"Comments on social media are very diverse, in terms of content, style and vocabulary, which make generating comments much more challenging than other existing natural language generation (NLG) tasks. Besides, since different user has different expression habits, it is necessary to take the user{'}s profile into consideration when generating comments. In this paper, we introduce the task of automatic generation of personalized comment (AGPC) for social media. Based on tens of thousands of users{'} real comments and corresponding user profiles on weibo, we propose Personalized Comment Generation Network (PCGN) for AGPC. The model utilizes user feature embedding with a gated memory and attends to user description to model personality of users. In addition, external user representation is taken into consideration during the decoding to enhance the comments generation. Experimental results show that our model can generate natural, human-like and personalized comments.","pages":"229--235","doi":"10.18653\/v1\/P19-2032","url":"https:\/\/www.aclweb.org\/anthology\/P19-2032","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2033","title":"From Bilingual to Multilingual Neural Machine Translation by Incremental Training","authors":["Escolano, Carlos","Costa-juss{\\`a}, Marta R.","Fonollosa, Jos{\\'e} A. R."],"emails":["carlos.escolano@upc.edu","marta.ruiz@upc.edu","jose.fonollosa@upc.edu"],"author_id":["carlos-escolano","marta-r-costa-jussa","jose-a-r-fonollosa"],"abstract":"Multilingual Neural Machine Translation approaches are based on the use of task specific models and the addition of one more language can only be done by retraining the whole system. In this work, we propose a new training schedule that allows the system to scale to more languages without modification of the previous components based on joint training and language-independent encoder\/decoder modules allowing for zero-shot translation. This work in progress shows close results to state-of-the-art in the WMT task.","pages":"236--242","doi":"10.18653\/v1\/P19-2033","url":"https:\/\/www.aclweb.org\/anthology\/P19-2033","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2034","title":"{STRASS}: A Light and Effective Method for Extractive Summarization Based on Sentence Embeddings","authors":["Bouscarrat, L{\\'e}o","Bonnefoy, Antoine","Peel, Thomas","Pereira, C{\\'e}cile"],"emails":["leo.bouscarrat@euranova.eu","antoine.bonnefoy@euranova.eu","thomas.peel@euranova.eu","cecile.pereira@euranova.eu"],"author_id":["leo-bouscarrat","antoine-bonnefoy","thomas-peel","cecile-pereira"],"abstract":"This paper introduces STRASS: Summarization by TRAnsformation Selection and Scoring. It is an extractive text summarization method which leverages the semantic information in existing sentence embedding spaces. Our method creates an extractive summary by selecting the sentences with the closest embeddings to the document embedding. The model earns a transformation of the document embedding to minimize the similarity between the extractive summary and the ground truth summary. As the transformation is only composed of a dense layer, the training can be done on CPU, therefore, inexpensive. Moreover, inference time is short and linear according to the number of sentences. As a second contribution, we introduce the French CASS dataset, composed of judgments from the French Court of cassation and their corresponding summaries. On this dataset, our results show that our method performs similarly to the state of the art extractive methods with effective training and inferring time.","pages":"243--252","doi":"10.18653\/v1\/P19-2034","url":"https:\/\/www.aclweb.org\/anthology\/P19-2034","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2035","title":"Attention and Lexicon Regularized {LSTM} for Aspect-based Sentiment Analysis","authors":["Bao, Lingxian","Lambert, Patrik","Badia, Toni"],"emails":["lingxian.bao@upf.edu","patrik.lambert@upf.edu","toni.badia@upf.edu"],"author_id":["lingxian-bao","patrik-lambert","toni-badia"],"abstract":"Abstract Attention based deep learning systems have been demonstrated to be the state of the art approach for aspect-level sentiment analysis, however, end-to-end deep neural networks lack flexibility as one can not easily adjust the network to fix an obvious problem, especially when more training data is not available: e.g. when it always predicts \\textit{positive} when seeing the word \\textit{disappointed}. Meanwhile, it is less stressed that attention mechanism is likely to {``}over-focus{''} on particular parts of a sentence, while ignoring positions which provide key information for judging the polarity. In this paper, we describe a simple yet effective approach to leverage lexicon information so that the model becomes more flexible and robust. We also explore the effect of regularizing attention vectors to allow the network to have a broader {``}focus{''} on different parts of the sentence. The experimental results demonstrate the effectiveness of our approach.","pages":"253--259","doi":"10.18653\/v1\/P19-2035","url":"https:\/\/www.aclweb.org\/anthology\/P19-2035","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2036","title":"Controllable Text Simplification with Lexical Constraint Loss","authors":["Nishihara, Daiki","Kajiwara, Tomoyuki","Arase, Yuki"],"emails":["nishihara.daiki@ist.osaka-u.ac.jp","kajiwara@ids.osaka-u.ac.jp","arase@ist.osaka-u.ac.jp"],"author_id":["daiki-nishihara","tomoyuki-kajiwara","yuki-arase"],"abstract":"We propose a method to control the level of a sentence in a text simplification task. Text simplification is a monolingual translation task translating a complex sentence into a simpler and easier to understand the alternative. In this study, we use the grade level of the US education system as the level of the sentence. Our text simplification method succeeds in translating an input into a specific grade level by considering levels of both sentences and words. Sentence level is considered by adding the target grade level as input. By contrast, the word level is considered by adding weights to the training loss based on words that frequently appear in sentences of the desired grade level. Although existing models that consider only the sentence level may control the syntactic complexity, they tend to generate words beyond the target level. Our approach can control both the lexical and syntactic complexity and achieve an aggressive rewriting. Experiment results indicate that the proposed method improves the metrics of both BLEU and SARI.","pages":"260--266","doi":"10.18653\/v1\/P19-2036","url":"https:\/\/www.aclweb.org\/anthology\/P19-2036","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2037","title":"Normalizing Non-canonical {T}urkish Texts Using Machine Translation Approaches","authors":["{\\c{C}}olako{\\u{g}}lu, Talha","Sulubacak, Umut","Tantu{\\u{g}}, Ahmet C{\\\"u}neyd"],"emails":["colakoglut@itu.edu.tr","umut.sulubacak@helsinki.fi","tantug@itu.edu.tr"],"author_id":["talha-colakoglu","umut-sulubacak","ahmet-cuneyd-tantug"],"abstract":"With the growth of the social web, user-generated text data has reached unprecedented sizes. Non-canonical text normalization provides a way to exploit this as a practical source of training data for language processing systems. The state of the art in Turkish text normalization is composed of a token level pipeline of modules, heavily dependent on external linguistic resources and manually defined rules. Instead, we propose a fully automated, context-aware machine translation approach with fewer stages of processing. Experiments with various implementations of our approach show that we are able to surpass the current best-performing system by a large margin.","pages":"267--272","doi":"10.18653\/v1\/P19-2037","url":"https:\/\/www.aclweb.org\/anthology\/P19-2037","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2038","title":"{ARHN}et - Leveraging Community Interaction for Detection of Religious Hate Speech in {A}rabic","authors":["Ghosh Chowdhury, Arijit","Didolkar, Aniket","Sawhney, Ramit","Shah, Rajiv Ratn"],"emails":["arijit10@gmail.com","adidolkar123@gmail.com","ramits.co@nsit.net.in","rajivratn@iiitd.ac.in"],"author_id":["arijit-ghosh-chowdhury","aniket-didolkar","ramit-sawhney","rajiv-shah"],"abstract":"The rapid widespread of social media has lead to some undesirable consequences like the rapid increase of hateful content and offensive language. Religious Hate Speech, in particular, often leads to unrest and sometimes aggravates to violence against people on the basis of their religious affiliations. The richness of the Arabic morphology and the limited available resources makes this task especially challenging. The current state-of-the-art approaches to detect hate speech in Arabic rely entirely on textual (lexical and semantic) cues. Our proposed methodology contends that leveraging Community-Interaction can better help us profile hate speech content on social media. Our proposed ARHNet (Arabic Religious Hate Speech Net) model incorporates both Arabic Word Embeddings and Social Network Graphs for the detection of religious hate speech.","pages":"273--280","doi":"10.18653\/v1\/P19-2038","url":"https:\/\/www.aclweb.org\/anthology\/P19-2038","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2039","title":"Investigating Political Herd Mentality: A Community Sentiment Based Approach","authors":["Bhavan, Anjali","Mishra, Rohan","Sinha, Pradyumna Prakhar","Sawhney, Ramit","Shah, Rajiv Ratn"],"emails":["anjalibhavan98@gmail.com","rohan.mishra1997@gmail.com","pradyumna014@gmail.com","ramits.co@nsit.net.in","rajivratn@iiitd.ac.in"],"author_id":["anjali-bhavan","rohan-mishra","pradyumna-prakhar-sinha","ramit-sawhney","rajiv-shah"],"abstract":"Analyzing polarities and sentiments inherent in political speeches and debates poses an important problem today. This experiment aims to address this issue by analyzing publicly-available Hansard transcripts of the debates conducted in the UK Parliament. Our proposed approach, which uses community-based graph information to augment hand-crafted features based on topic modeling and emotion detection on debate transcripts, currently surpasses the benchmark results on the same dataset. Such sentiment classification systems could prove to be of great use in today{'}s politically turbulent times, for public knowledge of politicians{'} stands on various relevant issues proves vital for good governance and citizenship. The experiments also demonstrate that continuous feature representations learned from graphs can improve performance on sentiment classification tasks significantly.","pages":"281--287","doi":"10.18653\/v1\/P19-2039","url":"https:\/\/www.aclweb.org\/anthology\/P19-2039","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2040","title":"Transfer Learning Based Free-Form Speech Command Classification for Low-Resource Languages","authors":["Karunanayake, Yohan","Thayasivam, Uthayasanker","Ranathunga, Surangika"],"emails":["yohan.13@cse.mrt.ac.lk","rtuthaya@uom.lk","surangikar@uom.lk"],"author_id":["yohan-karunanayake","uthayasanker-thayasivam","surangika-ranathunga"],"abstract":"Current state-of-the-art speech-based user interfaces use data intense methodologies to recognize free-form speech commands. However, this is not viable for low-resource languages, which lack speech data. This restricts the usability of such interfaces to a limited number of languages. In this paper, we propose a methodology to develop a robust domain-specific speech command classification system for low-resource languages using speech data of a high-resource language. In this transfer learning-based approach, we used a Convolution Neural Network (CNN) to identify a fixed set of intents using an ASR-based character probability map. We were able to achieve significant results for Sinhala and Tamil datasets using an English based ASR, which attests the robustness of the proposed approach.","pages":"288--294","doi":"10.18653\/v1\/P19-2040","url":"https:\/\/www.aclweb.org\/anthology\/P19-2040","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2041","title":"Embedding Strategies for Specialized Domains: Application to Clinical Entity Recognition","authors":["El Boukkouri, Hicham","Ferret, Olivier","Lavergne, Thomas","Zweigenbaum, Pierre"],"emails":["elboukkouri@limsi.fr","olivier.ferret@cea.fr","lavergne@limsi.fr","pz@limsi.fr"],"author_id":["hicham-el-boukkouri","olivier-ferret","thomas-lavergne","pierre-zweigenbaum"],"abstract":"Using pre-trained word embeddings in conjunction with Deep Learning models has become the {``}de facto{''} approach in Natural Language Processing (NLP). While this usually yields satisfactory results, off-the-shelf word embeddings tend to perform poorly on texts from specialized domains such as clinical reports. Moreover, training specialized word representations from scratch is often either impossible or ineffective due to the lack of large enough in-domain data. In this work, we focus on the clinical domain for which we study embedding strategies that rely on general-domain resources only. We show that by combining off-the-shelf contextual embeddings (ELMo) with static word2vec embeddings trained on a small in-domain corpus built from the task data, we manage to reach and sometimes outperform representations learned from a large corpus in the medical domain.","pages":"295--301","doi":"10.18653\/v1\/P19-2041","url":"https:\/\/www.aclweb.org\/anthology\/P19-2041","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2042","title":"Enriching Neural Models with Targeted Features for Dementia Detection","authors":["Di Palo, Flavio","Parde, Natalie"],"emails":["fdipal2@uic.edu","parde@uic.edu"],"author_id":["flavio-di-palo","natalie-parde"],"abstract":"Alzheimers disease is an irreversible brain disease that slowly destroys memory skills andthinking skills leading to the need for full-time care. Early detection of Alzheimer{'}s dis-ease is fundamental to slow down the progress of the disease. In this work we are developing Natural Language Processing techniques to detect linguistic characteristics of patients suffering Alzheimer{'}s Disease and related Dementias. We are proposing a neural model based on a CNN-LSTM architecture that is able to take in consideration both long language samples and hand-crafted linguistic features to distinguish between dementia affected and healthy patients. We are exploring the effects of the introduction of an attention mechanism on both our model and the actual state of the art. Our approach is able to set a new state-of-the art on the DementiaBank dataset achieving an F1 Score of 0.929 in the Dementia patients classification Supplementary material include code to run the experiments.","pages":"302--308","doi":"10.18653\/v1\/P19-2042","url":"https:\/\/www.aclweb.org\/anthology\/P19-2042","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2043","title":"{E}nglish-{I}ndonesian Neural Machine Translation for Spoken Language Domains","authors":["Dwiastuti, Meisyarah"],"emails":["meisyarah.dwiastuti@gmail.com"],"author_id":["meisyarah-dwiastuti"],"abstract":"In this work, we conduct a study on Neural Machine Translation (NMT) for English-Indonesian (EN-ID) and Indonesian-English (ID-EN). We focus on spoken language domains, namely colloquial and speech languages. We build NMT systems using the Transformer model for both translation directions and implement domain adaptation, in which we train our pre-trained NMT systems on speech language (in-domain) data. Moreover, we conduct an evaluation on how the domain-adaptation method in our EN-ID system can result in more formal translation outputs.","pages":"309--314","doi":"10.18653\/v1\/P19-2043","url":"https:\/\/www.aclweb.org\/anthology\/P19-2043","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2044","title":"Improving Neural Entity Disambiguation with Graph Embeddings","authors":["Sevgili, {\\\"O}zge","Panchenko, Alexander","Biemann, Chris"],"emails":["sevgili@informatik.uni-hamburg.de","panchenko@informatik.uni-hamburg.de","biemann@informatik.uni-hamburg.de"],"author_id":["ozge-sevgili","alexander-panchenko","chris-biemann"],"abstract":"Entity Disambiguation (ED) is the task of linking an ambiguous entity mention to a corresponding entry in a knowledge base. Current methods have mostly focused on unstructured text data to learn representations of entities, however, there is structured information in the knowledge base itself that should be useful to disambiguate entities. In this work, we propose a method that uses graph embeddings for integrating structured information from the knowledge base with unstructured information from text-based representations. Our experiments confirm that graph embeddings trained on a graph of hyperlinks between Wikipedia articles improve the performances of simple feed-forward neural ED model and a state-of-the-art neural ED system.","pages":"315--322","doi":"10.18653\/v1\/P19-2044","url":"https:\/\/www.aclweb.org\/anthology\/P19-2044","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2045","title":"Hierarchical Multi-label Classification of Text with Capsule Networks","authors":["Aly, Rami","Remus, Steffen","Biemann, Chris"],"emails":["5aly@informatik.uni-hamburg.de","remus@informatik.uni-hamburg.de","biemann@informatik.uni-hamburg.de"],"author_id":["rami-aly","steffen-remus","chris-biemann"],"abstract":"Capsule networks have been shown to demonstrate good performance on structured data in the area of visual inference. In this paper we apply and compare simple shallow capsule networks for hierarchical multi-label text classification and show that they can perform superior to other neural networks, such as CNNs and LSTMs, and non-neural network architectures such as SVMs. For our experiments, we use the established Web of Science (WOS) dataset and introduce a new real-world scenario dataset, the BlurbGenreCollection (BGC). Our results confirm the hypothesis that capsule networks are especially advantageous for rare events and structurally diverse categories, which we attribute to their ability to combine latent encoded information.","pages":"323--330","doi":"10.18653\/v1\/P19-2045","url":"https:\/\/www.aclweb.org\/anthology\/P19-2045","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2046","title":"Convolutional Neural Networks for Financial Text Regression","authors":["Dereli, Ne{\\c{s}}at","Saraclar, Murat"],"emails":["nesat.dereli@boun.edu.tr","murat.saraclar@boun.edu.tr"],"author_id":["nesat-dereli","murat-saraclar"],"abstract":"Forecasting financial volatility of a publicly-traded company from its annual reports has been previously defined as a text regression problem. Recent studies use a manually labeled lexicon to filter the annual reports by keeping sentiment words only. In order to remove the lexicon dependency without decreasing the performance, we replace bag-of-words model word features by word embedding vectors. Using word vectors increases the number of parameters. Considering the increase in number of parameters and excessive lengths of annual reports, a convolutional neural network model is proposed and transfer learning is applied. Experimental results show that the convolutional neural network model provides more accurate volatility predictions than lexicon based models.","pages":"331--337","doi":"10.18653\/v1\/P19-2046","url":"https:\/\/www.aclweb.org\/anthology\/P19-2046","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2047","title":"Sentiment Analysis on Naija-Tweets","authors":["Kolajo, Taiwo","Daramola, Olawande","Adebiyi, Ayodele"],"emails":["","",""],"author_id":["taiwo-kolajo","olawande-daramola","ayodele-adebiyi"],"abstract":"Examining sentiments in social media poses a challenge to natural language processing because of the intricacy and variability in the dialect articulation, noisy terms in form of slang, abbreviation, acronym, emoticon, and spelling error coupled with the availability of real-time content. Moreover, most of the knowledge-based approaches for resolving slang, abbreviation, and acronym do not consider the issue of ambiguity that evolves in the usage of these noisy terms. This research work proposes an improved framework for social media feed pre-processing that leverages on the combination of integrated local knowledge bases and adapted Lesk algorithm to facilitate pre-processing of social media feeds. The results from the experimental evaluation revealed an improvement over existing methods when applied to supervised learning algorithms in the task of extracting sentiments from Nigeria-origin tweets with an accuracy of 99.17{\\%}.","pages":"338--343","doi":"10.18653\/v1\/P19-2047","url":"https:\/\/www.aclweb.org\/anthology\/P19-2047","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2048","title":"Fact or Factitious? Contextualized Opinion Spam Detection","authors":["Kennedy, Stefan","Walsh, Niall","Sloka, Kirils","McCarren, Andrew","Foster, Jennifer"],"emails":["15902803@mail.dcu.ie","15384141@mail.dcu.ie","13405888@mail.dcu.ie","","oster@dcu.ie"],"author_id":["stefan-kennedy","niall-walsh","kirils-sloka","andrew-mccarren","jennifer-foster"],"abstract":"In this paper we perform an analytic comparison of a number of techniques used to detect fake and deceptive online reviews. We apply a number machine learning approaches found to be effective, and introduce our own approach by fine-tuning state of the art contextualised embeddings. The results we obtain show the potential of contextualised embeddings for fake review detection, and lay the groundwork for future research in this area.","pages":"344--350","doi":"10.18653\/v1\/P19-2048","url":"https:\/\/www.aclweb.org\/anthology\/P19-2048","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2049","title":"Scheduled Sampling for Transformers","authors":["Mihaylova, Tsvetomila","Martins, Andr{\\'e} F. T."],"emails":["tsvetomila.mihaylova@lx.it.pt","andre.martins@unbabel.com"],"author_id":["tsvetomila-mihaylova","andre-f-t-martins"],"abstract":"Scheduled sampling is a technique for avoiding one of the known problems in sequence-to-sequence generation: exposure bias. It consists of feeding the model a mix of the teacher forced embeddings and the model predictions from the previous step in training time. The technique has been used for improving model performance with recurrent neural networks (RNN). In the Transformer model, unlike the RNN, the generation of a new word attends to the full sentence generated so far, not only to the last word, and it is not straightforward to apply the scheduled sampling technique. We propose some structural changes to allow scheduled sampling to be applied to Transformer architectures, via a two-pass decoding strategy. Experiments on two language pairs achieve performance close to a teacher-forcing baseline and show that this technique is promising for further exploration.","pages":"351--356","doi":"10.18653\/v1\/P19-2049","url":"https:\/\/www.aclweb.org\/anthology\/P19-2049","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2050","title":"{BREAKING}! Presenting Fake News Corpus for Automated Fact Checking","authors":["Pathak, Archita","Srihari, Rohini"],"emails":["architap@buffalo.edu","rohini@buffalo.edu"],"author_id":["archita-pathak","rohini-k-srihari"],"abstract":"Popular fake news articles spread faster than mainstream articles on the same topic which renders manual fact checking inefficient. At the same time, creating tools for automatic detection is as challenging due to lack of dataset containing articles which present fake or manipulated stories as compelling facts. In this paper, we introduce manually verified corpus of compelling fake and questionable news articles on the USA politics, containing around 700 articles from Aug-Nov, 2016. We present various analyses on this corpus and finally implement classification model based on linguistic features. This work is still in progress as we plan to extend the dataset in the future and use it for our approach towards automated fake news detection.","pages":"357--362","doi":"10.18653\/v1\/P19-2050","url":"https:\/\/www.aclweb.org\/anthology\/P19-2050","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2051","title":"Cross-domain and Cross-lingual Abusive Language Detection: A Hybrid Approach with Deep Learning and a Multilingual Lexicon","authors":["Pamungkas, Endang Wahyu","Patti, Viviana"],"emails":["pamungka@di.unito.it","patti@di.unito.it"],"author_id":["endang-wahyu-pamungkas","viviana-patti"],"abstract":"The development of computational methods to detect abusive language in social media within variable and multilingual contexts has recently gained significant traction. The growing interest is confirmed by the large number of benchmark corpora for different languages developed in the latest years. However, abusive language behaviour is multifaceted and available datasets are featured by different topical focuses. This makes abusive language detection a domain-dependent task, and building a robust system to detect general abusive content a first challenge. Moreover, most resources are available for English, which makes detecting abusive language in low-resource languages a further challenge. We address both challenges by considering ten publicly available datasets across different domains and languages. A hybrid approach with deep learning and a multilingual lexicon to cross-domain and cross-lingual detection of abusive content is proposed and compared with other simpler models. We show that training a system on general abusive language datasets will produce a cross-domain robust system, which can be used to detect other more specific types of abusive content. We also found that using the domain-independent lexicon HurtLex is useful to transfer knowledge between domains and languages. In the cross-lingual experiment, we demonstrate the effectiveness of our jointlearning model also in out-domain scenarios.","pages":"363--370","doi":"10.18653\/v1\/P19-2051","url":"https:\/\/www.aclweb.org\/anthology\/P19-2051","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2052","title":"De-Mixing Sentiment from Code-Mixed Text","authors":["Lal, Yash Kumar","Kumar, Vaibhav","Dhar, Mrinal","Shrivastava, Manish","Koehn, Philipp"],"emails":["yash@jhu.edu","vaibhav2@andrew.cmu.edu","mrinaldhar@gmail.com","manish.shrivastava@iiit.ac.in","phi@jhu.edu"],"author_id":["yash-kumar-lal","vaibhav-kumar","mrinal-dhar","manish-shrivastava","philipp-koehn"],"abstract":"Code-mixing is the phenomenon of mixing the vocabulary and syntax of multiple languages in the same sentence. It is an increasingly common occurrence in today{'}s multilingual society and poses a big challenge when encountered in different downstream tasks. In this paper, we present a hybrid architecture for the task of Sentiment Analysis of English-Hindi code-mixed data. Our method consists of three components, each seeking to alleviate different issues. We first generate subword level representations for the sentences using a CNN architecture. The generated representations are used as inputs to a Dual Encoder Network which consists of two different BiLSTMs - the Collective and Specific Encoder. The Collective Encoder captures the overall sentiment of the sentence, while the Specific Encoder utilizes an attention mechanism in order to focus on individual sentiment-bearing sub-words. This, combined with a Feature Network consisting of orthographic features and specially trained word embeddings, achieves state-of-the-art results - 83.54{\\%} accuracy and 0.827 F1 score - on a benchmark dataset.","pages":"371--377","doi":"10.18653\/v1\/P19-2052","url":"https:\/\/www.aclweb.org\/anthology\/P19-2052","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2053","title":"Unsupervised Learning of Discourse-Aware Text Representation for Essay Scoring","authors":["Mim, Farjana Sultana","Inoue, Naoya","Reisert, Paul","Ouchi, Hiroki","Inui, Kentaro"],"emails":["mim@ecei.tohoku.ac.jp","naoya-i@ecei.tohoku.ac.jp","paul.reisert@riken.jp","hiroki.ouchi@riken.jp","inui@ecei.tohoku.ac.jp"],"author_id":["farjana-sultana-mim","naoya-inoue","paul-reisert","hiroki-ouchi","kentaro-inui"],"abstract":"Existing document embedding approaches mainly focus on capturing sequences of words in documents. However, some document classification and regression tasks such as essay scoring need to consider discourse structure of documents. Although some prior approaches consider this issue and utilize discourse structure of text for document classification, these approaches are dependent on computationally expensive parsers. In this paper, we propose an unsupervised approach to capture discourse structure in terms of coherence and cohesion for document embedding that does not require any expensive parser or annotation. Extrinsic evaluation results show that the document representation obtained from our approach improves the performance of essay Organization scoring and Argument Strength scoring.","pages":"378--385","doi":"10.18653\/v1\/P19-2053","url":"https:\/\/www.aclweb.org\/anthology\/P19-2053","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2054","title":"Multimodal Logical Inference System for Visual-Textual Entailment","authors":["Suzuki, Riko","Yanaka, Hitomi","Yoshikawa, Masashi","Mineshima, Koji","Bekki, Daisuke"],"emails":["suzuki.riko@is.ocha.ac.jp","hitomi.yanaka@riken.jp","yh8@is.naist.jp","mineshima.koji@ocha.ac.jp","bekki@is.ocha.ac.jp"],"author_id":["riko-suzuki","hitomi-yanaka","masashi-yoshikawa","koji-mineshima","daisuke-bekki"],"abstract":"A large amount of research about multimodal inference across text and vision has been recently developed to obtain visually grounded word and sentence representations. In this paper, we use logic-based representations as unified meaning representations for texts and images and present an unsupervised multimodal logical inference system that can effectively prove entailment relations between them. We show that by combining semantic parsing and theorem proving, the system can handle semantically complex sentences for visual-textual inference.","pages":"386--392","doi":"10.18653\/v1\/P19-2054","url":"https:\/\/www.aclweb.org\/anthology\/P19-2054","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2055","title":"Deep Neural Models for Medical Concept Normalization in User-Generated Texts","authors":["Miftahutdinov, Zulfat","Tutubalina, Elena"],"emails":["zulfatmi@gmail.com","elvtutubalina@kpfu.ru"],"author_id":["zulfat-miftahutdinov","elena-tutubalina"],"abstract":"In this work, we consider the medical concept normalization problem, i.e., the problem of mapping a health-related entity mention in a free-form text to a concept in a controlled vocabulary, usually to the standard thesaurus in the Unified Medical Language System (UMLS). This is a challenging task since medical terminology is very different when coming from health care professionals or from the general public in the form of social media texts. We approach it as a sequence learning problem with powerful neural networks such as recurrent neural networks and contextualized word representation models trained to obtain semantic representations of social media expressions. Our experimental evaluation over three different benchmarks shows that neural architectures leverage the semantic meaning of the entity mention and significantly outperform existing state of the art models.","pages":"393--399","doi":"10.18653\/v1\/P19-2055","url":"https:\/\/www.aclweb.org\/anthology\/P19-2055","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2056","title":"Using Semantic Similarity as Reward for Reinforcement Learning in Sentence Generation","authors":["Yasui, Go","Tsuruoka, Yoshimasa","Nagata, Masaaki"],"emails":["gyasui@logos.t.u-tokyo.ac.jp","tsuruoka@logos.t.u-tokyo.ac.jp","masaaki.nagata.et@hco.ntt.co.jp"],"author_id":["go-yasui","yoshimasa-tsuruoka","masaaki-nagata"],"abstract":"Traditional model training for sentence generation employs cross-entropy loss as the loss function. While cross-entropy loss has convenient properties for supervised learning, it is unable to evaluate sentences as a whole, and lacks flexibility. We present the approach of training the generation model using the estimated semantic similarity between the output and reference sentences to alleviate the problems faced by the training with cross-entropy loss. We use the BERT-based scorer fine-tuned to the Semantic Textual Similarity (STS) task for semantic similarity estimation, and train the model with the estimated scores through reinforcement learning (RL). Our experiments show that reinforcement learning with semantic similarity reward improves the BLEU scores from the baseline LSTM NMT model.","pages":"400--406","doi":"10.18653\/v1\/P19-2056","url":"https:\/\/www.aclweb.org\/anthology\/P19-2056","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2057","title":"Sentiment Classification Using Document Embeddings Trained with Cosine Similarity","authors":["Thongtan, Tan","Phienthrakul, Tanasanee"],"emails":["tan.thongtan1@gmail.com","tanasanee.phi@mahidol.ac.th"],"author_id":["tan-thongtan","tanasanee-phienthrakul"],"abstract":"In document-level sentiment classification, each document must be mapped to a fixed length vector. Document embedding models map each document to a dense, low-dimensional vector in continuous vector space. This paper proposes training document embeddings using cosine similarity instead of dot product. Experiments on the IMDB dataset show that accuracy is improved when using cosine similarity compared to using dot product, while using feature combination with Naive Bayes weighted bag of n-grams achieves a new state of the art accuracy of 97.42{\\%}. Code to reproduce all experiments is available at https:\/\/github.com\/tanthongtan\/dv-cosine","pages":"407--414","doi":"10.18653\/v1\/P19-2057","url":"https:\/\/www.aclweb.org\/anthology\/P19-2057","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2058","title":"Detecting Adverse Drug Reactions from Biomedical Texts with Neural Networks","authors":["Alimova, Ilseyar","Tutubalina, Elena"],"emails":["limova@kpfu.ru","elvtutubalina@kpfu.ru"],"author_id":["ilseyar-alimova","elena-tutubalina"],"abstract":"Detection of adverse drug reactions in postapproval periods is a crucial challenge for pharmacology. Social media and electronic clinical reports are becoming increasingly popular as a source for obtaining health related information. In this work, we focus on extraction information of adverse drug reactions from various sources of biomedical textbased information, including biomedical literature and social media. We formulate the problem as a binary classification task and compare the performance of four state-of-the-art attention-based neural networks in terms of the F-measure. We show the effectiveness of these methods on four different benchmarks.","pages":"415--421","doi":"10.18653\/v1\/P19-2058","url":"https:\/\/www.aclweb.org\/anthology\/P19-2058","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2059","title":"Annotating and Analyzing Semantic Role of Elementary Units and Relations in Online Persuasive Arguments","authors":["Egawa, Ryo","Morio, Gaku","Fujita, Katsuhide"],"emails":["egawa@katfuji.lab.tuat.ac.jp","","katfuji@cc.tuat.ac.jp"],"author_id":["ryo-egawa","gaku-morio","katsuhide-fujita"],"abstract":"For analyzing online persuasions, one of the important goals is to semantically understand how people construct comments to persuade others. However, analyzing the semantic role of arguments for online persuasion has been less emphasized. Therefore, in this study, we propose a novel annotation scheme that captures the semantic role of arguments in a popular online persuasion forum, so-called ChangeMyView. Through this study, we have made the following contributions: (i) proposing a scheme that includes five types of elementary units (EUs) and two types of relations. (ii) annotating ChangeMyView which results in 4612 EUs and 2713 relations in 345 posts. (iii) analyzing the semantic role of persuasive arguments. Our analyses captured certain characteristic phenomena for online persuasion.","pages":"422--428","doi":"10.18653\/v1\/P19-2059","url":"https:\/\/www.aclweb.org\/anthology\/P19-2059","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"},{"id":"P19-2060","title":"A {J}apanese Word Segmentation Proposal","authors":["Aguirre, Stalin","Aguiar, Josaf{\\'a}"],"emails":["stalin.aguirre@epn.edu.ec","josafa.aguiar@epn.edu.ec"],"author_id":["stalin-aguirre","josafa-aguiar"],"abstract":"Current Japanese word segmentation methods, that use a morpheme-based approach, may produce different segmentations for the same strings. This occurs when these strings appear in different sentences. The cause is the influence of different contexts around these strings affecting the probabilistic models used in segmentation algorithms. This paper presents an alternative to the current morpheme-based scheme for Japanese word segmentation. The proposed scheme focuses on segmenting inflections as single words instead of separating the auxiliary verbs and other morphemes from the stems. Some morphological segmentation rules are presented for each type of word and these rules are implemented in a program which is properly described. The program is used to generate a segmentation of a sentence corpus, whose consistency is calculated and compared with the current morpheme-based segmentation of the same corpus. The experiments show that this method produces a much more consistent segmentation than the morpheme-based one.","pages":"429--435","doi":"10.18653\/v1\/P19-2060","url":"https:\/\/www.aclweb.org\/anthology\/P19-2060","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"July","booktitle":"Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop"}]