[{"id":"S17-1001","title":"What Analogies Reveal about Word Vectors and their Compositionality","authors":["Finley, Gregory","Farmer, Stephanie","Pakhomov, Serguei"],"emails":["gregpfinley@gmail.com","sfarmer@macalester.edu","pakh0002@umn.edu"],"author_id":["gregory-finley","stephanie-farmer","serguei-pakhomov"],"abstract":"Analogy completion via vector arithmetic has become a common means of demonstrating the compositionality of word embeddings. Previous work have shown that this strategy works more reliably for certain types of analogical word relationships than for others, but these studies have not offered a convincing account for why this is the case. We arrive at such an account through an experiment that targets a wide variety of analogy questions and defines a baseline condition to more accurately measure the efficacy of our system. We find that the most reliably solvable analogy categories involve either 1) the application of a morpheme with clear syntactic effects, 2) male{--}female alternations, or 3) named entities. These broader types do not pattern cleanly along a syntactic{--}semantic divide. We suggest instead that their commonality is distributional, in that the difference between the distributions of two words in any given pair encompasses a relatively small number of word types. Our study offers a needed explanation for why analogy tests succeed and fail where they do and provides nuanced insight into the relationship between word distributions and the theoretical linguistic domains of syntax and semantics.","pages":"1--11","doi":"10.18653\/v1\/S17-1001","url":"https:\/\/www.aclweb.org\/anthology\/S17-1001","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1002","title":"Learning Antonyms with Paraphrases and a Morphology-Aware Neural Network","authors":["Rajana, Sneha","Callison-Burch, Chris","Apidianaki, Marianna","Shwartz, Vered"],"emails":["srajana@seas.upenn.edu","ccb@seas.upenn.edu","marapi@seas.upenn.edu","vered1986@gmail.com"],"author_id":["sneha-rajana","chris-callison-burch","marianna-apidianaki","vered-shwartz"],"abstract":"Recognizing and distinguishing antonyms from other types of semantic relations is an essential part of language understanding systems. In this paper, we present a novel method for deriving antonym pairs using paraphrase pairs containing negation markers. We further propose a neural network model, AntNET, that integrates morphological features indicative of antonymy into a path-based relation detection algorithm. We demonstrate that our model outperforms state-of-the-art models in distinguishing antonyms from other semantic relations and is capable of efficiently handling multi-word expressions.","pages":"12--21","doi":"10.18653\/v1\/S17-1002","url":"https:\/\/www.aclweb.org\/anthology\/S17-1002","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1003","title":"Decoding Sentiment from Distributed Representations of Sentences","authors":["Ponti, Edoardo Maria","Vuli{\\'c}, Ivan","Korhonen, Anna"],"emails":["ep490@cam.ac.uk","iv250@cam.ac.uk","alk23@cam.ac.uk"],"author_id":["edoardo-maria-ponti","ivan-vulic","anna-korhonen"],"abstract":"Distributed representations of sentences have been developed recently to represent their meaning as real-valued vectors. However, it is not clear how much information such representations retain about the polarity of sentences. To study this question, we decode sentiment from unsupervised sentence representations learned with different architectures (sensitive to the order of words, the order of sentences, or none) in 9 typologically diverse languages. Sentiment results from the (recursive) composition of lexical items and grammatical strategies such as negation and concession. The results are manifold: we show that there is no {`}one-size-fits-all{'} representation architecture outperforming the others across the board. Rather, the top-ranking architectures depend on the language at hand. Moreover, we find that in several cases the additive composition model based on skip-gram word vectors may surpass supervised state-of-art architectures such as bi-directional LSTMs. Finally, we provide a possible explanation of the observed variation based on the type of negative constructions in each language.","pages":"22--32","doi":"10.18653\/v1\/S17-1003","url":"https:\/\/www.aclweb.org\/anthology\/S17-1003","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1004","title":"Detecting Asymmetric Semantic Relations in Context: A Case-Study on Hypernymy Detection","authors":["Vyas, Yogarshi","Carpuat, Marine"],"emails":["yogarshi@cs.umd.edu","marine@cs.umd.edu"],"author_id":["yogarshi-vyas","marine-carpuat"],"abstract":"We introduce WHiC, a challenging testbed for detecting hypernymy, an asymmetric relation between words. While previous work has focused on detecting hypernymy between word types, we ground the meaning of words in specific contexts drawn from WordNet examples, and require predictions to be sensitive to changes in contexts. WHiC lets us analyze complementary properties of two approaches of inducing vector representations of word meaning in context. We show that such contextualized word representations also improve detection of a wider range of semantic relations in context.","pages":"33--43","doi":"10.18653\/v1\/S17-1004","url":"https:\/\/www.aclweb.org\/anthology\/S17-1004","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1005","title":"Domain-Specific New Words Detection in {C}hinese","authors":["Chen, Ao","Sun, Maosong"],"emails":["chenao3220@gmail.com","sms@mail.tsinghua.edu.cn"],"author_id":["ao-chen","maosong-sun"],"abstract":"With the explosive growth of Internet, more and more domain-specific environments appear, such as forums, blogs, MOOCs and etc. Domain-specific words appear in these areas and always play a critical role in the domain-specific NLP tasks. This paper aims at extracting Chinese domain-specific new words automatically. The extraction of domain-specific new words has two parts including both new words in this domain and the especially important words. In this work, we propose a joint statistical model to perform these two works simultaneously. Compared to traditional new words detection models, our model doesn{'}t need handcraft features which are labor intensive. Experimental results demonstrate that our joint model achieves a better performance compared with the state-of-the-art methods.","pages":"44--53","doi":"10.18653\/v1\/S17-1005","url":"https:\/\/www.aclweb.org\/anthology\/S17-1005","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1006","title":"Deep Learning Models For Multiword Expression Identification","authors":["Gharbieh, Waseem","Bhavsar, Virendrakumar","Cook, Paul"],"emails":["waseem.gharbieh@unb.ca","bhavsar@unb.ca","paul.cook@unb.ca"],"author_id":["waseem-gharbieh","virendrakumar-bhavsar","paul-cook"],"abstract":"Multiword expressions (MWEs) are lexical items that can be decomposed into multiple component words, but have properties that are unpredictable with respect to their component words. In this paper we propose the first deep learning models for token-level identification of MWEs. Specifically, we consider a layered feedforward network, a recurrent neural network, and convolutional neural networks. In experimental results we show that convolutional neural networks are able to outperform the previous state-of-the-art for MWE identification, with a convolutional neural network with three hidden layers giving the best performance.","pages":"54--64","doi":"10.18653\/v1\/S17-1006","url":"https:\/\/www.aclweb.org\/anthology\/S17-1006","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1007","title":"Emotion Intensities in Tweets","authors":["Mohammad, Saif","Bravo-Marquez, Felipe"],"emails":["saif.mohammad@nrc-cnrc.gc.ca","fbravoma@waikato.ac.nz"],"author_id":["saif-mohammad","felipe-bravo-marquez"],"abstract":"This paper examines the task of detecting intensity of emotion from text. We create the first datasets of tweets annotated for anger, fear, joy, and sadness intensities. We use a technique called best{--}worst scaling (BWS) that improves annotation consistency and obtains reliable fine-grained scores. We show that emotion-word hashtags often impact emotion intensity, usually conveying a more intense emotion. Finally, we create a benchmark regression system and conduct experiments to determine: which features are useful for detecting emotion intensity; and, the extent to which two emotions are similar in terms of how they manifest in language.","pages":"65--77","doi":"10.18653\/v1\/S17-1007","url":"https:\/\/www.aclweb.org\/anthology\/S17-1007","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1008","title":"Deep Active Learning for Dialogue Generation","authors":["Asghar, Nabiha","Poupart, Pascal","Jiang, Xin","Li, Hang"],"emails":["nasghar@uwaterloo.ca","ppoupart@uwaterloo.ca","jiang.xin@huawei.com","hangli.hl@huawei.com"],"author_id":["nabiha-asghar","pascal-poupart","xin-jiang","hang-li"],"abstract":"We propose an online, end-to-end, neural generative conversational model for open-domain dialogue. It is trained using a unique combination of offline two-phase supervised learning and online human-in-the-loop active learning. While most existing research proposes offline supervision or hand-crafted reward functions for online reinforcement, we devise a novel interactive learning mechanism based on hamming-diverse beam search for response generation and one-character user-feedback at each step. Experiments show that our model inherently promotes the generation of semantically relevant and interesting responses, and can be used to train agents with customized personas, moods and conversational styles.","pages":"78--83","doi":"10.18653\/v1\/S17-1008","url":"https:\/\/www.aclweb.org\/anthology\/S17-1008","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1009","title":"Mapping the Paraphrase Database to {W}ord{N}et","authors":["Cocos, Anne","Apidianaki, Marianna","Callison-Burch, Chris"],"emails":["acocos@seas.upenn.edu","marapi@seas.upenn.edu","ccb@seas.upenn.edu"],"author_id":["anne-cocos","marianna-apidianaki","chris-callison-burch"],"abstract":"WordNet has facilitated important research in natural language processing but its usefulness is somewhat limited by its relatively small lexical coverage. The Paraphrase Database (PPDB) covers 650 times more words, but lacks the semantic structure of WordNet that would make it more directly useful for downstream tasks. We present a method for mapping words from PPDB to WordNet synsets with 89{\\%} accuracy. The mapping also lays important groundwork for incorporating WordNet{'}s relations into PPDB so as to increase its utility for semantic reasoning in applications.","pages":"84--90","doi":"10.18653\/v1\/S17-1009","url":"https:\/\/www.aclweb.org\/anthology\/S17-1009","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1010","title":"Semantic Frame Labeling with Target-based Neural Model","authors":["Feng, Yukun","Yu, Dong","Xu, Jian","Liu, Chunhua"],"emails":["yudong@blcu.edu.cn","yukunfg@gmail.com","jianxu1@mail.ustc.edu.cn","chunhualiu596@gmail.com"],"author_id":["yukun-feng","dong-yu","jian-xu","chunhua-liu"],"abstract":"This paper explores the automatic learning of distributed representations of the target{'}s context for semantic frame labeling with target-based neural model. We constrain the whole sentence as the model{'}s input without feature extraction from the sentence. This is different from many previous works in which local feature extraction of the targets is widely used. This constraint makes the task harder, especially with long sentences, but also makes our model easily applicable to a range of resources and other similar tasks. We evaluate our model on several resources and get the state-of-the-art result on subtask 2 of SemEval 2015 task 15. Finally, we extend the task to word-sense disambiguation task and we also achieve a strong result in comparison to state-of-the-art work.","pages":"91--96","doi":"10.18653\/v1\/S17-1010","url":"https:\/\/www.aclweb.org\/anthology\/S17-1010","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1011","title":"Frame-Based Continuous Lexical Semantics through Exponential Family Tensor Factorization and Semantic Proto-Roles","authors":["Ferraro, Francis","Poliak, Adam","Cotterell, Ryan","Van Durme, Benjamin"],"emails":["ferraro@cs.jhu.edu","azpoliak@cs.jhu.edu","ryan.cotterell@cs.jhu.edu","vandurme@cs.jhu.edu"],"author_id":["francis-ferraro","adam-poliak","ryan-cotterell","benjamin-van-durme"],"abstract":"We study how different frame annotations complement one another when learning continuous lexical semantics. We learn the representations from a tensorized skip-gram model that consistently encodes syntactic-semantic content better, with multiple 10{\\%} gains over baselines.","pages":"97--103","doi":"10.18653\/v1\/S17-1011","url":"https:\/\/www.aclweb.org\/anthology\/S17-1011","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1012","title":"Distributed Prediction of Relations for Entities: The Easy, The Difficult, and The Impossible","authors":["Gupta, Abhijeet","Boleda, Gemma","Pad{\\'o}, Sebastian"],"emails":["abhijeet.gupta@ims.uni-stuttgart.de","gemma.boleda@upf.edu","pado@ims.uni-stuttgart.de"],"author_id":["abhijeet-gupta","gemma-boleda","sebastian-pado"],"abstract":"Word embeddings are supposed to provide easy access to semantic relations such as {``}male of{''} (man{--}woman). While this claim has been investigated for concepts, little is known about the distributional behavior of relations of (Named) Entities. We describe two word embedding-based models that predict values for relational attributes of entities, and analyse them. The task is challenging, with major performance differences between relations. Contrary to many NLP tasks, high difficulty for a relation does not result from low frequency, but from (a) one-to-many mappings; and (b) lack of context patterns expressing the relation that are easy to pick up by word embeddings.","pages":"104--109","doi":"10.18653\/v1\/S17-1012","url":"https:\/\/www.aclweb.org\/anthology\/S17-1012","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1013","title":"Comparing Approaches for Automatic Question Identification","authors":["Maredia, Angel","Schechtman, Kara","Levitan, Sarah Ita","Hirschberg, Julia"],"emails":["asm2221@columbia.edu","kws2121@columbia.edu","sarahita@cs.columbia.edu","julia@cs.columbia.edu"],"author_id":["angel-maredia","kara-schechtman","sarah-ita-levitan","julia-hirschberg"],"abstract":"Collecting spontaneous speech corpora that are open-ended, yet topically constrained, is increasingly popular for research in spoken dialogue systems and speaker state, inter alia. Typically, these corpora are labeled by human annotators, either in the lab or through crowd-sourcing; however, this is cumbersome and time-consuming for large corpora. We present four different approaches to automatically tagging a corpus when general topics of the conversations are known. We develop these approaches on the Columbia X-Cultural Deception corpus and find accuracy that significantly exceeds the baseline. Finally, we conduct a cross-corpus evaluation by testing the best performing approach on the Columbia\/SRI\/Colorado corpus.","pages":"110--114","doi":"10.18653\/v1\/S17-1013","url":"https:\/\/www.aclweb.org\/anthology\/S17-1013","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1014","title":"Does Free Word Order Hurt? Assessing the Practical Lexical Function Model for {C}roatian","authors":["Medi{\\'c}, Zoran","{\\v{S}}najder, Jan","Pad{\\'o}, Sebastian"],"emails":["zoran.medic@fer.hr","jan.snajder@fer.hr","pado@ims.uni-stuttgart.de"],"author_id":["zoran-medic","jan-snajder","sebastian-pado"],"abstract":"The Practical Lexical Function (PLF) model is a model of computational distributional semantics that attempts to strike a balance between expressivity and learnability in predicting phrase meaning and shows competitive results. We investigate how well the PLF carries over to free word order languages, given that it builds on observations of predicate-argument combinations that are harder to recover in free word order languages. We evaluate variants of the PLF for Croatian, using a new lexical substitution dataset. We find that the PLF works about as well for Croatian as for English, but demonstrate that its strength lies in modeling verbs, and that the free word order affects the less robust PLF variant.","pages":"115--120","doi":"10.18653\/v1\/S17-1014","url":"https:\/\/www.aclweb.org\/anthology\/S17-1014","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1015","title":"A Mixture Model for Learning Multi-Sense Word Embeddings","authors":["Nguyen, Dai Quoc","Nguyen, Dat Quoc","Modi, Ashutosh","Thater, Stefan","Pinkal, Manfred"],"emails":["dat.nguyen@students.mq.edu.au","daiquocn@coli.uni-saarland.de","ashutosh@coli.uni-saarland.de","stth@coli.uni-saarland.de","pinkal@coli.uni-saarland.de"],"author_id":["dat-quoc-nguyen","dai-quoc-nguyen","ashutosh-modi","stefan-thater","manfred-pinkal"],"abstract":"Word embeddings are now a standard technique for inducing meaning representations for words. For getting good representations, it is important to take into account different senses of a word. In this paper, we propose a mixture model for learning multi-sense word embeddings. Our model generalizes the previous works in that it allows to induce different weights of different senses of a word. The experimental results show that our model outperforms previous models on standard evaluation tasks.","pages":"121--127","doi":"10.18653\/v1\/S17-1015","url":"https:\/\/www.aclweb.org\/anthology\/S17-1015","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1016","title":"Aligning Script Events with Narrative Texts","authors":["Ostermann, Simon","Roth, Michael","Thater, Stefan","Pinkal, Manfred"],"emails":["simono@coli.uni-saarland.de","mroth@coli.uni-saarland.de","stth@coli.uni-saarland.de","pinkal@coli.uni-saarland.de"],"author_id":["simon-ostermann","michael-roth","stefan-thater","manfred-pinkal"],"abstract":"Script knowledge plays a central role in text understanding and is relevant for a variety of downstream tasks. In this paper, we consider two recent datasets which provide a rich and general representation of script events in terms of paraphrase sets. We introduce the task of mapping event mentions in narrative texts to such script event types, and present a model for this task that exploits rich linguistic representations as well as information on temporal ordering. The results of our experiments demonstrate that this complex task is indeed feasible.","pages":"128--134","doi":"10.18653\/v1\/S17-1016","url":"https:\/\/www.aclweb.org\/anthology\/S17-1016","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1017","title":"The (too Many) Problems of Analogical Reasoning with Word Vectors","authors":["Rogers, Anna","Drozd, Aleksandr","Li, Bofang"],"emails":["arogers@cs.uml.edu","alex@smg.is.titech.ac.jp","libofang@ruc.edu.cn"],"author_id":["anna-rogers","aleksandr-drozd","bofang-li"],"abstract":"This paper explores the possibilities of analogical reasoning with vector space models. Given two pairs of words with the same relation (e.g. man:woman :: king:queen), it was proposed that the offset between one pair of the corresponding word vectors can be used to identify the unknown member of the other pair (king - man + woman = queen). We argue against such {``}linguistic regularities{''} as a model for linguistic relations in vector space models and as a benchmark, and we show that the vector offset (as well as two other, better-performing methods) suffers from dependence on vector similarity.","pages":"135--148","doi":"10.18653\/v1\/S17-1017","url":"https:\/\/www.aclweb.org\/anthology\/S17-1017","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1018","title":"Semantic Frames and Visual Scenes: Learning Semantic Role Inventories from Image and Video Descriptions","authors":["Shutova, Ekaterina","Wundsam, Andreas","Yannakoudakis, Helen"],"emails":["es407@cam.ac.uk","andi@wundsam.net","hy260@cl.cam.ac.uk"],"author_id":["ekaterina-shutova","andreas-wundsam","helen-yannakoudakis"],"abstract":"Frame-semantic parsing and semantic role labelling, that aim to automatically assign semantic roles to arguments of verbs in a sentence, have become an active strand of research in NLP. However, to date these methods have relied on a predefined inventory of semantic roles. In this paper, we present a method to automatically learn argument role inventories for verbs from large corpora of text, images and videos. We evaluate the method against manually constructed role inventories in FrameNet and show that the visual model outperforms the language-only model and operates with a high precision.","pages":"149--154","doi":"10.18653\/v1\/S17-1018","url":"https:\/\/www.aclweb.org\/anthology\/S17-1018","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1019","title":"Acquiring Predicate Paraphrases from News Tweets","authors":["Shwartz, Vered","Stanovsky, Gabriel","Dagan, Ido"],"emails":["vered1986@gmail.com","gabriel.satanovsky@gmail.com","dagan@cs.biu.ac.il"],"author_id":["vered-shwartz","gabriel-stanovsky","ido-dagan"],"abstract":"We present a simple method for ever-growing extraction of predicate paraphrases from news headlines in Twitter. Analysis of the output of ten weeks of collection shows that the accuracy of paraphrases with different support levels is estimated between 60-86{\\%}. We also demonstrate that our resource is to a large extent complementary to existing resources, providing many novel paraphrases. Our resource is publicly available, continuously expanding based on daily news.","pages":"155--160","doi":"10.18653\/v1\/S17-1019","url":"https:\/\/www.aclweb.org\/anthology\/S17-1019","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1020","title":"Evaluating Semantic Parsing against a Simple Web-based Question Answering Model","authors":["Talmor, Alon","Geva, Mor","Berant, Jonathan"],"emails":["alontalmor@mail.tau.ac.il","morgeva@mail.tau.ac.il","joberant@cs.tau.ac.il"],"author_id":["alon-talmor","mor-geva","jonathan-berant"],"abstract":"Semantic parsing shines at analyzing complex natural language that involves composition and computation over multiple pieces of evidence. However, datasets for semantic parsing contain many factoid questions that can be answered from a single web document. In this paper, we propose to evaluate semantic parsing-based question answering models by comparing them to a question answering baseline that queries the web and extracts the answer only from web snippets, without access to the target knowledge-base. We investigate this approach on COMPLEXQUESTIONS, a dataset designed to focus on compositional language, and find that our model obtains reasonable performance (∼35 F1 compared to 41 F1 of state-of-the-art). We find in our analysis that our model performs well on complex questions involving conjunctions, but struggles on questions that involve relation composition and superlatives.","pages":"161--167","doi":"10.18653\/v1\/S17-1020","url":"https:\/\/www.aclweb.org\/anthology\/S17-1020","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1021","title":"Logical Metonymy in a Distributional Model of Sentence Comprehension","authors":["Chersoni, Emmanuele","Lenci, Alessandro","Blache, Philippe"],"emails":["emmanuelechersoni@gmail.com","alessandro.lenci@unipi.it","philippe.blache@univ-amu.fr"],"author_id":["emmanuele-chersoni","alessandro-lenci","philippe-blache"],"abstract":"In theoretical linguistics, logical metonymy is defined as the combination of an event-subcategorizing verb with an entity-denoting direct object (e.g., The author began the book), so that the interpretation of the VP requires the retrieval of a covert event (e.g., writing). Psycholinguistic studies have revealed extra processing costs for logical metonymy, a phenomenon generally explained with the introduction of new semantic structure. In this paper, we present a general distributional model for sentence comprehension inspired by the Memory, Unification and Control model by Hagoort (2013,2016). We show that our distributional framework can account for the extra processing costs of logical metonymy and can identify the covert event in a classification task.","pages":"168--177","doi":"10.18653\/v1\/S17-1021","url":"https:\/\/www.aclweb.org\/anthology\/S17-1021","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1022","title":"Double Trouble: The Problem of Construal in Semantic Annotation of Adpositions","authors":["Hwang, Jena D.","Bhatia, Archna","Han, Na-Rae","O{'}Gorman, Tim","Srikumar, Vivek","Schneider, Nathan"],"emails":["jhwang@ihmc.us","abhatia@ihmc.us","naraehan@pitt.edu","timothy.ogorman@colorado.edu","svivek@cs.utah.edu","nathan.schneider@georgetown.edu"],"author_id":["jena-d-hwang","archna-bhatia","na-rae-han","tim-ogorman","vivek-srikumar","nathan-schneider"],"abstract":"We consider the semantics of prepositions, revisiting a broad-coverage annotation scheme used for annotating all 4,250 preposition tokens in a 55,000 word corpus of English. Attempts to apply the scheme to adpositions and case markers in other languages, as well as some problematic cases in English, have led us to reconsider the assumption that an adposition{'}s lexical contribution is equivalent to the role\/relation that it mediates. Our proposal is to embrace the potential for construal in adposition use, expressing such phenomena directly at the token level to manage complexity and avoid sense proliferation. We suggest a framework to represent both the scene role and the adposition{'}s lexical function so they can be annotated at scale{---}supporting automatic, statistical processing of domain-general language{---}and discuss how this representation would allow for a simpler inventory of labels.","pages":"178--188","doi":"10.18653\/v1\/S17-1022","url":"https:\/\/www.aclweb.org\/anthology\/S17-1022","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1023","title":"Issues of Mass and Count: Dealing with {`}Dual-Life{'} Nouns","authors":["Kiss, Tibor","Pelletier, Francis Jeffry","Husi{\\'c}, Halima","Poppek, Johanna"],"emails":["tibor@linguistics.rub.de","francisp@ualberta.ca","husic@linguistics.rub.de","poppek@linguistics.rub.de"],"author_id":["tibor-kiss","francis-jeffry-pelletier","halima-husic1","johanna-poppek"],"abstract":"The topics of mass and count have been studied for many decades in philosophy (e.g., Quine, 1960; Pelletier, 1975), linguistics (e.g., McCawley, 1975; Allen, 1980; Krifka, 1991) and psychology (e.g., Middleton et al, 2004; Barner et al, 2009). More recently, interest from within computational linguistics has studied the issues involved (e.g., Pustejovsky, 1991; Bond, 2005; Schmidtke {\\&} Kuperman, 2016), to name just a few. As is pointed out in these works, there are many difficult conceptual issues involved in the study of this contrast. In this article we study one of these issues {--} the {``}Dual-Life{''} of being simultaneously +mass and +count {--} by means of an unusual combination of human annotation, online lexical resources, and online corpora.","pages":"189--198","doi":"10.18653\/v1\/S17-1023","url":"https:\/\/www.aclweb.org\/anthology\/S17-1023","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1024","title":"Parsing Graphs with Regular Graph Grammars","authors":["Gilroy, Sorcha","Lopez, Adam","Maneth, Sebastian"],"emails":["s.gilroy@sms.ed.ac.uk","alopez@inf.ed.ac.uk","smaneth@uni-bremen.de"],"author_id":["sorcha-gilroy","adam-lopez","sebastian-maneth"],"abstract":"Recently, several datasets have become available which represent natural language phenomena as graphs. Hyperedge Replacement Languages (HRL) have been the focus of much attention as a formalism to represent the graphs in these datasets. Chiang et al. (2013) prove that HRL graphs can be parsed in polynomial time with respect to the size of the input graph. We believe that HRL are more expressive than is necessary to represent semantic graphs and we propose the use of Regular Graph Languages (RGL; Courcelle 1991), which is a subfamily of HRL, as a possible alternative. We provide a top-down parsing algorithm for RGL that runs in time linear in the size of the input graph.","pages":"199--208","doi":"10.18653\/v1\/S17-1024","url":"https:\/\/www.aclweb.org\/anthology\/S17-1024","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1025","title":"Embedded Semantic Lexicon Induction with Joint Global and Local Optimization","authors":["Jauhar, Sujay Kumar","Hovy, Eduard"],"emails":["sjauhar@cs.cmu.edu","hovy@cs.cmu.edu"],"author_id":["sujay-kumar-jauhar","eduard-hovy"],"abstract":"Creating annotated frame lexicons such as PropBank and FrameNet is expensive and labor intensive. We present a method to induce an embedded frame lexicon in an minimally supervised fashion using nothing more than unlabeled predicate-argument word pairs. We hypothesize that aggregating such pair selectional preferences across training leads us to a global understanding that captures predicate-argument frame structure. Our approach revolves around a novel integration between a predictive embedding model and an Indian Buffet Process posterior regularizer. We show, through our experimental evaluation, that we outperform baselines on two tasks and can learn an embedded frame lexicon that is able to capture some interesting generalities in relation to hand-crafted semantic frames.","pages":"209--219","doi":"10.18653\/v1\/S17-1025","url":"https:\/\/www.aclweb.org\/anthology\/S17-1025","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1026","title":"Generating Pattern-Based Entailment Graphs for Relation Extraction","authors":["Eichler, Kathrin","Xu, Feiyu","Uszkoreit, Hans","Krause, Sebastian"],"emails":["kathrin.eichler@dfki.de","feiyu.xu@dfki.de","hans.uszkoreit@dfki.de","sebastian.krause@dfki.de"],"author_id":["kathrin-eichler","feiyu-xu","hans-uszkoreit","sebastian-krause"],"abstract":"Relation extraction is the task of recognizing and extracting relations between entities or concepts in texts. A common approach is to exploit existing knowledge to learn linguistic patterns expressing the target relation and use these patterns for extracting new relation mentions. Deriving relation patterns automatically usually results in large numbers of candidates, which need to be filtered to derive a subset of patterns that reliably extract correct relation mentions. We address the pattern selection task by exploiting the knowledge represented by entailment graphs, which capture semantic relationships holding among the learned pattern candidates. This is motivated by the fact that a pattern may not express the target relation explicitly, but still be useful for extracting instances for which the relation holds, because its meaning entails the meaning of the target relation. We evaluate the usage of both automatically generated and gold-standard entailment graphs in a relation extraction scenario and present favorable experimental results, exhibiting the benefits of structuring and selecting patterns based on entailment graphs.","pages":"220--229","doi":"10.18653\/v1\/S17-1026","url":"https:\/\/www.aclweb.org\/anthology\/S17-1026","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1027","title":"Classifying Semantic Clause Types: Modeling Context and Genre Characteristics with Recurrent Neural Networks and Attention","authors":["Becker, Maria","Staniek, Michael","Nastase, Vivi","Palmer, Alexis","Frank, Anette"],"emails":["mbecker@cl.uni-heidelberg.de","staniek@cl.uni-heidelberg.de","nastase@cl.uni-heidelberg.de","alexis.palmer@unt.edu","frank@cl.uni-heidelberg.de"],"author_id":["maria-becker","michael-staniek","vivi-nastase","alexis-palmer","anette-frank"],"abstract":"Detecting aspectual properties of clauses in the form of situation entity types has been shown to depend on a combination of syntactic-semantic and contextual features. We explore this task in a deep-learning framework, where tuned word representations capture lexical, syntactic and semantic features. We introduce an attention mechanism that pinpoints relevant context not only for the current instance, but also for the larger context. Apart from implicitly capturing task relevant features, the advantage of our neural model is that it avoids the need to reproduce linguistic features for other languages and is thus more easily transferable. We present experiments for English and German that achieve competitive performance. We present a novel take on modeling and exploiting genre information and showcase the adaptation of our system from one language to another.","pages":"230--240","doi":"10.18653\/v1\/S17-1027","url":"https:\/\/www.aclweb.org\/anthology\/S17-1027","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1028","title":"Predictive Linguistic Features of Schizophrenia","authors":["Sarioglu Kayi, Efsun","Diab, Mona","Pauselli, Luca","Compton, Michael","Coppersmith, Glen"],"emails":["efsun@gwu.edu","mtdiab@gwu.edu","pausell@nyspi.columbia.edu","mtc2176@cumc.columbia.edu","glen@qntfy.com"],"author_id":["efsun-sarioglu-kayi","mona-diab","luca-pauselli","michael-compton","glen-coppersmith"],"abstract":"Schizophrenia is one of the most disabling and difficult to treat of all human medical\/health conditions, ranking in the top ten causes of disability worldwide. It has been a puzzle in part due to difficulty in identifying its basic, fundamental components. Several studies have shown that some manifestations of schizophrenia (e.g., the negative symptoms that include blunting of speech prosody, as well as the disorganization symptoms that lead to disordered language) can be understood from the perspective of linguistics. However, schizophrenia research has not kept pace with technologies in computational linguistics, especially in semantics and pragmatics. As such, we examine the writings of schizophrenia patients analyzing their syntax, semantics and pragmatics. In addition, we analyze tweets of (self proclaimed) schizophrenia patients who publicly discuss their diagnoses. For writing samples dataset, syntactic features are found to be the most successful in classification whereas for the less structured Twitter dataset, a combination of features performed the best.","pages":"241--250","doi":"10.18653\/v1\/S17-1028","url":"https:\/\/www.aclweb.org\/anthology\/S17-1028","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1029","title":"Learning to Solve Geometry Problems from Natural Language Demonstrations in Textbooks","authors":["Sachan, Mrinmaya","Xing, Eric"],"emails":["mrinmays@cs.cmu.edu","epxing@cs.cmu.edu"],"author_id":["mrinmaya-sachan","eric-xing"],"abstract":"Humans as well as animals are good at imitation. Inspired by this, the learning by demonstration view of machine learning learns to perform a task from detailed example demonstrations. In this paper, we introduce the task of question answering using natural language demonstrations where the question answering system is provided with detailed demonstrative solutions to questions in natural language. As a case study, we explore the task of learning to solve geometry problems using demonstrative solutions available in textbooks. We collect a new dataset of demonstrative geometry solutions from textbooks and explore approaches that learn to interpret these demonstrations as well as to use these interpretations to solve geometry problems. Our approaches show improvements over the best previously published system for solving geometry problems.","pages":"251--261","doi":"10.18653\/v1\/S17-1029","url":"https:\/\/www.aclweb.org\/anthology\/S17-1029","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"},{"id":"S17-1030","title":"Ways of Asking and Replying in Duplicate Question Detection","authors":["Ant{\\'o}nio Rodrigues, Jo{\\~a}o","Saedi, Chakaveh","Maraev, Vladislav","Silva, Jo{\\~a}o","Branco, Ant{\\'o}nio"],"emails":["joao.rodrigues@di.fc.ul.pt","chakaveh.saedi@di.fc.ul.pt","vlad.maraev@di.fc.ul.pt","jsilva@di.fc.ul.pt","antonio.branco@di.fc.ul.pt"],"author_id":["joao-rodrigues","chakaveh-saedi","vladislav-maraev","joao-silva","antonio-branco"],"abstract":"This paper presents the results of systematic experimentation on the impact in duplicate question detection of different types of questions across both a number of established approaches and a novel, superior one used to address this language processing task. This study permits to gain a novel insight on the different levels of robustness of the diverse detection methods with respect to different conditions of their application, including the ones that approximate real usage scenarios.","pages":"262--270","doi":"10.18653\/v1\/S17-1030","url":"https:\/\/www.aclweb.org\/anthology\/S17-1030","publisher":"Association for Computational Linguistics","address":"Vancouver, Canada","year":"2017","month":"August","booktitle":"Proceedings of the 6th Joint Conference on Lexical and Computational Semantics (*{SEM} 2017)"}]