[{"id":"W17-5501","title":"Automatic Mapping of {F}rench Discourse Connectives to {PDTB} Discourse Relations","authors":["Laali, Majid","Kosseim, Leila"],"emails":["laali@encs.concordia.ca","kosseim@encs.concordia.ca"],"author_id":["majid-laali","leila-kosseim"],"abstract":"In this paper, we present an approach to exploit phrase tables generated by statistical machine translation in order to map French discourse connectives to discourse relations. Using this approach, we created DisCoRel, a lexicon of French discourse connectives and their PDTB relations. When evaluated against LEXCONN, DisCoRel achieves a recall of 0.81 and an Average Precision of 0.68 for the Concession and Condition relations.","pages":"1--6","doi":"10.18653\/v1\/W17-5501","url":"https:\/\/www.aclweb.org\/anthology\/W17-5501","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5502","title":"Towards Full Text Shallow Discourse Relation Annotation: Experiments with Cross-Paragraph Implicit Relations in the {PDTB}","authors":["Prasad, Rashmi","Forbes Riley, Katherine","Lee, Alan"],"emails":["prasadr@uwm.edu","katherineforbesriley@gmail.com","aleewk@seas.upenn.edu"],"author_id":["rashmi-prasad","kate-forbes-riley","alan-lee"],"abstract":"Full text discourse parsing relies on texts comprehensively annotated with discourse relations. To this end, we address a significant gap in the inter-sentential discourse relations annotated in the Penn Discourse Treebank (PDTB), namely the class of cross-paragraph implicit relations, which account for 30{\\%} of inter-sentential relations in the corpus. We present our annotation study to explore the incidence rate of adjacent vs. non-adjacent implicit relations in cross-paragraph contexts, and the relative degree of difficulty in annotating them. Our experiments show a high incidence of non-adjacent relations that are difficult to annotate reliably, suggesting the practicality of backing off from their annotation to reduce noise for corpus-based studies. Our resulting guidelines follow the PDTB adjacency constraint for implicits while employing an underspecified representation of non-adjacent implicits, and yield 62{\\%} inter-annotator agreement on this task.","pages":"7--16","doi":"10.18653\/v1\/W17-5502","url":"https:\/\/www.aclweb.org\/anthology\/W17-5502","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5503","title":"User-initiated Sub-dialogues in State-of-the-art Dialogue Systems","authors":["Larsson, Staffan"],"emails":["sl@ling.gu.se"],"author_id":["staffan-larsson"],"abstract":"We test state of the art dialogue systems for their behaviour in response to user-initiated sub-dialogues, i.e. interactions where a system question is responded to with a question or request from the user, who thus initiates a sub-dialogue. We look at sub-dialogues both within a single app (where the sub-dialogue concerns another topic in the original domain) and across apps (where the sub-dialogue concerns a different domain). The overall conclusion of the tests is that none of the systems can be said to deal appropriately with user-initiated sub-dialogues.","pages":"17--22","doi":"10.18653\/v1\/W17-5503","url":"https:\/\/www.aclweb.org\/anthology\/W17-5503","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5504","title":"A Multimodal Dialogue System for Medical Decision Support inside Virtual Reality","authors":["Prange, Alexander","Chikobava, Margarita","Poller, Peter","Barz, Michael","Sonntag, Daniel"],"emails":["astname@dfki.de","","","",""],"author_id":["alexander-prange","margarita-chikobava","peter-poller","michael-barz","daniel-sonntag"],"abstract":"We present a multimodal dialogue system that allows doctors to interact with a medical decision support system in virtual reality (VR). We integrate an interactive visualization of patient records and radiology image data, as well as therapy predictions. Therapy predictions are computed in real-time using a deep learning model.","pages":"23--26","doi":"10.18653\/v1\/W17-5504","url":"https:\/\/www.aclweb.org\/anthology\/W17-5504","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5505","title":"Generative Encoder-Decoder Models for Task-Oriented Spoken Dialog Systems with Chatting Capability","authors":["Zhao, Tiancheng","Lu, Allen","Lee, Kyusong","Eskenazi, Maxine"],"emails":["","","",""],"author_id":["tiancheng-zhao","allen-lu","kyusong-lee","maxine-eskenazi"],"abstract":"Generative encoder-decoder models offer great promise in developing domain-general dialog systems. However, they have mainly been applied to open-domain conversations. This paper presents a practical and novel framework for building task-oriented dialog systems based on encoder-decoder models. This framework enables encoder-decoder models to accomplish slot-value independent decision-making and interact with external databases. Moreover, this paper shows the flexibility of the proposed method by interleaving chatting capability with a slot-filling system for better out-of-domain recovery. The models were trained on both real-user data from a bus information system and human-human chat data. Results show that the proposed framework achieves good performance in both offline evaluation metrics and in task success rate with human users.","pages":"27--36","doi":"10.18653\/v1\/W17-5505","url":"https:\/\/www.aclweb.org\/anthology\/W17-5505","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5506","title":"Key-Value Retrieval Networks for Task-Oriented Dialogue","authors":["Eric, Mihail","Krishnan, Lakshmi","Charette, Francois","Manning, Christopher D."],"emails":["meric@cs.stanford.edu","lkrishn7@ford.com","fcharett@ford.com","manning@stanford.edu"],"author_id":["mihail-eric","lakshmi-krishnan","francois-charette","christopher-d-manning"],"abstract":"Neural task-oriented dialogue systems often struggle to smoothly interface with a knowledge base. In this work, we seek to address this problem by proposing a new neural dialogue agent that is able to effectively sustain grounded, multi-domain discourse through a novel key-value retrieval mechanism. The model is end-to-end differentiable and does not need to explicitly model dialogue state or belief trackers. We also release a new dataset of 3,031 dialogues that are grounded through underlying knowledge bases and span three distinct tasks in the in-car personal assistant space: calendar scheduling, weather information retrieval, and point-of-interest navigation. Our architecture is simultaneously trained on data from all domains and significantly outperforms a competitive rule-based system and other existing neural dialogue architectures on the provided domains according to both automatic and human evaluation metrics.","pages":"37--49","doi":"10.18653\/v1\/W17-5506","url":"https:\/\/www.aclweb.org\/anthology\/W17-5506","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5507","title":"Lexical Acquisition through Implicit Confirmations over Multiple Dialogues","authors":["Ono, Kohei","Takeda, Ryu","Nichols, Eric","Nakano, Mikio","Komatani, Kazunori"],"emails":["","","","",""],"author_id":["kohei-ono","ryu-takeda","eric-nichols","mikio-nakano","kazunori-komatani"],"abstract":"We address the problem of acquiring the ontological categories of unknown terms through implicit confirmation in dialogues. We develop an approach that makes implicit confirmation requests with an unknown term{'}s predicted category. Our approach does not degrade user experience with repetitive explicit confirmations, but the system has difficulty determining if information in the confirmation request can be correctly acquired. To overcome this challenge, we propose a method for determining whether or not the predicted category is correct, which is included in an implicit confirmation request. Our method exploits multiple user responses to implicit confirmation requests containing the same ontological category. Experimental results revealed that the proposed method exhibited a higher precision rate for determining the correctly predicted categories than when only single user responses were considered.","pages":"50--59","doi":"10.18653\/v1\/W17-5507","url":"https:\/\/www.aclweb.org\/anthology\/W17-5507","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5508","title":"Utterance Intent Classification of a Spoken Dialogue System with Efficiently Untied Recursive Autoencoders","authors":["Kato, Tsuneo","Nagai, Atsushi","Noda, Naoki","Sumitomo, Ryosuke","Wu, Jianming","Yamamoto, Seiichi"],"emails":["","","","","",""],"author_id":["tsuneo-kato","atsushi-nagai","naoki-noda","ryosuke-sumitomo","jianming-wu","seiichi-yamamoto"],"abstract":"Recursive autoencoders (RAEs) for compositionality of a vector space model were applied to utterance intent classification of a smartphone-based Japanese-language spoken dialogue system. Though the RAEs express a nonlinear operation on the vectors of child nodes, the operation is considered to be different intrinsically depending on types of child nodes. To relax the difference, a data-driven untying of autoencoders (AEs) is proposed. The experimental result of the utterance intent classification showed an improved accuracy with the proposed method compared with the basic tied RAE and untied RAE based on a manual rule.","pages":"60--64","doi":"10.18653\/v1\/W17-5508","url":"https:\/\/www.aclweb.org\/anthology\/W17-5508","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5509","title":"Reward-Balancing for Statistical Spoken Dialogue Systems using Multi-objective Reinforcement Learning","authors":["Ultes, Stefan","Budzianowski, Pawe{\\l}","Casanueva, I{\\~n}igo","Mrk{\\v{s}}i{\\'c}, Nikola","Rojas-Barahona, Lina M.","Su, Pei-Hao","Wen, Tsung-Hsien","Ga{\\v{s}}i{\\'c}, Milica","Young, Steve"],"emails":["phs26@cam.ac.uk","pfb30@cam.ac.uk","ic340@cam.ac.uk","nm480@cam.ac.uk","lmr46@cam.ac.uk","su259@cam.ac.uk","thw28@cam.ac.uk","mg436@cam.ac.uk","sjy11@cam.ac.uk"],"author_id":["stefan-ultes","pawel-budzianowski","inigo-casanueva","nikola-mrksic","lina-m-rojas-barahona","pei-hao-su","tsung-hsien-wen","milica-gasic","steve-young"],"abstract":"Reinforcement learning is widely used for dialogue policy optimization where the reward function often consists of more than one component, e.g., the dialogue success and the dialogue length. In this work, we propose a structured method for finding a good balance between these components by searching for the optimal reward component weighting. To render this search feasible, we use multi-objective reinforcement learning to significantly reduce the number of training dialogues required. We apply our proposed method to find optimized component weights for six domains and compare them to a default baseline.","pages":"65--70","doi":"10.18653\/v1\/W17-5509","url":"https:\/\/www.aclweb.org\/anthology\/W17-5509","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5510","title":"Automatic Measures to Characterise Verbal Alignment in Human-Agent Interaction","authors":["Dubuisson Duplessis, Guillaume","Clavel, Chlo{\\'e}","Landragin, Fr{\\'e}d{\\'e}ric"],"emails":["gdubuisson@isir.upmc.fr","clavel@enst.fr","frederic.landragin@ens.fr"],"author_id":["guillaume-dubuisson-duplessis","chloe-clavel","frederic-landragin"],"abstract":"This work aims at characterising verbal alignment processes for improving virtual agent communicative capabilities. We propose computationally inexpensive measures of verbal alignment based on expression repetition in dyadic textual dialogues. Using these measures, we present a contrastive study between Human-Human and Human-Agent dialogues on a negotiation task. We exhibit quantitative differences in the strength and orientation of verbal alignment showing the ability of our approach to characterise important aspects of verbal alignment.","pages":"71--81","doi":"10.18653\/v1\/W17-5510","url":"https:\/\/www.aclweb.org\/anthology\/W17-5510","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5511","title":"Demonstration of interactive teaching for end-to-end dialog control with hybrid code networks","authors":["Williams, Jason D.","Liden, Lars"],"emails":["jason.williams@microsoft.com","lars.liden@microsoft.edu"],"author_id":["jason-d-williams","lars-liden"],"abstract":"This is a demonstration of interactive teaching for practical end-to-end dialog systems driven by a recurrent neural network. In this approach, a developer teaches the network by interacting with the system and providing on-the-spot corrections. Once a system is deployed, a developer can also correct mistakes in logged dialogs. This demonstration shows both of these teaching methods applied to dialog systems in three domains: pizza ordering, restaurant information, and weather forecasts.","pages":"82--85","doi":"10.18653\/v1\/W17-5511","url":"https:\/\/www.aclweb.org\/anthology\/W17-5511","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5512","title":"Sub-domain Modelling for Dialogue Management with Hierarchical Reinforcement Learning","authors":["Budzianowski, Pawe{\\l}","Ultes, Stefan","Su, Pei-Hao","Mrk{\\v{s}}i{\\'c}, Nikola","Wen, Tsung-Hsien","Casanueva, I{\\~n}igo","Rojas-Barahona, Lina M.","Ga{\\v{s}}i{\\'c}, Milica"],"emails":["pfb30@cam.ac.uk","","","","","","","mg436@cam.ac.uk"],"author_id":["pawel-budzianowski","stefan-ultes","pei-hao-su","nikola-mrksic","tsung-hsien-wen","inigo-casanueva","lina-m-rojas-barahona","milica-gasic"],"abstract":"Human conversation is inherently complex, often spanning many different topics\/domains. This makes policy learning for dialogue systems very challenging. Standard flat reinforcement learning methods do not provide an efficient framework for modelling such dialogues. In this paper, we focus on the under-explored problem of multi-domain dialogue management. First, we propose a new method for hierarchical reinforcement learning using the option framework. Next, we show that the proposed architecture learns faster and arrives at a better policy than the existing flat ones do. Moreover, we show how pretrained policies can be adapted to more complex systems with an additional set of new actions. In doing that, we show that our approach has the potential to facilitate policy optimisation for more sophisticated multi-domain dialogue systems.","pages":"86--92","doi":"10.18653\/v1\/W17-5512","url":"https:\/\/www.aclweb.org\/anthology\/W17-5512","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5513","title":"{MACA}: A Modular Architecture for Conversational Agents","authors":["Truong, Hoai Phuoc","Parthasarathi, Prasanna","Pineau, Joelle"],"emails":["phuoc.truong2@mail.mcgill.ca","prasanna.p@cs.mcgill.ca","jpineau@cs.mcgill.ca"],"author_id":["hoai-phuoc-truong","prasanna-parthasarathi","joelle-pineau"],"abstract":"We propose a software architecture designed to ease the implementation of dialogue systems. The Modular Architecture for Conversational Agents (MACA) uses a plug-n-play style that allows quick prototyping, thereby facilitating the development of new techniques and the reproduction of previous work. The architecture separates the domain of the conversation from the agent{'}s dialogue strategy, and as such can be easily extended to multiple domains. MACA provides tools to host dialogue agents on Amazon Mechanical Turk (mTurk) for data collection and allows processing of other sources of training data. The current version of the framework already incorporates several domains and existing dialogue strategies from the recent literature.","pages":"93--102","doi":"10.18653\/v1\/W17-5513","url":"https:\/\/www.aclweb.org\/anthology\/W17-5513","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5514","title":"Sequential Dialogue Context Modeling for Spoken Language Understanding","authors":["Bapna, Ankur","T{\\\"u}r, Gokhan","Hakkani-T{\\\"u}r, Dilek","Heck, Larry"],"emails":["ankurbpn@google.com","gokhan.tur@ieee.org","dilek@ieee.org","larry.heck@ieee.org"],"author_id":["ankur-bapna","gokhan-tur","dilek-hakkani-tur","larry-heck"],"abstract":"Spoken Language Understanding (SLU) is a key component of goal oriented dialogue systems that would parse user utterances into semantic frame representations. Traditionally SLU does not utilize the dialogue history beyond the previous system turn and contextual ambiguities are resolved by the downstream components. In this paper, we explore novel approaches for modeling dialogue context in a recurrent neural network (RNN) based language understanding system. We propose the Sequential Dialogue Encoder Network, that allows encoding context from the dialogue history in chronological order. We compare the performance of our proposed architecture with two context models, one that uses just the previous turn context and another that encodes dialogue context in a memory network, but loses the order of utterances in the dialogue history. Experiments with a multi-domain dialogue dataset demonstrate that the proposed architecture results in reduced semantic frame error rates.","pages":"103--114","doi":"10.18653\/v1\/W17-5514","url":"https:\/\/www.aclweb.org\/anthology\/W17-5514","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5515","title":"Redundancy Localization for the Conversationalization of Unstructured Responses","authors":["Krause, Sebastian","Kozhevnikov, Mikhail","Malmi, Eric","Pighin, Daniele"],"emails":["sebastian.krause@dfki.de","biondo@google.com","eric.malmi@aalto.fi","qnan@google.com"],"author_id":["sebastian-krause","mikhail-kozhevnikov","eric-malmi","daniele-pighin"],"abstract":"Conversational agents offer users a natural-language interface to accomplish tasks, entertain themselves, or access information. Informational dialogue is particularly challenging in that the agent has to hold a conversation on an open topic, and to achieve a reasonable coverage it generally needs to digest and present unstructured information from textual sources. Making responses based on such sources sound natural and fit appropriately into the conversation context is a topic of ongoing research, one of the key issues of which is preventing the agent{'}s responses from sounding repetitive. Targeting this issue, we propose a new task, known as redundancy localization, which aims to pinpoint semantic overlap between text passages. To help address it systematically, we formalize the task, prepare a public dataset with fine-grained redundancy labels, and propose a model utilizing a weak training signal defined over the results of a passage-retrieval system on web texts. The proposed model demonstrates superior performance compared to a state-of-the-art entailment model and yields encouraging results when applied to a real-world dialogue.","pages":"115--126","doi":"10.18653\/v1\/W17-5515","url":"https:\/\/www.aclweb.org\/anthology\/W17-5515","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5516","title":"Attentive listening system with backchanneling, response generation and flexible turn-taking","authors":["Lala, Divesh","Milhorat, Pierrick","Inoue, Koji","Ishida, Masanari","Takanashi, Katsuya","Kawahara, Tatsuya"],"emails":["lastname@sap.ist.i.kyoto-u.ac.jp","","","","",""],"author_id":["divesh-lala","pierrick-milhorat","koji-inoue","masanari-ishida","katsuya-takanashi","tatsuya-kawahara"],"abstract":"Attentive listening systems are designed to let people, especially senior people, keep talking to maintain communication ability and mental health. This paper addresses key components of an attentive listening system which encourages users to talk smoothly. First, we introduce continuous prediction of end-of-utterances and generation of backchannels, rather than generating backchannels after end-point detection of utterances. This improves subjective evaluations of backchannels. Second, we propose an effective statement response mechanism which detects focus words and responds in the form of a question or partial repeat. This can be applied to any statement. Moreover, a flexible turn-taking mechanism is designed which uses backchannels or fillers when the turn-switch is ambiguous. These techniques are integrated into a humanoid robot to conduct attentive listening. We test the feasibility of the system in a pilot experiment and show that it can produce coherent dialogues during conversation.","pages":"127--136","doi":"10.18653\/v1\/W17-5516","url":"https:\/\/www.aclweb.org\/anthology\/W17-5516","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5517","title":"Natural Language Input for In-Car Spoken Dialog Systems: How Natural is Natural?","authors":["Braunger, Patricia","Maier, Wolfgang"],"emails":["patricia.braunger@daimler.com","wolfgang.mw.maier@daimler.com"],"author_id":["patricia-braunger","wolfgang-maier"],"abstract":"Recent spoken dialog systems are moving away from command and control towards a more intuitive and natural style of interaction. In order to choose an appropriate system design which allows the system to deal with naturally spoken user input, a definition of what exactly constitutes naturalness in user input is important. In this paper, we examine how different user groups naturally speak to an automotive spoken dialog system (SDS). We conduct a user study in which we collect freely spoken user utterances for a wide range of use cases in German. By means of a comparative study of the utterances from the study with interpersonal utterances, we provide criteria what constitutes naturalness in the user input of an state-of-the-art automotive SDS.","pages":"137--146","doi":"10.18653\/v1\/W17-5517","url":"https:\/\/www.aclweb.org\/anthology\/W17-5517","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5518","title":"Sample-efficient Actor-Critic Reinforcement Learning with Supervised Data for Dialogue Management","authors":["Su, Pei-Hao","Budzianowski, Pawe{\\l}","Ultes, Stefan","Ga{\\v{s}}i{\\'c}, Milica","Young, Steve"],"emails":["phs26@cam.ac.uk","pfb30@cam.ac.uk","su259@cam.ac.uk","mg436@cam.ac.uk","sjy11@cam.ac.uk"],"author_id":["pei-hao-su","pawel-budzianowski","stefan-ultes","milica-gasic","steve-young"],"abstract":"Deep reinforcement learning (RL) methods have significant potential for dialogue policy optimisation. However, they suffer from a poor performance in the early stages of learning. This is especially problematic for on-line learning with real users. Two approaches are introduced to tackle this problem. Firstly, to speed up the learning process, two sample-efficient neural networks algorithms: trust region actor-critic with experience replay (TRACER) and episodic natural actor-critic with experience replay (eNACER) are presented. For TRACER, the trust region helps to control the learning step size and avoid catastrophic model changes. For eNACER, the natural gradient identifies the steepest ascent direction in policy space to speed up the convergence. Both models employ off-policy learning with experience replay to improve sample-efficiency. Secondly, to mitigate the cold start issue, a corpus of demonstration data is utilised to pre-train the models prior to on-line reinforcement learning. Combining these two approaches, we demonstrate a practical approach to learn deep RL-based dialogue policies and demonstrate their effectiveness in a task-oriented information seeking domain.","pages":"147--157","doi":"10.18653\/v1\/W17-5518","url":"https:\/\/www.aclweb.org\/anthology\/W17-5518","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5519","title":"A surprisingly effective out-of-the-box char2char model on the {E}2{E} {NLG} Challenge dataset","authors":["Agarwal, Shubham","Dymetman, Marc"],"emails":["shubhamagarwal92@gmail.com","marc.dymetman@naverlabs.com"],"author_id":["shubham-agarwal","marc-dymetman"],"abstract":"We train a char2char model on the E2E NLG Challenge data, by exploiting {``}out-of-the-box{''} the recently released tfseq2seq framework, using some of the standard options offered by this tool. With minimal effort, and in particular without delexicalization, tokenization or lowercasing, the obtained raw predictions, according to a small scale human evaluation, are excellent on the linguistic side and quite reasonable on the adequacy side, the primary downside being the possible omissions of semantic material. However, in a significant number of cases (more than 70{\\%}), a perfect solution can be found in the top-20 predictions, indicating promising directions for solving the remaining issues.","pages":"158--163","doi":"10.18653\/v1\/W17-5519","url":"https:\/\/www.aclweb.org\/anthology\/W17-5519","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5520","title":"Interaction Quality Estimation Using Long Short-Term Memories","authors":["Rach, Niklas","Minker, Wolfgang","Ultes, Stefan"],"emails":["vorname.nachname@uni-ulm.de","","su259@cam.ac.uk"],"author_id":["niklas-rach","wolfgang-minker","stefan-ultes"],"abstract":"For estimating the Interaction Quality (IQ) in Spoken Dialogue Systems (SDS), the dialogue history is of significant importance. Previous works included this information manually in the form of precomputed temporal features into the classification process. Here, we employ a deep learning architecture based on Long Short-Term Memories (LSTM) to extract this information automatically from the data, thus estimating IQ solely by using current exchange features. We show that it is thereby possible to achieve competitive results as in a scenario where manually optimized temporal features have been included.","pages":"164--169","doi":"10.18653\/v1\/W17-5520","url":"https:\/\/www.aclweb.org\/anthology\/W17-5520","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5521","title":"{D}ial{P}ort, Gone Live: An Update After A Year of Development","authors":["Lee, Kyusong","Zhao, Tiancheng","Du, Yulun","Cai, Edward","Lu, Allen","Pincus, Eli","Traum, David","Ultes, Stefan","Rojas-Barahona, Lina M.","Gasic, Milica","Young, Steve","Eskenazi, Maxine"],"emails":["kyusongl@cs.cmu.edu","tianchez@cs.cmu.edu","arlu@cs.cmu.edu","edcai@cs.cmu.edu","yulund@cs.cmu.edu","pincus@ict.usc.edu","traum@ict.usc.edu","su259@eng.cam.ac.uk","lmr46@eng.cam.ac.uk","mg436@eng.cam.ac.uk","sjy11@eng.cam.ac.uk","max@cs.cmu.edu"],"author_id":["kyusong-lee","tiancheng-zhao","yulun-du","edward-cai","allen-lu","eli-pincus","david-traum","stefan-ultes","lina-m-rojas-barahona","milica-gasic","steve-young","maxine-eskenazi"],"abstract":"DialPort collects user data for connected spoken dialog systems. At present six systems are linked to a central portal that directs the user to the applicable system and suggests systems that the user may be interested in. User data has started to flow into the system.","pages":"170--173","doi":"10.18653\/v1\/W17-5521","url":"https:\/\/www.aclweb.org\/anthology\/W17-5521","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5522","title":"Evaluating Natural Language Understanding Services for Conversational Question Answering Systems","authors":["Braun, Daniel","Hernandez Mendez, Adrian","Matthes, Florian","Langen, Manfred"],"emails":["daniel.braun@tum.de","adrian.hernandez@tum.de","matthes@tum.de","manfred.langen@siemens.com"],"author_id":["daniel-braun","adrian-hernandez-mendez","florian-matthes","manfred-langen"],"abstract":"Conversational interfaces recently gained a lot of attention. One of the reasons for the current hype is the fact that chatbots (one particularly popular form of conversational interfaces) nowadays can be created without any programming knowledge, thanks to different toolkits and so-called Natural Language Understanding (NLU) services. While these NLU services are already widely used in both, industry and science, so far, they have not been analysed systematically. In this paper, we present a method to evaluate the classification performance of NLU services. Moreover, we present two new corpora, one consisting of annotated questions and one consisting of annotated questions with the corresponding answers. Based on these corpora, we conduct an evaluation of some of the most popular NLU services. Thereby we want to enable both, researchers and companies to make more educated decisions about which service they should use.","pages":"174--185","doi":"10.18653\/v1\/W17-5522","url":"https:\/\/www.aclweb.org\/anthology\/W17-5522","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5523","title":"The Role of Conversation Context for Sarcasm Detection in Online Interactions","authors":["Ghosh, Debanjan","Richard Fabbri, Alexander","Muresan, Smaranda"],"emails":["debanjan.ghosh@rutgers.edu","arf2145@columbia.edu","smara@columbia.edu"],"author_id":["debanjan-ghosh","alexander-richard-fabbri","smaranda-muresan"],"abstract":"Computational models for sarcasm detection have often relied on the content of utterances in isolation. However, speaker{'}s sarcastic intent is not always obvious without additional context. Focusing on social media discussions, we investigate two issues: (1) does modeling of conversation context help in sarcasm detection and (2) can we understand what part of conversation context triggered the sarcastic reply. To address the first issue, we investigate several types of Long Short-Term Memory (LSTM) networks that can model both the conversation context and the sarcastic response. We show that the conditional LSTM network (Rockt{\\\"a}schel et al. 2015) and LSTM networks with sentence level attention on context and response outperform the LSTM model that reads only the response. To address the second issue, we present a qualitative analysis of attention weights produced by the LSTM models with attention and discuss the results compared with human performance on the task.","pages":"186--196","doi":"10.18653\/v1\/W17-5523","url":"https:\/\/www.aclweb.org\/anthology\/W17-5523","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5524","title":"{VOILA}: An Optimised Dialogue System for Interactively Learning Visually-Grounded Word Meanings (Demonstration System)","authors":["Yu, Yanchao","Eshghi, Arash","Lemon, Oliver"],"emails":["y.yu@hw.ac.uk","a.eshghi@hw.ac.uk","o.lemon@hw.ac.uk"],"author_id":["yanchao-yu","arash-eshghi","oliver-lemon"],"abstract":"We present VOILA: an optimised, multi-modal dialogue agent for interactive learning of visually grounded word meanings from a human user. VOILA is: (1) able to learn new visual categories interactively from users from scratch; (2) trained on real human-human dialogues in the same domain, and so is able to conduct natural spontaneous dialogue; (3) optimised to find the most effective trade-off between the accuracy of the visual categories it learns and the cost it incurs to users. VOILA is deployed on Furhat, a human-like, multi-modal robot head with back-projection of the face, and a graphical virtual character.","pages":"197--200","doi":"10.18653\/v1\/W17-5524","url":"https:\/\/www.aclweb.org\/anthology\/W17-5524","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5525","title":"The {E}2{E} Dataset: New Challenges For End-to-End Generation","authors":["Novikova, Jekaterina","Du{\\v{s}}ek, Ond{\\v{r}}ej","Rieser, Verena"],"emails":["j.novikova@hw.ac.uk","o.dusek@hw.ac.uk","v.t.rieser@hw.ac.uk"],"author_id":["jekaterina-novikova","ondrej-dusek","verena-rieser"],"abstract":"This paper describes the E2E data, a new dataset for training end-to-end, data-driven natural language generation systems in the restaurant domain, which is ten times bigger than existing, frequently used datasets in this area. The E2E dataset poses new challenges: (1) its human reference texts show more lexical richness and syntactic variation, including discourse phenomena; (2) generating from this set requires content selection. As such, learning from this dataset promises more natural, varied and less template-like system utterances. We also establish a baseline on this dataset, which illustrates some of the difficulties associated with this data.","pages":"201--206","doi":"10.18653\/v1\/W17-5525","url":"https:\/\/www.aclweb.org\/anthology\/W17-5525","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5526","title":"{F}rames: a corpus for adding memory to goal-oriented dialogue systems","authors":["El Asri, Layla","Schulz, Hannes","Sharma, Shikhar","Zumer, Jeremie","Harris, Justin","Fine, Emery","Mehrotra, Rahul","Suleman, Kaheer"],"emails":["layla.el asri@microsoft.com","hannes.schulz@microsoft.com","shikhar.sharma@microsoft.com","jeremie.zumer@microsoft.com","justin.harris@microsoft.com","emery.fine@microsoft.com","rahul.mehrotra@microsoft.com","kaheer.suleman@microsoft.com"],"author_id":["layla-el-asri","hannes-schulz","shikhar-kr-sarma","jeremie-zumer","justin-harris","emery-fine","rahul-mehrotra","kaheer-suleman"],"abstract":"This paper proposes a new dataset, Frames, composed of 1369 human-human dialogues with an average of 15 turns per dialogue. This corpus contains goal-oriented dialogues between users who are given some constraints to book a trip and assistants who search a database to find appropriate trips. The users exhibit complex decision-making behaviour which involve comparing trips, exploring different options, and selecting among the trips that were discussed during the dialogue. To drive research on dialogue systems towards handling such behaviour, we have annotated and released the dataset and we propose in this paper a task called frame tracking. This task consists of keeping track of different semantic frames throughout each dialogue. We propose a rule-based baseline and analyse the frame tracking task through this baseline.","pages":"207--219","doi":"10.18653\/v1\/W17-5526","url":"https:\/\/www.aclweb.org\/anthology\/W17-5526","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5527","title":"Towards a General, Continuous Model of Turn-taking in Spoken Dialogue using {LSTM} Recurrent Neural Networks","authors":["Skantze, Gabriel"],"emails":["skantze@kth.se"],"author_id":["gabriel-skantze"],"abstract":"Previous models of turn-taking have mostly been trained for specific turn-taking decisions, such as discriminating between turn shifts and turn retention in pauses. In this paper, we present a predictive, continuous model of turn-taking using Long Short-Term Memory (LSTM) Recurrent Neural Networks (RNN). The model is trained on human-human dialogue data to predict upcoming speech activity in a future time window. We show how this general model can be applied to two different tasks that it was not specifically trained for. First, to predict whether a turn-shift will occur or not in pauses, where the model achieves a better performance than human observers, and better than results achieved with more traditional models. Second, to make a prediction at speech onset whether the utterance will be a short backchannel or a longer utterance. Finally, we show how the hidden layer in the network can be used as a feature vector for turn-taking decisions in a human-robot interaction scenario.","pages":"220--230","doi":"10.18653\/v1\/W17-5527","url":"https:\/\/www.aclweb.org\/anthology\/W17-5527","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5528","title":"Neural-based Natural Language Generation in Dialogue using {RNN} Encoder-Decoder with Semantic Aggregation","authors":["Tran, Van-Khanh","Nguyen, Le-Minh","Tojo, Satoshi"],"emails":["tvkhanh@jaist.ac.jp","nguyenml@jaist.ac.jp","tojo@jaist.ac.jp"],"author_id":["van-khanh-tran","minh-le-nguyen","satoshi-tojo"],"abstract":"Natural language generation (NLG) is an important component in spoken dialogue systems. This paper presents a model called Encoder-Aggregator-Decoder which is an extension of an Recurrent Neural Network based Encoder-Decoder architecture. The proposed Semantic Aggregator consists of two components: an Aligner and a Refiner. The Aligner is a conventional attention calculated over the encoded input information, while the Refiner is another attention or gating mechanism stacked over the attentive Aligner in order to further select and aggregate the semantic elements. The proposed model can be jointly trained both sentence planning and surface realization to produce natural language utterances. The model was extensively assessed on four different NLG domains, in which the experimental results showed that the proposed generator consistently outperforms the previous methods on all the NLG domains.","pages":"231--240","doi":"10.18653\/v1\/W17-5528","url":"https:\/\/www.aclweb.org\/anthology\/W17-5528","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5529","title":"Beyond On-hold Messages: Conversational Time-buying in Task-oriented Dialogue","authors":["L{\\'o}pez Gambino, Soledad","Zarrie{\\ss}, Sina","Schlangen, David"],"emails":["gambino@uni-bielefeld.de","sina.zarriess@uni-bielefeld.de","david.schlangen@uni-bielefeld.de"],"author_id":["m-soledad-lopez-gambino","sina-zarriess","david-schlangen"],"abstract":"A common convention in graphical user interfaces is to indicate a {``}wait state{''}, for example while a program is preparing a response, through a changed cursor state or a progress bar. What should the analogue be in a spoken conversational system? To address this question, we set up an experiment in which a human information provider (IP) was given their information only in a delayed and incremental manner, which systematically created situations where the IP had the turn but could not provide task-related information. Our data analysis shows that 1) IPs bridge the gap until they can provide information by re-purposing a whole variety of task- and grounding-related communicative actions (e.g. echoing the user{'}s request, signaling understanding, asserting partially relevant information), rather than being silent or explicitly asking for time (e.g. {``}please wait{''}), and that 2) IPs combined these actions productively to ensure an ongoing conversation. These results, we argue, indicate that natural conversational interfaces should also be able to manage their time flexibly using a variety of conversational resources.","pages":"241--246","doi":"10.18653\/v1\/W17-5529","url":"https:\/\/www.aclweb.org\/anthology\/W17-5529","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5530","title":"Neural-based Context Representation Learning for Dialog Act Classification","authors":["Ortega, Daniel","Vu, Ngoc Thang"],"emails":["daniel.ortega@ims.uni-stuttgart.de","thang.vu@ims.uni-stuttgart.de"],"author_id":["daniel-ortega","ngoc-thang-vu"],"abstract":"We explore context representation learning methods in neural-based models for dialog act classification. We propose and compare extensively different methods which combine recurrent neural network architectures and attention mechanisms (AMs) at different context levels. Our experimental results on two benchmark datasets show consistent improvements compared to the models without contextual information and reveal that the most suitable AM in the architecture depends on the nature of the dataset.","pages":"247--252","doi":"10.18653\/v1\/W17-5530","url":"https:\/\/www.aclweb.org\/anthology\/W17-5530","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5531","title":"Predicting Success in Goal-Driven Human-Human Dialogues","authors":["Noseworthy, Michael","Cheung, Jackie Chi Kit","Pineau, Joelle"],"emails":["michael.noseworthy@mail.mcgill.ca","jcheung@cs.mcgill.ca","jpineau@cs.mcgill.ca"],"author_id":["michael-noseworthy","jackie-chi-kit-cheung","joelle-pineau"],"abstract":"In goal-driven dialogue systems, success is often defined based on a structured definition of the goal. This requires that the dialogue system be constrained to handle a specific class of goals and that there be a mechanism to measure success with respect to that goal. However, in many human-human dialogues the diversity of goals makes it infeasible to define success in such a way. To address this scenario, we consider the task of automatically predicting success in goal-driven human-human dialogues using only the information communicated between participants in the form of text. We build a dataset from stackoverflow.com which consists of exchanges between two users in the technical domain where ground-truth success labels are available. We then propose a turn-based hierarchical neural network model that can be used to predict success without requiring a structured goal definition. We show this model outperforms rule-based heuristics and other baselines as it is able to detect patterns over the course of a dialogue and capture notions such as gratitude.","pages":"253--262","doi":"10.18653\/v1\/W17-5531","url":"https:\/\/www.aclweb.org\/anthology\/W17-5531","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5532","title":"Generating and Evaluating Summaries for Partial Email Threads: Conversational {B}ayesian Surprise and Silver Standards","authors":["Johnson, Jordon","Masrani, Vaden","Carenini, Giuseppe","Ng, Raymond"],"emails":["jordon@cs.ubc.ca","vadmas@cs.ubc.ca","carenini@cs.ubc.ca","rng@cs.ubc.ca"],"author_id":["jordon-johnson","vaden-masrani","giuseppe-carenini","raymond-ng"],"abstract":"We define and motivate the problem of summarizing partial email threads. This problem introduces the challenge of generating reference summaries for partial threads when human annotation is only available for the threads as a whole, particularly when the human-selected sentences are not uniformly distributed within the threads. We propose an oracular algorithm for generating these reference summaries with arbitrary length, and we are making the resulting dataset publicly available. In addition, we apply a recent unsupervised method based on Bayesian Surprise that incorporates background knowledge into partial thread summarization, extend it with conversational features, and modify the mechanism by which it handles redundancy. Experiments with our method indicate improved performance over the baseline for shorter partial threads; and our results suggest that the potential benefits of background knowledge to partial thread summarization should be further investigated with larger datasets.","pages":"263--272","doi":"10.18653\/v1\/W17-5532","url":"https:\/\/www.aclweb.org\/anthology\/W17-5532","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5533","title":"Enabling robust and fluid spoken dialogue with cognitively impaired users","authors":["Yaghoubzadeh, Ramin","Kopp, Stefan"],"emails":["ryaghoubzadeh@uni-bielefeld.de","skopp@techfak.uni-bielefeld.de"],"author_id":["ramin-yaghoubzadeh","stefan-kopp"],"abstract":"We present the flexdiam dialogue management architecture, which was developed in a series of projects dedicated to tailoring spoken interaction to the needs of users with cognitive impairments in an everyday assistive domain, using a multimodal front-end. This hybrid DM architecture affords incremental processing of uncertain input, a flexible, mixed-initiative information grounding process that can be adapted to users{'} cognitive capacities and interactive idiosyncrasies, and generic mechanisms that foster transitions in the joint discourse state that are understandable and controllable by those users, in order to effect a robust interaction for users with varying capacities.","pages":"273--283","doi":"10.18653\/v1\/W17-5533","url":"https:\/\/www.aclweb.org\/anthology\/W17-5533","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5534","title":"Adversarial evaluation for open-domain dialogue generation","authors":["Bruni, Elia","Fern{\\'a}ndez, Raquel"],"emails":["elia.bruni@gmail.com","raquel.fernandez@uva.nl"],"author_id":["elia-bruni","raquel-fernandez"],"abstract":"We investigate the potential of adversarial evaluation methods for open-domain dialogue generation systems, comparing the performance of a discriminative agent to that of humans on the same task. Our results show that the task is hard, both for automated models and humans, but that a discriminative agent can learn patterns that lead to above-chance performance.","pages":"284--288","doi":"10.18653\/v1\/W17-5534","url":"https:\/\/www.aclweb.org\/anthology\/W17-5534","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5535","title":"Exploring Joint Neural Model for Sentence Level Discourse Parsing and Sentiment Analysis","authors":["Nejat, Bita","Carenini, Giuseppe","Ng, Raymond"],"emails":["nejatb@cs.ubc.ca","carenini@cs.ubc.ca","rng@cs.ubc.ca"],"author_id":["bita-nejat","giuseppe-carenini","raymond-ng"],"abstract":"Discourse Parsing and Sentiment Analysis are two fundamental tasks in Natural Language Processing that have been shown to be mutually beneficial. In this work, we design and compare two Neural Based models for jointly learning both tasks. In the proposed approach, we first create a vector representation for all the text segments in the input sentence. Next, we apply three different Recursive Neural Net models: one for discourse structure prediction, one for discourse relation prediction and one for sentiment analysis. Finally, we combine these Neural Nets in two different joint models: Multi-tasking and Pre-training. Our results on two standard corpora indicate that both methods result in improvements in each task but Multi-tasking has a bigger impact than Pre-training. Specifically for Discourse Parsing, we see improvements in the prediction of the set of contrastive relations.","pages":"289--298","doi":"10.18653\/v1\/W17-5535","url":"https:\/\/www.aclweb.org\/anthology\/W17-5535","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5536","title":"Predicting Causes of Reformulation in Intelligent Assistants","authors":["Sano, Shumpei","Kaji, Nobuhiro","Sassano, Manabu"],"emails":["shsano@yahoo-corp.jp","nkaji@yahoo-corp.jp","msassano@yahoo-corp.jp"],"author_id":["shumpei-sano","nobuhiro-kaji","manabu-sassano"],"abstract":"Intelligent assistants (IAs) such as Siri and Cortana conversationally interact with users and execute a wide range of actions (e.g., searching the Web, setting alarms, and chatting). IAs can support these actions through the combination of various components such as automatic speech recognition, natural language understanding, and language generation. However, the complexity of these components hinders developers from determining which component causes an error. To remove this hindrance, we focus on reformulation, which is a useful signal of user dissatisfaction, and propose a method to predict the reformulation causes. We evaluate the method using the user logs of a commercial IA. The experimental results have demonstrated that features designed to detect the error of a specific component improve the performance of reformulation cause detection.","pages":"299--309","doi":"10.18653\/v1\/W17-5536","url":"https:\/\/www.aclweb.org\/anthology\/W17-5536","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5537","title":"Are you serious?: Rhetorical Questions and Sarcasm in Social Media Dialog","authors":["Oraby, Shereen","Harrison, Vrindavan","Misra, Amita","Riloff, Ellen","Walker, Marilyn"],"emails":["soraby@ucsc.edu","vharriso@ucsc.edu","amisra2@ucsc.edu","riloff@cs.utah.edu","mawalker@ucsc.edu"],"author_id":["shereen-oraby","vrindavan-harrison","amita-misra","ellen-riloff","marilyn-walker"],"abstract":"Effective models of social dialog must understand a broad range of rhetorical and figurative devices. Rhetorical questions (RQs) are a type of figurative language whose aim is to achieve a pragmatic goal, such as structuring an argument, being persuasive, emphasizing a point, or being ironic. While there are computational models for other forms of figurative language, rhetorical questions have received little attention to date. We expand a small dataset from previous work, presenting a corpus of 10,270 RQs from debate forums and Twitter that represent different discourse functions. We show that we can clearly distinguish between RQs and sincere questions (0.76 F1). We then show that RQs can be used both sarcastically and non-sarcastically, observing that non-sarcastic (other) uses of RQs are frequently argumentative in forums, and persuasive in tweets. We present experiments to distinguish between these uses of RQs using SVM and LSTM models that represent linguistic features and post-level context, achieving results as high as 0.76 F1 for {``}sarcastic{''} and 0.77 F1 for {``}other{''} in forums, and 0.83 F1 for both {``}sarcastic{''} and {``}other{''} in tweets. We supplement our quantitative experiments with an in-depth characterization of the linguistic variation in RQs.","pages":"310--319","doi":"10.18653\/v1\/W17-5537","url":"https:\/\/www.aclweb.org\/anthology\/W17-5537","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5538","title":"Finding Structure in Figurative Language: Metaphor Detection with Topic-based Frames","authors":["Jang, Hyeju","Maki, Keith","Hovy, Eduard","Ros{\\'e}, Carolyn"],"emails":["hyejuj@cs.cmu.edu","kmaki@cs.cmu.edu","hovy@cs.cmu.edu","cprose@cs.cmu.edu"],"author_id":["hyeju-jang","keith-maki","eduard-hovy","carolyn-rose"],"abstract":"In this paper, we present a novel and highly effective method for induction and application of metaphor frame templates as a step toward detecting metaphor in extended discourse. We infer implicit facets of a given metaphor frame using a semi-supervised bootstrapping approach on an unlabeled corpus. Our model applies this frame facet information to metaphor detection, and achieves the state-of-the-art performance on a social media dataset when building upon other proven features in a nonlinear machine learning model. In addition, we illustrate the mechanism through which the frame and topic information enable the more accurate metaphor detection.","pages":"320--330","doi":"10.18653\/v1\/W17-5538","url":"https:\/\/www.aclweb.org\/anthology\/W17-5538","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5539","title":"Using Reinforcement Learning to Model Incrementality in a Fast-Paced Dialogue Game","authors":["Manuvinakurike, Ramesh","DeVault, David","Georgila, Kallirroi"],"emails":["manuvina@usc.edu","devault@usc.edu","kgeorgila@ict.usc.edu"],"author_id":["ramesh-manuvinakurike","david-devault","kallirroi-georgila"],"abstract":"We apply Reinforcement Learning (RL) to the problem of incremental dialogue policy learning in the context of a fast-paced dialogue game. We compare the policy learned by RL with a high-performance baseline policy which has been shown to perform very efficiently (nearly as well as humans) in this dialogue game. The RL policy outperforms the baseline policy in offline simulations (based on real user data). We provide a detailed comparison of the RL policy and the baseline policy, including information about how much effort and time it took to develop each one of them. We also highlight the cases where the RL policy performs better, and show that understanding the RL policy can provide valuable insights which can inform the creation of an even better rule-based policy.","pages":"331--341","doi":"10.18653\/v1\/W17-5539","url":"https:\/\/www.aclweb.org\/anthology\/W17-5539","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5540","title":"Inferring Narrative Causality between Event Pairs in Films","authors":["Hu, Zhichao","Walker, Marilyn"],"emails":["zhu@soe.ucsc.edu","mawalker@ucsc.edu"],"author_id":["zhichao-hu","marilyn-walker"],"abstract":"To understand narrative, humans draw inferences about the underlying relations between narrative events. Cognitive theories of narrative understanding define these inferences as four different types of causality, that include pairs of events A, B where A physically causes B (X drop, X break), to pairs of events where A causes emotional state B (Y saw X, Y felt fear). Previous work on learning narrative relations from text has either focused on {``}strict{''} physical causality, or has been vague about what relation is being learned. This paper learns pairs of causal events from a corpus of film scene descriptions which are action rich and tend to be told in chronological order. We show that event pairs induced using our methods are of high quality and are judged to have a stronger causal relation than event pairs from Rel-Grams.","pages":"342--351","doi":"10.18653\/v1\/W17-5540","url":"https:\/\/www.aclweb.org\/anthology\/W17-5540","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5541","title":"Lessons in Dialogue System Deployment","authors":["Leuski, Anton","Artstein, Ron"],"emails":["leuski@ict.usc.edu","artstein@ict.usc.edu"],"author_id":["anton-leuski","ron-artstein"],"abstract":"We analyze deployment of an interactive dialogue system in an environment where deep technical expertise might not be readily available. The initial version was created using a collection of research tools. We summarize a number of challenges with its deployment at two museums and describe a new system that simplifies the installation and user interface; reduces reliance on 3rd-party software; and provides a robust data collection mechanism.","pages":"352--355","doi":"10.18653\/v1\/W17-5541","url":"https:\/\/www.aclweb.org\/anthology\/W17-5541","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5542","title":"Information Navigation System with Discovering User Interests","authors":["Yoshino, Koichiro","Suzuki, Yu","Nakamura, Satoshi"],"emails":["koichiro@is.naist.jp","ysuzuki@is.naist.jp","s-nakamura@is.naist.jp"],"author_id":["koichiro-yoshino","yu-suzuki","satoshi-nakamura"],"abstract":"We demonstrate an information navigation system for sightseeing domains that has a dialogue interface for discovering user interests for tourist activities. The system discovers interests of a user with focus detection on user utterances, and proactively presents related information to the discovered user interest. A partially observable Markov decision process (POMDP)-based dialogue manager, which is extended with user focus states, controls the behavior of the system to provide information with several dialogue acts for providing information. We transferred the belief-update function and the policy of the manager from other system trained on a different domain to show the generality of defined dialogue acts for our information navigation system.","pages":"356--359","doi":"10.18653\/v1\/W17-5542","url":"https:\/\/www.aclweb.org\/anthology\/W17-5542","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5543","title":"Modelling Protagonist Goals and Desires in First-Person Narrative","authors":["Rahimtoroghi, Elahe","Wu, Jiaqi","Wang, Ruimin","Anand, Pranav","Walker, Marilyn"],"emails":["erahimto@ucsc.edu","jwu64@ucsc.edu","ruiwang@ucsc.edu","panand@ucsc.edu","mawalker@ucsc.edu"],"author_id":["elahe-rahimtoroghi","jiaqi-wu","ruimin-wang","pranav-anand","marilyn-walker"],"abstract":"Many genres of natural language text are narratively structured, a testament to our predilection for organizing our experiences as narratives. There is broad consensus that understanding a narrative requires identifying and tracking the goals and desires of the characters and their narrative outcomes. However, to date, there has been limited work on computational models for this problem. We introduce a new dataset, DesireDB, which includes gold-standard labels for identifying statements of desire, textual evidence for desire fulfillment, and annotations for whether the stated desire is fulfilled given the evidence in the narrative context. We report experiments on tracking desire fulfillment using different methods, and show that LSTM Skip-Thought model achieves F-measure of 0.7 on our corpus.","pages":"360--369","doi":"10.18653\/v1\/W17-5543","url":"https:\/\/www.aclweb.org\/anthology\/W17-5543","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5544","title":"{SHIH}bot: A {F}acebook chatbot for Sexual Health Information on {HIV}\/{AIDS}","authors":["Brixey, Jacqueline","Hoegen, Rens","Lan, Wei","Rusow, Joshua","Singla, Karan","Yin, Xusen","Artstein, Ron","Leuski, Anton"],"emails":["","","","","","","",""],"author_id":["jacqueline-brixey","rens-hoegen","wei-lan","joshua-rusow","karan-singla","xusen-yin","ron-artstein","anton-leuski"],"abstract":"We present the implementation of an autonomous chatbot, SHIHbot, deployed on Facebook, which answers a wide variety of sexual health questions on HIV\/AIDS. The chatbot{'}s response database is com-piled from professional medical and public health resources in order to provide reliable information to users. The system{'}s backend is NPCEditor, a response selection platform trained on linked questions and answers; to our knowledge this is the first retrieval-based chatbot deployed on a large public social network.","pages":"370--373","doi":"10.18653\/v1\/W17-5544","url":"https:\/\/www.aclweb.org\/anthology\/W17-5544","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5545","title":"How Would You Say It? Eliciting Lexically Diverse Dialogue for Supervised Semantic Parsing","authors":["Ravichander, Abhilasha","Manzini, Thomas","Grabmair, Matthias","Neubig, Graham","Francis, Jonathan","Nyberg, Eric"],"emails":["aravicha@cs.cmu.edu","tmanzini@cs.cmu.edu","mgrabmai@cs.cmu.edu","gneubig@cs.cmu.edu","jon.francis@us.bosch.com","ehn@cs.cmu.edu"],"author_id":["abhilasha-ravichander","thomas-manzini","matthias-grabmair","graham-neubig","jonathan-francis","eric-nyberg"],"abstract":"Building dialogue interfaces for real-world scenarios often entails training semantic parsers starting from zero examples. How can we build datasets that better capture the variety of ways users might phrase their queries, and what queries are actually realistic? Wang et al. (2015) proposed a method to build semantic parsing datasets by generating canonical utterances using a grammar and having crowdworkers paraphrase them into natural wording. A limitation of this approach is that it induces bias towards using similar language as the canonical utterances. In this work, we present a methodology that elicits meaningful and lexically diverse queries from users for semantic parsing tasks. Starting from a seed lexicon and a generative grammar, we pair logical forms with mixed text-image representations and ask crowdworkers to paraphrase and confirm the plausibility of the queries that they generated. We use this method to build a semantic parsing dataset from scratch for a dialog agent in a smart-home simulation. We find evidence that this dataset, which we have named SmartHome, is demonstrably more lexically diverse and difficult to parse than existing domain-specific semantic parsing datasets.","pages":"374--383","doi":"10.18653\/v1\/W17-5545","url":"https:\/\/www.aclweb.org\/anthology\/W17-5545","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5546","title":"Not All Dialogues are Created Equal: Instance Weighting for Neural Conversational Models","authors":["Lison, Pierre","Bibauw, Serge"],"emails":["plison@nr.no","serge.bibauw@kuleuven.be"],"author_id":["pierre-lison","serge-bibauw"],"abstract":"Neural conversational models require substantial amounts of dialogue data to estimate their parameters and are therefore usually learned on large corpora such as chat forums or movie subtitles. These corpora are, however, often challenging to work with, notably due to their frequent lack of turn segmentation and the presence of multiple references external to the dialogue itself. This paper shows that these challenges can be mitigated by adding a weighting model into the architecture. The weighting model, which is itself estimated from dialogue data, associates each training example to a numerical weight that reflects its intrinsic quality for dialogue modelling. At training time, these sample weights are included into the empirical loss to be minimised. Evaluation results on retrieval-based models trained on movie and TV subtitles demonstrate that the inclusion of such a weighting model improves the model performance on unsupervised metrics.","pages":"384--394","doi":"10.18653\/v1\/W17-5546","url":"https:\/\/www.aclweb.org\/anthology\/W17-5546","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"},{"id":"W17-5547","title":"A data-driven model of explanations for a chatbot that helps to practice conversation in a foreign language","authors":["H{\\\"o}hn, Sviatlana"],"emails":["s.hoehn@aiminds.ai"],"author_id":["sviatlana-hohn"],"abstract":"This article describes a model of other-initiated self-repair for a chatbot that helps to practice conversation in a foreign language. The model was developed using a corpus of instant messaging conversations between German native and non-native speakers. Conversation Analysis helped to create computational models from a small number of examples. The model has been validated in an AIML-based chatbot. Unlike typical retrieval-based dialogue systems, the explanations are generated at run-time from a linguistic database.","pages":"395--405","doi":"10.18653\/v1\/W17-5547","url":"https:\/\/www.aclweb.org\/anthology\/W17-5547","publisher":"Association for Computational Linguistics","address":"Saarbr{\\\"u}cken, Germany","year":"2017","month":"August","booktitle":"Proceedings of the 18th Annual {SIG}dial Meeting on Discourse and Dialogue"}]