[{"id":"W18-3701","title":"Generating Questions for Reading Comprehension using Coherence Relations","authors":["Desai, Takshak","Dakle, Parag","Moldovan, Dan"],"emails":["takshak.desai@utdallas.edu","paragpravin.dakle@utdallas.edu","moldovan@utdallas.edu"],"author_id":["takshak-desai","parag-dakle","dan-moldovan"],"abstract":"In this paper, we have proposed a technique for generating complex reading comprehension questions from a discourse that are more useful than factual ones derived from assertions. Our system produces a set of general-level questions using coherence relations and a set of well-defined syntactic transformations on the input text. Generated questions evaluate comprehension abilities like a comprehensive analysis of the text and its structure, correct identification of the author{'}s intent, a thorough evaluation of stated arguments; and a deduction of the high-level semantic relations that hold between text spans. Experiments performed on the RST-DT corpus allow us to conclude that our system possesses a strong aptitude for generating intricate questions. These questions are capable of effectively assessing a student{'}s interpretation of the text.","pages":"1--10","doi":"10.18653\/v1\/W18-3701","url":"https:\/\/www.aclweb.org\/anthology\/W18-3701","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3702","title":"Syntactic and Lexical Approaches to Reading Comprehension","authors":["Lin, Henry"],"emails":["esotericbubba@hotmail.com"],"author_id":["henry-lin"],"abstract":"Among the challenges of teaching reading comprehension in K {--} 12 are identifying the portions of a text that are difficult for a student, comprehending major critical ideas, and understanding context-dependent polysemous words. We present a simple, unsupervised but robust and accurate syntactic method for achieving the first objective and a modified hierarchical lexical method for the second objective. Focusing on pinpointing troublesome sentences instead of the overall readability and on concepts central to a reading, we believe these methods will greatly facilitate efforts to help students improve reading skills","pages":"11--19","doi":"10.18653\/v1\/W18-3702","url":"https:\/\/www.aclweb.org\/anthology\/W18-3702","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3703","title":"Feature Optimization for Predicting Readability of {A}rabic {L}1 and {L}2","authors":["Saddiki, Hind","Habash, Nizar","Cavalli-Sforza, Violetta","Al Khalil, Muhamed"],"emails":["hind.saddiki@nyu.edu","nizar.habash@nyu.edu","v.cavallisforza@aui.ma","muhamed.alkhalil@nyu.edu"],"author_id":["hind-saddiki","nizar-habash","violetta-cavalli-sforza","muhamed-al-khalil1"],"abstract":"Advances in automatic readability assessment can impact the way people consume information in a number of domains. Arabic, being a low-resource and morphologically complex language, presents numerous challenges to the task of automatic readability assessment. In this paper, we present the largest and most in-depth computational readability study for Arabic to date. We study a large set of features with varying depths, from shallow words to syntactic trees, for both L1 and L2 readability tasks. Our best L1 readability accuracy result is 94.8{\\%} (75{\\%} error reduction from a commonly used baseline). The comparable results for L2 are 72.4{\\%} (45{\\%} error reduction). We also demonstrate the added value of leveraging L1 features for L2 readability prediction.","pages":"20--29","doi":"10.18653\/v1\/W18-3703","url":"https:\/\/www.aclweb.org\/anthology\/W18-3703","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3704","title":"A Tutorial {M}arkov Analysis of Effective Human Tutorial Sessions","authors":["Maharjan, Nabin","Rus, Vasile"],"emails":["nmharjan@memphis.edu","vrus@memphis.edu"],"author_id":["nabin-maharjan","vasile-rus"],"abstract":"This paper investigates what differentiates effective tutorial sessions from less effective sessions. Towards this end, we characterize and explore human tutors{'} actions in tutorial dialogue sessions by mapping the tutor-tutee interactions, which are streams of dialogue utterances, into streams of actions, based on the language-as-action theory. Next, we use human expert judgment measures, evidence of learning (EL) and evidence of soundness (ES), to identify effective and ineffective sessions. We perform sub-sequence pattern mining to identify sub-sequences of dialogue modes that discriminate good sessions from bad sessions. We finally use the results of sub-sequence analysis method to generate a tutorial Markov process for effective tutorial sessions.","pages":"30--34","doi":"10.18653\/v1\/W18-3704","url":"https:\/\/www.aclweb.org\/anthology\/W18-3704","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3705","title":"Thank {``}Goodness{''}! A Way to Measure Style in Student Essays","authors":["Mathias, Sandeep","Bhattacharyya, Pushpak"],"emails":["sam@cse.iitb.ac.in","pb@cse.iitb.ac.in"],"author_id":["sandeep-mathias","pushpak-bhattacharyya"],"abstract":"Essays have two major components for scoring - content and style. In this paper, we describe a property of the essay, called goodness, and use it to predict the score given for the style of student essays. We compare our approach to solve this problem with baseline approaches, like language modeling and also a state-of-the-art deep learning system. We show that, despite being quite intuitive, our approach is very powerful in predicting the style of the essays.","pages":"35--41","doi":"10.18653\/v1\/W18-3705","url":"https:\/\/www.aclweb.org\/anthology\/W18-3705","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3706","title":"Overview of {NLPTEA}-2018 Share Task {C}hinese Grammatical Error Diagnosis","authors":["Rao, Gaoqi","Gong, Qi","Zhang, Baolin","Xun, Endong"],"emails":["raogaoqi@blcu.edu.cn","gongqi@blcu.edu.cn","zhangbaolin@blcu.edu.cn","xunendong@blcu.edu.cn"],"author_id":["gaoqi-rao","qi-gong","baolin-zhang","endong-xun"],"abstract":"This paper presents the NLPTEA 2018 shared task for Chinese Grammatical Error Diagnosis (CGED) which seeks to identify grammatical error types, their range of occurrence and recommended corrections within sentences written by learners of Chinese as foreign language. We describe the task definition, data preparation, performance metrics, and evaluation results. Of the 20 teams registered for this shared task, 13 teams developed the system and submitted a total of 32 runs. Progress in system performances was obviously, reaching F1 of 36.12{\\%} in position level and 25.27{\\%} in correction level. All data sets with gold standards and scoring scripts are made publicly available to researchers.","pages":"42--51","doi":"10.18653\/v1\/W18-3706","url":"https:\/\/www.aclweb.org\/anthology\/W18-3706","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3707","title":"{C}hinese Grammatical Error Diagnosis using Statistical and Prior Knowledge driven Features with Probabilistic Ensemble Enhancement","authors":["Fu, Ruiji","Pei, Zhengqi","Gong, Jiefu","Song, Wei","Teng, Dechuan","Che, Wanxiang","Wang, Shijin","Hu, Guoping","Liu, Ting"],"emails":["rjfu@iflytek.com","zhengqi.pei@mail.utoronto.ca","jfgong@iflytek.com","wsong@cnu.edu.cn","dcteng@ir.hit.edu.cn","car@ir.hit.edu.cn","sjwang3@iflytek.com","gphu@iflytek.com","tliu@ir.hit.edu.cn"],"author_id":["ruiji-fu","zhengqi-pei","jiefu-gong","wei-song","dechuan-teng","wanxiang-che","shijin-wang","guoping-hu","ting-liu"],"abstract":"This paper describes our system at NLPTEA-2018 Task {\\#}1: Chinese Grammatical Error Diagnosis. Grammatical Error Diagnosis is one of the most challenging NLP tasks, which is to locate grammar errors and tell error types. Our system is built on the model of bidirectional Long Short-Term Memory with a conditional random field layer (BiLSTM-CRF) but integrates with several new features. First, richer features are considered in the BiLSTM-CRF model; second, a probabilistic ensemble approach is adopted; third, Template Matcher are used during a post-processing to bring in human knowledge. In official evaluation, our system obtains the highest F1 scores at identifying error types and locating error positions, the second highest F1 score at sentence level error detection. We also recommend error corrections for specific error types and achieve the best F1 performance among all participants.","pages":"52--59","doi":"10.18653\/v1\/W18-3707","url":"https:\/\/www.aclweb.org\/anthology\/W18-3707","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3708","title":"A Hybrid System for {C}hinese Grammatical Error Diagnosis and Correction","authors":["Li, Chen","Zhou, Junpei","Bao, Zuyi","Liu, Hengyou","Xu, Guangwei","Li, Linlin"],"emails":["linyan.lll@alibaba-inc.com","jpzhou1996@gmail.com","zuyi.bzy@alibaba-inc.com","hengyou.lhy@alibaba-inc.com","puji.lc@alibaba-inc.com","kunka.xgw@taobao.com"],"author_id":["chen-li","junpei-zhou","zuyi-bao","hengyou-liu","guangwei-xu","linlin-li"],"abstract":"This paper introduces the DM{\\_}NLP team{'}s system for NLPTEA 2018 shared task of Chinese Grammatical Error Diagnosis (CGED), which can be used to detect and correct grammatical errors in texts written by Chinese as a Foreign Language (CFL) learners. This task aims at not only detecting four types of grammatical errors including redundant words (R), missing words (M), bad word selection (S) and disordered words (W), but also recommending corrections for errors of M and S types. We proposed a hybrid system including four models for this task with two stages: the detection stage and the correction stage. In the detection stage, we first used a BiLSTM-CRF model to tag potential errors by sequence labeling, along with some handcraft features. Then we designed three Grammatical Error Correction (GEC) models to generate corrections, which could help to tune the detection result. In the correction stage, candidates were generated by the three GEC models and then merged to output the final corrections for M and S types. Our system reached the highest precision in the correction subtask, which was the most challenging part of this shared task, and got top 3 on F1 scores for position detection of errors.","pages":"60--69","doi":"10.18653\/v1\/W18-3708","url":"https:\/\/www.aclweb.org\/anthology\/W18-3708","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3709","title":"Ling@{CASS} Solution to the {NLP}-{TEA} {CGED} Shared Task 2018","authors":["Hu, Qinan","Zhang, Yongwei","Liu, Fang","Gu, Yueguo"],"emails":["qinan.hu@qq.com","zhangyw@cass.org.cn","liu_fang@pku.edu.cn","gyg@beiwaionline.com"],"author_id":["qinan-hu","yongwei-zhang","fang-liu","yueguo-gu"],"abstract":"In this study, we employ the sequence to sequence learning to model the task of grammar error correction. The system takes potentially erroneous sentences as inputs, and outputs correct sentences. To breakthrough the bottlenecks of very limited size of manually labeled data, we adopt a semi-supervised approach. Specifically, we adapt correct sentences written by native Chinese speakers to generate pseudo grammatical errors made by learners of Chinese as a second language. We use the pseudo data to pre-train the model, and the CGED data to fine-tune it. Being aware of the significance of precision in a grammar error correction system in real scenarios, we use ensembles to boost precision. When using inputs as simple as Chinese characters, the ensembled system achieves a precision at 86.56{\\%} in the detection of erroneous sentences, and a precision at 51.53{\\%} in the correction of errors of Selection and Missing types.","pages":"70--76","doi":"10.18653\/v1\/W18-3709","url":"https:\/\/www.aclweb.org\/anthology\/W18-3709","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3710","title":"{C}hinese Grammatical Error Diagnosis Based on Policy Gradient {LSTM} Model","authors":["Li, Changliang","Qi, Ji"],"emails":["lichangliang@kingsoft.com","ji.qi@cuc.edu.cn"],"author_id":["changliang-li","ji-qi"],"abstract":"Chinese Grammatical Error Diagnosis (CGED) is a natural language processing task for the NLPTEA2018 workshop held during ACL2018. The goal of this task is to diagnose Chinese sentences containing four kinds of grammatical errors through the model and find out the sentence errors. Chinese grammatical error diagnosis system is a very important tool, which can help Chinese learners automatically diagnose grammatical errors in many scenarios. However, due to the limitations of the Chinese language{'}s own characteristics and datasets, the traditional model faces the problem of extreme imbalances in the positive and negative samples and the disappearance of gradients. In this paper, we propose a sequence labeling method based on the Policy Gradient LSTM model and apply it to this task to solve the above problems. The results show that our model can achieve higher precision scores in the case of lower False positive rate (FPR) and it is convenient to optimize the model on-line.","pages":"77--82","doi":"10.18653\/v1\/W18-3710","url":"https:\/\/www.aclweb.org\/anthology\/W18-3710","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3711","title":"The Importance of Recommender and Feedback Features in a Pronunciation Learning Aid","authors":["Fudholi, Dzikri","Suominen, Hanna"],"emails":["u5857432@alumni.anu.edu.au","hanna.suominen@anu.edu.au"],"author_id":["dzikri-fudholi","hanna-suominen"],"abstract":"Verbal communication {---} and pronunciation as its part {---} is a core skill that can be developed through guided learning. An artificial intelligence system can take a role in these guided learning approaches as an enabler of an application for pronunciation learning with a recommender system to guide language learners through exercises and feedback system to correct their pronunciation. In this paper, we report on a user study on language learners{'} perceived usefulness of the application. 16 international students who spoke non-native English and lived in Australia participated. 13 of them said they need to improve their pronunciation skills in English because of their foreign accent. The feedback system with features for pronunciation scoring, speech replay, and giving a pronunciation example was deemed essential by most of the respondents. In contrast, a clear dichotomy between the recommender system perceived as useful or useless existed; the system had features to prompt new common words or old poorly-scored words. These results can be used to target research and development from information retrieval and reinforcement learning for better and better recommendations to speech recognition and speech analytics for accent acquisition.","pages":"83--87","doi":"10.18653\/v1\/W18-3711","url":"https:\/\/www.aclweb.org\/anthology\/W18-3711","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3712","title":"Selecting {NLP} Techniques to Evaluate Learning Design Objectives in Collaborative Multi-perspective Elaboration Activities","authors":["Bakharia, Aneesha"],"emails":["aneesha.bakharia@gmai.com"],"author_id":["aneesha-bakharia"],"abstract":"PerspectivesX is a multi-perspective elaboration tool designed to encourage learner submission and curation across a range of collaborative learning activities. In this paper, it is shown that the learning design objectives of collaborative learning activities can be evaluated using NLP techniques, but that careful analysis of learner impact and pedagogical intent are required in order to select appropriate techniques. In particular, this paper focuses on the NLP techniques required to deliver an instructor dashboard, personalized learner feedback and content recommendation within multi-perspective elaboration activities. Key NLP techniques considered for inclusion include summarization, topic modeling, paraphrase detection and diversified content recommendation.","pages":"88--92","doi":"10.18653\/v1\/W18-3712","url":"https:\/\/www.aclweb.org\/anthology\/W18-3712","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3713","title":"Augmenting Textual Qualitative Features in Deep Convolution Recurrent Neural Network for Automatic Essay Scoring","authors":["Dasgupta, Tirthankar","Naskar, Abir","Dey, Lipika","Saha, Rupsa"],"emails":["dasgupta.tirthankar@tcs.com","abir.naskar@tcs.com","lipika.dey@tcs.com","rupsa.s@tcs.com"],"author_id":["tirthankar-dasgupta","abir-naskar","lipika-dey","rupsa-saha"],"abstract":"In this paper we present a qualitatively enhanced deep convolution recurrent neural network for computing the quality of a text in an automatic essay scoring task. The novelty of the work lies in the fact that instead of considering only the word and sentence representation of a text, we try to augment the different complex linguistic, cognitive and psycological features associated within a text document along with a hierarchical convolution recurrent neural network framework. Our preliminary investigation shows that incorporation of such qualitative feature vectors along with standard word\/sentence embeddings can give us better understanding about improving the overall evaluation of the input essays.","pages":"93--102","doi":"10.18653\/v1\/W18-3713","url":"https:\/\/www.aclweb.org\/anthology\/W18-3713","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3714","title":"Joint learning of frequency and word embeddings for multilingual readability assessment","authors":["Le, Dieu-Thu","Nguyen, Cam-Tu","Wang, Xiaoliang"],"emails":["thu@ims.uni-stuttgart.de","ncamtu@nju.edu.cn","waxili@nju.edu.cn"],"author_id":["dieu-thu-le","cam-tu-nguyen","xiaoliang-wang"],"abstract":"This paper describes two models that employ word frequency embeddings to deal with the problem of readability assessment in multiple languages. The task is to determine the difficulty level of a given document, i.e., how hard it is for a reader to fully comprehend the text. The proposed models show how frequency information can be integrated to improve the readability assessment. The experimental results testing on both English and Chinese datasets show that the proposed models improve the results notably when comparing to those using only traditional word embeddings.","pages":"103--107","doi":"10.18653\/v1\/W18-3714","url":"https:\/\/www.aclweb.org\/anthology\/W18-3714","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3715","title":"{MULLE}: A grammar-based {L}atin language learning tool to supplement the classroom setting","authors":["Lange, Herbert","Ljungl{\\\"o}f, Peter"],"emails":["herbert.lange@cse.gu.se","peter.ljunglof@cse.gu.se"],"author_id":["herbert-lange","peter-ljunglof"],"abstract":"MULLE is a tool for language learning that focuses on teaching Latin as a foreign language. It is aimed for easy integration into the traditional classroom setting and syllabus, which makes it distinct from other language learning tools that provide standalone learning experience. It uses grammar-based lessons and embraces methods of gamification to improve the learner motivation. The main type of exercise provided by our application is to practice translation, but it is also possible to shift the focus to vocabulary or morphology training.","pages":"108--112","doi":"10.18653\/v1\/W18-3715","url":"https:\/\/www.aclweb.org\/anthology\/W18-3715","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3716","title":"Textual Features Indicative of Writing Proficiency in Elementary School {S}panish Documents","authors":["Bel-Enguix, Gemma","Due{\\~n}as Ch{\\'a}vez, Diana","Curiel D{\\'\\i}az, Arturo"],"emails":["me@arturocuriel.com","",""],"author_id":["gemma-bel-enguix","diana-duenas-chavez","arturo-curiel"],"abstract":"Childhood acquisition of written language is not straightforward. Writing skills evolve differently depending on external factors, such as the conditions in which children practice their productions and the quality of their instructors{'} guidance. This can be challenging in low-income areas, where schools may struggle to ensure ideal acquisition conditions. Developing computational tools to support the learning process may counterweight negative environmental influences; however, few work exists on the use of information technologies to improve childhood literacy. This work centers around the computational study of Spanish word and syllable structure in documents written by 2nd and 3rd year elementary school students. The studied texts were compared against a corpus of short stories aimed at the same age group, so as to observe whether the children tend to produce similar written patterns as the ones they are expected to interpret at their literacy level. The obtained results show some significant differences between the two kinds of texts, pointing towards possible strategies for the implementation of new education software in support of written language acquisition.","pages":"113--118","doi":"10.18653\/v1\/W18-3716","url":"https:\/\/www.aclweb.org\/anthology\/W18-3716","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3717","title":"Assessment of an Index for Measuring Pronunciation Difficulty","authors":["Kotani, Katsunori","Yoshimi, Takehiko"],"emails":["kkotani@kansaigaidai.ac.jp","yoshimi@rins.ryukoku.ac.jp"],"author_id":["katsunori-kotani","takehiko-yoshimi"],"abstract":"This study assesses an index for measur-ing the pronunciation difficulty of sen-tences (henceforth, pronounceability) based on the normalized edit distance from a reference sentence to a transcrip-tion of learners{'} pronunciation. Pro-nounceability should be examined when language teachers use a computer-assisted language learning system for pronunciation learning to maintain the motivation of learners. However, unlike the evaluation of learners{'} pronunciation performance, previous research did not focus on pronounceability not only for English but also for Asian languages. This study found that the normalized edit distance was reliable but not valid. The lack of validity appeared to be because of an English test used for determining the proficiency of learners.","pages":"119--124","doi":"10.18653\/v1\/W18-3717","url":"https:\/\/www.aclweb.org\/anthology\/W18-3717","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3718","title":"A Short Answer Grading System in {C}hinese by Support Vector Approach","authors":["Wu, Shih-Hung","Shih, Wen-Feng"],"emails":["shwu@cyut.edu.tw","wu0fu491@gmail.com"],"author_id":["shih-hung-wu","wen-feng-shih"],"abstract":"In this paper, we report a short answer grading system in Chinese. We build a system based on standard machine learning approaches and test it with translated corpus from two publicly available corpus in English. The experiment results show similar results on two different corpus as in English.","pages":"125--129","doi":"10.18653\/v1\/W18-3718","url":"https:\/\/www.aclweb.org\/anthology\/W18-3718","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3719","title":"From Fidelity to Fluency: Natural Language Processing for Translator Training","authors":["Kwong, Oi Yee"],"emails":["oykwong@arts.cuhk.edu.hk"],"author_id":["olivia-o-y-kwong"],"abstract":"This study explores the use of natural language processing techniques to enhance bilingual lexical access beyond simple equivalents, to enable translators to navigate along a wider cross-lingual lexical space and more examples showing different translation strategies, which is essential for them to learn to produce not only faithful but also fluent translations.","pages":"130--134","doi":"10.18653\/v1\/W18-3719","url":"https:\/\/www.aclweb.org\/anthology\/W18-3719","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3720","title":"Countering Position Bias in Instructor Interventions in {MOOC} Discussion Forums","authors":["Chandrasekaran, Muthu Kumar","Kan, Min-Yen"],"emails":["muthu.chandra@comp.nus.edu.sg","kanmy@comp.nus.edu.sg"],"author_id":["muthu-kumar-chandrasekaran","min-yen-kan"],"abstract":"We systematically confirm that instructors are strongly influenced by the user interface presentation of Massive Online Open Course (MOOC) discussion forums. In a large scale dataset, we conclusively show that instructor interventions exhibit strong position bias, as measured by the position where the thread appeared on the user interface at the time of intervention. We measure and remove this bias, enabling unbiased statistical modelling and evaluation. We show that our de-biased classifier improves predicting interventions over the state-of-the-art on courses with sufficient number of interventions by 8.2{\\%} in F1 and 24.4{\\%} in recall on average.","pages":"135--142","doi":"10.18653\/v1\/W18-3720","url":"https:\/\/www.aclweb.org\/anthology\/W18-3720","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3721","title":"Measuring Beginner Friendliness of {J}apanese Web Pages explaining Academic Concepts by Integrating Neural Image Feature and Text Features","authors":["Shiokawa, Hayato","Kawaguchi, Kota","Han, Bingcai","Utsuro, Takehito","Kawada, Yasuhide","Yoshioka, Masaharu","Kando, Noriko"],"emails":["","","","","","",""],"author_id":["hayato-shiokawa","kota-kawaguchi","bingcai-han","takehito-utsuro","yasuhide-kawada","masaharu-yoshioka","noriko-kando"],"abstract":"Search engine is an important tool of modern academic study, but the results are lack of measurement of beginner friendliness. In order to improve the efficiency of using search engine for academic study, it is necessary to invent a technique of measuring the beginner friendliness of a Web page explaining academic concepts and to build an automatic measurement system. This paper studies how to integrate heterogeneous features such as a neural image feature generated from the image of the Web page by a variant of CNN (convolutional neural network) as well as text features extracted from the body text of the HTML file of the Web page. Integration is performed through the framework of the SVM classifier learning. Evaluation results show that heterogeneous features perform better than each individual type of features.","pages":"143--151","doi":"10.18653\/v1\/W18-3721","url":"https:\/\/www.aclweb.org\/anthology\/W18-3721","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3722","title":"Learning to Automatically Generate Fill-In-The-Blank Quizzes","authors":["Marrese-Taylor, Edison","Nakajima, Ai","Matsuo, Yutaka","Yuichi, Ono"],"emails":["emarrese@weblab.t.u-tokyo.ac.jp","ainakajima@weblab.t.u-tokyo.ac.jp","matsuo@weblab.t.u-tokyo.ac.jp","ono.yuichi.ga@u.tsukuba.ac.jp"],"author_id":["edison-marrese-taylor","ai-nakajima","yutaka-matsuo","ono-yuichi"],"abstract":"In this paper we formalize the problem automatic fill-in-the-blank question generation using two standard NLP machine learning schemes, proposing concrete deep learning models for each. We present an empirical study based on data obtained from a language learning platform showing that both of our proposed settings offer promising results.","pages":"152--156","doi":"10.18653\/v1\/W18-3722","url":"https:\/\/www.aclweb.org\/anthology\/W18-3722","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3723","title":"Multilingual Short Text Responses Clustering for Mobile Educational Activities: a Preliminary Exploration","authors":["Tseng, Yuen-Hsien","Lee, Lung-Hao","Chien, Yu-Ta","Chang, Chun-Yen","Li, Tsung-Yen"],"emails":["samtseng@ntnu.edu.tw","lhlee@ntu.edu.tw","ytchien@ntou.edu.tw","changcy@ntnu.edu.tw","yan@ntnu.edu.tw"],"author_id":["yuen-hsien-tseng","lung-hao-lee","yu-ta-chien","chun-yen-chang","tsung-yen-li"],"abstract":"Text clustering is a powerful technique to detect topics from document corpora, so as to provide information browsing, analysis, and organization. On the other hand, the Instant Response System (IRS) has been widely used in recent years to enhance student engagement in class and thus improve their learning effectiveness. However, the lack of functions to process short text responses from the IRS prevents the further application of IRS in classes. Therefore, this study aims to propose a proper short text clustering module for the IRS, and demonstrate our implemented techniques through real-world examples, so as to provide experiences and insights for further study. In particular, we have compared three clustering methods and the result shows that theoretically better methods need not lead to better results, as there are various factors that may affect the final performance.","pages":"157--164","doi":"10.18653\/v1\/W18-3723","url":"https:\/\/www.aclweb.org\/anthology\/W18-3723","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3724","title":"{C}hinese Grammatical Error Diagnosis Based on {CRF} and {LSTM}-{CRF} model","authors":["Zhou, Yujie","Shao, Yinan","Zhou, Yong"],"emails":["yzhou@ied.ecnu.edu.cn","",""],"author_id":["yujie-zhou","yinan-shao","yong-zhou"],"abstract":"When learning Chinese as a foreign language, the learners may have some grammatical errors due to negative migration of their native languages. However, few grammar checking applications have been developed to support the learners. The goal of this paper is to develop a tool to automatically diagnose four types of grammatical errors which are redundant words (R), missing words (M), bad word selection (S) and disordered words (W) in Chinese sentences written by those foreign learners. In this paper, a conventional linear CRF model with specific feature engineering and a LSTM-CRF model are used to solve the CGED (Chinese Grammatical Error Diagnosis) task. We make some improvement on both models and the submitted results have better performance on false positive rate and accuracy than the average of all runs from CGED2018 for all three evaluation levels.","pages":"165--171","doi":"10.18653\/v1\/W18-3724","url":"https:\/\/www.aclweb.org\/anthology\/W18-3724","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3725","title":"Contextualized Character Representation for {C}hinese Grammatical Error Diagnosis","authors":["Zhao, Jianbo","Li, Si","Lin, Zhiqing"],"emails":["zhaojianbo@bupt.edu.cn","lisi@bupt.edu.cn","linzq@bupt.edu.cn"],"author_id":["jianbo-zhao","si-li","zhiqing-lin"],"abstract":"Nowadays, more and more people are learning Chinese as their second language. Establishing an automatic diagnosis system for Chinese grammatical error has become an important challenge. In this paper, we propose a Chinese grammatical error diagnosis (CGED) model with contextualized character representation. Compared to the traditional model using LSTM (Long-Short Term Memory), our model have better performance and there is no need to add too many artificial features.","pages":"172--179","doi":"10.18653\/v1\/W18-3725","url":"https:\/\/www.aclweb.org\/anthology\/W18-3725","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3726","title":"{CMMC}-{BDRC} Solution to the {NLP}-{TEA}-2018 {C}hinese Grammatical Error Diagnosis Task","authors":["Zhang, Yongwei","Hu, Qinan","Liu, Fang","Gu, Yueguo"],"emails":["zhangyw@cass.org.cn","qinan.hu@qq.com","liu_fang@pku.edu.cn","gyg@beiwaionline.com"],"author_id":["yongwei-zhang","qinan-hu","fang-liu","yueguo-gu"],"abstract":"Chinese grammatical error diagnosis is an important natural language processing (NLP) task, which is also an important application using artificial intelligence technology in language education. This paper introduces a system developed by the Chinese Multilingual {\\&} Multimodal Corpus and Big Data Research Center for the NLP-TEA shared task, named Chinese Grammar Error Diagnosis (CGED). This system regards diagnosing errors task as a sequence tagging problem, while takes correction task as a text classification problem. Finally, in the 12 teams, this system gets the highest F1 score in the detection task and the second highest F1 score in mean in the identification task, position task and the correction task.","pages":"180--187","doi":"10.18653\/v1\/W18-3726","url":"https:\/\/www.aclweb.org\/anthology\/W18-3726","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3727","title":"Detecting Simultaneously {C}hinese Grammar Errors Based on a {B}i{LSTM}-{CRF} Model","authors":["Liu, Yajun","Zan, Hongying","Zhong, Mengjie","Ma, Hongchao"],"emails":["liuyajun_gz@163.com","iehyzan@zzu.edu.cn","1837361628@qq.com","ma-hc@foxmail.com"],"author_id":["yajun-liu","hongying-zan","mengjie-zhong","hongchao-ma"],"abstract":"In the process of learning and using Chinese, many learners of Chinese as foreign language(CFL) may have grammar errors due to negative migration of their native languages. This paper introduces our system that can simultaneously diagnose four types of grammatical errors including redundant (R), missing (M), selection (S), disorder (W) in NLPTEA-5 shared task. We proposed a Bidirectional LSTM CRF neural network (BiLSTM-CRF) that combines BiLSTM and CRF without hand-craft features for Chinese Grammatical Error Diagnosis (CGED). Evaluation includes three levels, which are detection level, identification level and position level. At the detection level and identification level, our system got the third recall scores, and achieved good F1 values.","pages":"188--193","doi":"10.18653\/v1\/W18-3727","url":"https:\/\/www.aclweb.org\/anthology\/W18-3727","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3728","title":"A Hybrid Approach Combining Statistical Knowledge with Conditional Random Fields for {C}hinese Grammatical Error Detection","authors":["Wang, Yiyi","Shih, Chilin"],"emails":["ywang418@uiuc.edu","cls@uiuc.edu"],"author_id":["yiyi-wang","chilin-shih"],"abstract":"This paper presents a method of combining Conditional Random Fields (CRFs) model with a post-processing layer using Google n-grams statistical information tailored to detect word selection and word order errors made by learners of Chinese as Foreign Language (CFL). We describe the architecture of the model and its performance in the shared task of the ACL 2018 Workshop on Natural Language Processing Techniques for Educational Applications (NLPTEA). This hybrid approach yields comparably high false positive rate (FPR = 0.1274) and precision (Pd= 0.7519; Pi= 0.6311), but low recall (Rd = 0.3035; Ri = 0.1696 ) in grammatical error detection and identification tasks. Additional statistical information and linguistic rules can be added to enhance the model performance in the future.","pages":"194--198","doi":"10.18653\/v1\/W18-3728","url":"https:\/\/www.aclweb.org\/anthology\/W18-3728","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3729","title":"{CYUT}-{III} Team {C}hinese Grammatical Error Diagnosis System Report in {NLPTEA}-2018 {CGED} Shared Task","authors":["Wu, Shih-Hung","Wang, Jun-Wei","Chen, Liang-Pu","Yang, Ping-Che"],"emails":["shwu@cyut.edu.tw","eit@iii.org.tw","maciaclark@iii.org.tw",""],"author_id":["shih-hung-wu","jun-wei-wang","liang-pu-chen","ping-che-yang"],"abstract":"This paper reports how we build a Chinese Grammatical Error Diagnosis system in the NLPTEA-2018 CGED shared task. In 2018, we sent three runs with three different approaches. The first one is a pattern-based approach by frequent error pattern matching. The second one is a sequential labelling approach by conditional random fields (CRF). The third one is a rewriting approach by sequence to sequence (seq2seq) model. The three approaches have different properties that aim to optimize different performance metrics and the formal run results show the differences as we expected.","pages":"199--202","doi":"10.18653\/v1\/W18-3729","url":"https:\/\/www.aclweb.org\/anthology\/W18-3729","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"},{"id":"W18-3730","title":"Detecting Grammatical Errors in the {NTOU} {CGED} System by Identifying Frequent Subsentences","authors":["Lin, Chuan-Jie","Chen, Shao-Heng"],"emails":["cjlin@mail.ntou.edu.tw","shchen.cse@mail.ntou.edu.tw"],"author_id":["chuan-jie-lin","shao-heng-chen"],"abstract":"The main goal of Chinese grammatical error diagnosis task is to detect word er-rors in the sentences written by Chinese-learning students. Our previous system would generate error-corrected sentences as candidates and their sentence likeli-hood were measured based on a large scale Chinese n-gram dataset. This year we further tried to identify long frequent-ly-seen subsentences and label them as correct in order to avoid propose too many error candidates. Two new methods for suggesting missing and selection er-rors were also tested.","pages":"203--206","doi":"10.18653\/v1\/W18-3730","url":"https:\/\/www.aclweb.org\/anthology\/W18-3730","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the 5th Workshop on Natural Language Processing Techniques for Educational Applications"}]