[{"id":"W18-1701","title":"Scientific Discovery as Link Prediction in Influence and Citation Graphs","authors":["Luo, Fan","Valenzuela-Esc{\\'a}rcega, Marco A.","Hahn-Powell, Gus","Surdeanu, Mihai"],"emails":["fanluo@email.arizona.edu","marcov@email.arizona.edu","hahnpowell@email.arizona.edu","msurdeanu@email.arizona.edu"],"author_id":["fan-luo","marco-a-valenzuela-escarcega","gus-hahn-powell","mihai-surdeanu"],"abstract":"We introduce a machine learning approach for the identification of {``}white spaces{''} in scientific knowledge. Our approach addresses this task as link prediction over a graph that contains over 2M influence statements such as {``}CTCF activates FOXA1{''}, which were automatically extracted using open-domain machine reading. We model this prediction task using graph-based features extracted from the above influence graph, as well as from a citation graph that captures scientific communities. We evaluated the proposed approach through backtesting. Although the data is heavily unbalanced (50 times more negative examples than positives), our approach predicts which influence links will be discovered in the {``}near future{''} with a F1 score of 27 points, and a mean average precision of 68{\\%}.","pages":"1--6","doi":"10.18653\/v1\/W18-1701","url":"https:\/\/www.aclweb.org\/anthology\/W18-1701","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana, USA","year":"2018","month":"June","booktitle":"Proceedings of the Twelfth Workshop on Graph-Based Methods for Natural Language Processing ({T}ext{G}raphs-12)"},{"id":"W18-1702","title":"Efficient Generation and Processing of Word Co-occurrence Networks Using corpus2graph","authors":["Zhang, Zheng","Zweigenbaum, Pierre","Yin, Ruiqing"],"emails":["zheng.zhang@limsi.fr","pz@limsi.fr","ruiqing.yin@limsi.fr"],"author_id":["zheng-zhang","pierre-zweigenbaum","ruiqing-yin"],"abstract":"Corpus2graph is an open-source NLP-application-oriented tool that generates a word co-occurrence network from a large corpus. It not only contains different built-in methods to preprocess words, analyze sentences, extract word pairs and define edge weights, but also supports user-customized functions. By using parallelization techniques, it can generate a large word co-occurrence network of the whole English Wikipedia data within hours. And thanks to its nodes-edges-weight three-level progressive calculation design, rebuilding networks with different configurations is even faster as it does not need to start all over again. This tool also works with other graph libraries such as igraph, NetworkX and graph-tool as a front end providing data to boost network generation speed.","pages":"7--11","doi":"10.18653\/v1\/W18-1702","url":"https:\/\/www.aclweb.org\/anthology\/W18-1702","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana, USA","year":"2018","month":"June","booktitle":"Proceedings of the Twelfth Workshop on Graph-Based Methods for Natural Language Processing ({T}ext{G}raphs-12)"},{"id":"W18-1703","title":"Multi-hop Inference for Sentence-level {T}ext{G}raphs: How Challenging is Meaningfully Combining Information for Science Question Answering?","authors":["Jansen, Peter"],"emails":["pajansen@email.arizona.edu"],"author_id":["peter-jansen"],"abstract":"Question Answering for complex questions is often modelled as a graph construction or traversal task, where a solver must build or traverse a graph of facts that answer and explain a given question. This {``}multi-hop{''} inference has been shown to be extremely challenging, with few models able to aggregate more than two facts before being overwhelmed by {``}semantic drift{''}, or the tendency for long chains of facts to quickly drift off topic. This is a major barrier to current inference models, as even elementary science questions require an average of 4 to 6 facts to answer and explain. In this work we empirically characterize the difficulty of building or traversing a graph of sentences connected by lexical overlap, by evaluating chance sentence aggregation quality through 9,784 manually-annotated judgements across knowledge graphs built from three free-text corpora (including study guides and Simple Wikipedia). We demonstrate semantic drift tends to be high and aggregation quality low, at between 0.04 and 3, and highlight scenarios that maximize the likelihood of meaningfully combining information.","pages":"12--17","doi":"10.18653\/v1\/W18-1703","url":"https:\/\/www.aclweb.org\/anthology\/W18-1703","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana, USA","year":"2018","month":"June","booktitle":"Proceedings of the Twelfth Workshop on Graph-Based Methods for Natural Language Processing ({T}ext{G}raphs-12)"},{"id":"W18-1704","title":"Multi-Sentence Compression with Word Vertex-Labeled Graphs and Integer Linear Programming","authors":["Linhares Pontes, Elvys","Huet, St{\\'e}phane","Gouveia da Silva, Thiago","Linhares, Andr{\\'e}a carneiro","Torres-Moreno, Juan-Manuel"],"emails":["andrea@sobral.ufc.br","stephane.huet@univ-avignon.fr","thiago.gouveia@ifpb.edu.br","elvys.linhares-pontes@alumni.univ-avignon.fr","juan-manuel.torres@univ-avignon.fr"],"author_id":["elvys-linhares-pontes","stephane-huet","thiago-gouveia-da-silva","andrea-carneiro-linhares1","juan-manuel-torres-moreno"],"abstract":"Multi-Sentence Compression (MSC) aims to generate a short sentence with key information from a cluster of closely related sentences. MSC enables summarization and question-answering systems to generate outputs combining fully formed sentences from one or several documents. This paper describes a new Integer Linear Programming method for MSC using a vertex-labeled graph to select different keywords, and novel 3-gram scores to generate more informative sentences while maintaining their grammaticality. Our system is of good quality and outperforms the state-of-the-art for evaluations led on news dataset. We led both automatic and manual evaluations to determine the informativeness and the grammaticality of compressions for each dataset. Additional tests, which take advantage of the fact that the length of compressions can be modulated, still improve ROUGE scores with shorter output sentences.","pages":"18--27","doi":"10.18653\/v1\/W18-1704","url":"https:\/\/www.aclweb.org\/anthology\/W18-1704","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana, USA","year":"2018","month":"June","booktitle":"Proceedings of the Twelfth Workshop on Graph-Based Methods for Natural Language Processing ({T}ext{G}raphs-12)"},{"id":"W18-1705","title":"Large-scale spectral clustering using diffusion coordinates on landmark-based bipartite graphs","authors":["Pham, Khiem","Chen, Guangliang"],"emails":["khiem.pham@sjsu.edu","guangliang.chen@sjsu.edu"],"author_id":["khiem-pham","guangliang-chen"],"abstract":"Spectral clustering has received a lot of attention due to its ability to separate nonconvex, non-intersecting manifolds, but its high computational complexity has significantly limited its applicability. Motivated by the document-term co-clustering framework by Dhillon (2001), we propose a landmark-based scalable spectral clustering approach in which we first use the selected landmark set and the given data to form a bipartite graph and then run a diffusion process on it to obtain a family of diffusion coordinates for clustering. We show that our proposed algorithm can be implemented based on very efficient operations on the affinity matrix between the given data and selected landmarks, thus capable of handling large data. Finally, we demonstrate the excellent performance of our method by comparing with the state-of-the-art scalable algorithms on several benchmark data sets.","pages":"28--37","doi":"10.18653\/v1\/W18-1705","url":"https:\/\/www.aclweb.org\/anthology\/W18-1705","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana, USA","year":"2018","month":"June","booktitle":"Proceedings of the Twelfth Workshop on Graph-Based Methods for Natural Language Processing ({T}ext{G}raphs-12)"},{"id":"W18-1706","title":"Efficient Graph-based Word Sense Induction by Distributional Inclusion Vector Embeddings","authors":["Chang, Haw-Shiuan","Agrawal, Amol","Ganesh, Ananya","Desai, Anirudha","Mathur, Vinayak","Hough, Alfred","McCallum, Andrew"],"emails":["hschang@cs.umass.edu","amolagrawal@cs.umass.edu","aganesh@cs.umass.edu","anirudhadesa@cs.umass.edu","vinayak@cs.umass.edu","al.hough@lexalytics.com","mccallum@cs.umass.edu"],"author_id":["haw-shiuan-chang","amol-agrawal","ananya-ganesh","anirudha-desai","vinayak-mathur","alfred-hough","andrew-mccallum"],"abstract":"Word sense induction (WSI), which addresses polysemy by unsupervised discovery of multiple word senses, resolves ambiguities for downstream NLP tasks and also makes word representations more interpretable. This paper proposes an accurate and efficient graph-based method for WSI that builds a global non-negative vector embedding basis (which are interpretable like topics) and clusters the basis indexes in the ego network of each polysemous word. By adopting distributional inclusion vector embeddings as our basis formation model, we avoid the expensive step of nearest neighbor search that plagues other graph-based methods without sacrificing the quality of sense clusters. Experiments on three datasets show that our proposed method produces similar or better sense clusters and embeddings compared with previous state-of-the-art methods while being significantly more efficient.","pages":"38--48","doi":"10.18653\/v1\/W18-1706","url":"https:\/\/www.aclweb.org\/anthology\/W18-1706","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana, USA","year":"2018","month":"June","booktitle":"Proceedings of the Twelfth Workshop on Graph-Based Methods for Natural Language Processing ({T}ext{G}raphs-12)"},{"id":"W18-1707","title":"Fusing Document, Collection and Label Graph-based Representations with Word Embeddings for Text Classification","authors":["Skianis, Konstantinos","Malliaros, Fragkiskos","Vazirgiannis, Michalis"],"emails":["kskianis@lix.polytechnique.fr","fragkiskos.me@gmail.com","mvazirg@lix.polytechnique.fr"],"author_id":["konstantinos-skianis","fragkiskos-malliaros","michalis-vazirgiannis"],"abstract":"Contrary to the traditional Bag-of-Words approach, we consider the Graph-of-Words(GoW) model in which each document is represented by a graph that encodes relationships between the different terms. Based on this formulation, the importance of a term is determined by weighting the corresponding node in the document, collection and label graphs, using node centrality criteria. We also introduce novel graph-based weighting schemes by enriching graphs with word-embedding similarities, in order to reward or penalize semantic relationships. Our methods produce more discriminative feature weights for text categorization, outperforming existing frequency-based criteria.","pages":"49--58","doi":"10.18653\/v1\/W18-1707","url":"https:\/\/www.aclweb.org\/anthology\/W18-1707","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana, USA","year":"2018","month":"June","booktitle":"Proceedings of the Twelfth Workshop on Graph-Based Methods for Natural Language Processing ({T}ext{G}raphs-12)"},{"id":"W18-1708","title":"Embedding Text in Hyperbolic Spaces","authors":["Dhingra, Bhuwan","Shallue, Christopher","Norouzi, Mohammad","Dai, Andrew","Dahl, George"],"emails":["bdhingra@cs.cmu.edu","shallue@google.com","mnorouzi@google.com","adai@google.com","gdahl@google.com"],"author_id":["bhuwan-dhingra","christopher-shallue","mohammad-norouzi","andrew-dai","george-dahl"],"abstract":"Natural language text exhibits hierarchical structure in a variety of respects. Ideally, we could incorporate our prior knowledge of this hierarchical structure into unsupervised learning algorithms that work on text data. Recent work by Nickel and Kiela (2017) proposed using hyperbolic instead of Euclidean embedding spaces to represent hierarchical data and demonstrated encouraging results when embedding graphs. In this work, we extend their method with a re-parameterization technique that allows us to learn hyperbolic embeddings of arbitrarily parameterized objects. We apply this framework to learn word and sentence embeddings in hyperbolic space in an unsupervised manner from text corpora. The resulting embeddings seem to encode certain intuitive notions of hierarchy, such as word-context frequency and phrase constituency. However, the implicit continuous hierarchy in the learned hyperbolic space makes interrogating the model{'}s learned hierarchies more difficult than for models that learn explicit edges between items. The learned hyperbolic embeddings show improvements over Euclidean embeddings in some {--} but not all {--} downstream tasks, suggesting that hierarchical organization is more useful for some tasks than others.","pages":"59--69","doi":"10.18653\/v1\/W18-1708","url":"https:\/\/www.aclweb.org\/anthology\/W18-1708","publisher":"Association for Computational Linguistics","address":"New Orleans, Louisiana, USA","year":"2018","month":"June","booktitle":"Proceedings of the Twelfth Workshop on Graph-Based Methods for Natural Language Processing ({T}ext{G}raphs-12)"}]