[{"id":"W18-4201","title":"The effect of information controls on developers in China: An analysis of censorship in {C}hinese open source projects","authors":["Knockel, Jeffrey","Crete-Nishihata, Masashi","Ruan, Lotus"],"emails":["jeff@citizenlab.ca","masashi@citizenlab.ca","lotusruan@citizenlab.ca"],"author_id":["jeffrey-knockel","masashi-crete-nishihata","lotus-ruan"],"abstract":"Censorship of Internet content in China is understood to operate through a system of intermediary liability whereby service providers are liable for the content on their platforms. Previous work studying censorship has found huge variability in the implementation of censorship across different products even within the same industry segment. In this work we explore the extent to which these censorship features are present in the open source projects of individual developers in China by collecting their blacklists and comparing their similarity. We collect files from a popular online code repository, extract lists of strings, and then classify whether each is a Chinese blacklist. Overall, we found over 1,000 Chinese blacklists comprising over 200,000 unique keywords, representing the largest dataset of Chinese blacklisted keywords to date. We found very little keyword overlap between lists, raising questions as to their origins, as the lists seem too large to have been individually curated, yet the lack of overlap suggests that they have no common source.","pages":"1--11","url":"https:\/\/www.aclweb.org\/anthology\/W18-4201","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Natural Language Processing for {I}nternet Freedom"},{"id":"W18-4202","title":"Linguistic Characteristics of Censorable Language on {S}ina{W}eibo","authors":["Ng, Kei Yin","Feldman, Anna","Peng, Jing","Leberknight, Chris"],"emails":["ngk2@montclair.edu","feldmana@montclair.edu","pengj@montclair.edu","leberknightc@montclair.edu"],"author_id":["kei-yin-ng","anna-feldman","jing-peng","chris-leberknight"],"abstract":"This paper investigates censorship from a linguistic perspective. We collect a corpus of censored and uncensored posts on a number of topics, build a classifier that predicts censorship decisions independent of discussion topics. Our investigation reveals that the strongest linguistic indicator of censored content of our corpus is its readability.","pages":"12--22","url":"https:\/\/www.aclweb.org\/anthology\/W18-4202","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Natural Language Processing for {I}nternet Freedom"},{"id":"W18-4203","title":"Creative Language Encoding under Censorship","authors":["Ji, Heng","Knight, Kevin"],"emails":["jih@rpi.edu","knight@isi.edu"],"author_id":["heng-ji","kevin-knight"],"abstract":"People often create obfuscated language for online communication to avoid Internet censorship, share sensitive information, express strong sentiment or emotion, plan for secret actions, trade illegal products, or simply hold interesting conversations. In this position paper we systematically categorize human-created obfuscated language on various levels, investigate their basic mechanisms, give an overview on automated techniques needed to simulate human encoding. These encoders have potential to frustrate and evade, co-evolve with dynamic human or automated decoders, and produce interesting and adoptable code words. We also summarize remaining challenges for future research on the interaction between Natural Language Processing (NLP) and encryption, and leveraging NLP techniques for encoding and decoding.","pages":"23--33","url":"https:\/\/www.aclweb.org\/anthology\/W18-4203","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Natural Language Processing for {I}nternet Freedom"}]