[{"id":"W18-5801","title":"Efficient Computation of Implicational Universals in Constraint-Based Phonology Through the Hyperplane Separation Theorem","authors":["Magri, Giorgio"],"emails":["magrigrg@gmail.com"],"author_id":["giorgio-magri"],"abstract":"This paper focuses on the most basic implicational universals in phonological theory, called T-orders after Anttila and Andrus (2006). It develops necessary and sufficient constraint characterizations of T-orders within Harmonic Grammar and Optimality Theory. These conditions rest on the rich convex geometry underlying these frameworks. They are phonologically intuitive and have significant algorithmic implications.","pages":"1--10","doi":"10.18653\/v1\/W18-5801","url":"https:\/\/www.aclweb.org\/anthology\/W18-5801","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5802","title":"Lexical Networks in !{X}ung","authors":["Hussain, Syed-Amad","Elsner, Micha","Miller, Amanda"],"emails":["amanda.miller@247.ai","melsner0@gmail.com","amadh881@gmail.com"],"author_id":["syed-amad-hussain","micha-elsner","amanda-miller"],"abstract":"We investigate the lexical network properties of the large phoneme inventory Southern African language Mangetti Dune !Xung as it compares to English and other commonly-studied languages. Lexical networks are graphs in which nodes (words) are linked to their minimal pairs; global properties of these networks are believed to mediate lexical access in the minds of speakers. We show that the network properties of !Xung are within the range found in previously-studied languages. By simulating data ({``}pseudolexicons{''}) with varying levels of phonotactic structure, we find that the lexical network properties of !Xung diverge from previously-studied languages when fewer phonotactic constraints are retained. We conclude that lexical network properties are representative of an underlying cognitive structure which is necessary for efficient word retrieval and that the phonotactics of !Xung may be shaped by a selective pressure which preserves network properties within this cognitively useful range.","pages":"11--20","doi":"10.18653\/v1\/W18-5802","url":"https:\/\/www.aclweb.org\/anthology\/W18-5802","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5803","title":"Acoustic Word Disambiguation with Phonogical Features in {D}anish {ASR}","authors":["Kirkedal, Andreas S{\\o}eborg"],"emails":["akirkedal@interactions.com"],"author_id":["andreas-soeborg-kirkedal"],"abstract":"Phonological features can indicate word class and we can use word class information to disambiguate both homophones and homographs in automatic speech recognition (ASR).","pages":"21--31","doi":"10.18653\/v1\/W18-5803","url":"https:\/\/www.aclweb.org\/anthology\/W18-5803","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5804","title":"Adaptor Grammars for the Linguist: Word Segmentation Experiments for Very Low-Resource Languages","authors":["Godard, Pierre","Besacier, Laurent","Yvon, Fran{\\c{c}}ois","Adda-Decker, Martine","Adda, Gilles","Maynard, H{\\'e}l{\\`e}ne","Rialland, Annie"],"emails":["godard@limsi.fr","laurent.besacier@univ-grenoble-alpes.fr","yvon@limsi.fr","martine.adda-decker@univ-paris3.fr","gadda@limsi.fr","hbm@limsi.fr","annie.rialland@univ-paris3.fr"],"author_id":["pierre-godard","laurent-besacier","francois-yvon","martine-adda-decker","gilles-adda","helene-bonneau-maynard","annie-rialland"],"abstract":"Computational Language Documentation attempts to make the most recent research in speech and language technologies available to linguists working on language preservation and documentation. In this paper, we pursue two main goals along these lines. The first is to improve upon a strong baseline for the unsupervised word discovery task on two very low-resource Bantu languages, taking advantage of the expertise of linguists on these particular languages. The second consists in exploring the Adaptor Grammar framework as a decision and prediction tool for linguists studying a new language. We experiment 162 grammar configurations for each language and show that using Adaptor Grammars for word segmentation enables us to test hypotheses about a language. Specializing a generic grammar with language specific knowledge leads to great improvements for the word discovery task, ultimately achieving a leap of about 30{\\%} token F-score from the results of a strong baseline.","pages":"32--42","doi":"10.18653\/v1\/W18-5804","url":"https:\/\/www.aclweb.org\/anthology\/W18-5804","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5805","title":"String Transduction with Target Language Models and Insertion Handling","authors":["Nicolai, Garrett","Najafi, Saeed","Kondrak, Grzegorz"],"emails":["gnicola2@jhu.edu","snajafi@ualberta.ca","gkondrak@ualberta.ca"],"author_id":["garrett-nicolai","saeed-najafi","grzegorz-kondrak"],"abstract":"Many character-level tasks can be framed as","pages":"43--53","doi":"10.18653\/v1\/W18-5805","url":"https:\/\/www.aclweb.org\/anthology\/W18-5805","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5806","title":"Complementary Strategies for Low Resourced Morphological Modeling","authors":["Erdmann, Alexander","Habash, Nizar"],"emails":["ae1541@nyu.edu","nizar.habash@nyu.edu"],"author_id":["alexander-erdmann","nizar-habash"],"abstract":"Morphologically rich languages are challenging for natural language processing tasks due to data sparsity. This can be addressed either by introducing out-of-context morphological knowledge, or by developing machine learning architectures that specifically target data sparsity and\/or morphological information. We find these approaches to complement each other in a morphological paradigm modeling task in Modern Standard Arabic, which, in addition to being morphologically complex, features ubiquitous ambiguity, exacerbating sparsity with noise. Given a small number of out-of-context rules describing closed class morphology, we combine them with word embeddings leveraging subword strings and noise reduction techniques. The combination outperforms both approaches individually by about 20{\\%} absolute. While morphological resources already exist for Modern Standard Arabic, our results inform how comparable resources might be constructed for non-standard dialects or any morphologically rich, low resourced language, given scarcity of time and","pages":"54--65","doi":"10.18653\/v1\/W18-5806","url":"https:\/\/www.aclweb.org\/anthology\/W18-5806","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5807","title":"Modeling Reduplication with 2-way Finite-State Transducers","authors":["Dolatian, Hossep","Heinz, Jeffrey"],"emails":["hossep.dolatian@stonybrook.edu","jeffrey.heinz@stonybrook.edu"],"author_id":["hossep-dolatian","jeffrey-heinz"],"abstract":"This article describes a novel approach to the computational modeling of reduplication. Reduplication is a well-studied linguistic phenomenon. However, it is often treated as a stumbling block within finite-state treatments of morphology. Most finite-state implementations of computational morphology cannot adequately capture the productivity of unbounded copying in reduplication, nor can they adequately capture bounded copying. We show that an understudied type of finite-state machines, two-way finite-state transducers (2-way FSTs), captures virtually all reduplicative processes, including total reduplication. 2-way FSTs can model reduplicative typology in a way which is convenient, easy to design and debug in practice, and linguistically-motivated. By virtue of being finite-state, 2-way FSTs are likewise incorporable into existing finite-state systems and programs. A small but representative typology of reduplicative processes is described in this article, alongside their corresponding 2-way FST models.","pages":"66--77","doi":"10.18653\/v1\/W18-5807","url":"https:\/\/www.aclweb.org\/anthology\/W18-5807","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5808","title":"Automatically Tailoring Unsupervised Morphological Segmentation to the Language","authors":["Eskander, Ramy","Rambow, Owen","Muresan, Smaranda"],"emails":["rnd2110@columbia.edu","owenr@elementalcognition.com","smara@columbia.edu"],"author_id":["ramy-eskander","owen-rambow","smaranda-muresan"],"abstract":"Morphological segmentation is beneficial for several natural language processing tasks dealing with large vocabularies. Unsupervised methods for morphological segmentation are essential for handling a diverse set of languages, including low-resource languages. Eskander et al. (2016) introduced a Language Independent Morphological Segmenter (LIMS) using Adaptor Grammars (AG) based on the best-on-average performing AG configuration. However, while LIMS worked best on average and outperforms other state-of-the-art unsupervised morphological segmentation approaches, it did not provide the optimal AG configuration for five out of the six languages. We propose two language-independent classifiers that enable the selection of the optimal or nearly-optimal configuration for the morphological segmentation of unseen languages.","pages":"78--83","doi":"10.18653\/v1\/W18-5808","url":"https:\/\/www.aclweb.org\/anthology\/W18-5808","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5809","title":"A Comparison of Entity Matching Methods between {E}nglish and {J}apanese Katakana","authors":["Yamashita, Michiharu","Awashima, Hideki","Oiwa, Hidekazu"],"emails":["chewgen@r.recruit.co.jp","awashima@r.recruit.co.jp","hidekazu.oiwa@gmail.com"],"author_id":["michiharu-yamashita","hideki-awashima","hidekazu-oiwa"],"abstract":"Japanese Katakana is one component of the Japanese writing system and is used to express English terms, loanwords, and onomatopoeia in Japanese characters based on the phonemes. The main purpose of this research is to find the best entity matching methods between English and Katakana. We built two research questions to clarify which types of entity matching systems works better than others. The first question is what transliteration should be used for conversion. We need to transliterate English or Katakana terms into the same form in order to compute the string similarity. We consider five conversions that transliterate English to Katakana directly, Katakana to English directly, English to Katakana via phoneme, Katakana to English via phoneme, and both English and Katakana to phoneme. The second question is what should be used for the similarity measure at entity matching. To investigate the problem, we choose six methods, which are Overlap Coefficient, Cosine, Jaccard, Jaro-Winkler, Levenshtein, and the similarity of the phoneme probability predicted by RNN. Our results show that 1) matching using phonemes and conversion of Katakana to English works better than other methods, and 2) the similarity of phonemes outperforms other methods while other similarity score is changed depending on data and models.","pages":"84--92","doi":"10.18653\/v1\/W18-5809","url":"https:\/\/www.aclweb.org\/anthology\/W18-5809","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5810","title":"{S}eq2{S}eq Models with Dropout can Learn Generalizable Reduplication","authors":["Prickett, Brandon","Traylor, Aaron","Pater, Joe"],"emails":["","",""],"author_id":["brandon-prickett","aaron-traylor","joe-pater"],"abstract":"Natural language reduplication can pose a challenge to neural models of language, and has been argued to require variables (Marcus et al., 1999). Sequence-to-sequence neural networks have been shown to perform well at a number of other morphological tasks (Cotterell et al., 2016), and produce results that highly correlate with human behavior (Kirov, 2017; Kirov {\\&} Cotterell, 2018) but do not include any explicit variables in their architecture. We find that they can learn a reduplicative pattern that generalizes to novel segments if they are trained with dropout (Srivastava et al., 2014). We argue that this matches the scope of generalization observed in human reduplication.","pages":"93--100","doi":"10.18653\/v1\/W18-5810","url":"https:\/\/www.aclweb.org\/anthology\/W18-5810","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5811","title":"A Characterwise Windowed Approach to {H}ebrew Morphological Segmentation","authors":["Zeldes, Amir"],"emails":["amir.zeldes@georgetown.edu"],"author_id":["amir-zeldes"],"abstract":"This paper presents a novel approach to the segmentation of orthographic word forms in contemporary Hebrew, focusing purely on splitting without carrying out morphological analysis or disambiguation. Casting the analysis task as character-wise binary classification and using adjacent character and word-based lexicon-lookup features, this approach achieves over 98{\\%} accuracy on the benchmark SPMRL shared task data for Hebrew, and 97{\\%} accuracy on a new out of domain Wikipedia dataset, an improvement of {\\textasciitilde}4{\\%} and 5{\\%} over previous state of the art performance.","pages":"101--110","doi":"10.18653\/v1\/W18-5811","url":"https:\/\/www.aclweb.org\/anthology\/W18-5811","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5812","title":"Phonetic Vector Representations for Sound Sequence Alignment","authors":["Sofroniev, Pavel","{\\c{C}}{\\\"o}ltekin, {\\c{C}}a{\\u{g}}r{\\i}"],"emails":["pavel.sofroniev@student.uni-tuebingen.de","ccoltekin@sfs.uni-tuebingen.de"],"author_id":["pavel-sofroniev","cagri-coltekin"],"abstract":"This study explores a number of data-driven vector representations of the","pages":"111--116","doi":"10.18653\/v1\/W18-5812","url":"https:\/\/www.aclweb.org\/anthology\/W18-5812","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5813","title":"Sounds Wilde. Phonetically Extended Embeddings for Author-Stylized Poetry Generation","authors":["Tikhonov, Aleksey","Yamshchikov, Ivan"],"emails":["altsoph@gmail.com","ivan@yamshchikov.info"],"author_id":["aleksey-tikhonov","ivan-yamshchikov"],"abstract":"This paper addresses author-stylized text generation. Using a version of a language model with extended phonetic and semantic embeddings for poetry generation we show that phonetics has comparable contribution to the overall model performance as the information on the target author. Phonetic information is shown to be important for English and Russian language. Humans tend to attribute machine generated texts to the target author.","pages":"117--124","doi":"10.18653\/v1\/W18-5813","url":"https:\/\/www.aclweb.org\/anthology\/W18-5813","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5814","title":"On Hapax Legomena and Morphological Productivity","authors":["Pierrehumbert, Janet","Granell, Ramon"],"emails":["janet.pierrehumbert@oerc.ox.ac.uk","ramon.granell@oerc.ox.ac.uk"],"author_id":["janet-pierrehumbert","ramon-granell"],"abstract":"Quantifying and predicting morphological productivity is a long-standing challenge in corpus linguistics and psycholinguistics. The same challenge reappears in natural language processing in the context of handling words that were not seen in the training set (out-of-vocabulary, or OOV, words). Prior research showed that a good indicator of the productivity of a morpheme is the number of words involving it that occur exactly once (the hapax legomena). A technical connection was adduced between this result and Good-Turing smoothing, which assigns probability mass to unseen events on the basis of the simplifying assumption that word frequencies are stationary. In a large-scale study of 133 affixes in Wikipedia, we develop evidence that success in fact depends on tapping the frequency range in which the assumptions of Good-Turing are violated.","pages":"125--130","doi":"10.18653\/v1\/W18-5814","url":"https:\/\/www.aclweb.org\/anthology\/W18-5814","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5815","title":"A Morphological Analyzer for {S}hipibo-Konibo","authors":["Cardenas, Ronald","Zeman, Daniel"],"emails":["ronald.cardenas@matfyz.cz","zeman@ufal.mff.cuni.cz"],"author_id":["ronald-cardenas","daniel-zeman"],"abstract":"We present a morphological analyzer for Shipibo-Konibo, a low-resourced native language spoken in the Amazonian region of Peru.","pages":"131--139","doi":"10.18653\/v1\/W18-5815","url":"https:\/\/www.aclweb.org\/anthology\/W18-5815","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5816","title":"An {A}rabic Morphological Analyzer and Generator with Copious Features","authors":["Taji, Dima","Khalifa, Salam","Obeid, Ossama","Eryani, Fadhl","Habash, Nizar"],"emails":["dima.taji@nyu.edu","salamkhalifa@nyu.edu","oobeid@nyu.edu","fadhl.eryani@nyu.edu","nizar.habash@nyu.edu"],"author_id":["dima-taji","salam-khalifa","ossama-obeid","fadhl-eryani","nizar-habash"],"abstract":"We introduce CALIMA-Star, a very rich Arabic morphological analyzer and generator that provides functional and form-based morphological features as well as built-in tokenization, phonological representation, lexical rationality and much more. This tool includes a fast engine that can be easily integrated into other systems, as well as an easy-to-use API and a web interface. CALIMA-Star also supports morphological reinflection. We evaluate CALIMA-Star against four commonly used analyzers for Arabic in terms of speed and morphological content.","pages":"140--150","doi":"10.18653\/v1\/W18-5816","url":"https:\/\/www.aclweb.org\/anthology\/W18-5816","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5817","title":"{S}anskrit n-Retroflexion is Input-Output Tier-Based Strictly Local","authors":["Graf, Thomas","Mayer, Connor"],"emails":["mail@thomasgraf.net","connormayer@ucla.edu"],"author_id":["thomas-graf","connor-mayer"],"abstract":"Sanskrit \/n\/-retroflexion (nati) is one of the most complex segmental processes in phonology. While it is still star-free, it does not fit in any of the subregular classes that are commonly entertained in the literature. We show that when construed as a phonotactic dependency, the process fits into a class we call input-output tier-based strictly local (IO-TSL), a natural extension of the familiar class TSL. IO-TSL increases the power of TSL{'}s tier projection function by making it an input-output strictly local transduction. Assuming that \/n\/-retroflexion represents the upper bound on the complexity of segmental phonology, this shows that all of segmental phonology can be captured by combining the intuitive notion of tiers with the independently motivated machinery of strictly local mappings.","pages":"151--160","doi":"10.18653\/v1\/W18-5817","url":"https:\/\/www.aclweb.org\/anthology\/W18-5817","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5818","title":"Phonological Features for Morphological Inflection","authors":["Wiemerslage, Adam","Silfverberg, Miikka","Hulden, Mans"],"emails":["adam.wiemerslage@colorado.edu","miikka.silfverberg@colorado.edu","mans.hulden@colorado.edu"],"author_id":["adam-wiemerslage","miikka-silfverberg","mans-hulden"],"abstract":"Modeling morphological inflection is an important task in Natural Language Processing. In contrast to earlier work that has largely used orthographic representations, we experiment with this task in a phonetic character space, representing inputs as either IPA segments or bundles of phonological distinctive features. We show that both of these inputs, somewhat counterintuitively, achieve similar accuracies on morphological inflection, slightly lower than orthographic models. We conclude that providing detailed phonological representations is largely redundant when compared to IPA segments, and that articulatory distinctions relevant for word inflection are already latently present in the distributional properties of many graphemic writing systems.","pages":"161--166","doi":"10.18653\/v1\/W18-5818","url":"https:\/\/www.aclweb.org\/anthology\/W18-5818","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W18-5819","title":"Extracting Morphophonology from Small Corpora","authors":["Ermolaeva, Marina"],"emails":["mermolaeva@uchicago.edu"],"author_id":["marina-ermolaeva"],"abstract":"Probabilistic approaches have proven themselves well in learning phonological structure. In contrast, theoretical linguistics usually works with deterministic generalizations. The goal of this paper is to explore possible interactions between information-theoretic methods and deterministic linguistic knowledge and to examine some ways in which both can be used in tandem to extract phonological and morphophonological patterns from a small annotated dataset. Local and nonlocal processes in Mishar Tatar (Turkic\/Kipchak) are examined as a case study.","pages":"167--175","doi":"10.18653\/v1\/W18-5819","url":"https:\/\/www.aclweb.org\/anthology\/W18-5819","publisher":"Association for Computational Linguistics","address":"Brussels, Belgium","year":"2018","month":"October","booktitle":"Proceedings of the Fifteenth Workshop on Computational Research in Phonetics, Phonology, and Morphology"}]