[{"id":"W18-3201","title":"Joint Part-of-Speech and Language {ID} Tagging for Code-Switched Data","authors":["Soto, Victor","Hirschberg, Julia"],"emails":["vsoto@cs.columbia.edu","julia@cs.columbia.edu"],"author_id":["victor-soto","julia-hirschberg"],"abstract":"Code-switching is the fluent alternation between two or more languages in conversation between bilinguals. Large populations of speakers code-switch during communication, but little effort has been made to develop tools for code-switching, including part-of-speech taggers. In this paper, we propose an approach to POS tagging of code-switched English-Spanish data based on recurrent neural networks. We test our model on known monolingual benchmarks to demonstrate that our neural POS tagging model is on par with state-of-the-art methods. We next test our code-switched methods on the Miami Bangor corpus of English Spanish conversation, focusing on two types of experiments: POS tagging alone, for which we achieve 96.34{\\%} accuracy, and joint part-of-speech and language ID tagging, which achieves similar POS tagging accuracy (96.39{\\%}) and very high language ID accuracy (98.78{\\%}). Finally, we show that our proposed models outperform other state-of-the-art code-switched taggers.","pages":"1--10","doi":"10.18653\/v1\/W18-3201","url":"https:\/\/www.aclweb.org\/anthology\/W18-3201","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3202","title":"Phone Merging For Code-Switched Speech Recognition","authors":["Sivasankaran, Sunit","Srivastava, Brij Mohan Lal","Sitaram, Sunayana","Bali, Kalika","Choudhury, Monojit"],"emails":["sunit.sivasankaran@inria.fr","v-bmlals@microsoft.com","susitara@microsoft.com","kalikab@microsoft.com","monojitc@microsoft.com"],"author_id":["sunit-sivasankaran","brij-mohan-lal-srivastava","sunayana-sitaram","kalika-bali","monojit-choudhury"],"abstract":"Speakers in multilingual communities often switch between or mix multiple languages in the same conversation. Automatic Speech Recognition (ASR) of code-switched speech faces many challenges including the influence of phones of different languages on each other. This paper shows evidence that phone sharing between languages improves the Acoustic Model performance for Hindi-English code-switched speech. We compare baseline system built with separate phones for Hindi and English with systems where the phones were manually merged based on linguistic knowledge. Encouraged by the improved ASR performance after manually merging the phones, we further investigate multiple data-driven methods to identify phones to be merged across the languages. We show detailed analysis of automatic phone merging in this language pair and the impact it has on individual phone accuracies and WER. Though the best performance gain of 1.2{\\%} WER was observed with manually merged phones, we show experimentally that the manual phone merge is not optimal.","pages":"11--19","doi":"10.18653\/v1\/W18-3202","url":"https:\/\/www.aclweb.org\/anthology\/W18-3202","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3203","title":"Improving Neural Network Performance by Injecting Background Knowledge: Detecting Code-switching and Borrowing in {A}lgerian texts","authors":["Adouane, Wafia","Bernardy, Jean-Philippe","Dobnik, Simon"],"emails":["wafia.adouane@gu.se","jean-philippe.bernardy@gu.se","simon.dobnik@gu.se"],"author_id":["wafia-adouane","jean-philippe-bernardy","simon-dobnik"],"abstract":"We explore the effect of injecting background knowledge to different deep neural network (DNN) configurations in order to mitigate the problem of the scarcity of annotated data when applying these models on datasets of low-resourced languages. The background knowledge is encoded in the form of lexicons and pre-trained sub-word embeddings. The DNN models are evaluated on the task of detecting code-switching and borrowing points in non-standardised user-generated Algerian texts. Overall results show that DNNs benefit from adding background knowledge. However, the gain varies between models and categories. The proposed DNN architectures are generic and could be applied to other low-resourced languages.","pages":"20--28","doi":"10.18653\/v1\/W18-3203","url":"https:\/\/www.aclweb.org\/anthology\/W18-3203","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3204","title":"Code-Mixed Question Answering Challenge: Crowd-sourcing Data and Techniques","authors":["Chandu, Khyathi","Loginova, Ekaterina","Gupta, Vishal","Genabith, Josef van","Neumann, G{\\\"u}nter","Chinnakotla, Manoj","Nyberg, Eric","Black, Alan W."],"emails":["kchandu@andrew.cmu.edu","","vishal.gupta@research.iiit.ac.in","enabith@dfki.de","neumann@dfki.de","manojc@microsoft.com","ehn@andrew.cmu.edu","awb@andrew.cmu.edu"],"author_id":["khyathi-chandu","ekaterina-loginova","vishal-gupta","josef-van-genabith","gunter-neumann","manoj-chinnakotla","eric-nyberg","alan-w-black"],"abstract":"Code-Mixing (CM) is the phenomenon of alternating between two or more languages which is prevalent in bi- and multi-lingual communities. Most NLP applications today are still designed with the assumption of a single interaction language and are most likely to break given a CM utterance with multiple languages mixed at a morphological, phrase or sentence level. For example, popular commercial search engines do not yet fully understand the intents expressed in CM queries. As a first step towards fostering research which supports CM in NLP applications, we systematically crowd-sourced and curated an evaluation dataset for factoid question answering in three CM languages - Hinglish (Hindi+English), Tenglish (Telugu+English) and Tamlish (Tamil+English) which belong to two language families (Indo-Aryan and Dravidian). We share the details of our data collection process, techniques which were used to avoid inducing lexical bias amongst the crowd workers and other CM specific linguistic properties of the dataset. Our final dataset, which is available freely for research purposes, has 1,694 Hinglish, 2,848 Tamlish and 1,391 Tenglish factoid questions and their answers. We discuss the techniques used by the participants for the first edition of this ongoing challenge.","pages":"29--38","doi":"10.18653\/v1\/W18-3204","url":"https:\/\/www.aclweb.org\/anthology\/W18-3204","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3205","title":"Transliteration Better than Translation? Answering Code-mixed Questions over a Knowledge Base","authors":["Gupta, Vishal","Chinnakotla, Manoj","Shrivastava, Manish"],"emails":["vishal.gupta@research.iiit.ac.in","manojc@microsoft.com","m.shrivastava@iiit.ac.in"],"author_id":["vishal-gupta","manoj-chinnakotla","manish-shrivastava"],"abstract":"Humans can learn multiple languages. If they know a fact in one language, they can answer a question in another language they understand. They can also answer Code-mix (CM) questions: questions which contain both languages. This behavior is attributed to the unique learning ability of humans. Our task aims to study if machines can achieve this. We demonstrate how effectively a machine can answer CM questions. In this work, we adopt a two phase approach: candidate generation and candidate re-ranking to answer questions. We propose a Triplet-Siamese-Hybrid CNN (TSHCNN) to re-rank candidate answers. We show experiments on the SimpleQuestions dataset. Our network is trained only on English questions provided in this dataset and noisy Hindi translations of these questions and can answer English-Hindi CM questions effectively without the need of translation into English. Back-transliterated CM questions outperform their lexical and sentence level translated counterparts by 5{\\%} {\\&} 35{\\%} in accuracy respectively, highlighting the efficacy of our approach in a resource constrained setting.","pages":"39--50","doi":"10.18653\/v1\/W18-3205","url":"https:\/\/www.aclweb.org\/anthology\/W18-3205","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3206","title":"Language Identification and Analysis of Code-Switched Social Media Text","authors":["Mave, Deepthi","Maharjan, Suraj","Solorio, Thamar"],"emails":["dmave@uh.edu","smaharjan2@uh.edu","solorio@cs.uh.edu"],"author_id":["deepthi-mave","suraj-maharjan","thamar-solorio"],"abstract":"In this paper, we detail our work on comparing different word-level language identification systems for code-switched Hindi-English data and a standard Spanish-English dataset. In this regard, we build a new code-switched dataset for Hindi-English. To understand the code-switching patterns in these language pairs, we investigate different code-switching metrics. We find that the CRF model outperforms the neural network based models by a margin of 2-5 percentage points for Spanish-English and 3-5 percentage points for Hindi-English.","pages":"51--61","doi":"10.18653\/v1\/W18-3206","url":"https:\/\/www.aclweb.org\/anthology\/W18-3206","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3207","title":"Code-Switching Language Modeling using Syntax-Aware Multi-Task Learning","authors":["Winata, Genta Indra","Madotto, Andrea","Wu, Chien-Sheng","Fung, Pascale"],"emails":["giwinata@ust.hk","eeandreamad@ust.hk","cwuak@ust.hk","pascale@ece.ust.hk"],"author_id":["genta-indra-winata","andrea-madotto","chien-sheng-wu","pascale-fung"],"abstract":"Lack of text data has been the major issue on code-switching language modeling. In this paper, we introduce multi-task learning based language model which shares syntax representation of languages to leverage linguistic information and tackle the low resource data issue. Our model jointly learns both language modeling and Part-of-Speech tagging on code-switched utterances. In this way, the model is able to identify the location of code-switching points and improves the prediction of next word. Our approach outperforms standard LSTM based language model, with an improvement of 9.7{\\%} and 7.4{\\%} in perplexity on SEAME Phase I and Phase II dataset respectively.","pages":"62--67","doi":"10.18653\/v1\/W18-3207","url":"https:\/\/www.aclweb.org\/anthology\/W18-3207","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3208","title":"Predicting the presence of a Matrix Language in code-switching","authors":["Bullock, Barbara","Guzm{\\'a}n, Wally","Serigos, Jacqueline","Sharath, Vivek","Toribio, Almeida Jacqueline"],"emails":["bbullock@austin.utexas.edu","gualbertoguzman@utexas.edu","jserigos@gmu.edu","vivek.sharath@utexas.edu","toribio@austin.utexas.edu"],"author_id":["barbara-bullock","wally-guzman","jacqueline-serigos","vivek-sharath","almeida-jacqueline-toribio"],"abstract":"One language is often assumed to be dominant in code-switching but this assumption has not been empirically tested. We operationalize the matrix language (ML) at the level of the sentence, using three common definitions from linguistics. We test whether these converge and then model this convergence via a set of metrics that together quantify the nature of C-S. We conduct our experiment on four Spanish-English corpora. Our results demonstrate that our model can separate some corpora according to whether they have a dominant ML or not but that the corpora span a range of mixing types that cannot be sorted neatly into an insertional vs. alternational dichotomy.","pages":"68--75","doi":"10.18653\/v1\/W18-3208","url":"https:\/\/www.aclweb.org\/anthology\/W18-3208","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3209","title":"Automatic Detection of Code-switching Style from Acoustics","authors":["Rallabandi, SaiKrishna","Sitaram, Sunayana","Black, Alan W"],"emails":["srallaba@cs.cmu.edu","susitara@microsoft.com","awb@cs.cmu.edu"],"author_id":["saikrishna-rallabandi","sunayana-sitaram","alan-w-black"],"abstract":"Multilingual speakers switch between languages in an non-trivial fashion displaying inter sentential, intra sentential, and congruent lexicalization based transitions. While monolingual ASR systems may be capable of recognizing a few words from a foreign language, they are usually not robust enough to handle these varied styles of code-switching. There is also a lack of large code-switched speech corpora capturing all these styles making it difficult to build code-switched speech recognition systems. We hypothesize that it may be useful for an ASR system to be able to first detect the switching style of a particular utterance from acoustics, and then use specialized language models or other adaptation techniques for decoding the speech. In this paper, we look at the first problem of detecting code-switching style from acoustics. We classify code-switched Spanish-English and Hindi-English corpora using two metrics and show that features extracted from acoustics alone can distinguish between different kinds of code-switching in these language pairs.","pages":"76--81","doi":"10.18653\/v1\/W18-3209","url":"https:\/\/www.aclweb.org\/anthology\/W18-3209","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3210","title":"Accommodation of Conversational Code-Choice","authors":["Bawa, Anshul","Choudhury, Monojit","Bali, Kalika"],"emails":["t-anbaw@microsoft.com","monojitc@microsoft.com","kalikab@microsoft.com"],"author_id":["anshul-bawa","monojit-choudhury","kalika-bali"],"abstract":"Bilingual speakers often freely mix languages. However, in such bilingual conversations, are the language choices of the speakers coordinated? How much does one speaker{'}s choice of language affect other speakers? In this paper, we formulate code-choice as a linguistic style, and show that speakers are indeed sensitive to and accommodating of each other{'}s code-choice. We find that the saliency or markedness of a language in context directly affects the degree of accommodation observed. More importantly, we discover that accommodation of code-choices persists over several conversational turns. We also propose an alternative interpretation of conversational accommodation as a retrieval problem, and show that the differences in accommodation characteristics of code-choices are based on their markedness in context.","pages":"82--91","doi":"10.18653\/v1\/W18-3210","url":"https:\/\/www.aclweb.org\/anthology\/W18-3210","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3211","title":"Language Informed Modeling of Code-Switched Text","authors":["Chandu, Khyathi","Manzini, Thomas","Singh, Sumeet","Black, Alan W."],"emails":["kchandu@cs.cmu.edu","tmanzini@cs.cmu.edu","sumeets@cs.cmu.edu","awb@cs.cmu.edu"],"author_id":["khyathi-chandu","thomas-manzini","sumeet-singh","alan-w-black"],"abstract":"Code-switching (CS), the practice of alternating between two or more languages in conversations, is pervasive in most multi-lingual communities. CS texts have a complex interplay between languages and occur in informal contexts that make them harder to collect and construct NLP tools for. We approach this problem through Language Modeling (LM) on a new Hindi-English mixed corpus containing 59,189 unique sentences collected from blogging websites. We implement and discuss different Language Models derived from a multi-layered LSTM architecture. We hypothesize that encoding language information strengthens a language model by helping to learn code-switching points. We show that our highest performing model achieves a test perplexity of 19.52 on the CS corpus that we collected and processed. On this data we demonstrate that our performance is an improvement over AWD-LSTM LM (a recent state of the art on monolingual English).","pages":"92--97","doi":"10.18653\/v1\/W18-3211","url":"https:\/\/www.aclweb.org\/anthology\/W18-3211","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3212","title":"{GHHT} at {CALCS} 2018: Named Entity Recognition for Dialectal {A}rabic Using Neural Networks","authors":["Attia, Mohammed","Samih, Younes","Maier, Wolfgang"],"emails":["attia@google.com","samih@phil.hhu.de","wolfgang.maier@gmail.com"],"author_id":["mohammed-attia","younes-samih","wolfgang-maier"],"abstract":"This paper describes our system submission to the CALCS 2018 shared task on named entity recognition on code-switched data for the language variant pair of Modern Standard Arabic and Egyptian dialectal Arabic. We build a a Deep Neural Network that combines word and character-based representations in convolutional and recurrent networks with a CRF layer. The model is augmented with stacked layers of enriched information such pre-trained embeddings, Brown clusters and named entity gazetteers. Our system is ranked second among those participating in the shared task achieving an FB1 average of 70.09{\\%}.","pages":"98--102","doi":"10.18653\/v1\/W18-3212","url":"https:\/\/www.aclweb.org\/anthology\/W18-3212","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3213","title":"Simple Features for Strong Performance on Named Entity Recognition in Code-Switched Twitter Data","authors":["Jain, Devanshu","Kustikova, Maria","Darbari, Mayank","Gupta, Rishabh","Mayhew, Stephen"],"emails":["devjain@seas.upenn.edu","mkust@seas.upenn.edu","mdarbari@seas.upenn.edu","rgupt@seas.upenn.edu","mayhew@seas.upenn.edu"],"author_id":["devanshu-jain","maria-kustikova","mayank-darbari","rishabh-gupta","stephen-mayhew"],"abstract":"In this work, we address the problem of Named Entity Recognition (NER) in code-switched tweets as a part of the Workshop on Computational Approaches to Linguistic Code-switching (CALCS) at ACL{'}18. Code-switching is the phenomenon where a speaker switches between two languages or variants of the same language within or across utterances, known as intra-sentential or inter-sentential code-switching, respectively. Processing such data is challenging using state of the art methods since such technology is generally geared towards processing monolingual text. In this paper we explored ways to use language identification and translation to recognize named entities in such data, however, utilizing simple features (sans multi-lingual features) with Conditional Random Field (CRF) classifier achieved the best results. Our experiments were mainly aimed at the (ENG-SPA) English-Spanish dataset but we submitted a language-independent version of our system to the (MSA-EGY) Arabic-Egyptian dataset as well and achieved good results.","pages":"103--109","doi":"10.18653\/v1\/W18-3213","url":"https:\/\/www.aclweb.org\/anthology\/W18-3213","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3214","title":"Bilingual Character Representation for Efficiently Addressing Out-of-Vocabulary Words in Code-Switching Named Entity Recognition","authors":["Winata, Genta Indra","Wu, Chien-Sheng","Madotto, Andrea","Fung, Pascale"],"emails":["giwinata@ust.hk","cwuak@ust.hk","eeandreamad@ust.hk","pascale@ece.ust.hk"],"author_id":["genta-indra-winata","chien-sheng-wu","andrea-madotto","pascale-fung"],"abstract":"We propose an LSTM-based model with hierarchical architecture on named entity recognition from code-switching Twitter data. Our model uses bilingual character representation and transfer learning to address out-of-vocabulary words. In order to mitigate data noise, we propose to use token replacement and normalization. In the 3rd Workshop on Computational Approaches to Linguistic Code-Switching Shared Task, we achieved second place with 62.76{\\%} harmonic mean F1-score for English-Spanish language pair without using any gazetteer and knowledge-based information.","pages":"110--114","doi":"10.18653\/v1\/W18-3214","url":"https:\/\/www.aclweb.org\/anthology\/W18-3214","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3215","title":"Named Entity Recognition on Code-Switched Data Using Conditional Random Fields","authors":["Sikdar, Utpal Kumar","Barik, Biswanath","Gamb{\\\"a}ck, Bj{\\\"o}rn"],"emails":["utpal.sikdar@gmail.com","biswanath.barik@ntnu.no","gamback@ntnu.no"],"author_id":["utpal-kumar-sikdar","biswanath-barik","bjorn-gamback"],"abstract":"Named Entity Recognition is an important information extraction task that identifies proper names in unstructured texts and classifies them into some pre-defined categories. Identification of named entities in code-mixed social media texts is a more difficult and challenging task as the contexts are short, ambiguous and often noisy. This work proposes a Conditional Random Fields based named entity recognition system to identify proper names in code-switched data and classify them into nine categories. The system ranked fifth among nine participant systems and achieved a 59.25{\\%} F1-score.","pages":"115--119","doi":"10.18653\/v1\/W18-3215","url":"https:\/\/www.aclweb.org\/anthology\/W18-3215","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3216","title":"The University of {T}exas System Submission for the Code-Switching Workshop Shared Task 2018","authors":["Janke, Florian","Li, Tongrui","Rinc{\\'o}n, Eric","Guzm{\\'a}n, Gualberto","Bullock, Barbara","Toribio, Almeida Jacqueline"],"emails":["florian@utexas.edu","tli1998@utexas.edu","eric.rincon@utexas.edu","gualbertoguzman@utexas.edu","bbullock@austin.utexas.edu","toribio@austin.utexas.edu"],"author_id":["florian-janke","tongrui-li","eric-rincon","gualberto-a-guzman","barbara-bullock","almeida-jacqueline-toribio"],"abstract":"This paper describes the system for the Named Entity Recognition Shared Task of the Third Workshop on Computational Approaches to Linguistic Code-Switching (CALCS) submitted by the Bilingual Annotations Tasks (BATs) research group of the University of Texas. Our system uses several features to train a Conditional Random Field (CRF) model for classifying input words as Named Entities (NEs) using the Inside-Outside-Beginning (IOB) tagging scheme. We participated in the Modern Standard Arabic-Egyptian Arabic (MSA-EGY) and English-Spanish (ENG-SPA) tasks, achieving weighted average F-scores of 65.62 and 54.16 respectively. We also describe the performance of a deep neural network (NN) trained on a subset of the CRF features, which did not surpass CRF performance.","pages":"120--125","doi":"10.18653\/v1\/W18-3216","url":"https:\/\/www.aclweb.org\/anthology\/W18-3216","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3217","title":"Tackling Code-Switched {NER}: Participation of {CMU}","authors":["Geetha, Parvathy","Chandu, Khyathi","Black, Alan W"],"emails":["pgeetha@andrew.cmu.edu","kchandu@andrew.cmu.edu","awb@andrew.cmu.edu"],"author_id":["parvathy-geetha","khyathi-chandu","alan-w-black"],"abstract":"Named Entity Recognition plays a major role in several downstream applications in NLP. Though this task has been heavily studied in formal monolingual texts and also noisy texts like Twitter data, it is still an emerging task in code-switched (CS) content on social media. This paper describes our participation in the shared task of NER on code-switched data for Spanglish (Spanish + English) and Arabish (Arabic + English). In this paper we describe models that intuitively developed from the data for the shared task Named Entity Recognition on Code-switched Data. Owing to the sparse and non-linear relationships between words in Twitter data, we explored neural architectures that are capable of non-linearities fairly well. In specific, we trained character level models and word level models based on Bidirectional LSTMs (Bi-LSTMs) to perform sequential tagging. We train multiple models to identify nominal mentions and subsequently use this information to predict the labels of named entity in a sequence. Our best model is a character level model along with word level pre-trained multilingual embeddings that gave an F-score of 56.72 in Spanglish and a word level model that gave an F-score of 65.02 in Arabish on the test data.","pages":"126--131","doi":"10.18653\/v1\/W18-3217","url":"https:\/\/www.aclweb.org\/anthology\/W18-3217","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3218","title":"Multilingual Named Entity Recognition on {S}panish-{E}nglish Code-switched Tweets using Support Vector Machines","authors":["Claeser, Daniel","Kent, Samantha","Felske, Dennis"],"emails":["daniel.claeser@fkie.fraunhofer.de","samantha.kent@fkie.fraunhofer.de","dennis.felske@fkie.fraunhofer.de"],"author_id":["daniel-claeser","samantha-kent","dennis-felske"],"abstract":"This paper describes our system submission for the ACL 2018 shared task on named entity recognition (NER) in code-switched Twitter data. Our best result (F1 = 53.65) was obtained using a Support Vector Machine (SVM) with 14 features combined with rule-based post processing.","pages":"132--137","doi":"10.18653\/v1\/W18-3218","url":"https:\/\/www.aclweb.org\/anthology\/W18-3218","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3219","title":"Named Entity Recognition on Code-Switched Data: Overview of the {CALCS} 2018 Shared Task","authors":["Aguilar, Gustavo","AlGhamdi, Fahad","Soto, Victor","Diab, Mona","Hirschberg, Julia","Solorio, Thamar"],"emails":["gaguilaralas@uh.edu","mtdiab@gwu.edu","vs2411@cs.columbia.edu","fghamdi@gwu.edu","julia@cs.columbia.edu","tsolorio@uh.edu"],"author_id":["gustavo-aguilar","fahad-alghamdi","victor-soto","mona-diab","julia-hirschberg","thamar-solorio"],"abstract":"In the third shared task of the Computational Approaches to Linguistic Code-Switching (CALCS) workshop, we focus on Named Entity Recognition (NER) on code-switched social-media data. We divide the shared task into two competitions based on the English-Spanish (ENG-SPA) and Modern Standard Arabic-Egyptian (MSA-EGY) language pairs. We use Twitter data and 9 entity types to establish a new dataset for code-switched NER benchmarks. In addition to the CS phenomenon, the diversity of the entities and the social media challenges make the task considerably hard to process. As a result, the best scores of the competitions are 63.76{\\%} and 71.61{\\%} for ENG-SPA and MSA-EGY, respectively. We present the scores of 9 participants and discuss the most common challenges among submissions.","pages":"138--147","doi":"10.18653\/v1\/W18-3219","url":"https:\/\/www.aclweb.org\/anthology\/W18-3219","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3220","title":"{IIT} ({BHU}) Submission for the {ACL} Shared Task on Named Entity Recognition on Code-switched Data","authors":["Trivedi, Shashwat","Rangwani, Harsh","Kumar Singh, Anil"],"emails":["shashwat.trivedi.cse15@iitbhu.ac.in","harsh.rangwani.cse15@iitbhu.ac.in","aksingh.cse@iitbhu.ac.in"],"author_id":["shashwat-trivedi","harsh-rangwani","anil-kumar-singh"],"abstract":"This paper describes the best performing system for the shared task on Named Entity Recognition (NER) on code-switched data for the language pair Spanish-English (ENG-SPA). We introduce a gated neural architecture for the NER task. Our final model achieves an F1 score of 63.76{\\%}, outperforming the baseline by 10{\\%}.","pages":"148--153","doi":"10.18653\/v1\/W18-3220","url":"https:\/\/www.aclweb.org\/anthology\/W18-3220","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"},{"id":"W18-3221","title":"Code-Switched Named Entity Recognition with Embedding Attention","authors":["Wang, Changhan","Cho, Kyunghyun","Kiela, Douwe"],"emails":["changhan@fb.com","kyunghyuncho@fb.com","dkiela@fb.com"],"author_id":["changhan-wang","kyunghyun-cho","douwe-kiela"],"abstract":"We describe our work for the CALCS 2018 shared task on named entity recognition on code-switched data. Our system ranked first place for MS Arabic-Egyptian named entity recognition and third place for English-Spanish.","pages":"154--158","doi":"10.18653\/v1\/W18-3221","url":"https:\/\/www.aclweb.org\/anthology\/W18-3221","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the Third Workshop on Computational Approaches to Linguistic Code-Switching"}]