[{"id":"W18-4401","title":"Benchmarking Aggression Identification in Social Media","authors":["Kumar, Ritesh","Ojha, Atul Kr.","Malmasi, Shervin","Zampieri, Marcos"],"emails":["","","",""],"author_id":["ritesh-kumar","atul-kr-ojha","shervin-malmasi","marcos-zampieri"],"abstract":"In this paper, we present the report and findings of the Shared Task on Aggression Identification organised as part of the First Workshop on Trolling, Aggression and Cyberbullying (TRAC - 1) at COLING 2018. The task was to develop a classifier that could discriminate between Overtly Aggressive, Covertly Aggressive, and Non-aggressive texts. For this task, the participants were provided with a dataset of 15,000 aggression-annotated Facebook Posts and Comments each in Hindi (in both Roman and Devanagari script) and English for training and validation. For testing, two different sets - one from Facebook and another from a different social media - were provided. A total of 130 teams registered to participate in the task, 30 teams submitted their test runs, and finally 20 teams also sent their system description paper which are included in the TRAC workshop proceedings. The best system obtained a weighted F-score of 0.64 for both Hindi and English on the Facebook test sets, while the best scores on the surprise set were 0.60 and 0.50 for English and Hindi respectively. The results presented in this report depict how challenging the task is. The positive response from the community and the great levels of participation in the first edition of this shared task also highlights the interest in this topic.","pages":"1--11","url":"https:\/\/www.aclweb.org\/anthology\/W18-4401","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4402","title":"{R}i{TUAL}-{UH} at {TRAC} 2018 Shared Task: Aggression Identification","authors":["Safi Samghabadi, Niloofar","Mave, Deepthi","Kar, Sudipta","Solorio, Thamar"],"emails":["nsafisamghabadi@uh.edu","dmave@uh.edu","skar3@uh.edu","tsolorio@uh.edu"],"author_id":["niloofar-safi-samghabadi","deepthi-mave","sudipta-kar","thamar-solorio"],"abstract":"This paper presents our system for {``}TRAC 2018 Shared Task on Aggression Identification{''}. Our best systems for the English dataset use a combination of lexical and semantic features. However, for Hindi data using only lexical features gave us the best results. We obtained weighted F1-measures of 0.5921 for the English Facebook task (ranked 12th), 0.5663 for the English Social Media task (ranked 6th), 0.6292 for the Hindi Facebook task (ranked 1st), and 0.4853 for the Hindi Social Media task (ranked 2nd).","pages":"12--18","url":"https:\/\/www.aclweb.org\/anthology\/W18-4402","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4403","title":"IRIT at TRAC 2018","authors":["Ramiandrisoa, Faneva","Mothe, Josiane"],"emails":["faneva.ramiandrisoa@irit.fr","othe@irit.fr"],"author_id":["faneva-ramiandrisoa","josiane-mothe"],"abstract":"This paper describes the participation of the IRIT team to the TRAC 2018 shared task on Aggression Identification and more precisely to the shared task in English language. The three following methods have been used: a) a combination of machine learning techniques that relies on a set of features and document\/text vectorization, b) Convolutional Neural Network (CNN) and c) a combination of Convolutional Neural Network (CNN) and Long Short-Term Memory (LSTM). Best results were obtained when using the method (a) on the English test data from Facebook which ranked our method sixteenth out of thirty teams, and the method (c) on the English test data from other social media, where we obtained the fifteenth rank out of thirty.","pages":"19--27","url":"https:\/\/www.aclweb.org\/anthology\/W18-4403","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4404","title":"Fully Connected Neural Network with Advance Preprocessor to Identify Aggression over {F}acebook and Twitter","authors":["Raiyani, Kashyap","Gon{\\c{c}}alves, Teresa","Quaresma, Paulo","Nogueira, Vitor Beires"],"emails":["kshyp@uevora.pt","tcg@uevora.pt","pq@uevora.pt","vbn@uevora.pt"],"author_id":["kashyap-raiyani","teresa-goncalves","paulo-quaresma","vitor-beires-nogueira"],"abstract":"Paper presents the different methodologies developed {\\&} tested and discusses their results, with the goal of identifying the best possible method for the aggression identification problem in social media.","pages":"28--41","url":"https:\/\/www.aclweb.org\/anthology\/W18-4404","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4405","title":"Cyberbullying Intervention Based on Convolutional Neural Networks","authors":["Huang, Qianjia","Inkpen, Diana","Zhang, Jianhong","Van Bruwaene, David"],"emails":["qhuan035@uottawa.ca","nkpen@uottawa.ca","jzhan410@uottawa.ca","dvanbruwaene@safetonet.com"],"author_id":["qianjia-huang","diana-inkpen","jianhong-zhang","david-van-bruwaene"],"abstract":"This paper describes the process of building a cyberbullying intervention interface driven by a machine-learning based text-classification service. We make two main contributions. First, we show that cyberbullying can be identified in real-time before it takes place, with available machine learning and natural language processing tools. Second, we present a mechanism that provides individuals with early feedback about how other people would feel about wording choices in their messages before they are sent out. This interface not only gives a chance for the user to revise the text, but also provides a system-level flagging\/intervention in a situation related to cyberbullying.","pages":"42--51","url":"https:\/\/www.aclweb.org\/anthology\/W18-4405","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4406","title":"{LSTM}s with Attention for Aggression Detection","authors":["Nikhil, Nishant","Pahwa, Ramit","Nirala, Mehul Kumar","Khilnani, Rohan"],"emails":["nishantnikhil@iitkgp.ac.in","ramitpahwa123@iitkgp.ac.in","mehulkumarnirala@iitkgp.ac.in","rkhilnani9@iitkgp.ac.in"],"author_id":["nishant-nikhil","ramit-pahwa","mehul-kumar-nirala","rohan-khilnani"],"abstract":"In this paper, we describe the system submitted for the shared task on Aggression Identification in Facebook posts and comments by the team Nishnik. Previous works demonstrate that LSTMs have achieved remarkable performance in natural language processing tasks. We deploy an LSTM model with an attention unit over it. Our system ranks 6th and 4th in the Hindi subtask for Facebook comments and subtask for generalized social media data respectively. And it ranks 17th and 10th in the corresponding English subtasks.","pages":"52--57","url":"https:\/\/www.aclweb.org\/anthology\/W18-4406","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4407","title":"TRAC-1 Shared Task on Aggression Identification: IIT(ISM)@COLING{'}18","authors":["Kumar, Ritesh","Bhanodai, Guggilla","Pamula, Rajendra","Chennuru, Maheshwar Reddy"],"emails":["ritesh4rmrvs@gmail.com","bhanodaig@gmail.com","rajendra@iitism.ac.in","cmr.mahesh@gmail.com"],"author_id":["ritesh-kumar","guggilla-bhanodai","rajendra-pamula","maheshwar-reddy-chennuru"],"abstract":"This paper describes the work that our team bhanodaig did at Indian Institute of Technology (ISM) towards TRAC-1 Shared Task on Aggression Identification in Social Media for COLING 2018. In this paper we label aggression identification into three categories: Overtly Aggressive, Covertly Aggressive and Non-aggressive. We train a model to differentiate between these categories and then analyze the results in order to better understand how we can distinguish between them. We participated in two different tasks named as English (Facebook) task and English (Social Media) task. For English (Facebook) task System 05 was our best run (i.e. 0.3572) above the Random Baseline (i.e. 0.3535). For English (Social Media) task our system 02 got the value (i.e. 0.1960) below the Random Bseline (i.e. 0.3477). For all of our runs we used Long Short-Term Memory model. Overall, our performance is not satisfactory. However, as new entrant to the field, our scores are encouraging enough to work for better results in future.","pages":"58--65","url":"https:\/\/www.aclweb.org\/anthology\/W18-4407","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4408","title":"An Ensemble Approach for Aggression Identification in {E}nglish and {H}indi Text","authors":["Roy, Arjun","Kapil, Prashant","Basak, Kingshuk","Ekbal, Asif"],"emails":["arjun.mtmc17@iitp.ac.in","prashant.pcs17@iitp.ac.in","kingshuk.mtcs16@iitp.ac.in","asif@iitp.ac.in"],"author_id":["arjun-roy","prashant-kapil","kingshuk-basak","asif-ekbal"],"abstract":"This paper describes our system submitted in the shared task at COLING 2018 TRAC-1: Aggression Identification. The objective of this task was to predict online aggression spread through online textual post or comment. The dataset was released in two languages, English and Hindi. We submitted a single system for Hindi and a single system for English. Both the systems are based on an ensemble architecture where the individual models are based on Convoluted Neural Network and Support Vector Machine. Evaluation shows promising results for both the languages.The total submission for English was 30 and Hindi was 15. Our system on English facebook and social media obtained F1 score of 0.5151 and 0.5099 respectively where Hindi facebook and social media obtained F1 score of 0.5599 and 0.3790 respectively.","pages":"66--73","url":"https:\/\/www.aclweb.org\/anthology\/W18-4408","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4409","title":"Aggression Identification and Multi Lingual Word Embeddings","authors":["Galery, Thiago","Charitos, Efstathios","Tian, Ye"],"emails":["thiago.galery@idio.ai","stathis.charitos@idio.ai",""],"author_id":["thiago-galery","efstathios-charitos","ye-tian"],"abstract":"The system presented here took part in the 2018 Trolling, Aggression and Cyberbullying shared task (Forest and Trees team) and uses a Gated Recurrent Neural Network architecture (Cho et al., 2014) in an attempt to assess whether combining pre-trained English and Hindi fastText (Mikolov et al., 2018) word embeddings as a representation of the sequence input would improve classification performance. The motivation for this comes from the fact that the shared task data for English contained many Hindi tokens and therefore some users might be doing code-switching: the alternation between two or more languages in communication. To test this hypothesis, we also aligned Hindi and English vectors using pre-computed SVD matrices that pulls representations from different languages into a common space (Smith et al., 2017). Two conditions were tested: (i) one with standard pre-trained fastText word embeddings where each Hindi word is treated as an OOV token, and (ii) another where word embeddings for Hindi and English are loaded in a common vector space, so Hindi tokens can be assigned a meaningful representation. We submitted the second (i.e., multilingual) system and obtained the scores of 0.531 weighted F1 for the EN-FB dataset and 0.438 weighted F1 for the EN-TW dataset.","pages":"74--79","url":"https:\/\/www.aclweb.org\/anthology\/W18-4409","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4410","title":"A K-Competitive Autoencoder for Aggression Detection in Social Media Text","authors":["Maitra, Promita","Sarkhel, Ritesh"],"emails":["promita.maitra@gmail.com","sarkhel.5@osu.edu"],"author_id":["promita-maitra","ritesh-sarkhel"],"abstract":"We present an approach to detect aggression from social media text in this work. A winner-takes-all autoencoder, called Emoti-KATE is proposed for this purpose. Using a log-normalized, weighted word-count vector at input dimensions, the autoencoder simulates a competition between neurons in the hidden layer to minimize the reconstruction loss between the input and final output layers. We have evaluated the performance of our system on the datasets provided by the organizers of TRAC workshop, 2018. Using the encoding generated by Emoti-KATE, a 3-way classification is performed for every social media text in the dataset. Each data point is classified as {`}Overtly Aggressive{'}, {`}Covertly Aggressive{'} or {`}Non-aggressive{'}. Results show that our (team name: PMRS) proposed method is able to achieve promising results on some of these datasets. In this paper, we have described the effects of introducing an winner-takes-all autoencoder for the task of aggression detection, reported its performance on four different datasets, analyzed some of its limitations and how to improve its performance in future works.","pages":"80--89","url":"https:\/\/www.aclweb.org\/anthology\/W18-4410","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4411","title":"Aggression Detection in Social Media: Using Deep Neural Networks, Data Augmentation, and Pseudo Labeling","authors":["Aroyehun, Segun Taofeek","Gelbukh, Alexander"],"emails":["aroyehun.segun@gmail.com",""],"author_id":["segun-taofeek-aroyehun","alexander-gelbukh"],"abstract":"With the advent of the read-write web which facilitates social interactions in online spaces, the rise of anti-social behaviour in online spaces has attracted the attention of researchers. In this paper, we address the challenge of automatically identifying aggression in social media posts. Our team, saroyehun, participated in the English track of the Aggression Detection in Social Media Shared Task. On this task, we investigate the efficacy of deep neural network models of varying complexity. Our results reveal that deep neural network models require more data points to do better than an NBSVM linear baseline based on character n-grams. Our improved deep neural network models were trained on augmented data and pseudo labeled examples. Our LSTM classifier receives a weighted macro-F1 score of 0.6425 to rank first overall on the Facebook subtask of the shared task. On the social media sub-task, our CNN-LSTM model records a weighted macro-F1 score of 0.5920 to place third overall.","pages":"90--97","url":"https:\/\/www.aclweb.org\/anthology\/W18-4411","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4412","title":"Identifying Aggression and Toxicity in Comments using Capsule Network","authors":["Srivastava, Saurabh","Khurana, Prerna","Tewari, Vartika"],"emails":["sriv.saurabh@tcs.com","prerna.khurana2@tcs.com","vartika.tewari@tcs.com"],"author_id":["saurabh-srivastava","prerna-khurana","vartika-tewari"],"abstract":"Aggression and related activities like trolling, hate speech etc. involve toxic comments in various forms. These are common scenarios in today{'}s time and websites react by shutting down their comment sections. To tackle this, an algorithmic solution is preferred to human moderation which is slow and expensive. In this paper, we propose a single model capsule network with focal loss to achieve this task which is suitable for production environment. Our model achieves competitive results over other strong baseline methods, which show its effectiveness and that focal loss exhibits significant improvement in such cases where class imbalance is a regular issue. Additionally, we show that the problem of extensive data preprocessing, data augmentation can be tackled by capsule networks implicitly. We achieve an overall ROC AUC of 98.46 on Kaggle-toxic comment dataset and show that it beats other architectures by a good margin. As comments tend to be written in more than one language, and transliteration is a common problem, we further show that our model handles this effectively by applying our model on TRAC shared task dataset which contains comments in code-mixed Hindi-English.","pages":"98--105","url":"https:\/\/www.aclweb.org\/anthology\/W18-4412","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4413","title":"Degree based Classification of Harmful Speech using Twitter Data","authors":["Sharma, Sanjana","Agrawal, Saksham","Shrivastava, Manish"],"emails":["sanjana.sharma@research.iiit.ac.in","saksham.agrawal@research.iiit.ac.in","m.shrivastava@iiit.ac.in"],"author_id":["sanjana-sharma","saksham-agrawal","manish-shrivastava"],"abstract":"Harmful speech has various forms and it has been plaguing the social media in different ways. If we need to crackdown different degrees of hate speech and abusive behavior amongst it, the classification needs to be based on complex ramifications which needs to be defined and hold accountable for, other than racist, sexist or against some particular group and community. This paper primarily describes how we created an ontological classification of harmful speech based on degree of hateful intent and used it to annotate twitter data accordingly. The key contribution of this paper is the new dataset of tweets we created based on ontological classes and degrees of harmful speech found in the text. We also propose supervised classification system for recognizing these respective harmful speech classes in the texts hence. This serves as a preliminary work to lay down foundation on defining different classes of harmful speech and subsequent work will be done in making it{'}s automatic detection more robust and efficient.","pages":"106--112","url":"https:\/\/www.aclweb.org\/anthology\/W18-4413","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4414","title":"Aggressive Language Identification Using Word Embeddings and Sentiment Features","authors":["Or{\\u{a}}san, Constantin"],"emails":["rasan@wlv.ac.uk"],"author_id":["constantin-orasan"],"abstract":"This paper describes our participation in the First Shared Task on Aggression Identification. The method proposed relies on machine learning to identify social media texts which contain aggression. The main features employed by our method are information extracted from word embeddings and the output of a sentiment analyser. Several machine learning methods and different combinations of features were tried. The official submissions used Support Vector Machines and Random Forests. The official evaluation showed that for texts similar to the ones in the training dataset Random Forests work best, whilst for texts which are different SVMs are a better choice. The evaluation also showed that despite its simplicity the method performs well when compared with more elaborated methods.","pages":"113--119","url":"https:\/\/www.aclweb.org\/anthology\/W18-4414","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4415","title":"Aggression Detection in Social Media using Deep Neural Networks","authors":["Madisetty, Sreekanth","Sankar Desarkar, Maunendra"],"emails":["cs15resch11006@iith.ac.in","maunendra@iith.ac.in"],"author_id":["sreekanth-madisetty","maunendra-sankar-desarkar"],"abstract":"With the rise of user-generated content in social media coupled with almost non-existent moderation in many such systems, aggressive contents have been observed to rise in such forums. In this paper, we work on the problem of aggression detection in social media. Aggression can sometimes be expressed directly or overtly or it can be hidden or covert in the text. On the other hand, most of the content in social media is non-aggressive in nature. We propose an ensemble based system to classify an input post to into one of three classes, namely, Overtly Aggressive, Covertly Aggressive, and Non-aggressive. Our approach uses three deep learning methods, namely, Convolutional Neural Networks (CNN) with five layers (input, convolution, pooling, hidden, and output), Long Short Term Memory networks (LSTM), and Bi-directional Long Short Term Memory networks (Bi-LSTM). A majority voting based ensemble method is used to combine these classifiers (CNN, LSTM, and Bi-LSTM). We trained our method on Facebook comments dataset and tested on Facebook comments (in-domain) and other social media posts (cross-domain). Our system achieves the F1-score (weighted) of 0.604 for Facebook posts and 0.508 for social media posts.","pages":"120--127","url":"https:\/\/www.aclweb.org\/anthology\/W18-4415","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4416","title":"Merging Datasets for Aggressive Text Identification","authors":["Fortuna, Paula","Ferreira, Jos{\\'e}","Pires, Luiz","Routar, Guilherme","Nunes, S{\\'e}rgio"],"emails":["paula.fortuna@fe.up.pt","","","","sergio.nunes@fe.up.pt"],"author_id":["paula-fortuna","jose-ferreira","luiz-pires","guilherme-routar","sergio-nunes"],"abstract":"This paper presents the approach of the team {``}groutar{''} to the shared task on Aggression Identification, considering the test sets in English, both from Facebook and general Social Media. This experiment aims to test the effect of merging new datasets in the performance of classification models. We followed a standard machine learning approach with training, validation, and testing phases, and considered features such as part-of-speech, frequencies of insults, punctuation, sentiment, and capitalization. In terms of algorithms, we experimented with Boosted Logistic Regression, Multi-Layer Perceptron, Parallel Random Forest and eXtreme Gradient Boosting. One question appearing was how to merge datasets using different classification systems (e.g. aggression vs. toxicity). Other issue concerns the possibility to generalize models and apply them to data from different social networks. Regarding these, we merged two datasets, and the results showed that training with similar data is an advantage in the classification of social networks data. However, adding data from different platforms, allowed slightly better results in both Facebook and Social Media, indicating that more generalized models can be an advantage.","pages":"128--139","url":"https:\/\/www.aclweb.org\/anthology\/W18-4416","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4417","title":"Cyberbullying Detection Task: the EBSI-LIA-UNAM System (ELU) at COLING{'}18 TRAC-1","authors":["Arroyo-Fern{\\'a}ndez, Ignacio","Forest, Dominic","Torres-Moreno, Juan-Manuel","Carrasco-Ruiz, Mauricio","Legeleux, Thomas","Joannette, Karen"],"emails":["","","","","",""],"author_id":["ignacio-arroyo-fernandez","dominic-forest","juan-manuel-torres-moreno","mauricio-carrasco-ruiz","thomas-legeleux","karen-joannette"],"abstract":"The phenomenon of cyberbullying has growing in worrying proportions with the development of social networks. Forums and chat rooms are spaces where serious damage can now be done to others, while the tools for avoiding on-line spills are still limited. This study aims to assess the ability that both classical and state-of-the-art vector space modeling methods provide to well known learning machines to identify aggression levels in social network cyberbullying (i.e. social network posts manually labeled as Overtly Aggressive, Covertly Aggressive and Non-aggressive). To this end, an exploratory stage was performed first in order to find relevant settings to test, i.e. by using training and development samples, we trained multiple learning machines using multiple vector space modeling methods and discarded the less informative configurations. Finally, we selected the two best settings and their voting combination to form three competing systems. These systems were submitted to the competition of the TRACK-1 task of the Workshop on Trolling, Aggression and Cyberbullying. Our voting combination system resulted second place in predicting Aggression levels on a test set of untagged social network posts.","pages":"140--149","url":"https:\/\/www.aclweb.org\/anthology\/W18-4417","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4418","title":"Aggression Identification Using Deep Learning and Data Augmentation","authors":["Risch, Julian","Krestel, Ralf"],"emails":["julian.risch@hpi.de","ralf.krestel@hpi.de"],"author_id":["julian-risch","ralf-krestel"],"abstract":"Social media platforms allow users to share and discuss their opinions online. However, a minority of user posts is aggressive, thereby hinders respectful discussion, and {---} at an extreme level {---} is liable to prosecution. The automatic identification of such harmful posts is important, because it can support the costly manual moderation of online discussions. Further, the automation allows unprecedented analyses of discussion datasets that contain millions of posts. This system description paper presents our submission to the First Shared Task on Aggression Identification. We propose to augment the provided dataset to increase the number of labeled comments from 15,000 to 60,000. Thereby, we introduce linguistic variety into the dataset. As a consequence of the larger amount of training data, we are able to train a special deep neural net, which generalizes especially well to unseen data. To further boost the performance, we combine this neural net with three logistic regression classifiers trained on character and word n-grams, and hand-picked syntactic features. This ensemble is more robust than the individual single models. Our team named {``}Julian{''} achieves an F1-score of 60{\\%} on both English datasets, 63{\\%} on the Hindi Facebook dataset, and 38{\\%} on the Hindi Twitter dataset.","pages":"150--158","url":"https:\/\/www.aclweb.org\/anthology\/W18-4418","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4419","title":"Cyber-aggression Detection using Cross Segment-and-Concatenate Multi-Task Learning from Text","authors":["Husseini Orabi, Ahmed","Husseini Orabi, Mahmoud","Huang, Qianjia","Inkpen, Diana","Van Bruwaene, David"],"emails":["","","","",""],"author_id":["ahmed-husseini-orabi","mahmoud-husseini-orabi","qianjia-huang","diana-inkpen","david-van-bruwaene"],"abstract":"In this paper, we propose a novel deep-learning architecture for text classification, named cross segment-and-concatenate multi-task learning (CSC-MTL). We use CSC-MTL to improve the performance of cyber-aggression detection from text. Our approach provides a robust shared feature representation for multi-task learning by detecting contrasts and similarities among polarity and neutral classes. We participated in the cyber-aggression shared task under the team name uOttawa. We report 59.74{\\%} F1 performance for the Facebook test set and 56.9{\\%} for the Twitter test set, for detecting aggression from text.","pages":"159--165","url":"https:\/\/www.aclweb.org\/anthology\/W18-4419","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4420","title":"Delete or not Delete? Semi-Automatic Comment Moderation for the Newsroom","authors":["Risch, Julian","Krestel, Ralf"],"emails":["julian.risch@hpi.de","ralf.krestel@hpi.de"],"author_id":["julian-risch","ralf-krestel"],"abstract":"Comment sections of online news providers have enabled millions to share and discuss their opinions on news topics. Today, moderators ensure respectful and informative discussions by deleting not only insults, defamation, and hate speech, but also unverifiable facts. This process has to be transparent and comprehensive in order to keep the community engaged. Further, news providers have to make sure to not give the impression of censorship or dissemination of fake news. Yet manual moderation is very expensive and becomes more and more unfeasible with the increasing amount of comments. Hence, we propose a semi-automatic, holistic approach, which includes comment features but also their context, such as information about users and articles. For evaluation, we present experiments on a novel corpus of 3 million news comments annotated by a team of professional moderators.","pages":"166--176","url":"https:\/\/www.aclweb.org\/anthology\/W18-4420","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4421","title":"Textual Aggression Detection through Deep Learning","authors":["Tommasel, Antonela","Rodriguez, Juan Manuel","Godoy, Daniela"],"emails":["","",""],"author_id":["antonela-tommasel","juan-manuel-rodriguez","daniela-godoy"],"abstract":"Cyberbullying and cyberaggression are serious and widespread issues increasingly affecting Internet users. With the widespread of social media networks, bullying, once limited to particular places, can now occur anytime and anywhere. Cyberaggression refers to aggressive online behaviour that aims at harming other individuals, and involves rude, insulting, offensive, teasing or demoralising comments through online social media. Considering the dangerous consequences that cyberaggression has on its victims and its rapid spread amongst internet users (specially kids and teens), it is crucial to understand how cyberbullying occurs to prevent it from escalating. Given the massive information overload on the Web, there is an imperious need to develop intelligent techniques to automatically detect harmful content, which would allow the large-scale social media monitoring and early detection of undesired situations. This paper presents the Isistanitos{'}s approach for detecting aggressive content in multiple social media sites. The approach is based on combining Support Vector Machines and Recurrent Neural Network models for analysing a wide-range of character, word, word embeddings, sentiment and irony features. Results confirmed the difficulty of the task (particularly for detecting covert aggressions), showing the limitations of traditionally used features.","pages":"177--187","url":"https:\/\/www.aclweb.org\/anthology\/W18-4421","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4422","title":"Combining Shallow and Deep Learning for Aggressive Text Detection","authors":["Golem, Viktor","Karan, Mladen","{\\v{S}}najder, Jan"],"emails":["viktor.golem@fer.hr","mladen.karan@fer.hr","jan.snajder@fer.hr"],"author_id":["viktor-golem","mladen-karan","jan-snajder"],"abstract":"We describe the participation of team TakeLab in the aggression detection shared task at the TRAC1 workshop for English. Aggression manifests in a variety of ways. Unlike some forms of aggression that are impossible to prevent in day-to-day life, aggressive speech abounding on social networks could in principle be prevented or at least reduced by simply disabling users that post aggressively worded messages. The first step in achieving this is to detect such messages. The task, however, is far from being trivial, as what is considered as aggressive speech can be quite subjective, and the task is further complicated by the noisy nature of user-generated text on social networks. Our system learns to distinguish between open aggression, covert aggression, and non-aggression in social media texts. We tried different machine learning approaches, including traditional (shallow) machine learning models, deep learning models, and a combination of both. We achieved respectable results, ranking 4th and 8th out of 31 submissions on the Facebook and Twitter test sets, respectively.","pages":"188--198","url":"https:\/\/www.aclweb.org\/anthology\/W18-4422","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"},{"id":"W18-4423","title":"Filtering Aggression from the Multilingual Social Media Feed","authors":["Modha, Sandip","Majumder, Prasenjit","Mandl, Thomas"],"emails":["sjmodha@gmail.com","prasenjit.majumder@gmail.com","mandl@uni-hildesheim.de"],"author_id":["sandip-modha","prasenjit-majumder","thomas-mandl"],"abstract":"This paper describes the participation of team DA-LD-Hildesheim from the Information Retrieval Lab(IRLAB) at DA-IICT Gandhinagar, India in collaboration with the University of Hildesheim, Germany and LDRP-ITR, Gandhinagar, India in a shared task on Aggression Identification workshop in COLING 2018. The objective of the shared task is to identify the level of aggression from the User-Generated contents within Social media written in English, Devnagiri Hindi and Romanized Hindi. Aggression levels are categorized into three predefined classes namely: {`}Overtly Aggressive{`}, {`}Covertly Aggressive{`} and {`}Non-aggressive{`}. The participating teams are required to develop a multi-class classifier which classifies User-generated content into these pre-defined classes. Instead of relying on a bag-of-words model, we have used pre-trained vectors for word embedding. We have performed experiments with standard machine learning classifiers. In addition, we have developed various deep learning models for the multi-class classification problem. Using the validation data, we found that validation accuracy of our deep learning models outperform all standard machine learning classifiers and voting based ensemble techniques and results on test data support these findings. We have also found that hyper-parameters of the deep neural network are the keys to improve the results.","pages":"199--207","url":"https:\/\/www.aclweb.org\/anthology\/W18-4423","publisher":"Association for Computational Linguistics","address":"Santa Fe, New Mexico, USA","year":"2018","month":"August","booktitle":"Proceedings of the First Workshop on Trolling, Aggression and Cyberbullying ({TRAC}-2018)"}]