[{"id":"W18-3601","title":"The First Multilingual Surface Realisation Shared Task ({SR}{'}18): Overview and Evaluation Results","authors":["Mille, Simon","Belz, Anja","Bohnet, Bernd","Graham, Yvette","Pitler, Emily","Wanner, Leo"],"emails":["simon.mille@upf.edu","a.s.belz@brighton.ac.uk","bohnetbd@google.com","graham.yvette@gmail.com","epitler@google.com","leo.wanner@upf.edu"],"author_id":["simon-mille","anja-belz","bernd-bohnet","yvette-graham","emily-pitler","leo-wanner"],"abstract":"We report results from the SR{'}18 Shared Task, a new multilingual surface realisation task organised as part of the ACL{'}18 Workshop on Multilingual Surface Realisation. As in its English-only predecessor task SR{'}11, the shared task comprised two tracks with different levels of complexity: (a) a shallow track where the inputs were full UD structures with word order information removed and tokens lemmatised; and (b) a deep track where additionally, functional words and morphological information were removed. The shallow track was offered in ten, and the deep track in three languages. Systems were evaluated (a) automatically, using a range of intrinsic metrics, and (b) by human judges in terms of readability and meaning similarity. This report presents the evaluation results, along with descriptions of the SR{'}18 tracks, data and evaluation methods. For full descriptions of the participating systems, please see the separate system reports elsewhere in this volume.","pages":"1--12","doi":"10.18653\/v1\/W18-3601","url":"https:\/\/www.aclweb.org\/anthology\/W18-3601","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"},{"id":"W18-3602","title":"{B}in{L}in: A Simple Method of Dependency Tree Linearization","authors":["Puzikov, Yevgeniy","Gurevych, Iryna"],"emails":["puzikov@ukp.informatik.tu-darmstadt.de","gurevych@ukp.informatik.tu-darmstadt.de"],"author_id":["yevgeniy-puzikov","iryna-gurevych"],"abstract":"Surface Realization Shared Task 2018 is a workshop on generating sentences from lemmatized sets of dependency triples. This paper describes the results of our participation in the challenge. We develop a data-driven pipeline system which first orders the lemmas and then conjugates the words to finish the surface realization process. Our contribution is a novel sequential method of ordering lemmas, which, despite its simplicity, achieves promising results. We demonstrate the effectiveness of the proposed approach, describe its limitations and outline ways to improve it.","pages":"13--28","doi":"10.18653\/v1\/W18-3602","url":"https:\/\/www.aclweb.org\/anthology\/W18-3602","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"},{"id":"W18-3603","title":"{IIT} ({BHU}) Varanasi at {MSR}-{SRST} 2018: A Language Model Based Approach for Natural Language Generation","authors":["Singh, Shreyansh","Sharma, Ayush","Chawla, Avi","Singh, A.K."],"emails":["shreyansh.singh.cse16@iitbhu.ac.in","ayush.sharma.cse16@iitbhu.ac.in","avi.chawla.cse16@iitbhu.ac.in","aksingh.cse@iitbhu.ac.in"],"author_id":["shreyansh-singh","ayush-sharma","avi-chawla","a-k-singh"],"abstract":"This paper describes our submission system for the Shallow Track of Surface Realization Shared Task 2018 (SRST{'}18). The task was to convert genuine UD structures, from which word order information had been removed and the tokens had been lemmatized, into their correct sentential form. We divide the problem statement into two parts, word reinflection and correct word order prediction. For the first sub-problem, we use a Long Short Term Memory based Encoder-Decoder approach. For the second sub-problem, we present a Language Model (LM) based approach. We apply two different sub-approaches in the LM Based approach and the combined result of these two approaches is considered as the final output of the system.","pages":"29--34","doi":"10.18653\/v1\/W18-3603","url":"https:\/\/www.aclweb.org\/anthology\/W18-3603","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"},{"id":"W18-3604","title":"Surface Realization Shared Task 2018 ({SR}18): The {T}ilburg University Approach","authors":["Castro Ferreira, Thiago","Wubben, Sander","Krahmer, Emiel"],"emails":["tcastrof@tilburguniversity.edu","s.wubben@tilburguniversity.edu","e.j.krahmer@tilburguniversity.edu"],"author_id":["thiago-castro-ferreira","sander-wubben","emiel-krahmer"],"abstract":"This study describes the approach developed by the Tilburg University team to the shallow task of the Multilingual Surface Realization Shared Task 2018 (SR18). Based on (Castro Ferreira et al., 2017), the approach works by first preprocessing an input dependency tree into an ordered linearized string, which is then realized using a statistical machine translation model. Our approach shows promising results, with BLEU scores above 50 for 5 different languages (English, French, Italian, Portuguese and Spanish) and above 35 for the Dutch language.","pages":"35--38","doi":"10.18653\/v1\/W18-3604","url":"https:\/\/www.aclweb.org\/anthology\/W18-3604","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"},{"id":"W18-3605","title":"The {OSU} Realizer for {SRST} {`}18: Neural Sequence-to-Sequence Inflection and Incremental Locality-Based Linearization","authors":["King, David","White, Michael"],"emails":["king.2138@osu.edu","mwhite@ling.osu.edu"],"author_id":["david-king","michael-white"],"abstract":"Surface realization is a nontrivial task as it involves taking structured data and producing grammatically and semantically correct utterances. Many competing grammar-based and statistical models for realization still struggle with relatively simple sentences. For our submission to the 2018 Surface Realization Shared Task, we tackle the shallow task by first generating inflected wordforms with a neural sequence-to-sequence model before incrementally linearizing them. For linearization, we use a global linear model trained using early update that makes use of features that take into account the dependency structure and dependency locality. Using this pipeline sufficed to produce surprisingly strong results in the shared task. In future work, we intend to pursue joint approaches to linearization and morphological inflection and incorporating a neural language model into the linearization choices.","pages":"39--48","doi":"10.18653\/v1\/W18-3605","url":"https:\/\/www.aclweb.org\/anthology\/W18-3605","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"},{"id":"W18-3606","title":"Generating High-Quality Surface Realizations Using Data Augmentation and Factored Sequence Models","authors":["Elder, Henry","Hokamp, Chris"],"emails":["henry.elder@adaptcentre.ie","chris@aylien.com"],"author_id":["henry-elder","chris-hokamp"],"abstract":"This work presents state of the art results in reconstruction of surface realizations from obfuscated text. We identify the lack of sufficient training data as the major obstacle to training high-performing models, and solve this issue by generating large amounts of synthetic training data. We also propose preprocessing techniques which make the structure contained in the input features more accessible to sequence models. Our models were ranked first on all evaluation metrics in the English portion of the 2018 Surface Realization shared task.","pages":"49--53","doi":"10.18653\/v1\/W18-3606","url":"https:\/\/www.aclweb.org\/anthology\/W18-3606","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"},{"id":"W18-3607","title":"{AX} Semantics{'} Submission to the Surface Realization Shared Task 2018","authors":["Madsack, Andreas","Heininger, Johanna","Davaasambuu, Nyamsuren","Voronik, Vitaliia","K{\\\"a}ufl, Michael","Wei{\\ss}graeber, Robert"],"emails":["andreas.madsack@ax-semantics.com","johanna.heininger@ax-semantics.com","nyamsuren.davaasambuu@ax-semantics.com","vitaliia.voronik@ax-semantics.com","michael.k{\\\"a}ufl@ax-semantics.com","robert.wei{\\ss}graeber@ax-semantics.com"],"author_id":["andreas-madsack","johanna-heininger","nyamsuren-davaasambuu","vitaliia-voronik","michael-kaufl","robert-weissgraeber"],"abstract":"In this paper we describe our system and experimental results on the development set of the Surface Realisation Shared Task. Our system is an entry for the Shallow-Task, with two different models based on deep-learning implementations for building the sentence combined with a rule-based morphology component.","pages":"54--57","doi":"10.18653\/v1\/W18-3607","url":"https:\/\/www.aclweb.org\/anthology\/W18-3607","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"},{"id":"W18-3608","title":"{NILC}-{SWORNEMO} at the Surface Realization Shared Task: Exploring Syntax-Based Word Ordering using Neural Models","authors":["Sobrevilla Cabezudo, Marco Antonio","Pardo, Thiago"],"emails":["msobrevillac@usp.br","taspardo@icmc.usp.br"],"author_id":["marco-antonio-sobrevilla-cabezudo","thiago-pardo"],"abstract":"This paper describes the submission by the NILC Computational Linguistics research group of the University of S{\\~a}o Paulo\/Brazil to the Track 1 of the Surface Realization Shared Task (SRST Track 1). We present a neural-based method that works at the syntactic level to order the words (which we refer by NILC-SWORNEMO, standing for {``}Syntax-based Word ORdering using NEural MOdels{''}). Additionally, we apply a bottom-up approach to build the sentence and, using language-specific lexicons, we produce the proper word form of each lemma in the sentence. The results obtained by our method outperformed the average of the results for English, Portuguese and Spanish in the track.","pages":"58--64","doi":"10.18653\/v1\/W18-3608","url":"https:\/\/www.aclweb.org\/anthology\/W18-3608","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"},{"id":"W18-3609","title":"The {D}ip{I}nfo-{U}ni{T}o system for {SRST} 2018","authors":["Basile, Valerio","Mazzei, Alessandro"],"emails":["valeriobasile@gmail.com","mazzei@di.unito.it"],"author_id":["valerio-basile","alessandro-mazzei"],"abstract":"This paper describes the system developed by the DipInfo-UniTo team to participate to the shallow track of the Surface Realization Shared Task 2018. The system employs two separate neural networks with different architectures to predict the word ordering and the morphological inflection independently from each other. The UniTO realizer is language independent, and its simple architecture allowed it to be scored in the central part of the final ranking of the shared task.","pages":"65--71","doi":"10.18653\/v1\/W18-3609","url":"https:\/\/www.aclweb.org\/anthology\/W18-3609","publisher":"Association for Computational Linguistics","address":"Melbourne, Australia","year":"2018","month":"July","booktitle":"Proceedings of the First Workshop on Multilingual Surface Realisation"}]