[{"id":"W18-3401","title":"Character-level Supervision for Low-resource {POS} Tagging","authors":["Kann, Katharina","Bjerva, Johannes","Augenstein, Isabelle","Plank, Barbara","S{\\o}gaard, Anders"],"emails":["kann@nyu.edu","","","",""],"author_id":["katharina-kann","johannes-bjerva","isabelle-augenstein","barbara-plank","anders-sogaard"],"abstract":"Neural part-of-speech (POS) taggers are known to not perform well with little training data. As a step towards overcoming this problem, we present an architecture for learning more robust neural POS taggers by jointly training a hierarchical, recurrent model and a recurrent character-based sequence-to-sequence network supervised using an auxiliary objective. This way, we introduce stronger character-level supervision into the model, which enables better generalization to unseen words and provides regularization, making our encoding less prone to overfitting. We experiment with three auxiliary tasks: lemmatization, character-based word autoencoding, and character-based random string autoencoding. Experiments with minimal amounts of labeled data on 34 languages show that our new architecture outperforms a single-task baseline and, surprisingly, that, on average, raw text autoencoding can be as beneficial for low-resource POS tagging as using lemma information. Our neural POS tagger closes the gap to a state-of-the-art POS tagger (MarMoT) for low-resource scenarios by 43{\\%}, even outperforming it on languages with templatic morphology, e.g., Arabic, Hebrew, and Turkish, by some margin.","pages":"1--11","doi":"10.18653\/v1\/W18-3401","url":"https:\/\/www.aclweb.org\/anthology\/W18-3401","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3402","title":"Training a Neural Network in a Low-Resource Setting on Automatically Annotated Noisy Data","authors":["Hedderich, Michael A.","Klakow, Dietrich"],"emails":["mhedderich@lsv.uni-saarland.de","dietrich.klakow@lsv.uni-saarland.de"],"author_id":["michael-a-hedderich","dietrich-klakow"],"abstract":"Manually labeled corpora are expensive to create and often not available for low-resource languages or domains. Automatic labeling approaches are an alternative way to obtain labeled data in a quicker and cheaper way. However, these labels often contain more errors which can deteriorate a classifier{'}s performance when trained on this data. We propose a noise layer that is added to a neural network architecture. This allows modeling the noise and train on a combination of clean and noisy data. We show that in a low-resource NER task we can improve performance by up to 35{\\%} by using additional, noisy data and handling the noise.","pages":"12--18","doi":"10.18653\/v1\/W18-3402","url":"https:\/\/www.aclweb.org\/anthology\/W18-3402","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3403","title":"Multi-task learning for historical text normalization: Size matters","authors":["Bollmann, Marcel","S{\\o}gaard, Anders","Bingel, Joachim"],"emails":["marcel@di.ku.dk","soegaard@di.ku.dk","bingel@di.ku.dk"],"author_id":["marcel-bollmann","anders-sogaard","joachim-bingel"],"abstract":"Historical text normalization suffers from small datasets that exhibit high variance, and previous work has shown that multi-task learning can be used to leverage data from related problems in order to obtain more robust models. Previous work has been limited to datasets from a specific language and a specific historical period, and it is not clear whether results generalize. It therefore remains an open problem, when historical text normalization benefits from multi-task learning. We explore the benefits of multi-task learning across 10 different datasets, representing different languages and periods. Our main finding{---}contrary to what has been observed for other NLP tasks{---}is that multi-task learning mainly works when target task data is very scarce.","pages":"19--24","doi":"10.18653\/v1\/W18-3403","url":"https:\/\/www.aclweb.org\/anthology\/W18-3403","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3404","title":"Compositional Language Modeling for Icon-Based Augmentative and Alternative Communication","authors":["Dudy, Shiran","Bedrick, Steven"],"emails":["dudy@ohsu.edu","bedricks@ohsu.edu"],"author_id":["shiran-dudy","steven-bedrick"],"abstract":"Icon-based communication systems are widely used in the field of Augmentative and Alternative Communication. Typically, icon-based systems have lagged behind word- and character-based systems in terms of predictive typing functionality, due to the challenges inherent to training icon-based language models. We propose a method for synthesizing training data for use in icon-based language models, and explore two different modeling strategies. We propose a method to generate language models for corpus-less symbol-set.","pages":"25--32","doi":"10.18653\/v1\/W18-3404","url":"https:\/\/www.aclweb.org\/anthology\/W18-3404","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3405","title":"Multimodal Neural Machine Translation for Low-resource Language Pairs using Synthetic Data","authors":["Dutta Chowdhury, Koel","Hasanuzzaman, Mohammed","Liu, Qun"],"emails":["koel.chowdhury@adaptcentre.ie","mohammed.hasanuzzaman@adaptcentre.ie","qun.liu@adaptcentre.ie"],"author_id":["koel-dutta-chowdhury","mohammed-hasanuzzaman","qun-liu"],"abstract":"In this paper, we investigate the effectiveness of training a multimodal neural machine translation (MNMT) system with image features for a low-resource language pair, Hindi and English, using synthetic data. A three-way parallel corpus which contains bilingual texts and corresponding images is required to train a MNMT system with image features. However, such a corpus is not available for low resource language pairs. To address this, we developed both a synthetic training dataset and a manually curated development\/test dataset for Hindi based on an existing English-image parallel corpus. We used these datasets to build our image description translation system by adopting state-of-the-art MNMT models. Our results show that it is possible to train a MNMT system for low-resource language pairs through the use of synthetic data and that such a system can benefit from image features.","pages":"33--42","doi":"10.18653\/v1\/W18-3405","url":"https:\/\/www.aclweb.org\/anthology\/W18-3405","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3406","title":"Multi-Task Active Learning for Neural Semantic Role Labeling on Low Resource Conversational Corpus","authors":["Ikhwantri, Fariz","Louvan, Samuel","Kurniawan, Kemal","Abisena, Bagas","Rachman, Valdi","Wicaksono, Alfan Farizki","Mahendra, Rahmad"],"emails":["fariz@kata.ai","slouvan@fbk.eu","kemal@kata.ai","bagas@kata.ai","valdi.rachman@gmail.com","alfan@cs.ui.ac.id","rahmad.mahendra@cs.ui.ac.id"],"author_id":["fariz-ikhwantri","samuel-louvan","kemal-kurniawan","bagas-abisena","valdi-rachman","alfan-farizki-wicaksono","rahmad-mahendra"],"abstract":"Most Semantic Role Labeling (SRL) approaches are supervised methods which require a significant amount of annotated corpus, and the annotation requires linguistic expertise. In this paper, we propose a Multi-Task Active Learning framework for Semantic Role Labeling with Entity Recognition (ER) as the auxiliary task to alleviate the need for extensive data and use additional information from ER to help SRL. We evaluate our approach on Indonesian conversational dataset. Our experiments show that multi-task active learning can outperform single-task active learning method and standard multi-task learning. According to our results, active learning is more efficient by using 12{\\%} less of training data compared to passive learning in both single-task and multi-task setting. We also introduce a new dataset for SRL in Indonesian conversational domain to encourage further research in this area.","pages":"43--50","doi":"10.18653\/v1\/W18-3406","url":"https:\/\/www.aclweb.org\/anthology\/W18-3406","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3407","title":"Domain Adapted Word Embeddings for Improved Sentiment Classification","authors":["Kameswara Sarma, Prathusha","Liang, Yingyu","Sethares, Bill"],"emails":["kameswarasar@wisc.edu","yliang@cs.wisc.edu","sethares@wisc.edu"],"author_id":["prathusha-kameswara-sarma","yingyu-liang","bill-sethares"],"abstract":"Generic word embeddings are trained on large-scale generic corpora; Domain Specific (DS) word embeddings are trained only on data from a domain of interest. This paper proposes a method to combine the breadth of generic embeddings with the specificity of domain specific embeddings. The resulting embeddings, called Domain Adapted (DA) word embeddings, are formed by first aligning corresponding word vectors using Canonical Correlation Analysis (CCA) or the related nonlinear Kernel CCA (KCCA) and then combining them via convex optimization. Results from evaluation on sentiment classification tasks show that the DA embeddings substantially outperform both generic, DS embeddings when used as input features to standard or state-of-the-art sentence encoding algorithms for classification.","pages":"51--59","doi":"10.18653\/v1\/W18-3407","url":"https:\/\/www.aclweb.org\/anthology\/W18-3407","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3408","title":"Investigating Effective Parameters for Fine-tuning of Word Embeddings Using Only a Small Corpus","authors":["Komiya, Kanako","Shinnou, Hiroyuki"],"emails":["",""],"author_id":["kanako-komiya","hiroyuki-shinnou"],"abstract":"Fine-tuning is a popular method to achieve better performance when only a small target corpus is available. However, it requires tuning of a number of metaparameters and thus it might carry risk of adverse effect when inappropriate metaparameters are used. Therefore, we investigate effective parameters for fine-tuning when only a small target corpus is available. In the current study, we target at improving Japanese word embeddings created from a huge corpus. First, we demonstrate that even the word embeddings created from the huge corpus are affected by domain shift. After that, we investigate effective parameters for fine-tuning of the word embeddings using a small target corpus. We used perplexity of a language model obtained from a Long Short-Term Memory network to assess the word embeddings input into the network. The experiments revealed that fine-tuning sometimes give adverse effect when only a small target corpus is used and batch size is the most important parameter for fine-tuning. In addition, we confirmed that effect of fine-tuning is higher when size of a target corpus was larger.","pages":"60--67","doi":"10.18653\/v1\/W18-3408","url":"https:\/\/www.aclweb.org\/anthology\/W18-3408","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3409","title":"Semi-Supervised Learning with Auxiliary Evaluation Component for Large Scale e-Commerce Text Classification","authors":["Liu, Mingkuan","Wen, Musen","Kopru, Selcuk","Liu, Xianjing","Lu, Alan"],"emails":["mingkliu@ebay.com","mwen@ebay.com","skopru@ebay.com","xianjliu@ebay.com","alalu@ebay.com"],"author_id":["mingkuan-liu","musen-wen","selcuk-kopru","xianjing-liu","alan-lu"],"abstract":"The lack of high-quality labeled training data has been one of the critical challenges facing many industrial machine learning tasks. To tackle this challenge, in this paper, we propose a semi-supervised learning method to utilize unlabeled data and user feedback signals to improve the performance of ML models. The method employs a primary model Main and an auxiliary evaluation model Eval, where Main and Eval models are trained iteratively by automatically generating labeled data from unlabeled data and\/or users{'} feedback signals. The proposed approach is applied to different text classification tasks. We report results on both the publicly available Yahoo! Answers dataset and our e-commerce product classification dataset. The experimental results show that the proposed method reduces the classification error rate by 4{\\%} and up to 15{\\%} across various experimental setups and datasets. A detailed comparison with other semi-supervised learning approaches is also presented later in the paper. The results from various text classification tasks demonstrate that our method outperforms those developed in previous related studies.","pages":"68--76","doi":"10.18653\/v1\/W18-3409","url":"https:\/\/www.aclweb.org\/anthology\/W18-3409","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"},{"id":"W18-3410","title":"Low-rank passthrough neural networks","authors":["Miceli Barone, Antonio Valerio"],"emails":["amiceli@inf.ed.ac.uk"],"author_id":["antonio-valerio-miceli-barone"],"abstract":"Various common deep learning architectures, such as LSTMs, GRUs, Resnets and Highway Networks, employ state passthrough connections that support training with high feed-forward depth or recurrence over many time steps. These {``}Passthrough Networks{''} architectures also enable the decoupling of the network state size from the number of parameters of the network, a possibility has been studied by Sak et al. (2014) with their low-rank parametrization of the LSTM. In this work we extend this line of research, proposing effective, low-rank and low-rank plus diagonal matrix parametrizations for Passthrough Networks which exploit this decoupling property, reducing the data complexity and memory requirements of the network while preserving its memory capacity. This is particularly beneficial in low-resource settings as it supports expressive models with a compact parametrization less susceptible to overfitting. We present competitive experimental results on several tasks, including language modeling and a near state of the art result on sequential randomly-permuted MNIST classification, a hard task on natural data.","pages":"77--86","doi":"10.18653\/v1\/W18-3410","url":"https:\/\/www.aclweb.org\/anthology\/W18-3410","publisher":"Association for Computational Linguistics","address":"Melbourne","year":"2018","month":"July","booktitle":"Proceedings of the Workshop on Deep Learning Approaches for Low-Resource {NLP}"}]