[{"id":"W19-4201","title":"{AX} Semantics{'} Submission to the {SIGMORPHON} 2019 Shared Task","authors":["Madsack, Andreas","Wei{\\ss}graeber, Robert"],"emails":["andreas.madsack@ax-semantics.com","robert.wei{\\ss}graeber@ax-semantics.com"],"author_id":["andreas-madsack","robert-weissgraeber"],"abstract":"This paper describes the AX Semantics{'} submission to the SIGMORPHON 2019 shared task on morphological reinflection. We implemented two systems, both tackling the task for all languages in one codebase, without any underlying language specific features. The first one is an encoder-decoder model using AllenNLP; the second system uses the same model modified by a custom trainer that trains only with the target language resources after a specific threshold. We especially focused on building an implementation using AllenNLP with out-of-the-box methods to facilitate easy operation and reuse.","pages":"1--5","doi":"10.18653\/v1\/W19-4201","url":"https:\/\/www.aclweb.org\/anthology\/W19-4201","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4202","title":"Cognate Projection for Low-Resource Inflection Generation","authors":["Hauer, Bradley","Habibi, Amir Ahmad","Luan, Yixing","Riyadh, Rashed Rubby","Kondrak, Grzegorz"],"emails":["bmhauer@ualberta.ca","amirahmad@ualberta.ca","yixing1@ualberta.ca","riyadh@ualberta.ca","gkondrak@ualberta.ca"],"author_id":["bradley-hauer","amir-ahmad-habibi","yixing-luan","rashed-rubby-riyadh","grzegorz-kondrak"],"abstract":"We propose cognate projection as a method of crosslingual transfer for inflection generation in the context of the SIGMORPHON 2019 Shared Task. The results on four language pairs show the method is effective when no low-resource training data is available.","pages":"6--11","doi":"10.18653\/v1\/W19-4202","url":"https:\/\/www.aclweb.org\/anthology\/W19-4202","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4203","title":"Cross-Lingual Lemmatization and Morphology Tagging with Two-Stage Multilingual {BERT} Fine-Tuning","authors":["Kondratyuk, Dan"],"emails":["dankondratyuk@gmail.com"],"author_id":["dan-kondratyuk"],"abstract":"We present our CHARLES-SAARLAND system for the SIGMORPHON 2019 Shared Task on Crosslinguality and Context in Morphology, in task 2, Morphological Analysis and Lemmatization in Context. We leverage the multilingual BERT model and apply several fine-tuning strategies introduced by UDify demonstrating exceptional evaluation performance on morpho-syntactic tasks. Our results show that fine-tuning multilingual BERT on the concatenation of all available treebanks allows the model to learn cross-lingual information that is able to boost lemmatization and morphology tagging accuracy over fine-tuning it purely monolingually. Unlike UDify, however, we show that when paired with additional character-level and word-level LSTM layers, a second stage of fine-tuning on each treebank individually can improve evaluation even further. Out of all submissions for this shared task, our system achieves the highest average accuracy and f1 score in morphology tagging and places second in average lemmatization accuracy.","pages":"12--18","doi":"10.18653\/v1\/W19-4203","url":"https:\/\/www.aclweb.org\/anthology\/W19-4203","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4204","title":"{CBNU} System for {SIGMORPHON} 2019 Shared Task 2: a Pipeline Model","authors":["Shadikhodjaev, Uygun","Lee, Jae Sung"],"emails":["",""],"author_id":["uygun-shadikhodjaev","jae-sung-lee"],"abstract":"In this paper we describe our system for morphological analysis and lemmatization in context, using a transformer-based sequence to sequence model and a biaffine attention based BiLSTM model. First, a lemma is produced for a given word, and then both the lemma and the given word are used for morphological analysis. We also make use of character level word encodings and trainable encodings to improve accuracy. Overall, our system ranked fifth in lemmatization and sixth in morphological accuracy among twelve systems, and demonstrated considerable improvements over the baseline in morphological analysis.","pages":"19--24","doi":"10.18653\/v1\/W19-4204","url":"https:\/\/www.aclweb.org\/anthology\/W19-4204","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4205","title":"{M}orpheus: A Neural Network for Jointly Learning Contextual Lemmatization and Morphological Tagging","authors":["Yildiz, Eray","Tantu{\\u{g}}, A. C{\\\"u}neyd"],"emails":["yildiz17@itu.edu.tr","tantug@itu.edu.tr"],"author_id":["eray-yildiz","a-cuneyd-tantug"],"abstract":"In this study, we present Morpheus, a joint contextual lemmatizer and morphological tagger. Morpheus is based on a neural sequential architecture where inputs are the characters of the surface words in a sentence and the outputs are the minimum edit operations between surface words and their lemmata as well as the morphological tags assigned to the words. The experiments on the datasets in nearly 100 languages provided by SigMorphon 2019 Shared Task 2 organizers show that the performance of Morpheus is comparable to the state-of-the-art system in terms of lemmatization. In morphological tagging, on the other hand, Morpheus significantly outperforms the SigMorphon baseline. In our experiments, we also show that the neural encoder-decoder architecture trained to predict the minimum edit operations can produce considerably better results than the architecture trained to predict the characters in lemmata directly as in previous studies. According to the SigMorphon 2019 Shared Task 2 results, Morpheus has placed 3rd in lemmatization and reached the 9th place in morphological tagging among all participant teams.","pages":"25--34","doi":"10.18653\/v1\/W19-4205","url":"https:\/\/www.aclweb.org\/anthology\/W19-4205","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4206","title":"Multi-Team: A Multi-attention, Multi-decoder Approach to Morphological Analysis.","authors":["{\\\"U}st{\\\"u}n, Ahmet","van der Goot, Rob","Bouma, Gosse","van Noord, Gertjan"],"emails":["a.ustun@rug.nl","r.van.der.goot@rug.nl","g.bouma@rug.nl","g.j.m.van.noord@rug.nl"],"author_id":["ahmet-ustun","rob-van-der-goot","gosse-bouma","gertjan-van-noord"],"abstract":"This paper describes our submission to SIGMORPHON 2019 Task 2: Morphological analysis and lemmatization in context. Our model is a multi-task sequence to sequence neural network, which jointly learns morphological tagging and lemmatization. On the encoding side, we exploit character-level as well as contextual information. We introduce a multi-attention decoder to selectively focus on different parts of character and word sequences. To further improve the model, we train on multiple datasets simultaneously and use external embeddings for initialization. Our final model reaches an average morphological tagging F1 score of 94.54 and a lemma accuracy of 93.91 on the test data, ranking respectively 3rd and 6th out of 13 teams in the SIGMORPHON 2019 shared task.","pages":"35--49","doi":"10.18653\/v1\/W19-4206","url":"https:\/\/www.aclweb.org\/anthology\/W19-4206","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4207","title":"{IT}{--}{IST} at the {SIGMORPHON} 2019 Shared Task: Sparse Two-headed Models for Inflection","authors":["Peters, Ben","Martins, Andr{\\'e} F. T."],"emails":["benzurdopeters@gmail.com","andre.martins@unbabel.com"],"author_id":["ben-peters","andre-f-t-martins"],"abstract":"This paper presents the Instituto de Telecomunica{\\c{c}}{\\~o}es{--}Instituto Superior T{\\'e}cnico submission to Task 1 of the SIGMORPHON 2019 Shared Task. Our models combine sparse sequence-to-sequence models with a two-headed attention mechanism that learns separate attention distributions for the lemma and inflectional tags. Among submissions to Task 1, our models rank second and third. Despite the low data setting of the task (only 100 in-language training examples), they learn plausible inflection patterns and often concentrate all probability mass into a small set of hypotheses, making beam search exact.","pages":"50--56","doi":"10.18653\/v1\/W19-4207","url":"https:\/\/www.aclweb.org\/anthology\/W19-4207","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4208","title":"{CMU}-01 at the {SIGMORPHON} 2019 Shared Task on Crosslinguality and Context in Morphology","authors":["Chaudhary, Aditi","Salesky, Elizabeth","Bhat, Gayatri","Mortensen, David R.","Carbonell, Jaime","Tsvetkov, Yulia"],"emails":["aschaudh@cs.cmu.edu","esalesky@cs.cmu.edu","gbhat@cs.cmu.edu","dmortens@cs.cmu.edu","jgc@cs.cmu.edu","ytsvetko@cs.cmu.edu"],"author_id":["aditi-chaudhary","elizabeth-salesky","gayatri-bhat","david-r-mortensen","jaime-g-carbonell","yulia-tsvetkov"],"abstract":"This paper presents the submission by the CMU-01 team to the SIGMORPHON 2019 task 2 of Morphological Analysis and Lemmatization in Context. This task requires us to produce the lemma and morpho-syntactic description of each token in a sequence, for 107 treebanks. We approach this task with a hierarchical neural conditional random field (CRF) model which predicts each coarse-grained feature (eg. POS, Case, etc.) independently. However, most treebanks are under-resourced, thus making it challenging to train deep neural models for them. Hence, we propose a multi-lingual transfer training regime where we transfer from multiple related languages that share similar typology.","pages":"57--70","doi":"10.18653\/v1\/W19-4208","url":"https:\/\/www.aclweb.org\/anthology\/W19-4208","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4209","title":"Cross-lingual morphological inflection with explicit alignment","authors":["{\\c{C}}{\\\"o}ltekin, {\\c{C}}a{\\u{g}}r{\\i}"],"emails":["ccoltekin@sfs.uni-tuebingen.de"],"author_id":["cagri-coltekin"],"abstract":"This paper describes two related systems for cross-lingual morphological inflection for SIGMORPHON 2019 Shared Task participation. Both sets of results submitted to the shared task for evaluation are obtained using a simple approach of predicting transducer actions based on initial alignments on the training set, where cross-lingual transfer is limited to only using the high-resource language data as additional training set. The performance of the system does not reach the performance of the top two systems in the competition. However, we show that results can be improved with further tuning. We also present further analyses demonstrating that the cross-lingual gain is rather modest.","pages":"71--79","doi":"10.18653\/v1\/W19-4209","url":"https:\/\/www.aclweb.org\/anthology\/W19-4209","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4210","title":"{THOMAS}: The Hegemonic {OSU} Morphological Analyzer using Seq2seq","authors":["Oh, Byung-Doh","Maneriker, Pranav","Jiang, Nanjiang"],"emails":["oh.531@osu.edu","maneriker.1@osu.edu","jiang.1879@osu.edu"],"author_id":["byung-doh-oh","pranav-maneriker","nanjiang-jiang"],"abstract":"This paper describes the OSU submission to the SIGMORPHON 2019 shared task, Crosslinguality and Context in Morphology. Our system addresses the \\textit{contextual morphological analysis} subtask of Task 2, which is to produce the morphosyntactic description (MSD) of each fully inflected word within a given sentence. We frame this as a sequence generation task and employ a neural encoder-decoder (seq2seq) architecture to generate the sequence of MSD tags given the encoded representation of each token. Follow-up analyses reveal that our system most significantly improves performance on morphologically complex languages whose inflected word forms typically have longer MSD tag sequences. In addition, our system seems to capture the structured correlation between MSD tags, such as that between the {``}verb{''} tag and TAM-related tags.","pages":"80--86","doi":"10.18653\/v1\/W19-4210","url":"https:\/\/www.aclweb.org\/anthology\/W19-4210","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4211","title":"Sigmorphon 2019 Task 2 system description paper: Morphological analysis in context for many languages, with supervision from only a few","authors":["Aiken, Brad","Kelly, Jared","Palmer, Alexis","polat, suleyman olcay","Rama, Taraka","Nielsen, Rodney"],"emails":["bradfordaiken@my.unt.edu","jared.kelly@unt.edu","alexis.palmer@unt.edu","suleymanolcaypolat@my.unt.edu","tarakark@ifi.uio.no","rodney.nielsen@unt.edu"],"author_id":["brad-aiken","jared-kelly","alexis-palmer","suleyman-olcay-polat","taraka-rama","rodney-nielsen"],"abstract":"This paper presents the UNT HiLT+Ling system for the Sigmorphon 2019 shared Task 2: Morphological Analysis and Lemmatization in Context. Our core approach focuses on the morphological tagging task; part-of-speech tagging and lemmatization are treated as secondary tasks. Given the highly multilingual nature of the task, we propose an approach which makes minimal use of the supplied training data, in order to be extensible to languages without labeled training data for the morphological inflection task. Specifically, we use a parallel Bible corpus to align contextual embeddings at the verse level. The aligned verses are used to build cross-language translation matrices, which in turn are used to map between embedding spaces for the various languages. Finally, we use sets of inflected forms, primarily from a high-resource language, to induce vector representations for individual UniMorph tags. Morphological analysis is performed by matching vector representations to embeddings for individual tokens. While our system results are dramatically below the average system submitted for the shared task evaluation campaign, our method is (we suspect) unique in its minimal reliance on labeled training data.","pages":"87--94","doi":"10.18653\/v1\/W19-4211","url":"https:\/\/www.aclweb.org\/anthology\/W19-4211","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4212","title":"{UDP}ipe at {SIGMORPHON} 2019: Contextualized Embeddings, Regularization with Morphological Categories, Corpora Merging","authors":["Straka, Milan","Strakov{\\'a}, Jana","Hajic, Jan"],"emails":["straka@ufal.mff.cuni.cz","strakova@ufal.mff.cuni.cz","hajic@ufal.mff.cuni.cz"],"author_id":["milan-straka","jana-strakova","jan-hajic"],"abstract":"We present our contribution to the SIGMORPHON 2019 Shared Task: Crosslinguality and Context in Morphology, Task 2: contextual morphological analysis and lemmatization. We submitted a modification of the UDPipe 2.0, one of best-performing systems of the CoNLL 2018 Shared Task: Multilingual Parsing from Raw Text to Universal Dependencies and an overall winner of the The 2018 Shared Task on Extrinsic Parser Evaluation. As our first improvement, we use the pretrained contextualized embeddings (BERT) as additional inputs to the network; secondly, we use individual morphological features as regularization; and finally, we merge the selected corpora of the same language. In the lemmatization task, our system exceeds all the submitted systems by a wide margin with lemmatization accuracy 95.78 (second best was 95.00, third 94.46). In the morphological analysis, our system placed tightly second: our morphological analysis accuracy was 93.19, the winning system{'}s 93.23.","pages":"95--103","doi":"10.18653\/v1\/W19-4212","url":"https:\/\/www.aclweb.org\/anthology\/W19-4212","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4213","title":"{CUNI}{--}Malta system at {SIGMORPHON} 2019 Shared Task on Morphological Analysis and Lemmatization in context: Operation-based word formation","authors":["Cardenas, Ronald","Borg, Claudia","Zeman, Daniel"],"emails":["ronald.cardenas@matfyz.cz","claudia.borg@um.edu.mt","zeman@ufal.mff.cuni.cz"],"author_id":["ronald-cardenas","claudia-borg","daniel-zeman"],"abstract":"This paper presents the submission by the Charles University-University of Malta team to the SIGMORPHON 2019 Shared Task on Morphological Analysis and Lemmatization in context. We present a lemmatization model based on previous work on neural transducers (Makarov and Clematide, 2018b; Aharoni and Goldberg, 2016). The key difference is that our model transforms the whole word form in every step, instead of consuming it character by character. We propose a merging strategy inspired by Byte-Pair-Encoding that reduces the space of valid operations by merging frequent adjacent operations. The resulting operations not only encode the actions to be performed but the relative position in the word token and how characters need to be transformed. Our morphological tagger is a vanilla biLSTM tagger that operates over operation representations, encoding operations and words in a hierarchical manner. Even though relative performance according to metrics is below the baseline, experiments show that our models capture important associations between interpretable operation labels and fine-grained morpho-syntax labels.","pages":"104--112","doi":"10.18653\/v1\/W19-4213","url":"https:\/\/www.aclweb.org\/anthology\/W19-4213","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4214","title":"A Little Linguistics Goes a Long Way: Unsupervised Segmentation with Limited Language Specific Guidance","authors":["Erdmann, Alexander","Khalifa, Salam","Oudah, Mai","Habash, Nizar","Bouamor, Houda"],"emails":["ae1541@nyu.edu","salamkhalifa@nyu.edu","mai.oudah@nyu.edu","nizar.habash@nyu.edu","hbouamor@cmu.edu"],"author_id":["alexander-erdmann","salam-khalifa","mai-oudah","nizar-habash","houda-bouamor"],"abstract":"We present de-lexical segmentation, a linguistically motivated alternative to greedy or other unsupervised methods, requiring only minimal language specific input. Our technique involves creating a small grammar of closed-class affixes which can be written in a few hours. The grammar over generates analyses for word forms attested in a raw corpus which are disambiguated based on features of the linguistic base proposed for each form. Extending the grammar to cover orthographic, morpho-syntactic or lexical variation is simple, making it an ideal solution for challenging corpora with noisy, dialect-inconsistent, or otherwise non-standard content. In two evaluations, we consistently outperform competitive unsupervised baselines and approach the performance of state-of-the-art supervised models trained on large amounts of data, providing evidence for the value of linguistic input during preprocessing.","pages":"113--124","doi":"10.18653\/v1\/W19-4214","url":"https:\/\/www.aclweb.org\/anthology\/W19-4214","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4215","title":"Equiprobable mappings in weighted constraint grammars","authors":["Anttila, Arto","Borgeson, Scott","Magri, Giorgio"],"emails":["anttila@stanford.edu","borgeson@stanford.edu","magrigrg@gmail.com"],"author_id":["arto-anttila","scott-borgeson","giorgio-magri"],"abstract":"We show that MaxEnt is so rich that it can distinguish between any two different mappings: there always exists a nonnegative weight vector which assigns them different MaxEnt probabilities. Stochastic HG instead does admit equiprobable mappings and we give a complete formal characterization of them.","pages":"125--134","doi":"10.18653\/v1\/W19-4215","url":"https:\/\/www.aclweb.org\/anthology\/W19-4215","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4216","title":"Unbounded Stress in Subregular Phonology","authors":["Hao, Yiding","Andersson, Samuel"],"emails":["yiding.hao@yale.edu","samuel.andersson@yale.edu"],"author_id":["yiding-hao","samuel-andersson"],"abstract":"This paper situates culminative unbounded stress systems within the subregular hierarchy for functions. While Baek (2018) has argued that such systems can be uniformly understood as input tier-based strictly local constraints, we show here that default-to-opposite-side and default-to-same-side stress systems belong to distinct subregular classes when they are viewed as functions that assign primary stress to underlying forms. While the former system can be captured by input tier-based input strictly local functions, a subsequential function class that we define here, the latter system is not subsequential, though it is weakly deterministic according to McCollum et al.{'}s (2018) non-interaction criterion. Our results motivate the extension of recently proposed subregular language classes to subregular functions and argue in favor of McCollum et al{'}s definition of weak determinism over that of Heinz and Lai (2013).","pages":"135--143","doi":"10.18653\/v1\/W19-4216","url":"https:\/\/www.aclweb.org\/anthology\/W19-4216","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4217","title":"Data mining {M}andarin tone contour shapes","authors":["ZHANG, SHUO"],"emails":["zhang@bose.com"],"author_id":["shuo-zhang1"],"abstract":"In spontaneous speech, Mandarin tones that belong to the same tone category may exhibit many different contour shapes. We explore the use of time-series data mining techniques for understanding the variability of tones in a large corpus of Mandarin newscast speech. First, we adapt a graph-based approach to characterize the clusters (fuzzy types) of tone contour shapes observed in each tone n-gram category. Second, we show correlations between these realized contour shape clusters and a bag of automatically extracted linguistic features. We discuss the implications of the current study within the context of phonological and information theory.","pages":"144--153","doi":"10.18653\/v1\/W19-4217","url":"https:\/\/www.aclweb.org\/anthology\/W19-4217","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4218","title":"Convolutional neural networks for low-resource morpheme segmentation: baseline or state-of-the-art?","authors":["Sorokin, Alexey"],"emails":[""],"author_id":["alexey-sorokin"],"abstract":"We apply convolutional neural networks to the task of shallow morpheme segmentation using low-resource datasets for 5 different languages. We show that both in fully supervised and semi-supervised settings our model beats previous state-of-the-art approaches. We argue that convolutional neural networks reflect local nature of morpheme segmentation better than other semi-supervised approaches.","pages":"154--159","doi":"10.18653\/v1\/W19-4218","url":"https:\/\/www.aclweb.org\/anthology\/W19-4218","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4219","title":"What do phone embeddings learn about Phonology?","authors":["Kolachina, Sudheer","Magyar, Lilla"],"emails":["sudheer.kpg08@gmail.com","lillamagyar0929@gmail.com"],"author_id":["sudheer-kolachina","lilla-magyar"],"abstract":"Recent work has looked at evaluation of phone embeddings using sound analogies and correlations between distinctive feature space and embedding space. It has not been clear what aspects of natural language phonology are learnt by neural network inspired distributed representational models such as word2vec. To study the kinds of phonological relationships learnt by phone embeddings, we present artificial phonology experiments that show that phone embeddings learn paradigmatic relationships such as phonemic and allophonic distribution quite well. They are also able to capture co-occurrence restrictions among vowels such as those observed in languages with vowel harmony. However, they are unable to learn co-occurrence restrictions among the class of consonants.","pages":"160--169","doi":"10.18653\/v1\/W19-4219","url":"https:\/\/www.aclweb.org\/anthology\/W19-4219","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4220","title":"Inverting and Modeling Morphological Inflection","authors":["Oseki, Yohei","Sudo, Yasutada","Sakai, Hiromu","Marantz, Alec"],"emails":["oseki@aoni.waseda.jp","y.sudo@ucl.ac.uk","hsakai@waseda.jp","marantz@nyu.edu"],"author_id":["yohei-oseki","yasutada-sudo","hiromu-sakai","alec-marantz"],"abstract":"Previous {``}wug{''} tests (Berko, 1958) on Japanese verbal inflection have demonstrated that Japanese speakers, both adults and children, cannot inflect novel present tense forms to {``}correct{''} past tense forms predicted by rules of existent verbs (de Chene, 1982; Vance, 1987, 1991; Klafehn, 2003, 2013), indicating that Japanese verbs are merely stored in the mental lexicon. However, the implicit assumption that present tense forms are bases for verbal inflection should not be blindly extended to morphologically rich languages like Japanese in which both present and past tense forms are morphologically complex without inherent direction (Albright, 2002). Interestingly, there are also independent observations in the acquisition literature to suggest that past tense forms may be bases for verbal inflection in Japanese (Klafehn, 2003; Murasugi et al., 2010; Hirose, 2017; Tatsumi et al., 2018). In this paper, we computationally simulate two directions of verbal inflection in Japanese, Present → Past and Past → Present, with the rule-based computational model called Minimal Generalization Learner (MGL; Albright and Hayes, 2003) and experimentally evaluate the model with the bidirectional {``}wug{''} test where humans inflect novel verbs in two opposite directions. We conclude that Japanese verbs can be computed online via some generalizations and those generalizations do depend on the direction of morphological inflection.","pages":"170--177","doi":"10.18653\/v1\/W19-4220","url":"https:\/\/www.aclweb.org\/anthology\/W19-4220","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4221","title":"Augmenting a {G}erman Morphological Database by Data-Intense Methods","authors":["Steiner, Petra"],"emails":["petra.steiner@uni-jena.de"],"author_id":["petra-steiner"],"abstract":"This paper deals with the automatic enhancement of a new German morphological database. While there are some databases for flat word segmentation, this is the first available resource which can be directly used for deep parsing of German words. We combine the entries of this morphological database with the morphological tools SMOR and Moremorph and a context-based evaluation method which builds on a large Wikipedia corpus. We describe the state of the art and the essential characteristics of the database and the context method. The approach is tested on an inflight magazine of Lufthansa. We derive over 5,000 new instances of complex words. The coverage for the lemma types reaches up to over 99 percent. The precision of new found complex splits and monomorphemes is between 0.93 and 0.99.","pages":"178--188","doi":"10.18653\/v1\/W19-4221","url":"https:\/\/www.aclweb.org\/anthology\/W19-4221","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4222","title":"Unsupervised Morphological Segmentation for Low-Resource Polysynthetic Languages","authors":["Eskander, Ramy","Klavans, Judith","Muresan, Smaranda"],"emails":["rnd2110@columbia.edu","jklavans@umd.edu","smara@columbia.edu"],"author_id":["ramy-eskander","judith-l-klavans","smaranda-muresan"],"abstract":"Polysynthetic languages pose a challenge for morphological analysis due to the root-morpheme complexity and to the word class {``}squish{''}. In addition, many of these polysynthetic languages are low-resource. We propose unsupervised approaches for morphological segmentation of low-resource polysynthetic languages based on Adaptor Grammars (AG) (Eskander et al., 2016). We experiment with four languages from the Uto-Aztecan family. Our AG-based approaches outperform other unsupervised approaches and show promise when compared to supervised methods, outperforming them on two of the four languages.","pages":"189--195","doi":"10.18653\/v1\/W19-4222","url":"https:\/\/www.aclweb.org\/anthology\/W19-4222","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4223","title":"Weakly deterministic transformations are subregular","authors":["Lamont, Andrew","O{'}Hara, Charlie","Smith, Caitlin"],"emails":["alamont@linguist.umass.edu","charleso@usc.edu","csmit372@jhu.edu"],"author_id":["andrew-lamont","charlie-ohara","caitlin-smith"],"abstract":"Whether phonological transformations in general are subregular is an open question. This is the case for most transformations, which have been shown to be subsequential, but it is not known whether weakly deterministic mappings form a proper subset of the regular functions. This paper demonstrates that there are regular functions that are not weakly deterministic, and, because all attested processes are weakly deterministic, supports the subregular hypothesis.","pages":"196--205","doi":"10.18653\/v1\/W19-4223","url":"https:\/\/www.aclweb.org\/anthology\/W19-4223","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4224","title":"Encoder-decoder models for latent phonological representations of words","authors":["Jacobs, Cassandra L.","Mailhot, Fred"],"emails":["clxjacobs@ucdavis.edu","fred.mailhot@autodesk.com"],"author_id":["cassandra-l-jacobs","fred-mailhot"],"abstract":"We use sequence-to-sequence networks trained on sequential phonetic encoding tasks to construct compositional phonological representations of words. We show that the output of an encoder network can predict the phonetic durations of American English words better than a number of alternative forms. We also show that the model{'}s learned representations map onto existing measures of words{'} phonological structure (phonological neighborhood density and phonotactic probability).","pages":"206--217","doi":"10.18653\/v1\/W19-4224","url":"https:\/\/www.aclweb.org\/anthology\/W19-4224","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4225","title":"Action-Sensitive Phonological Dependencies","authors":["Hao, Yiding","Bowers, Dustin"],"emails":["yiding.hao@yale.edu","bowersd@email.arizona.edu"],"author_id":["yiding-hao","dustin-bowers"],"abstract":"This paper defines a subregular class of functions called the tier-based synchronized strictly local (TSSL) functions. These functions are similar to the the tier-based input-output strictly local (TIOSL) functions, except that the locality condition is enforced not on the input and output streams, but on the computation history of the minimal subsequential finite-state transducer. We show that TSSL functions naturally describe rhythmic syncope while TIOSL functions cannot, and we argue that TSSL functions provide a more restricted characterization of rhythmic syncope than existing treatments within Optimality Theory.","pages":"218--228","doi":"10.18653\/v1\/W19-4225","url":"https:\/\/www.aclweb.org\/anthology\/W19-4225","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"},{"id":"W19-4226","title":"The {SIGMORPHON} 2019 Shared Task: Morphological Analysis in Context and Cross-Lingual Transfer for Inflection","authors":["McCarthy, Arya D.","Vylomova, Ekaterina","Wu, Shijie","Malaviya, Chaitanya","Wolf-Sonkin, Lawrence","Nicolai, Garrett","Kirov, Christo","Silfverberg, Miikka","Mielke, Sebastian J.","Heinz, Jeffrey","Cotterell, Ryan","Hulden, Mans"],"emails":["","","","","","","","","","","",""],"author_id":["arya-d-mccarthy","ekaterina-vylomova","shijie-wu","chaitanya-malaviya","lawrence-wolf-sonkin","garrett-nicolai","christo-kirov","miikka-silfverberg","sebastian-j-mielke","jeffrey-heinz","ryan-cotterell","mans-hulden"],"abstract":"The SIGMORPHON 2019 shared task on cross-lingual transfer and contextual analysis in morphology examined transfer learning of inflection between 100 language pairs, as well as contextual lemmatization and morphosyntactic description in 66 languages. The first task evolves past years{'} inflection tasks by examining transfer of morphological inflection knowledge from a high-resource language to a low-resource language. This year also presents a new second challenge on lemmatization and morphological feature analysis in context. All submissions featured a neural component and built on either this year{'}s strong baselines or highly ranked systems from previous years{'} shared tasks. Every participating team improved in accuracy over the baselines for the inflection task (though not Levenshtein distance), and every team in the contextual analysis task improved on both state-of-the-art neural and non-neural baselines.","pages":"229--244","doi":"10.18653\/v1\/W19-4226","url":"https:\/\/www.aclweb.org\/anthology\/W19-4226","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the 16th Workshop on Computational Research in Phonetics, Phonology, and Morphology"}]