[{"id":"W19-2601","title":"Distantly Supervised Biomedical Knowledge Acquisition via Knowledge Graph Based Attention","authors":["Dai, Qin","Inoue, Naoya","Reisert, Paul","Takahashi, Ryo","Inui, Kentaro"],"emails":["daiqin@ecei.tohoku.ac.jp","naoya-i@ecei.tohoku.ac.jp","preisert@ecei.tohoku.ac.jp","ryo.t@ecei.tohoku.ac.jp","inui@ecei.tohoku.ac.jp"],"author_id":["qin-dai","naoya-inoue","paul-reisert","ryo-takahashi","kentaro-inui"],"abstract":"The increased demand for structured scientific knowledge has attracted considerable attention in extracting scientific relation from the ever growing scientific publications. Distant supervision is widely applied approach to automatically generate large amounts of labelled data with low manual annotation cost. However, distant supervision inevitably accompanies the wrong labelling problem, which will negatively affect the performance of Relation Extraction (RE). To address this issue, (Han et al., 2018) proposes a novel framework for jointly training both RE model and Knowledge Graph Completion (KGC) model to extract structured knowledge from non-scientific dataset. In this work, we firstly investigate the feasibility of this framework on scientific dataset, specifically on biomedical dataset. Secondly, to achieve better performance on the biomedical dataset, we extend the framework with other competitive KGC models. Moreover, we proposed a new end-to-end KGC model to extend the framework. Experimental results not only show the feasibility of the framework on the biomedical dataset, but also indicate the effectiveness of our extensions, because our extended model achieves significant and consistent improvements on distant supervised RE as compared with baselines.","pages":"1--10","doi":"10.18653\/v1\/W19-2601","url":"https:\/\/www.aclweb.org\/anthology\/W19-2601","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2602","title":"Scalable, Semi-Supervised Extraction of Structured Information from Scientific Literature","authors":["Agrawal, Kritika","Mittal, Aakash","Pudi, Vikram"],"emails":["","",""],"author_id":["kritika-agrawal","aakash-mittal","vikram-pudi"],"abstract":"As scientific communities grow and evolve, there is a high demand for improved methods for finding relevant papers, comparing papers on similar topics and studying trends in the research community. All these tasks involve the common problem of extracting structured information from scientific articles. In this paper, we propose a novel, scalable, semi-supervised method for extracting relevant structured information from the vast available raw scientific literature. We extract the fundamental concepts of {``}aim{''}, {''}method{''} and {``}result{''} from scientific articles and use them to construct a knowledge graph. Our algorithm makes use of domain-based word embedding and the bootstrap framework. Our experiments show that our system achieves precision and recall comparable to the state of the art. We also show the domain independence of our algorithm by analyzing the research trends of two distinct communities - computational linguistics and computer vision.","pages":"11--20","doi":"10.18653\/v1\/W19-2602","url":"https:\/\/www.aclweb.org\/anthology\/W19-2602","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2603","title":"Understanding the Polarity of Events in the Biomedical Literature: Deep Learning vs. Linguistically-informed Methods","authors":["Noriega-Atala, Enrique","Liang, Zhengzhong","Bachman, John","Morrison, Clayton","Surdeanu, Mihai"],"emails":["enoriega@email.arizona.edu","zhengzhongliang@email.arizona.edu","bachman@hms.harvard.edu","claytonm@email.arizona.edu","msurdeanu@email.arizona.edu"],"author_id":["enrique-noriega-atala","zhengzhong-liang","john-bachman","clayton-morrison","mihai-surdeanu"],"abstract":"An important task in the machine reading of biochemical events expressed in biomedical texts is correctly reading the polarity, i.e., attributing whether the biochemical event is a promotion or an inhibition. Here we present a novel dataset for studying polarity attribution accuracy. We use this dataset to train and evaluate several deep learning models for polarity identification, and compare these to a linguistically-informed model. The best performing deep learning architecture achieves 0.968 average F1 performance in a five-fold cross-validation study, a considerable improvement over the linguistically informed model average F1 of 0.862.","pages":"21--30","doi":"10.18653\/v1\/W19-2603","url":"https:\/\/www.aclweb.org\/anthology\/W19-2603","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2604","title":"Dataset Mention Extraction and Classification","authors":["Prasad, Animesh","Si, Chenglei","Kan, Min-Yen"],"emails":["animesh@comp.nus.edu.sg","","kanmy@comp.nus.edu.sg"],"author_id":["animesh-prasad","chenglei-si","min-yen-kan"],"abstract":"Datasets are integral artifacts of empirical scientific research. However, due to natural language variation, their recognition can be difficult and even when identified, can often be inconsistently referred across and within publications. We report our approach to the Coleridge Initiative{'}s Rich Context Competition, which tasks participants with identifying dataset surface forms (dataset mention extraction) and associating the extracted mention to its referred dataset (dataset classification). In this work, we propose various neural baselines and evaluate these model on one-plus and zero-shot classification scenarios. We further explore various joint learning approaches - exploring the synergy between the tasks - and report the issues with such techniques.","pages":"31--36","doi":"10.18653\/v1\/W19-2604","url":"https:\/\/www.aclweb.org\/anthology\/W19-2604","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2605","title":"Annotating with Pros and Cons of Technologies in Computer Science Papers","authors":["Shirai, Hono","Inoue, Naoya","Suzuki, Jun","Inui, Kentaro"],"emails":["h.shirai@ecei.tohoku.ac.jp","naoya-i@ecei.tohoku.ac.jp","jun.suzuki@ecei.tohoku.ac.jp","inui@ecei.tohoku.ac.jp"],"author_id":["hono-shirai","naoya-inoue","jun-suzuki","kentaro-inui"],"abstract":"This paper explores a task for extracting a technological expression and its pros\/cons from computer science papers. We report ongoing efforts on an annotated corpus of pros\/cons and an analysis of the nature of the automatic extraction task. Specifically, we show how to adapt the targeted sentiment analysis task for pros\/cons extraction in computer science papers and conduct an annotation study. In order to identify the challenges of the automatic extraction task, we construct a strong baseline model and conduct an error analysis. The experiments show that pros\/cons can be consistently annotated by several annotators, and that the task is challenging due to domain-specific knowledge. The annotated dataset is made publicly available for research purposes.","pages":"37--42","doi":"10.18653\/v1\/W19-2605","url":"https:\/\/www.aclweb.org\/anthology\/W19-2605","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2606","title":"Browsing Health: Information Extraction to Support New Interfaces for Accessing Medical Evidence","authors":["Parikh, Soham","Conrad, Elizabeth","Agarwal, Oshin","Marshall, Iain","Wallace, Byron","Nenkova, Ani"],"emails":["sohamp@seas.upenn.edu","ecconrad1@crimson.ua.edu","oagarwal@seas.upenn.edu","iain.marshall@kcl.ac.uk","b.wallace@northeastern.edu","nenkova@seas.upenn.edu"],"author_id":["soham-parikh","elizabeth-conrad","oshin-agarwal","iain-marshall","byron-c-wallace","ani-nenkova"],"abstract":"Standard paradigms for search do not work well in the medical context. Typical information needs, such as retrieving a full list of medical interventions for a given condition, or finding the reported efficacy of a particular treatment with respect to a specific outcome of interest cannot be straightforwardly posed in typical text-box search. Instead, we propose faceted-search in which a user specifies a condition and then can browse treatments and outcomes that have been evaluated. Choosing from these, they can access randomized control trials (RCTs) describing individual studies. Realizing such a view of the medical evidence requires information extraction techniques to identify the population, interventions, and outcome measures in an RCT. Patients, health practitioners, and biomedical librarians all stand to benefit from such innovation in search of medical evidence. We present an initial prototype of such an interface applied to pre-registered clinical studies. We also discuss pilot studies into the applicability of information extraction methods to allow for similar access to all published trial results.","pages":"43--47","doi":"10.18653\/v1\/W19-2606","url":"https:\/\/www.aclweb.org\/anthology\/W19-2606","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2607","title":"An Analysis of Deep Contextual Word Embeddings and Neural Architectures for Toponym Mention Detection in Scientific Publications","authors":["Magnusson, Matthew","Dietz, Laura"],"emails":["mfm2@cs.unh.edu","dietz@cs.unh.edu"],"author_id":["matthew-magnusson","laura-dietz"],"abstract":"Toponym detection in scientific papers is an open task and a key first step in place entity enrichment of documents. We examine three common neural architectures in NLP: 1) convolutional neural network, 2) multi-layer perceptron (both applied in a sliding window context) and 3) bidirectional LSTM and apply contextual and non-contextual word embedding layers to these models. We find that deep contextual word embeddings improve the performance of the bi-LSTM with CRF neural architecture achieving the best performance when multiple layers of deep contextual embeddings are concatenated. Our best performing model achieves an average F1 of 0.910 when evaluated on overlap macro exceeding previous state-of-the-art models in the toponym detection task.","pages":"48--56","doi":"10.18653\/v1\/W19-2607","url":"https:\/\/www.aclweb.org\/anthology\/W19-2607","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2608","title":"{STAC}: Science Toolkit Based on {C}hinese Idiom Knowledge Graph","authors":["Wang, Meiling","Xiao, Min","Li, Changliang","Guo, Yu","Zhao, Zhixin","Liu, Xiaonan"],"emails":["wangmeiling1@kingsoft.com","liuxiaonan1@kingsoft.com","lichangliang@kingsoft.com","guoyu9@kingsoft.com","zhaozhixin@kingsoft.com","xiaomincloud@gmail.com"],"author_id":["meiling-wang","min-xiao","changliang-li","yu-guo","zhixin-zhao","xiaonan-liu"],"abstract":"Chinese idioms (Cheng Yu) have seen five thousand years{'} history and culture of China, meanwhile they contain large number of scientific achievement of ancient China. However, existing Chinese online idiom dictionaries have limited function for scientific exploration. In this paper, we first construct a Chinese idiom knowledge graph by extracting domains and dynasties and associating them with idioms, and based on the idiom knowledge graph, we propose a Science Toolkit for Ancient China (STAC) aiming to support scientific exploration. In the STAC toolkit, idiom navigator helps users explore overall scientific progress from idiom perspective with visualization tools, and idiom card and idiom QA shorten action path and avoid thinking being interrupted while users are reading and writing. The current STAC toolkit is deployed at http:\/\/120.92.208.22:7476\/demo\/{\\#}\/stac.","pages":"57--61","doi":"10.18653\/v1\/W19-2608","url":"https:\/\/www.aclweb.org\/anthology\/W19-2608","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2609","title":"Playing by the Book: An Interactive Game Approach for Action Graph Extraction from Text","authors":["Tamari, Ronen","Shindo, Hiroyuki","Shahaf, Dafna","Matsumoto, Yuji"],"emails":["ronent@cs.huji.ac.il","shindo@is.naist.jp","dshahaf@cs.huji.ac.il","matsu@is.naist.jp"],"author_id":["ronen-tamari","hiroyuki-shindo","dafna-shahaf","yuji-matsumoto"],"abstract":"Understanding procedural text requires tracking entities, actions and effects as the narrative unfolds. We focus on the challenging real-world problem of action-graph extraction from materials science papers, where language is highly specialized and data annotation is expensive and scarce. We propose a novel approach, Text2Quest, where procedural text is interpreted as instructions for an interactive game. A learning agent completes the game by executing the procedure correctly in a text-based simulated lab environment. The framework can complement existing approaches and enables richer forms of learning compared to static texts. We discuss potential limitations and advantages of the approach, and release a prototype proof-of-concept, hoping to encourage research in this direction.","pages":"62--71","doi":"10.18653\/v1\/W19-2609","url":"https:\/\/www.aclweb.org\/anthology\/W19-2609","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"},{"id":"W19-2610","title":"Textual and Visual Characteristics of Mathematical Expressions in Scholar Documents","authors":["Daudaravicius, Vidas"],"emails":["vidas.daudaravicius@vtex.lt"],"author_id":["vidas-daudaravicius"],"abstract":"Mathematical expressions (ME) are widely used in scholar documents. In this paper we analyze characteristics of textual and visual MEs characteristics for the image-to-LaTeX translation task. While there are open data-sets of LaTeX files with MEs included it is very complicated to extract these MEs from a document and to compile the list of MEs. Therefore we release a corpus of open-access scholar documents with PDF and JATS-XML parallel files. The MEs in these documents are LaTeX encoded and are document independent. The data contains more than 1.2 million distinct annotated formulae and more than 80 million raw tokens of LaTeX MEs in more than 8 thousand documents. While the variety of textual lengths and visual sizes of MEs are not well defined we found that the task of analyzing MEs in scholar documents can be reduced to the subtask of a particular text length, image width and height bounds, and display MEs can be processed as arrays of partial MEs.","pages":"72--81","doi":"10.18653\/v1\/W19-2610","url":"https:\/\/www.aclweb.org\/anthology\/W19-2610","publisher":"Association for Computational Linguistics","address":"Minneapolis, Minnesota","year":"2019","month":"June","booktitle":"Proceedings of the Workshop on Extracting Structured Knowledge from Scientific Publications"}]