[{"id":"W19-3201","title":"Extracting Kinship from Obituary to Enhance Electronic Health Records for Genetic Research","authors":["He, Kai","Wu, Jialun","Ma, Xiaoyong","Zhang, Chong","Huang, Ming","Li, Chen","Yao, Lixia"],"emails":["","","","","","",""],"author_id":["kai-he","jialun-wu","xiaoyong-ma","chong-zhang","ming-huang","chen-li","lixia-yao"],"abstract":"Claims database and electronic health records database do not usually capture kinship or family relationship information, which is imperative for genetic research. We identify online obituaries as a new data source and propose a special named entity recognition and relation extraction solution to extract names and kinships from online obituaries. Built on 1,809 annotated obituaries and a novel tagging scheme, our joint neural model achieved macro-averaged precision, recall and F measure of 72.69{\\%}, 78.54{\\%} and 74.93{\\%}, and micro-averaged precision, recall and F measure of 95.74{\\%}, 98.25{\\%} and 96.98{\\%} using 57 kinships with 10 or more examples in a 10-fold cross-validation experiment. The model performance improved dramatically when trained with 34 kinships with 50 or more examples. Leveraging additional information such as age, death date, birth date and residence mentioned by obituaries, we foresee a promising future of supplementing EHR databases with comprehensive and accurate kinship information for genetic research.","pages":"1--10","doi":"10.18653\/v1\/W19-3201","url":"https:\/\/www.aclweb.org\/anthology\/W19-3201","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3202","title":"Lexical Normalization of User-Generated Medical Text","authors":["Dirkson, Anne","Verberne, Suzan","Kraaij, Wessel"],"emails":["a.r.dirkson@liacs.leidenuniv.nl","s.verberne@liacs.leidenuniv.nl","w.kraaij@liacs.leidenuniv.nl"],"author_id":["anne-dirkson","suzan-verberne","wessel-kraaij"],"abstract":"In the medical domain, user-generated social media text is increasingly used as a valuable complementary knowledge source to scientific medical literature. The extraction of this knowledge is complicated by colloquial language use and misspellings. Yet, lexical normalization of such data has not been addressed properly. This paper presents an unsupervised, data-driven spelling correction module for medical social media. Our method outperforms state-of-the-art spelling correction and can detect mistakes with an F0.5 of 0.888. Additionally, we present a novel corpus for spelling mistake detection and correction on a medical patient forum.","pages":"11--20","doi":"10.18653\/v1\/W19-3202","url":"https:\/\/www.aclweb.org\/anthology\/W19-3202","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3203","title":"Overview of the Fourth Social Media Mining for Health ({SMM}4{H}) Shared Tasks at {ACL} 2019","authors":["Weissenbacher, Davy","Sarker, Abeed","Magge, Arjun","Daughton, Ashlynn","O{'}Connor, Karen","Paul, Michael J.","Gonzalez-Hernandez, Graciela"],"emails":["dweissen@pennmedicine.upenn.edu","abeed@pennmedicine.upenn.edu","amaggera@asu.edu","ashlynn.daughton@colorado.edu","","mpaul@colorado.edu","gragon@pennmedicine.upenn.edu"],"author_id":["davy-weissenbacher","abeed-sarker","arjun-magge","ashlynn-daughton","karen-oconnor","michael-paul","graciela-gonzalez"],"abstract":"The number of users of social media continues to grow, with nearly half of adults worldwide and two-thirds of all American adults using social networking. Advances in automated data processing, machine learning and NLP present the possibility of utilizing this massive data source for biomedical and public health applications, if researchers address the methodological challenges unique to this media. We present the Social Media Mining for Health Shared Tasks collocated with the ACL at Florence in 2019, which address these challenges for health monitoring and surveillance, utilizing state of the art techniques for processing noisy, real-world, and substantially creative language expressions from social media users. For the fourth execution of this challenge, we proposed four different tasks. Task 1 asked participants to distinguish tweets reporting an adverse drug reaction (ADR) from those that do not. Task 2, a follow-up to Task 1, asked participants to identify the span of text in tweets reporting ADRs. Task 3 is an end-to-end task where the goal was to first detect tweets mentioning an ADR and then map the extracted colloquial mentions of ADRs in the tweets to their corresponding standard concept IDs in the MedDRA vocabulary. Finally, Task 4 asked participants to classify whether a tweet contains a personal mention of one{'}s health, a more general discussion of the health issue, or is an unrelated mention. A total of 34 teams from around the world registered and 19 teams from 12 countries submitted a system run. We summarize here the corpora for this challenge which are freely available at https:\/\/competitions.codalab.org\/competitions\/22521, and present an overview of the methods and the results of the competing systems.","pages":"21--30","doi":"10.18653\/v1\/W19-3203","url":"https:\/\/www.aclweb.org\/anthology\/W19-3203","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3204","title":"{M}ed{N}orm: A Corpus and Embeddings for Cross-terminology Medical Concept Normalisation","authors":["Belousov, Maksim","Dixon, William G.","Nenadic, Goran"],"emails":["maksim.belousov@manchester.ac.uk","will.dixon@manchester.ac.uk","g.nenadic@manchester.ac.uk"],"author_id":["maksim-belousov","william-g-dixon","goran-nenadic"],"abstract":"The medical concept normalisation task aims to map textual descriptions to standard terminologies such as SNOMED-CT or MedDRA. Existing publicly available datasets annotated using different terminologies cannot be simply merged and utilised, and therefore become less valuable when developing machine learning-based concept normalisation systems. To address that, we designed a data harmonisation pipeline and engineered a corpus of 27,979 textual descriptions simultaneously mapped to both MedDRA and SNOMED-CT, sourced from five publicly available datasets across biomedical and social media domains. The pipeline can be used in the future to integrate new datasets into the corpus and also could be applied in relevant data curation tasks. We also described a method to merge different terminologies into a single concept graph preserving their relations and demonstrated that representation learning approach based on random walks on a graph can efficiently encode both hierarchical and equivalent relations and capture semantic similarities not only between concepts inside a given terminology but also between concepts from different terminologies. We believe that making a corpus and embeddings for cross-terminology medical concept normalisation available to the research community would contribute to a better understanding of the task.","pages":"31--39","doi":"10.18653\/v1\/W19-3204","url":"https:\/\/www.aclweb.org\/anthology\/W19-3204","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3205","title":"Passive Diagnosis Incorporating the {PHQ}-4 for Depression and Anxiety","authors":["Delahunty, Fionn","Johansson, Robert","Arcan, Mihael"],"emails":["","ohansson@liu.se",""],"author_id":["fionn-delahunty","robert-johansson","mihael-arcan"],"abstract":"Depression and anxiety are the two most prevalent mental health disorders worldwide, impacting the lives of millions of people each year. In this work, we develop and evaluate a multilabel, multidimensional deep neural network designed to predict PHQ-4 scores based on individuals written text. Our system outperforms random baseline metrics and provides a novel approach to how we can predict psychometric scores from written text. Additionally, we explore how this architecture can be applied to analyse social media data.","pages":"40--46","doi":"10.18653\/v1\/W19-3205","url":"https:\/\/www.aclweb.org\/anthology\/W19-3205","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3206","title":"{HITSZ}-{ICRC}: A Report for {SMM}4{H} Shared Task 2019-Automatic Classification and Extraction of Adverse Effect Mentions in Tweets","authors":["Chen, Shuai","Huang, Yuanhang","Huang, Xiaowei","Qin, Haoming","Yan, Jun","Tang, Buzhou"],"emails":["","","","","",""],"author_id":["shuai-chen","yuanhang-huang","xiaowei-huang","haoming-qin","jun-yan","buzhou-tang"],"abstract":"This is the system description of the Harbin Institute of Technology Shenzhen (HITSZ) team for the first and second subtasks of the fourth Social Media Mining for Health Applications (SMM4H) shared task in 2019. The two subtasks are automatic classification and extraction of adverse effect mentions in tweets. The systems for the two subtasks are based on bidirectional encoder representations from transformers (BERT), and achieves promising results. Among the systems we developed for subtask1, the best F1-score was 0.6457, for subtask2, the best relaxed F1-score and the best strict F1-score were 0.614 and 0.407 respectively. Our system ranks first among all systems on subtask1.","pages":"47--51","doi":"10.18653\/v1\/W19-3206","url":"https:\/\/www.aclweb.org\/anthology\/W19-3206","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3207","title":"{KFU} {NLP} Team at {SMM}4{H} 2019 Tasks: Want to Extract Adverse Drugs Reactions from Tweets? {BERT} to The Rescue","authors":["Miftahutdinov, Zulfat","Alimova, Ilseyar","Tutubalina, Elena"],"emails":["zulfatmi@gmail.com","limova@kpfu.ru","elvtutubalina@kpfu.ru"],"author_id":["zulfat-miftahutdinov","ilseyar-alimova","elena-tutubalina"],"abstract":"This paper describes a system developed for the Social Media Mining for Health (SMM4H) 2019 shared tasks. Specifically, we participated in three tasks. The goals of the first two tasks are to classify whether a tweet contains mentions of adverse drug reactions (ADR) and extract these mentions, respectively. The objective of the third task is to build an end-to-end solution: first, detect ADR mentions and then map these entities to concepts in a controlled vocabulary. We investigate the use of a language representation model BERT trained to obtain semantic representations of social media texts. Our experiments on a dataset of user reviews showed that BERT is superior to state-of-the-art models based on recurrent neural networks. The BERT-based system for Task 1 obtained an F1 of 57.38{\\%}, with improvements up to +7.19{\\%} F1 over a score averaged across all 43 submissions. The ensemble of neural networks with a voting scheme for named entity recognition ranked first among 9 teams at the SMM4H 2019 Task 2 and obtained a relaxed F1 of 65.8{\\%}. The end-to-end model based on BERT for ADR normalization ranked first at the SMM4H 2019 Task 3 and obtained a relaxed F1 of 43.2{\\%}.","pages":"52--57","doi":"10.18653\/v1\/W19-3207","url":"https:\/\/www.aclweb.org\/anthology\/W19-3207","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3208","title":"Approaching {SMM}4{H} with Merged Models and Multi-task Learning","authors":["Ellendorff, Tilia","Furrer, Lenz","Colic, Nicola","Aepli, No{\\\"e}mi","Rinaldi, Fabio"],"emails":["tilia.ellendorff@uzh.ch","lenz.furrer@uzh.ch","nicola.colic@uzh.ch","no{\\\"e}mi.aepli@uzh.ch","fabio.rinaldi@uzh.ch"],"author_id":["tilia-ellendorff","lenz-furrer","nicola-colic","noemi-aepli","fabio-rinaldi"],"abstract":"We describe our submissions to the 4th edi- tion of the Social Media Mining for Health Applications (SMM4H) shared task. Our team (UZH) participated in two sub-tasks: Automatic classifications of adverse effects mentions in tweets (Task 1) and Generaliz- able identification of personal health expe- rience mentions (Task 4). For our submis- sions, we exploited ensembles based on a pre- trained language representation with a neu- ral transformer architecture (BERT) (Tasks 1 and 4) and a CNN-BiLSTM(-CRF) network within a multi-task learning scenario (Task 1). These systems are placed on top of a carefully crafted pipeline of domain-specific pre- processing steps.","pages":"58--61","doi":"10.18653\/v1\/W19-3208","url":"https:\/\/www.aclweb.org\/anthology\/W19-3208","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3209","title":"Identifying Adverse Drug Events Mentions in Tweets Using Attentive, Collocated, and Aggregated Medical Representation","authors":["Zhao, Xinyan","Yu, Deahan","Vydiswaran, V.G.Vinod"],"emails":["zhaoxy@umich.edu","deahanyu@umich.edu","vgvinodv@umich.edu"],"author_id":["xinyan-zhao","deahan-yu","v-g-vinod-vydiswaran"],"abstract":"Identifying mentions of medical concepts in social media is challenging because of high variability in free text. In this paper, we propose a novel neural network architecture, the Collocated LSTM with Attentive Pooling and Aggregated representation (CLAPA), that integrates a bidirectional LSTM model with attention and pooling strategy and utilizes the collocation information from training data to improve the representation of medical concepts. The collocation and aggregation layers improve the model performance on the task of identifying mentions of adverse drug events (ADE) in tweets. Using the dataset made available as part of the workshop shared task, we show that careful selection of neighborhood contexts can help uncover useful local information and improve the overall medical concept representation.","pages":"62--70","doi":"10.18653\/v1\/W19-3209","url":"https:\/\/www.aclweb.org\/anthology\/W19-3209","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3210","title":"Correlating Twitter Language with Community-Level Health Outcomes","authors":["Schneuwly, Arno","Grubenmann, Ralf","Rion Logean, S{\\'e}verine","Cieliebak, Mark","Jaggi, Martin"],"emails":["arno.schneuwly@epfl.ch","rg@spinningbytes.com","rion@swissre.com","ciel@zhaw.ch","martin.jaggi@epfl.ch"],"author_id":["arno-schneuwly","ralf-grubenmann","severine-rion-logean","mark-cieliebak","martin-jaggi"],"abstract":"We study how language on social media is linked to mortal diseases such as atherosclerotic heart disease (AHD), diabetes and various types of cancer. Our proposed model leverages state-of-the-art sentence embeddings, followed by a regression model and clustering, without the need of additional labelled data. It allows to predict community-level medical outcomes from language, and thereby potentially translate these to the individual level. The method is applicable to a wide range of target variables and allows us to discover known and potentially novel correlations of medical outcomes with life-style aspects and other socioeconomic risk factors.","pages":"71--78","doi":"10.18653\/v1\/W19-3210","url":"https:\/\/www.aclweb.org\/anthology\/W19-3210","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3211","title":"Affective Behaviour Analysis of On-line User Interactions: Are On-line Support Groups More Therapeutic than Twitter?","authors":["Tortoreto, Giuliano","Stepanov, Evgeny","Cervone, Alessandra","Dubiel, Mateusz","Riccardi, Giuseppe"],"emails":["giuliano.tortoreto@strath.ac.uk","evgeny.stepanov@strath.ac.uk","alessandra.cervone@strath.ac.uk","mateusz.dubiel@strath.ac.uk","giuseppe.riccardi@strath.ac.uk"],"author_id":["giuliano-tortoreto","evgeny-stepanov","alessandra-cervone","mateusz-dubiel","giuseppe-riccardi"],"abstract":"The increase in the prevalence of mental health problems has coincided with a growing popularity of health related social networking sites. Regardless of their therapeutic potential, on-line support groups (OSGs) can also have negative effects on patients. In this work we propose a novel methodology to automatically verify the presence of therapeutic factors in social networking websites by using Natural Language Processing (NLP) techniques. The methodology is evaluated on on-line asynchronous multi-party conversations collected from an OSG and Twitter. The results of the analysis indicate that therapeutic factors occur more frequently in OSG conversations than in Twitter conversations. Moreover, the analysis of OSG conversations reveals that the users of that platform are supportive, and interactions are likely to lead to the improvement of their emotional state. We believe that our method provides a stepping stone towards automatic analysis of emotional states of users of online platforms. Possible applications of the method include provision of guidelines that highlight potential implications of using such platforms on users{'} mental health, and\/or support in the analysis of their impact on specific individuals.","pages":"79--88","doi":"10.18653\/v1\/W19-3211","url":"https:\/\/www.aclweb.org\/anthology\/W19-3211","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3212","title":"Transfer Learning for Health-related Twitter Data","authors":["Dirkson, Anne","Verberne, Suzan"],"emails":["a.r.dirkson@liacs.leidenuniv.nl","s.verberne@liacs.leidenuniv.nl"],"author_id":["anne-dirkson","suzan-verberne"],"abstract":"Transfer learning is promising for many NLP applications, especially in tasks with limited labeled data. This paper describes the methods developed by team TMRLeiden for the 2019 Social Media Mining for Health Applications (SMM4H) Shared Task. Our methods use state-of-the-art transfer learning methods to classify, extract and normalise adverse drug effects (ADRs) and to classify personal health mentions from health-related tweets. The code and fine-tuned models are publicly available.","pages":"89--92","doi":"10.18653\/v1\/W19-3212","url":"https:\/\/www.aclweb.org\/anthology\/W19-3212","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3213","title":"{NLP}@{UNED} at {SMM}4{H} 2019: Neural Networks Applied to Automatic Classifications of Adverse Effects Mentions in Tweets","authors":["Cortes-Tejada, Javier","Martinez-Romo, Juan","Araujo, Lourdes"],"emails":["jcortes@lsi.uned.es","juaner@lsi.uned.es","lurdes@lsi.uned.es"],"author_id":["javier-cortes-tejada","juan-martinez-romo","lourdes-araujo"],"abstract":"This paper describes a system for automatically classifying adverse effects mentions in tweets developed for the task 1 at Social Media Mining for Health Applications (SMM4H) Shared Task 2019. We have developed a system based on LSTM neural networks inspired by the excellent results obtained by deep learning classifiers in the last edition of this task. The network is trained along with Twitter GloVe pre-trained word embeddings.","pages":"93--95","doi":"10.18653\/v1\/W19-3213","url":"https:\/\/www.aclweb.org\/anthology\/W19-3213","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3214","title":"Detecting and Extracting of Adverse Drug Reaction Mentioning Tweets with Multi-Head Self Attention","authors":["Ge, Suyu","Qi, Tao","Wu, Chuhan","Huang, Yongfeng"],"emails":["gesy17@mails.tsinghua.edu.cn","qit16@mails.tsinghua.edu.cn","wuch15@mails.tsinghua.edu.cn","yfhuang@mails.tsinghua.edu.cn"],"author_id":["suyu-ge","tao-qi","chuhan-wu","yongfeng-huang"],"abstract":"This paper describes our system for the first and second shared tasks of the fourth Social Media Mining for Health Applications (SMM4H) workshop. We enhance tweet representation with a language model and distinguish the importance of different words with Multi-Head Self-Attention. In addition, transfer learning is exploited to make up for the data shortage. Our system achieved competitive results on both tasks with an F1-score of 0.5718 for task 1 and 0.653 (overlap) \/ 0.357 (strict) for task 2.","pages":"96--98","doi":"10.18653\/v1\/W19-3214","url":"https:\/\/www.aclweb.org\/anthology\/W19-3214","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3215","title":"Deep Learning for Identification of Adverse Effect Mentions In Twitter Data","authors":["Barry, Paul","Uzuner, Ozlem"],"emails":["pbarry2@gmu.edu","ouzuner@gmu.edu"],"author_id":["paul-barry","ozlem-uzuner"],"abstract":"Social Media Mining for Health Applications (SMM4H) Adverse Effect Mentions Shared Task challenges participants to accurately identify spans of text within a tweet that correspond to Adverse Effects (AEs) resulting from medication usage (Weissenbacher et al., 2019). This task features a training data set of 2,367 tweets, in addition to a 1,000 tweet evaluation data set. The solution presented here features a bidirectional Long Short-term Memory Network (bi-LSTM) for the generation of character-level embeddings. It uses a second bi-LSTM trained on both character and token level embeddings to feed a Conditional Random Field (CRF) which provides the final classification. This paper further discusses the deep learning algorithms used in our solution.","pages":"99--101","doi":"10.18653\/v1\/W19-3215","url":"https:\/\/www.aclweb.org\/anthology\/W19-3215","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3216","title":"Using Machine Learning and Deep Learning Methods to Find Mentions of Adverse Drug Reactions in Social Media","authors":["L{\\'o}pez {\\'U}beda, Pilar","D{\\'\\i}az Galiano, Manuel Carlos","Martin, Maite","Urena Lopez, L. Alfonso"],"emails":["plubeda@ujaen.es","mcdiaz@ujaen.es","maite@ujaen.es","laurena@ujaen.es"],"author_id":["pilar-lopez-ubeda","manuel-carlos-diaz-galiano1","m-teresa-martin-valdivia","l-alfonso-urena-lopez"],"abstract":"Over time the use of social networks is becoming very popular platforms for sharing health related information. Social Media Mining for Health Applications (SMM4H) provides tasks such as those described in this document to help manage information in the health domain. This document shows the first participation of the SINAI group. We study approaches based on machine learning and deep learning to extract adverse drug reaction mentions from Twitter. The results obtained in the tasks are encouraging, we are close to the average of all participants and even above in some cases.","pages":"102--106","doi":"10.18653\/v1\/W19-3216","url":"https:\/\/www.aclweb.org\/anthology\/W19-3216","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3217","title":"Towards Text Processing Pipelines to Identify Adverse Drug Events-related Tweets: University of Michigan @ {SMM}4{H} 2019 Task 1","authors":["Vydiswaran, V.G.Vinod","Ganzel, Grace","Romas, Bryan","Yu, Deahan","Austin, Amy","Bhomia, Neha","Chan, Socheatha","Hall, Stephanie","Le, Van","Miller, Aaron","Oduyebo, Olawunmi","Song, Aulia","Sondhi, Radhika","Teng, Danny","Tseng, Hao","Vuong, Kim","Zimmerman, Stephanie"],"emails":["vgvinodv@umich.edu","","","","","","","","","","","","","","","",""],"author_id":["v-g-vinod-vydiswaran","grace-ganzel","bryan-romas","deahan-yu","amy-austin","neha-bhomia","socheatha-chan","stephanie-hall","van-le","aaron-miller","olawunmi-oduyebo","aulia-song","radhika-sondhi","danny-teng","hao-tseng","kim-vuong","stephanie-zimmerman"],"abstract":"We participated in Task 1 of the Social Media Mining for Health Applications (SMM4H) 2019 Shared Tasks on detecting mentions of adverse drug events (ADEs) in tweets. Our approach relied on a text processing pipeline for tweets, and training traditional machine learning and deep learning models. Our submitted runs performed above average for the task.","pages":"107--109","doi":"10.18653\/v1\/W19-3217","url":"https:\/\/www.aclweb.org\/anthology\/W19-3217","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3218","title":"Neural Network to Identify Personal Health Experience Mention in Tweets Using {B}io{BERT} Embeddings","authors":["Gondane, Shubham"],"emails":["sgondane@asu.edu"],"author_id":["shubham-gondane"],"abstract":"This paper describes the system developed by team ASU-NLP for the Social Media Mining for Health Applications(SMM4H) shared task 4. We extract feature embeddings from the BioBERT (Lee et al., 2019) model which has been fine-tuned on the training dataset and use that as inputs to a dense fully connected neural network. We achieve above average scores among the participant systems with the overall F1-score, accuracy, precision, recall as 0.8036, 0.8456, 0.9783, 0.6818 respectively.","pages":"110--113","doi":"10.18653\/v1\/W19-3218","url":"https:\/\/www.aclweb.org\/anthology\/W19-3218","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3219","title":"Give It a Shot: Few-shot Learning to Normalize {ADR} Mentions in Social Media Posts","authors":["Manousogiannis, Emmanouil","Mesbah, Sepideh","Bozzon, Alessandro","Baez, Selene","Sips, Robert Jan"],"emails":["m.manousogiannis@mytomorrows.com","s.mesbah@tudelft.nl","a.bozzon@tudelft.nl","s.baez@mytomorrows.com","r.sips@mytomorrows.com"],"author_id":["emmanouil-manousogiannis","sepideh-mesbah","alessandro-bozzon","selene-baez","robert-jan-sips"],"abstract":"This paper describes the system that team MYTOMORROWS-TU DELFT developed for the 2019 Social Media Mining for Health Applications (SMM4H) Shared Task 3, for the end-to-end normalization of ADR tweet mentions to their corresponding MEDDRA codes. For the first two steps, we reuse a state-of-the art approach, focusing our contribution on the final entity-linking step. For that we propose a simple Few-Shot learning approach, based on pre-trained word embeddings and data from the UMLS, combined with the provided training data. Our system (relaxed F1: 0.337- 0.345) outperforms the average (relaxed F1 0.2972) of the participants in this task, demonstrating the potential feasibility of few-shot learning in the context of medical text normalization.","pages":"114--116","doi":"10.18653\/v1\/W19-3219","url":"https:\/\/www.aclweb.org\/anthology\/W19-3219","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3220","title":"{BIGODM} System in the Social Media Mining for Health Applications Shared Task 2019","authors":["Wang, Chen-Kai","Dai, Hong-Jie","Wang, Bo-Hung"],"emails":["","",""],"author_id":["chen-kai-wang","hong-jie-dai","bo-hung-wang"],"abstract":"In this study, we describe our methods to automatically classify Twitter posts conveying events of adverse drug reaction (ADR). Based on our previous experience in tackling the ADR classification task, we empirically applied the vote-based under-sampling ensemble approach along with linear support vector machine (SVM) to develop our classifiers as part of our participation in ACL 2019 Social Media Mining for Health Applications (SMM4H) shared task 1. The best-performed model on the test sets were trained on a merged corpus consisting of the datasets released by SMM4H 2017 and 2019. By using VUE, the corpus was randomly under-sampled with 2:1 ratio between the negative and positive classes to create an ensemble using the linear kernel trained with features including bag-of-word, domain knowledge, negation and word embedding. The best performing model achieved an F-measure of 0.551 which is about 5{\\%} higher than the average F-scores of 16 teams.","pages":"117--119","doi":"10.18653\/v1\/W19-3220","url":"https:\/\/www.aclweb.org\/anthology\/W19-3220","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3221","title":"Detection of Adverse Drug Reaction Mentions in Tweets Using {ELM}o","authors":["Sarabadani, Sarah"],"emails":["ssarabadani@klick.com"],"author_id":["sarah-sarabadani"],"abstract":"This paper describes the models used by our team in SMM4H 2019 shared task. We submitted results for subtasks 1 and 2. For task 1 which aims to detect tweets with Adverse Drug Reaction (ADR) mentions we used ELMo embeddings which is a deep contextualized word representation able to capture both syntactic and semantic characteristics. For task 2, which focuses on extraction of ADR mentions, first the same architecture as task 1 was used to identify whether or not a tweet contains ADR. Then, for tweets positively classified as mentioning ADR, the relevant text span was identified by similarity matching with 3 different lexicon sets.","pages":"120--122","doi":"10.18653\/v1\/W19-3221","url":"https:\/\/www.aclweb.org\/anthology\/W19-3221","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3222","title":"Adverse Drug Effect and Personalized Health Mentions, {CL}a{C} at {SMM}4{H} 2019, Tasks 1 and 4","authors":["Bagherzadeh, Parsa","Sheikh, Nadia","Bergler, Sabine"],"emails":["","she@encs.concordia.ca","bergler@encs.concordia.ca"],"author_id":["parsa-bagherzadeh","nadia-sheikh","sabine-bergler"],"abstract":"CLaC labs participated in Task 1 and 4 of SMM4H 2019. We pursed two main objectives in our submission. First we tried to use some textual features in a deep net framework, and second, the potential use of more than one word embedding was tested. The results seem positively affected by the proposed architectures.","pages":"123--126","doi":"10.18653\/v1\/W19-3222","url":"https:\/\/www.aclweb.org\/anthology\/W19-3222","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3223","title":"{MIDAS}@{SMM}4{H}-2019: Identifying Adverse Drug Reactions and Personal Health Experience Mentions from Twitter","authors":["Mahata, Debanjan","Anand, Sarthak","Zhang, Haimin","Shahid, Simra","Mehnaz, Laiba","Kumar, Yaman","Shah, Rajiv Ratn"],"emails":["dmahata@bloomberg.net","sarthaka.ic@nsit.net.in","hzhang449@bloomberg.net","ndia@nsit.net.in","laibamehnaz@dtu.ac.in","ykumar@adobe.com","rajivratn@iiitd.ac.in"],"author_id":["debanjan-mahata","sarthak-anand","haimin-zhang","simra-shahid","laiba-mehnaz","yaman-kumar","rajiv-shah"],"abstract":"In this paper, we present our approach and the system description for the Social Media Mining for Health Applications (SMM4H) Shared Task 1,2 and 4 (2019). Our main contribution is to show the effectiveness of Transfer Learning approaches like BERT and ULMFiT, and how they generalize for the classification tasks like identification of adverse drug reaction mentions and reporting of personal health problems in tweets. We show the use of stacked embeddings combined with BLSTM+CRF tagger for identifying spans mentioning adverse drug reactions in tweets. We also show that these approaches perform well even with imbalanced dataset in comparison to undersampling and oversampling.","pages":"127--132","doi":"10.18653\/v1\/W19-3223","url":"https:\/\/www.aclweb.org\/anthology\/W19-3223","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3224","title":"Detection of Adverse Drug Reaction in Tweets Using a Combination of Heterogeneous Word Embeddings","authors":["Aroyehun, Segun Taofeek","Gelbukh, Alexander"],"emails":["aroyehun.segun@gmail.com",""],"author_id":["segun-taofeek-aroyehun","alexander-gelbukh"],"abstract":"This paper details our approach to the task of detecting reportage of adverse drug reaction in tweets as part of the 2019 social media mining for healthcare applications shared task. We employed a combination of three types of word representations as input to a LSTM model. With this approach, we achieved an F1 score of 0.5209.","pages":"133--135","doi":"10.18653\/v1\/W19-3224","url":"https:\/\/www.aclweb.org\/anthology\/W19-3224","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"},{"id":"W19-3225","title":"Identification of Adverse Drug Reaction Mentions in Tweets {--} {SMM}4{H} Shared Task 2019","authors":["Rawal, Samarth","Rawal, Siddharth","Anwar, Saadat","Baral, Chitta"],"emails":["samrawal@asu.edu","sidrawal@asu.edu","sanwar@asu.edu","chitta@asu.edu"],"author_id":["samarth-rawal","siddharth-rawal","saadat-anwar","chitta-baral"],"abstract":"Analyzing social media posts can offer insights into a wide range of topics that are commonly discussed online, providing valuable information for studying various health-related phenomena reported online. The outcome of this work can offer insights into pharmacovigilance research to monitor the adverse effects of medications. This research specifically looks into mentions of adverse drug reactions (ADRs) in Twitter data through the Social Media Mining for Health Applications (SMM4H) Shared Task 2019. Adverse drug reactions are undesired harmful effects which can arise from medication or other methods of treatment. The goal of this research is to build accurate models using natural language processing techniques to detect reports of adverse drug reactions in Twitter data and extract these words or phrases.","pages":"136--137","doi":"10.18653\/v1\/W19-3225","url":"https:\/\/www.aclweb.org\/anthology\/W19-3225","publisher":"Association for Computational Linguistics","address":"Florence, Italy","year":"2019","month":"August","booktitle":"Proceedings of the Fourth Social Media Mining for Health Applications ({\\#}SMM4H) Workshop {\\&} Shared Task"}]